[{"slug":"welcome-visitors","title":"Welcome Visitors","date":1538998441921,"synopsis":"Here we write about the [[Open Science]] and the [[Science Commons]]. A particular focus here, and something we actively research is the [[Problem of Peer Review]]."},{"slug":"changes-to-this-site","title":"Changes to this Site","date":1434532209841,"synopsis":"Below we list recent changes to this site only without also listing changes from the [[Neighbourhood]]:"},{"slug":"open-peer-review","title":"Open Peer Review","date":1496691752779,"synopsis":"Open peer review (also called \"public peer review\", \"transparent peer review\") denotes several, closely related forms of scholarly peer review - [https://en.wikipedia.org/wiki/Open_peer_review wikipedia]"},{"slug":"maven-index","title":"Maven Index","date":1536151171978,"synopsis":"A [[Maven Index]] is a reputation metric derived from the success of an individual in knowledgeably assessing the quality of other peoples scientific work."},{"slug":"scientific-journals-for-null-results","title":"Scientific journals for null results","date":1496690971939,"synopsis":"There are now several scientific journals dedicated to the publication of negative or null results, including the following: - [https://en.wikipedia.org/wiki/Null_result#scientific_journals_for_null_results#Scientific_journals_for_null_results wikipedia]"},{"slug":"science-wars","title":"Science wars","date":1496689956179,"synopsis":"The science wars were a series of intellectual exchanges, between scientific realists and postmodernist critics, about the nature of scientific theory and intellectual inquiry - [https://en.wikipedia.org/wiki/Science_wars wikipedia]"},{"slug":"scientific-method","title":"Scientific method","date":1496689486170,"synopsis":"The scientific method is a body of techniques for investigating phenomena, acquiring new knowledge, or correcting and integrating previous knowledge. To be termed scientific, a method of inquiry is commonly based on empirical or measurable evidence subject to specific principles of reasoning. The Oxford Dictionaries Online define the scientific method as \"a method or procedure that has characterized natural science since the 17th century, consisting in systematic observation, measurement, and experiment, and the formulation, testing, and modification of "},{"slug":"reproducibility-project","title":"Reproducibility Project","date":1496689414140,"synopsis":"The Reproducibility Project: Psychology was a collaboration of 270 contributing authors to repeat 100 published experimental and correlational psychological studies. This project was led by the Center for Open Science and its co-founder, Brian Nosek, who started the project in November 2011. The results of this collaboration were published in August 2015. Reproducibility is the ability to produce a copy or duplicate, in this case it is the ability to replicate the results of the original studies. The project has illustrated the growing problem of failed "},{"slug":"evidence-based-medicine","title":"Evidence-based medicine","date":1496689325650,"synopsis":"Evidence-based medicine (EBM) is an approach to medical practice intended to optimize decision-making by emphasizing the use of evidence from well-designed and well-conducted research. Although all medicine based on science has some degree of empirical support, EBM goes further, classifying evidence by its epistemologic strength and requiring that only the strongest types (coming from meta-analyses, systematic reviews, and randomized controlled trials) can yield strong recommendations; weaker types (such as from case-control studies) can yield only weak "},{"slug":"replication-crisis","title":"Replication crisis","date":1534780799718,"synopsis":"The replication crisis (or replicability crisis) refers to a methodological crisis in science in which scientists have found that the results of many scientific experiments are difficult or impossible to replicate on subsequent investigation, either by independent researchers or by the original researchers themselves. While the crisis has long-standing roots, the phrase was coined in the early 2010s as part of a growing awareness of the problem - [https://en.wikipedia.org/wiki/Replication_crisis wikipedia]"},{"slug":"science-commons","title":"Science Commons","date":1534788430072,"synopsis":"Science Commons (SC) was a Creative Commons project for designing strategies and tools for faster, more efficient web-enabled scientific research."},{"slug":"fedwiki-tools","title":"Fedwiki Tools","date":1534682624243,"synopsis":"Here we list a few tools that are of particular use in managing and creating [[Fedwiki]] content. For a full list of transporters navigate to the site below:"},{"slug":"science-sites","title":"Science Sites","date":1535189259067,"synopsis":"Here we gather researchers and writers interested in writing about [[Science]] and [[Open Science]]."},{"slug":"open-science","title":"Open science","date":1534787860726,"synopsis":"Open science is the movement to make scientific research, data and dissemination accessible to all levels of an inquiring society, amateur or professional. "},{"slug":"science-activity","title":"Science Activity","date":1534684662914,"synopsis":"View all activity from [[Science Sites]] listed in the roster below:"},{"slug":"open-science-group","title":"Open Science Group","date":1534777745352,"synopsis":"The Open Science Group is a not-for-profit and open membership organisation working towards creating new ways for scientists to reshape the way they are funded and incentivised to create open science."},{"slug":"scientific-journal","title":"Scientific journal","date":1534687535650,"synopsis":"In academic publishing, a scientific journal is a periodical publication intended to further the progress of science, usually by reporting new research. - [https://en.wikipedia.org/wiki/Scientific_journal wikipedia]"},{"slug":"science-in-public","title":"Science in Public","date":1426179525793,"synopsis":"How, how much, and why science should be conducted in public. Notes from the Mozilla open Science Call can be found here [https://etherpad.mozilla.org/sciencelab-calls-mar12-2015 etherpad]"},{"slug":"open-science-projects","title":"Open science projects","date":1534773871227,"synopsis":"Big scientific projects are more likely to practice open science than small projects.  Different projects conduct, advocate, develop tools for, or fund open science, and many organizations run multiple projects."},{"slug":"against-open-science","title":"Against open science","date":1534788194454,"synopsis":"Here we explore common arguments against [[open science]] - [https://en.wikipedia.org/wiki/Open_Science#Arguments_against_open_science wikipedia]"},{"slug":"for-open-science","title":"For open science","date":1534776371216,"synopsis":"A number of scholars across disciplines have advanced various arguments in favor of open science.  These generally focus on the perceived value of open science in improving the transparency and validity of research as well as in regards to public ownership of science, particularly that which is publicly funded - [https://en.wikipedia.org/wiki/Open_Science#Arguments_for_open_science wikipedia]"},{"slug":"allows-for-rigorous-peer-review","title":"Allows for rigorous peer-review","date":1534775872507,"synopsis":"An article published by a team of NASA astrobiologists in 2010 in [[Science (journal)]] reported a bacterium known as [[GFAJ-1]] that could purportedly metabolize arsenic (unlike any previously known species of lifeform)."},{"slug":"public-funding-must-be-open","title":"Public funding must be open","date":1534775941148,"synopsis":"Public funding of research has long been cited as one of the primary reasons for providing Open Access to research articles."},{"slug":"more-reproducible","title":"More reproducible","date":1534775965949,"synopsis":"Increasingly the reproducibility of science is being questioned and the term [[reproducibility crisis]] has been coined."},{"slug":"open-has-more-impact","title":"Open has more impact","date":1534775987283,"synopsis":"There are several components to impact in research, many of which are hotly debated. However, under traditional scientific metrics parts Open science such as Open Access and Open Data have proved to outperform traditional versions."},{"slug":"helps-answer-complex-questions","title":"Helps answer complex questions","date":1534776145992,"synopsis":"Recent arguments in favor of Open Science have maintained that Open Science is a necessary tool to begin answering immensely complex questions, such as the neural basis of consciousness."},{"slug":"too-much-unsorted-information","title":"Too much unsorted information","date":1534776421245,"synopsis":"Some scientists find inspiration in their own thoughts by restricting the amount of information they get from others. [[Alexander Grothendieck]] has been cited as a scientist who wanted to learn with restricted influence when he said that he wanted to \"reach out in (his) own way to the things (he) wished to learn, rather than relying on the notions of consensus.\""},{"slug":"potential-misuse","title":"Potential misuse","date":1534776414911,"synopsis":"In 2011, Dutch researchers announced their intention to publish a research paper in [[Science (journal)]], describing the creation of [[Influenza A virus subtype H5N1]] which can be easily passed between [[ferret]]s, the mammals which most closely mimic the human response to the flu."},{"slug":"the-public-will-misunderstand","title":"The public will misunderstand","date":1534776397247,"synopsis":"In 2009 NASA launched the [[Kepler (spacecraft)]] and promised that they would release collected data in June 2010. Later they decided to postpone release so that their scientists could look at it first."},{"slug":"makes-discovery-more-difficult","title":"Makes discovery more difficult","date":1534776386674,"synopsis":"When more people report data it will take longer for anyone to consider all data, and perhaps more data of lower quality, before drawing any conclusion."},{"slug":"low-quality-science","title":"Low-quality science","date":1534776375775,"synopsis":"Post-publication peer review, a staple of open science, has been criticized as promoting the production of lower quality papers that are extremely voluminous. Specifically, critics assert that as quality is not guaranteed by preprint servers, the veracity of papers will be difficult to assess by individual readers."},{"slug":"research-and-development","title":"Research and development","date":1534777982112,"synopsis":"Research and development, also known in Europe as research and technological development (RTD), refers to innovative activities undertaken by corporations or governments in developing new services or products, or improving existing services or products. Research and development constitutes the first stage of development of a potential new service or the production process. - [https://en.wikipedia.org/wiki/Research_and_development wikipedia]"},{"slug":"business-rd","title":"Business R&D","date":1534777880651,"synopsis":"Research and development are very difficult to manage, since the defining feature of research is that the researchers do not know in advance exactly how to accomplish the desired result. As a result, \"higher R&D spending does not guarantee more creativity, higher profit or a greater market share\".[http://csis.org/files/publication/090520_diig_aerospace.pdf Aerospace and Defense: Inventing and Selling the Next Generation] - [https://en.wikipedia.org/wiki/Research_And_Development#Business_R&D wikipedia]"},{"slug":"peer-review","title":"Peer review","date":1534954366674,"synopsis":"Peer review is the evaluation of work by one or more people of similar competence to the producers of the work. It constitutes a form of self-regulation by qualified members of a relevant field - [https://en.wikipedia.org/wiki/Peer_review wikipedia]"},{"slug":"peer-review-scam","title":"Peer Review Scam","date":1417546629857,"synopsis":"Nature News: Publishing: The peer-review scam."},{"slug":"whos-afraid-of-peer-review","title":"Who's Afraid of Peer Review?","date":1496685844841,"synopsis":"\"Who's Afraid of Peer Review?\" is an article written by Science correspondent John Bohannon that describes his investigation of peer review among fee-charging open-access journals - [https://en.wikipedia.org/wiki/Who%27s_Afraid_of_Peer_Review%3F wikipedia]"},{"slug":"scienceopen","title":"ScienceOpen","date":1534780148013,"synopsis":"ScienceOpen is an interactive discovery environment for scholarly research across all disciplines. It is freely accessible for all and offers hosting and promotional services within the platform for publishers and institutes. The organization is based in Berlin and has a technical office in Boston. It is a member of CrossRef, ORCID, the Open Access Scholarly Publishers Association, STM Association and the Directory of Open Access Journals. The company was designated as one of “10 to Watch” by research advisory firm Outsell in its report “Open Access 2015"},{"slug":"research-works-act","title":"Research Works Act","date":1534780157104,"synopsis":"The Research Works Act, 102 H.R. 3699, was a bill that was introduced in the United States House of Representatives at the 112th United States Congress on December 16, 2011, by Representative Darrell Issa (R-CA) and co-sponsored by Carolyn B. Maloney (D-NY)."},{"slug":"infrastructure-school","title":"Infrastructure School","date":1534780893163,"synopsis":"The infrastructure school is founded on the assumption that \"efficient\" research depends on the availability of tools and applications. Therefore, the \"goal\" of the school is to promote the creation of openly available platforms, tools, and services for scientists. Hence, the infrastructure school is concerned with the technical infrastructure that promotes the development of emerging and developing research practices through the use of the internet, including the use of software and applications, in addition to conventional computing networks. In that s"},{"slug":"measurement-school","title":"Measurement School","date":1534780884089,"synopsis":"The measurement school, in the view of the authors, deals with developing alternative methods to determine scientific impact. This school acknowledges that measurements of scientific impact are crucial to a researcher's reputation, funding opportunities, and career development. Hence, the authors argue, that any discourse about Open Science is pivoted around developing a robust measure of scientific impact in the digital age.  The authors then discuss other research indicating support for the measurement school. The three key currents of previous literat"},{"slug":"public-school","title":"Public School","date":1534780881600,"synopsis":"According to the authors, the central concern of the school is to make science accessible to a wider audience. The inherent assumption of this school, as described by the authors, is that the newer communication technologies such as Web 2.0 allow scientists to open up the research process and also allow scientist to better prepare their \"products of research\" for interested non-experts. Hence, the school is characterized by two broad streams: one argues for the access of the research process to the masses, whereas the other argues for increased access to"},{"slug":"democratic-school","title":"Democratic School","date":1534780879635,"synopsis":"The democratic school concerns itself with the concept of access to knowledge. As opposed to focusing on the accessibility of research and its understandability, advocates of this school focus on the access of products of research to the public. The central concern of the school is with the legal and other obstacles that hinder the access of research publications and scientific data to the public. The authors argue that proponents of this school assert that any research product should be freely available. The authors argue that the underlying notion of t"},{"slug":"pragmatic-school","title":"Pragmatic School","date":1534780853553,"synopsis":"The pragmatic school considers [[Open Science]] as the possibility to make knowledge creation and dissemination more efficient by increasing the collaboration throughout the research process."},{"slug":"michael-nielsen","title":"Michael Nielsen","date":1534787928313,"synopsis":"Michael Nielsen is one of the pioneers of quantum computation. Together with Ike Chuang of MIT, he wrote the standard text in the field, a text which is now one of the twenty most highly cited physics books of all time."},{"slug":"panton-principles","title":"Panton Principles","date":1534788233057,"synopsis":"The Panton Principles are a set of principles which were written to promote open science. They were first drafted in July 2009 at the Panton Arms pub in Cambridge. - [https://en.wikipedia.org/wiki/Panton_Principles wikipedia]"},{"slug":"john-wilbanks","title":"John Wilbanks","date":1534788779455,"synopsis":"John Wilbanks is the chief commons officer at Sage Bionetworks and a senior fellow at the Ewing Marion Kauffman Foundation and at FasterCures. He runs the Consent to Research Project. - [https://en.wikipedia.org/wiki/John_Wilbanks wikipedia]"},{"slug":"problems-of-peer-review","title":"Problems of Peer Review","date":1534944943073,"synopsis":"On the other hand editors, and most of the scientific community are convinced (even though it is hard to find supporting evidence for the belief), that peer review is invaluable."},{"slug":"peer-review-is-ineffective","title":"Peer review is ineffective","date":1534926846804,"synopsis":"- Peer review is a [[Something of a lottery]]"},{"slug":"giving-credit-to-peer-reviewers","title":"Giving credit to peer reviewers","date":1534952116893,"synopsis":"How can referees receive credit or recognition for their work, and what form should this take;"},{"slug":"blockchain-based-peer-review","title":"Blockchain based peer review","date":1534952209514,"synopsis":"A blockchain-powered peer-reviewed journal could be issued as a token system to reward contributors, reviewers, editors, commentators, forum participants, advisors, staff, consultants, and indirect service providers involved in scientific publishing (Swan, 2015)."},{"slug":"congress-on-peer-review","title":"Congress on Peer Review","date":1534952724924,"synopsis":"The International [[Congress on Peer Review]] and Scientific Publication, which aims to encourage research into the quality and credibility of peer review - [https://peerreviewcongress.org/index.html peerreviewcongress.org]"},{"slug":"liquid-peer-review","title":"Liquid Peer Review","date":1534954058687,"synopsis":"Write about stuff i did at Charing Cross in 1990"},{"slug":"roy-rosenzweig-center-for-history-and-new-media","title":"Roy Rosenzweig Center for History and New Media","date":1535102038247,"synopsis":"Roy Rosenzweig Center for History and New Media (RRCHNM), formerly the Center for History and New Media (CHNM) is a research institution in the George Mason University in Fairfax, Virginia specializing in history and information technology."},{"slug":"digital-preservation","title":"Digital preservation","date":1535101184970,"synopsis":"Following the [[September 11, 2001 attacks]], the Center for History and New Media in partnership with the American Social History Project at the City University of New York organized the [[September 11 Digital Archive]] with funding from the [[Alfred P. Sloan]] Foundation."},{"slug":"september-11-digital-archive","title":"September 11 Digital Archive","date":1535101992749,"synopsis":"With the September 11 Digital Archive, CHNM and ASHP utilized electronic media to collect, preserve, and present the past, with a digital repository of material including more than 150,000 first-hand accounts, emails, images, and other digital materials - [http://911digitalarchive.org/about 911digitalarchive.org]"},{"slug":"omeka","title":"Omeka","date":1535101770001,"synopsis":"Omeka is a free, open source content management system for online digital collections. As a web application, it allows users to publish and exhibit cultural heritage objects, and extend its functionality with themes and plugins. A lightweight solution in comparison to traditional institutional repository software like DSpace and Fedora, Omeka has a focus on display and uses an unqualified Dublin Core metadata standard. - [https://en.wikipedia.org/wiki/Omeka wikipedia]"},{"slug":"digital-history","title":"Digital history","date":1535101947160,"synopsis":"Digital history is the use of digital media to further historical analysis, presentation, and research. It is a branch of the Digital humanities and an extension of quantitative history, cliometrics, and computing - [https://en.wikipedia.org/wiki/Digital_history wikipedia]"},{"slug":"george-mason-university","title":"George Mason University","date":1535103104487,"synopsis":"George Mason University is a public research university in Fairfax County, Virginia. Initially founded as a branch of the University of Virginia in 1949, it became an independent institution in 1972."},{"slug":"george-mason-universitys-historical-hoaxes","title":"George Mason University's historical hoaxes","date":1535102884949,"synopsis":"Students of George Mason University, as part of Professor T. Mills Kelly's course – \"Lying about the past\", have created two popular hoaxes: the \"Edward Owens hoax,\" and the \"Reddit serial killer hoax.\" It is a goal of the course to create a sweeping internet deception. As Prof. Kelly stated in the course's syllabus:"},{"slug":"wgmu-radio","title":"WGMU Radio","date":1535102933623,"synopsis":"WGMU Radio is a college radio station located on the Fairfax campus of George Mason University in Virginia, United States. It broadcasts a range of music, sports, news and talk. - [https://en.wikipedia.org/wiki/WGMU_Radio wikipedia]"},{"slug":"smithsonian-institution","title":"Smithsonian Institution","date":1535103483208,"synopsis":"The Smithsonian Institution, established on August 10, 1846 \"for the increase and diffusion of knowledge,\" is a group of museums and research centers administered by the Government of the United States. The institution is named after its founding donor, British scientist James Smithson. Originally organized as the \"United States National Museum,\" that name ceased to exist as an administrative entity in 1967. - [https://en.wikipedia.org/wiki/Smithsonian_Institution wikipedia]"},{"slug":"citation-graph","title":"Citation graph","date":1496683749454,"synopsis":"In information science and bibliometrics, a citation graph (or citation network) is a directed graph in which each vertex represents a document and in which each edge represents a citation from the current publication to another - [https://en.wikipedia.org/wiki/Citation_graph wikipedia]"},{"slug":"citation-index","title":"Citation Index","date":1496683681603,"synopsis":"A citation index is a kind of bibliographic database, an index of citations between publications, allowing the user to easily establish which later documents cite which earlier documents -  [https://en.wikipedia.org/wiki/Citation_index wikipedia]"},{"slug":"stiglers-law-of-eponymy","title":"Stigler's law of eponymy","date":1535189766268,"synopsis":"Stigler's law of eponymy is a process proposed by University of Chicago statistics professor Stephen Stigler in his 1980 publication \"Stigler’s law of eponymy\"."},{"slug":"public-knowledge-project","title":"Public Knowledge Project","date":1535191072953,"synopsis":"The Public Knowledge Project (PKP) is a non-profit research initiative that is focused on the importance of making the results of publicly funded research freely available through open access policies, and on developing strategies for making this possible including software solutions."},{"slug":"david-bovill","title":"David Bovill","date":1535373808416,"synopsis":"Specialist in legal, blockchain, and participatory governance. One of the founders of Liquid Democracy (2002), and developed a number of crypto-currencies (1998-2004). Holds degrees in medicine, philosophy and biochemistry."},{"slug":"latest-cv","title":"Latest CV","date":1535372581663,"synopsis":"This needs updating some time :)"},{"slug":"governance","title":"Governance","date":1535889311776,"synopsis":"Here we explore governance in the particular context of governing a commons, that is an organic federation or ecosystem of decentralised entities."},{"slug":"maven","title":"Maven","date":1496668816650,"synopsis":"A maven (also mavin) is a trusted expert in a particular field, who seeks to pass knowledge on to others - [https://en.wikipedia.org/wiki/Maven wikipedia]"},{"slug":"maven-science","title":"Maven Science","date":1536151208809,"synopsis":"Maven.science is the application of the scientific methodology to the institutions of science. It takes an understanding of complexity science, anthropology, knowledge modelling, artificial intelligence, management science, cybernetics, and applies it pragmatically to the institutional knowledge flows of science itself."},{"slug":"science-software","title":"Science software","date":1535214436795,"synopsis":"Here we list software tools that are useful to scientists and open scientists in particular:"},{"slug":"science-and-civilisation-in-china","title":"Science and Civilisation in China","date":1538998938184,"synopsis":"In 1948, Needham proposed a project to the [[Cambridge University Press]] for a book on __Science and Civilisation in China__. Within weeks of being accepted, the project had grown to seven volumes, and it has expanded ever since. The first volume appeared in 1954 - [https://en.wikipedia.org/wiki/Joseph_Needham#Science_and_Civilisation_in_China wikipedia]"},{"slug":"joseph-needham","title":"Joseph Needham","date":1538998986151,"synopsis":"__Joseph Needham__ ( 9 December 1900 – 24 March 1995) was a British biochemist, historian and [[sinologist]] known for his scientific research and writing on the history of [[Science and technology in China]]."},{"slug":"needham-question","title":"Needham Question","date":1538999047722,"synopsis":"__Needham's Grand Question__, also known as \"The Needham Question\", is this: why had China and India been overtaken by the West in science and technology, despite their earlier successes - [https://en.wikipedia.org/wiki/Joseph_Needham#Needham_Question wikipedia]"},{"slug":"needham-question-critiques","title":"Needham Question Critiques","date":1538999052769,"synopsis":"Needham's work has been criticised by some scholars who assert that it has a strong inclination to exaggerate [[List of Chinese inventions]] and has an excessive propensity to assume a Chinese origin for the wide range of objects his work covered - [https://en.wikipedia.org/wiki/Joseph_Needham#Evaluations_and_critiques wikipedia]"},{"slug":"needham-research-institute","title":"Needham Research Institute","date":1539003081391,"synopsis":"The __Needham Research Institute__ or __NRI__ , located on the grounds of [[Robinson College, Cambridge]], in [[Cambridge]], [[England]], is a centre for research into the history of [[science]], [[technology]] and [[medicine]] in [[East Asia]]. The institute is named after the biochemist and [[historian]] [[Joseph Needham]], who initiated the ''[[Science and Civilisation in China]]'' series. The current director is [[Mei Jianjun]], a noted archaeo-metallurgist - [https://en.wikipedia.org/wiki/Needham_Research_Institute wikipedia]"}]