[{"slug":"about-federated-wiki","title":"About Federated Wiki","date":1469224975210,"synopsis":"We remain excited about this platform and have become increasingly confident that it embodies important new ideas. We will explain."},{"slug":"featured-documentation","title":"Featured Documentation","date":1465759498791,"synopsis":"We write a lot about how things work here creating new sites for each subject area or nature of interest."},{"slug":"featured-sites","title":"Featured Sites","date":1465760357601,"synopsis":"You can browse to any of these sites without leaving your own. Always start at your own site so that anything you find that you want to keep can be forked to there."},{"slug":"federated-wiki-and-xh-2027","title":"Federated Wiki and XH 2027","date":1499033338146,"synopsis":"A page with 1 items."},{"slug":"federated-wiki-and-xh2027","title":"Federated Wiki and XH2027","date":1499033586675,"synopsis":"This is where I make notes about the connection between Federated Wiki and XH2027 (Exponentially Human Twenty Twenty-Seven)"},{"slug":"field-guide-to-the-federation","title":"Field Guide to the Federation","date":1488335368485,"synopsis":"We show you what we find interesting in the federation and suggest how you can make yourself at home here."},{"slug":"introduction-to-exponentially-human","title":"Introduction to Exponentially Human","date":1499034681801,"synopsis":"This is about an event taking place in September Twenty Twenty-Seven, and how you can get involved."},{"slug":"learning-journey","title":"Learning Journey","date":1499124121107,"synopsis":"This page is the overview of my learning journey with [[Federated Wiki]]. I have been shown some of the basics of creating pages etc, but I lack an understanding of  \"how we behave around here\", what it means to belong to this community, the vision of the creators, how I contribute usefully and appropriately etc. So I need to learn...  and I'll document my learning journey here."},{"slug":"learning-journey-page-2","title":"Learning Journey Page 2","date":1499175652144,"synopsis":"This is where I continue my Federated Wiki learning journey, following the start that i wrote about as [[Learning Journey]] (but that page got too long)."},{"slug":"pamela-mclean","title":"Pamela McLean","date":1499124443107,"synopsis":"Pamela McLean has been a teacher/learner and creator of new knowledge related to the use of digital technologies since the late 1970s (when her name was Pam Fiddy)."},{"slug":"welcome-visitors","title":"Welcome Visitors","date":1499122753350,"synopsis":"Welcome to this [[Federated Wiki]] site. From this page you can find who we are and what we do. New sites provide this information and then claim the site as their own. You will need your own site to participate."},{"slug":"youre-new-here","title":"You're New Here","date":1499124218824,"synopsis":"There are four steps to making a home here once you have your own site. In other systems this would be like filling out your profile page. Do these steps in any order."}]