[{"slug":"23rd-st--forest-ave-boulder-co-80304-usa","title":"23rd St & Forest Ave, Boulder, CO 80304, USA","date":1510770701795,"synopsis":"23rd St & Forest Ave, Boulder, CO 80304, USA - [https://www.google.co.uk/maps/place/23rd+St+%26+Forest+Ave,+Boulder,+CO+80304,+USA/@40.032393,-105.2691607,17z/data=!3m1!4b1!4m5!3m4!1s0x876bee87fb58461d:0xe9d37fa894d4d97!8m2!3d40.0323889!4d-105.266972 google]"},{"slug":"3d-installation-research","title":"3D Installation Research","date":1501841841444,"synopsis":"Here we research spaces, and technology that may be useful for the [[Immersive Sound Installation]] that we look to use to create a [[Democratic Space]], or should we say a [[Digital Speakers Corner]]."},{"slug":"3d-sound-libraries","title":"3D Sound Libraries","date":1501845364039,"synopsis":"Below are a collection of links imported from [[OneTab]]. You can view these links here - [https://www.one-tab.com/page/SiphfrIHSwemr1bNWJy-2g one-tab.com]:"},{"slug":"48-hours-neuklln","title":"48 Hours Neukölln","date":1489871222568,"synopsis":"[[48 Hours]] Neukölln is a map-based (whats the nice word for this?) festival that has been taking place in [[Neukölln]] in [[Berlin]] for the last 18 years. This form of art festival is growing in popularity, and we can look to the format as an inspiration for [[FEAST]] - [http://48-stunden-neukoelln.de/en/page/mission-statement 48-stunden-neukoelln.de]"},{"slug":"ableton-3d-sound","title":"Ableton 3D Sound","date":1501841853562,"synopsis":"4DSOUND is a new immersive system which allows for evolving changes in three-dimensional positioning of sound. An expansive array of speakers, a Max-based core, and custom Max for Live devices allow for sound to be positioned anywhere within the system’s space (and beyond)."},{"slug":"about-time","title":"About Time","date":1475588344314,"synopsis":"Time and therefore change which leads to uncertainty are not built into our programming languages. Indeed nor is it built into much of our philosophy, or common sense modes of thinking.  What would a language look like that builds in the idea of time?"},{"slug":"adobe-voco","title":"Adobe Voco","date":1501842078704,"synopsis":"[[Adobe Voco]] is a new experimental software from Adobe billed as [[Photoshop for Sound]]."},{"slug":"airpods-and-mics","title":"Airpods and mics","date":1498999410528,"synopsis":"Below are a collection of links imported from [[OneTab]]. You can view these links here - [https://www.one-tab.com/page/6uA3gKBJTHWy2guNrYetGA one-tab.com]:"},{"slug":"ambisonics","title":"Ambisonics","date":1501841885491,"synopsis":"Ambisonics is a full-sphere surround sound technique: in addition to the horizontal plane, it covers sound sources above and below the listener - [https://en.wikipedia.org/wiki/Ambisonics wikipedia]"},{"slug":"anthropological-archive","title":"Anthropological Archive","date":1500114669084,"synopsis":"An [[archive]] can be considered as a store of artefacts, whether digital or physical, but here we look to describe something more organic, more \"present\" and evolving in terms of structure, and more psychosocial in terms of content."},{"slug":"as-if-i-were-you","title":"As If I Were You","date":1419291078285,"synopsis":"I don't want to be you, but I'd like to see your side of this conversation as if I were you. And then I'd like to be me again."},{"slug":"audio-archive","title":"Audio Archive","date":1488750901209,"synopsis":"The idea here is to use Fedwiki to curate and archive of conversations recorded as part of [[FEAST]]. The eventual aim is to create a shared archive of audio files together with background research around the themes discussed in order to form a suitable medium for grups collaborating around researching themes for radio production."},{"slug":"bar-kter-neexistuje","title":"Bar, který neexistuje","date":1519677072491,"synopsis":"This bar in [[Brno]], [[Czech Republic]] is somewhere Nina recommended - [https://www.facebook.com/thecornersports/ facebook]"},{"slug":"basic-installation","title":"Basic Installation","date":1501841902053,"synopsis":"The basic installation uses commercial surround sound technology and / or [[Networked Speakers]] to represent the different audio pieces spatially."},{"slug":"bret-victor","title":"Bret Victor","date":1507034218921,"synopsis":"Bret Victor worked at Apple (2007-2010) as a member of the “HID Proto” future-interface prototyping team, designing UI concepts for experimental hardware platforms."},{"slug":"caf-localit","title":"Café Localité","date":1519678002191,"synopsis":"Another venue in [[Brno]], [[Czech Republic]] recommended by Nina - [https://www.facebook.com/cafelocalite/ facebook]"},{"slug":"casa-museo-jos-carlos-maritegui","title":"Casa Museo José Carlos Mariátegui","date":1534279219977,"synopsis":"La Casa Museo [[José Carlos Mariátegui]] es una institución de carácter histórico que busca preservar el legado de quien fue uno de los principales pensadores peruanos del siglo XX. Se encuentra ubicada en la capital del Perú, Lima - [https://es.wikipedia.org/wiki/Casa_Museo_Jos%C3%A9_Carlos_Mari%C3%A1tegui wikipedia]"},{"slug":"changes-to-this-site","title":"Changes to this Site","date":1434532209841,"synopsis":"Below we list recent changes to this site only without also listing changes from the [[Neighbourhood]]:"},{"slug":"cities-alive","title":"Cities Alive","date":1510968813808,"synopsis":"Robert Steuteville reviews Michael Mehaffy explaining Jane Jacobs and Christopher Alexander. [https://www.cnu.org/publicsquare/2017/11/16/how-jacobs-and-alexander-unlock-21st-century-problems post]"},{"slug":"citizenship","title":"Citizenship","date":1509805923870,"synopsis":"Citizenship is the status of a person recognized under the custom or law as being a legal member of a sovereign state or part of a nation - [https://en.wikipedia.org/wiki/Citizenship wikipedia]"},{"slug":"coffeehouse","title":"Coffeehouse","date":1516547041190,"synopsis":"A coffeehouse, coffee shop or café (sometimes spelled cafe) is an establishment which primarily serves hot coffee, related coffee beverages (e.g., café latte, cappuccino, espresso), tea, and other hot beverages - [https://en.wikipedia.org/wiki/Coffeehouse wikipedia]"},{"slug":"conversation-clubs","title":"Conversation Clubs","date":1419354295289,"synopsis":"We're generating an index of conversations that links to all copies of that conversation. This opens a new tab where the neighborhood will contain only the sites owning and mentioned on those pages."},{"slug":"conversation-factors","title":"Conversation Factors","date":1442699062537,"synopsis":"According to news value theory, journalists select events for news production that contain so-called news factors (Galtung & Ruge, 1965)."},{"slug":"conversation-piece","title":"Conversation Piece","date":1452424631483,"synopsis":"[[transmediale]] reboots itself with a new performative and participatory format for its 29th edition. Under the name Conversation Piece, the event creates an intensive space of exchanges, murmurs, and transitions, with dialogues initiated before the event and continued afterwards - [http://transmediale.de/ transmediale.de]"},{"slug":"conversational-space","title":"Conversational Space","date":1498942088885,"synopsis":"Here we describe the architecture of conversation, in a system or design perspective, not as a singular temporal event but as a network process that occurs across time and space."},{"slug":"conversations-across-space","title":"Conversations Across Space","date":1519638296056,"synopsis":"We understand what a conversation is, how it can be conducted. We value good quality conversations that are respectful, in which each party deepens their learning and understanding. Yet we have little idea how to conduct such conversations across space."},{"slug":"creative-space","title":"Creative Space","date":1426103891295,"synopsis":"As a [[Creative Space]] an assembly may have such roles, but may well choose to run things completely differently. Minutes may be videoed, and live streamed to the assemblies web site."},{"slug":"decentralised-conversation","title":"Decentralised Conversation","date":1445642990948,"synopsis":"Decentralised [[Conversation]] is a conversation which happens between people or groups of people at different geographical locations but not an online only conversation. It can be done synchronously or asynchronously."},{"slug":"deliberative-furniture","title":"Deliberative Furniture","date":1510321708102,"synopsis":"Here we look at objects, tables, chairs, sofa's, wall hangings... that are designed to support deliberation."},{"slug":"digital-speakers-corner","title":"Digital Speakers Corner","date":1500111623899,"synopsis":"Below are a collection of links imported from [[OneTab]]. You can view these links here - [https://www.one-tab.com/page/wjAPiU0MTV-dBE4UgdPuYA one-tab.com]:"},{"slug":"distributed-academy","title":"Distributed Academy","date":1446914313078,"synopsis":"The [[Distributed Academy]] aims to create a decentralised [[Network of Learning Spaces]] for [[Flipped Classroom]]s and [[Hyperlocal MOOC]]s"},{"slug":"documentary-events","title":"Documentary Events","date":1465035360756,"synopsis":"[[Happenings]] in physical space are more like workshops than they are lectures or passive viewing experiences. We should explore how we can use these events to film more things, and interview and bring more people into the conversation."},{"slug":"dred-scott-v-sandford","title":"Dred Scott v. Sandford","date":1509805637610,"synopsis":"Dred Scott v. Sandford, 60 U.S. 393 (1857), also known simply as the Dred Scott case, was a landmark decision by the United States Supreme Court on US labor law and constitutional law - [https://en.wikipedia.org/wiki/Dred_Scott_v._Sandford wikipedia]"},{"slug":"face2face","title":"Face2Face","date":1501357804192,"synopsis":"We present a novel approach for real-time facial reenactment of a monocular target video sequence (e.g., Youtube video)."},{"slug":"facial-reenactment","title":"Facial Reenactment","date":1501357999945,"synopsis":"Facial reenactment is the use of an actor to animate the facial expressions of a video or 3D model of another person."},{"slug":"fedwiki-tools","title":"Fedwiki Tools","date":1510427480399,"synopsis":"Here we list a few tools that are of particular use in managing and creating [[Fedwiki]] content."},{"slug":"fellows-guide","title":"Fellows Guide","date":1519807747260,"synopsis":"This site is a demo for [[Newspeak House]] fellows."},{"slug":"free-music-archive","title":"Free Music Archive","date":1501842088441,"synopsis":"The Free Music Archive (FMA) is a precious gem for readers who thrill to"},{"slug":"funkhaus","title":"Funkhaus","date":1510410159417,"synopsis":"Funkhaus was built in the 1950s as the radio broadcasting center for East Germany within the USSR.  The design of the Funkhaus came out of three founding principles - perfection, practicality and a focus on creative production."},{"slug":"future-of-programming","title":"Future of Programming","date":1475588227371,"synopsis":"Here we collect notes and ideas on the future directions of programming and creating software."},{"slug":"futures-studies","title":"Futures studies","date":1507038129953,"synopsis":"Futures studies (also called futurology) is the study of postulating possible, probable, and preferable futures and the worldviews and myths that underlie them. There is a debate as to whether this discipline is an art or science. In general, it can be considered as a branch of the social sciences and parallel to the field of history. History studies the past, futures studies considers the future. Futures studies (colloquially called \"futures\" by many of the field's practitioners) seeks to understand what is likely to continue and what could plausibly ch"},{"slug":"geographic-conversations","title":"Geographic Conversations","date":1500389868855,"synopsis":"We are collecting interviews and thought pieces from around the world using mobile phones, and archiving these sound samples together with their [[GPS]] locations."},{"slug":"glassbunker","title":"GlassBunker","date":1519678966311,"synopsis":"I think we can accommodate 20 to 25 people, with non-stop cooking, hacking, live music and circles of discussion - tuning in to the radio altogether. Since it is my place, I think i’ll be able to explain the rules of the game and framework of the whole day (from noon to midnight)."},{"slug":"hackerspacegr","title":"Hackerspace.gr","date":1508161162954,"synopsis":"a physical space dedicated to creative code and hardware hacking in Athens"},{"slug":"harmony","title":"Harmony","date":1471674469457,"synopsis":"In music, harmony is the use of simultaneous pitches (tones, notes), or chords - [https://en.wikipedia.org/wiki/Harmony wikipedia]"},{"slug":"heimat","title":"Heimat","date":1509807566845,"synopsis":"Heimat (pronounced [ˈhaɪmat]) is a German word that denotes the relationship of a human being toward a certain spatial social unit. The term forms a contrast to social alienation and usually carries positive connotations. It is often expressed with such terms as “home” or “homeland”, but it has been alleged that the word has no English equivalent - [https://en.wikipedia.org/wiki/Heimat wikipedia]"},{"slug":"home","title":"Home","date":1509807482423,"synopsis":"A home or domicile is a dwelling-place used as a permanent or semi-permanent residence for an individual, family, household or several families in a tribe. It is often a house, apartment, or other building, or alternatively a mobile home, houseboat, yurt or any other portable shelter. A principle of constitutional law in many countries, related to the right to privacy enshrined in article 12 of the UN Declaration of Human Rights is the inviolability of the home as an individual's place of shelter and refuge - [https://en.wikipedia.org/wiki/Home wikipedia"},{"slug":"identity","title":"Identity","date":1449087570443,"synopsis":"This will be a collection of audio notes on the topic of idenity. Some subtopics below:"},{"slug":"immersive-sound","title":"Immersive Sound","date":1510411886623,"synopsis":"Immersive sound is both a general term for spatial sound, and a specific term relating to the enhancement of traditional 3-dimensional sound to include height as a component."},{"slug":"information-is-a-virus","title":"Information is a Virus","date":1437923853662,"synopsis":"Here we explore various ways in in which information spreads, and how information architectures and conversational routing can affect this spread."},{"slug":"interactivity","title":"Interactivity","date":1500389952335,"synopsis":"We want to be able to experience and explore the sounds in the [[anthropological archive]] as a global mix, and then move to a particular location, effectively zooming in to a geographic area where we would then be able to discern more fine grained geographic differences in the sounds."},{"slug":"jane-mcgonigal","title":"Jane McGonigal","date":1519638193784,"synopsis":"Jane McGonigal (born October 21, 1977) is an American game designer and author who advocates the use of mobile and digital technology to channel positive attitudes and collaboration in a real world context - [https://en.wikipedia.org/wiki/Jane_McGonigal wikipedia]"},{"slug":"jekyll","title":"Jekyll","date":1510428776852,"synopsis":"Jekyll is a simple, blog-aware, static site generator for personal, project, or organization sites. Written in Ruby by Tom Preston-Werner, GitHub's co-founder, it is distributed under an open source license - [https://en.wikipedia.org/wiki/Jekyll_(software) wikipedia]"},{"slug":"jekyll-software","title":"Jekyll (software)","date":1510428707200,"synopsis":"[[Jekyll]] is a simple, blog-aware, static site generator for personal, project, or organization sites. Written in Ruby by Tom Preston-Werner, GitHub's co-founder, it is distributed under an open source license - [https://en.wikipedia.org/wiki/Jekyll_(software) wikipedia]"},{"slug":"jrgen-habermas","title":"Jürgen Habermas","date":1509806971278,"synopsis":"Jürgen Habermas ( or ; German: [ˈjʏrɡn̩ ˈhaːbɐmaːs]; born 18 June 1929) is a German sociologist and philosopher in the tradition of critical theory and pragmatism. He is perhaps best known for his theories on communicative rationality and the public sphere. In 2014, Prospect readers chose Habermas as one of their favourites among the \"world's leading thinkers.\" - [https://en.wikipedia.org/wiki/J%C3%BCrgen_Habermas wikipedia]"},{"slug":"kafanchan","title":"Kafanchan","date":1500391327082,"synopsis":"Kafanchan is a town in southern Kaduna State in north-central Nigeria. It is the location of a junction station of the Nigerian Railway Corporation, and it sits on the line connecting Port Harcourt, Enugu, Kafanchan, Kuru, Bauchi, and finally Maiduguri. As of 2007 Kafanchan had an estimated population of 83,092 - [https://en.wikipedia.org/wiki/Kafanchan wikipedia]"},{"slug":"learning-lip-sync","title":"Learning Lip Sync","date":1501356443257,"synopsis":"Given audio of President Barack Obama, we synthesize a high quality video of him speaking with accurate lip sync, composited into a target video clip. Trained on many hours of his weekly address footage, a recurrent neural network learns the mapping from raw audio features to mouth shapes."},{"slug":"lets-worry-about-the-train","title":"Let's Worry about the Train","date":1491988082606,"synopsis":"After offhand remarks Bret Victor reflects deeply on the climate problem bearing upon us and the many ways that our technological attention could be better spent. [http://worrydream.com/ClimateChange/ site]"},{"slug":"map","title":"Map","date":1509807855933,"synopsis":"A map is a symbolic depiction emphasizing relationships between elements of some space, such as objects, regions, or themes - [https://en.wikipedia.org/wiki/Map wikipedia]"},{"slug":"map-animation","title":"Map Animation","date":1510843662004,"synopsis":"Here we look at software and techniques that can be used to animate maps:"},{"slug":"maps","title":"Maps","date":1500133844910,"synopsis":"Here we look at how to work with maps in wiki. In particular we want to look out how we can use wiki to create and document walks, oral histories, and map festivals."},{"slug":"mediastream-processing-api","title":"MediaStream Processing API","date":1501845345507,"synopsis":"A number of existing or proposed features for the Web platform deal with continuous real-time media - [https://www.w3.org/TR/2012/NOTE-streamproc-20120531/ w3.org]"},{"slug":"memebase","title":"MemeBase","date":1511904138730,"synopsis":"Federated wiki is essentially a [[Repository of Memes]]. [[Wiki page]]s float through [[the federation]], spreading from author to author - [[preserving attribution]]."},{"slug":"mobile-camera-integration","title":"Mobile Camera Integration","date":1438339330202,"synopsis":"Mobile devices have amazingly capable still and video cameras, that can be used in a number of ways with [[Federated Wiki]]."},{"slug":"mobile-interface","title":"Mobile Interface","date":1500389897144,"synopsis":"A main part of the project would be to create a mobile application that enables you to listen to the podcasts spatially."},{"slug":"monom","title":"Monom","date":1511039743408,"synopsis":"[[Monom]] is based in the [[Funkhaus]] in Berlin. Monom is an experimental performance venue"},{"slug":"nature-place-citizenship","title":"Nature Place Citizenship","date":1509807353299,"synopsis":"This is the key idea, that three things: [[Nature]], [[Place]] and [[Citizenship]] all intersect to [[Define the Scope]] and expectations of any [[Situated Green Project]]."},{"slug":"newspeak-house","title":"Newspeak House","date":1519807477613,"synopsis":"Newspeak House is a space that hosts public and private events for researching the intersection of Politics, Media and Government - [https://www.nwspk.com/about nwspk.com]"},{"slug":"newspeak-library","title":"Newspeak Library","date":1519808063896,"synopsis":"At present this is simply a google Spreadsheet, but in the future the aim is to tag and categorise these, and together with a new position of a [[Newspeak Librarian]], to create a resource for [[Newspeak Organisers]], [[Newspeak Fellows]] and [[Newspeak Members]]."},{"slug":"of-coffeehouses-and-salons","title":"Of coffeehouses and salons","date":1425176841212,"synopsis":"This wee think piece (ward, note, page, scribble - note to self need a term that stands for all possible names in a FedWiki) was prompted by Mike's thoughts on the Fri/Sat hangout. It struck me and I tried to capture a bit of it in [[reflections on a friday saturday hangout]] but thought it needed a bit more elaboration."},{"slug":"paducah-kentucky","title":"Paducah, Kentucky","date":1510393603799,"synopsis":"Paducah is a home rule-class city in and the county seat of McCracken County, Kentucky, United States. The largest city in the Jackson Purchase region, it is located at the confluence of the Tennessee and the Ohio Rivers, halfway between St. Louis, Missouri, to the northwest and Nashville, Tennessee, to the southeast - [https://en.wikipedia.org/wiki/Paducah,_Kentucky wikipedia]"},{"slug":"pages-as-public-spaces","title":"Pages as Public Spaces","date":1475589338018,"synopsis":"What I'm trying to do here is to create a rhetorical situation what will help writers get themselves organized and help them create content that can be better built on than we've seen before. The idea of Pages as Public Spaces may or may not work."},{"slug":"palace-of-the-parliament","title":"Palace of the Parliament","date":1515499760699,"synopsis":"The Palace of the Parliament is the seat of the Parliament of Romania. Located on Dealul Arsenalului in central Bucharest (Sector 5). It is the largest administrative building in the world, and in terms of weight,it is the heaviest building in the world - [https://en.wikipedia.org/wiki/Palace_of_the_Parliament wikipedia]"},{"slug":"place","title":"Place","date":1509807652969,"synopsis":"Our notion of place is not simply physical, we are able or rather need to identify with it in many ways."},{"slug":"political-conversation","title":"Political Conversation","date":1468079445124,"synopsis":"How to turn the political conversation around"},{"slug":"potential-venues","title":"Potential Venues","date":1499644720489,"synopsis":"These are some off the cuff venues that may work for the [[Thought Garden Installation]] in the US."},{"slug":"prague","title":"Prague","date":1519677768856,"synopsis":"<div style='padding: 12px; background:#eee; width:96%; align=centered;'>"},{"slug":"pubic-happening","title":"Pubic Happening","date":1470235863828,"synopsis":"A public [[Happening]] is an event that takes place in a public venue, theatre, café, Hackspace, conference or social venue. It is designed to be of value to a public audience that may observe or otherwise take part in the event."},{"slug":"public-sphere","title":"Public sphere","date":1509806842807,"synopsis":"The public sphere (German Öffentlichkeit) is an area in social life where individuals can come together to freely discuss and identify societal problems, and through that discussion influence political action - [https://en.wikipedia.org/wiki/Public_sphere wikipedia]"},{"slug":"punching-trees-next-to-people","title":"Punching Trees Next to People","date":1420316103249,"synopsis":"An example of how shared work builds relationships sometimes where conversations might fail. Plus, I just wanted to share it."},{"slug":"real-space","title":"Real Space","date":1498936270621,"synopsis":"Real Space is community space that real people feel comfortable in. It is not pretentious, it is not simply for entertainment, but nor is it dull and worthy."},{"slug":"real-space-academy","title":"Real Space Academy","date":1424894683772,"synopsis":"Basic idea behind Real Space Academy is that learning is a social activity inseparable from day to day life."},{"slug":"real-space-conversations","title":"Real Space Conversations","date":1428852590958,"synopsis":"At Chaos Communication Congress this year we have tried a simple set up and one of the elements of real Spaces Studio: a table projection from a light and affordable pico projector, showing content relevant to the conversation we are having around the table."},{"slug":"real-spaces-association","title":"Real Spaces Association","date":1424814349864,"synopsis":"Real Spaces Association is a Voluntary Association with a digital constitution on OneClick Orgs."},{"slug":"real-spaces-studio","title":"Real Spaces Studio","date":1428852014784,"synopsis":"Real Space Studio is a low cost podcasting studio for running, streaming and recording shareable content (relevant to learning). It can be used to run distributed asynchronous conferences, or Smallest Federated Conversations if you like. Pupose of such content is not"},{"slug":"research-group-activity","title":"Research Group Activity","date":1502635151645,"synopsis":"Here we list views of the activity of groups and individual related to the current project. You may want to keep an eye on:"},{"slug":"roleplay-simulation","title":"Roleplay simulation","date":1507038769295,"synopsis":"Roleplay simulation is an experiential learning method in which either amateur or professional roleplayers (also called interactors) improvise with learners as part of a simulated scenario. Roleplay is designed primarily to build first-person experience in a safe and supportive environment. Roleplay is widely acknowledged as a powerful technique across multiple avenues of training and education - [https://en.wikipedia.org/wiki/Roleplay_simulation wikipedia]"},{"slug":"simulated-reality","title":"Simulated reality","date":1507109747487,"synopsis":"Simulated reality is the hypothesis that reality could be simulated — for example by computer simulation — to a degree indistinguishable from \"true\" reality. It could contain conscious minds which may or may not be fully aware that they are living inside a simulation. This is quite different from the current, technologically achievable concept of virtual reality. Virtual reality is easily distinguished from the experience of actuality; participants are never in doubt about the nature of what they experience. Simulated reality, by contrast, would be hard "},{"slug":"simulation","title":"Simulation","date":1507110499670,"synopsis":"Simulation is the imitation of the operation of a real-world process or system over time. The act of simulating something first requires that a model be developed; this model represents the key characteristics, behaviors and functions of the selected physical or abstract system or process. The model represents the system itself, whereas the simulation represents the operation of the system over time - [https://en.wikipedia.org/wiki/Simulation wikipedia]"},{"slug":"small-public-spaces","title":"Small public spaces","date":1427125381147,"synopsis":"William H Whyte's book, The Social Life of Small Urban Spaces, was a landmark study published in 1980 of the way people adapted to the built environment and [[Movable Furniture]] of small plazas in larger cities."},{"slug":"sound-and-music","title":"Sound and Music","date":1501841915002,"synopsis":"Some notes on how sound and music would work in a local festival - such as the [[Finsbury Park Festival]]."},{"slug":"sound-art","title":"Sound art","date":1501842033687,"synopsis":"Sound art is an artistic discipline in which sound is utilised as a primary medium. Like many genres of contemporary art, sound art is interdisciplinary in nature, or takes on hybrid forms. Sound art can engage with a range of subjects such as acoustics, psychoacoustics, electronics, noise music, audio media, found or environmental sound, explorations of the human body, sculpture, architecture, film or video and an ever-expanding set of subjects that are part of the current discourse of contemporary art - [https://en.wikipedia.org/wiki/Sound_art wikipedi"},{"slug":"sound-garden","title":"Sound Garden","date":1510321748337,"synopsis":"The Sound Garden installation uses spatialised or 3D [[Immersive Sound]] to reflect the location of the speakers in geographical or conceptual space."},{"slug":"soundscape","title":"Soundscape","date":1501861314968,"synopsis":"A soundscape is a sonic landscape. It is a way of picturing a space or an idea in sound."},{"slug":"spaces","title":"Spaces","date":1519676009900,"synopsis":"Here we list spaces that are of interest, that we may be able to twin with, organise discussions, and research together:"},{"slug":"spatial-sound-institute","title":"Spatial Sound Institute","date":1534276091141,"synopsis":"In October 2015, 4DSOUND opened the doors of the Spatial Sound Institute, located at [[Art Quarter Budapest]] in Hungary - [http://www.4dsound.net/institute/#ssi-institute 4dsound.net]"},{"slug":"stalker","title":"Stalker","date":1509640120202,"synopsis":"Stalker is a collective of architects and researchers connected to the Roma Tre University who came together in the mid-1990s. In 2002, Stalker founded the research network Osservatorio Nomade (ON), which consists of architects, artists, activists and researchers working experimentally and engaging in actions to create self-organised spaces and situations - [http://www.spatialagency.net/database/how/networking/stalkerosservatorio.nomade spatialagency.net]"},{"slug":"static-site-generation","title":"Static Site Generation","date":1510428720526,"synopsis":"Static site generation is a simple and effective modern way to create web sites. Advantages include reduced complexity, easier compliance, cheaper hosting, amongst other benefits."},{"slug":"structured-conversation-platform","title":"Structured Conversation Platform","date":1519638148337,"synopsis":"Examples of structured conversation platforms include [[Compendium]], [[Cohere]], [[Debategraph]],  [[TruthMapping]], [[Climate Collaboratorium]], and [[Argument Mapping]] and an emerging list of others."},{"slug":"tech-research","title":"Tech Research","date":1499616796823,"synopsis":"here ares ome general pages about technology for installation purposes:"},{"slug":"technical-considerations","title":"Technical Considerations","date":1501841839583,"synopsis":"A [[Unity 3D]] app should be fairly straightforwards in terms of creating a navigable interface with associated spatially located sound. I am not sure about what times of sound output would be possible from such an app for installation purposes by it would suffice for a mobile experience."},{"slug":"textile-markup-language","title":"Textile (markup language)","date":1510428815902,"synopsis":"[[Textile]] is a lightweight markup language that uses a text formatting syntax to convert plain text into structured HTML markup. Textile is used for writing articles, forum posts, readme documentation, and any other type of written content published online - [https://en.wikipedia.org/wiki/Textile_(markup_language) wikipedia]"},{"slug":"the-humane-representation-of-thought","title":"The Humane Representation of Thought","date":1507034246758,"synopsis":"This was a talk by [[Bret Victor]] a few years ago. On this page we also collect other ideas and quotes on the use of models and simulations as a way of [[Publishing Thought]] as an [[Evolutionary Language]]."},{"slug":"the-structural-transformation-of-the-public-sphere","title":"The Structural Transformation of the Public Sphere","date":1509808097917,"synopsis":"The Structural Transformation of the Public Sphere: An Inquiry into a Category of Bourgeois Society is a 1962 book by J[[ürgen Habermas]] - [https://en.wikipedia.org/wiki/The_Structural_Transformation_of_the_Public_Sphere wikipedia]"},{"slug":"theatre-conversations","title":"Theatre Conversations","date":1458909459779,"synopsis":"Many theatres host events to go with a production in which the Director and / or cast take place in a conversation about the piece being performed or theatre in general. Here we look at how we might alter or extend this format."},{"slug":"thought-garden-activity","title":"Thought Garden Activity","date":1498939003831,"synopsis":"View all activity from [[Thought Garden Sites]] listed in the roster below:"},{"slug":"thought-garden-installation","title":"Thought Garden Installation","date":1510321554697,"synopsis":"The [[Thought Garden]] installation is a [[conversational space]] that layers and places sound spatially in order to represent the architecture of the topic presented."},{"slug":"thought-garden-project-activity","title":"Thought Garden Project Activity","date":1509225332650,"synopsis":"View all activity from the [[Thought Garden Projects]] roster below:"},{"slug":"unity-3d","title":"Unity 3D","date":1501841859447,"synopsis":"The [[Unity (game engine)]] is a cross-platform game engine developed by Unity Technologies, which is primarily used to develop video games and simulations for computers, consoles and mobile devices."},{"slug":"unity-game-engine","title":"Unity (game engine)","date":1498944848885,"synopsis":"Unity is a cross-platform game engine developed by Unity Technologies, which is primarily used to develop video games and simulations for computers, consoles and mobile devices - [https://en.wikipedia.org/wiki/Unity_(game_engine) wikipedia]"},{"slug":"venue-template","title":"Venue Template","date":1519672534295,"synopsis":"Some named venue in [[Town_A]], [[Country_A]]. A nice description - [https://www.facebook.com/thecornersports/ facebook]"},{"slug":"welcome-visitors","title":"Welcome Visitors","date":1519676065423,"synopsis":"Here we gather notes and research regarding on the [[Thought Garden Installation]] and our slowly emerging federation of Democratic [[Spaces]]."},{"slug":"windows-overlooking-life","title":"Windows Overlooking Life","synopsis":". . . this pattern helps to complete the earlier patterns which give each room its shape: <span>[[Light On Two Sides Of Every Room]]</span>, <span>[[Ceiling Height Variety]]</span>, and <span>[[The Shape Of Indoor Space]]</span>. Once these patterns are clear, this pattern helps to place the windows rather more precisely in the walls. It defines just how many windows there should be, how far apart, and what their total area should be."},{"slug":"worldscape","title":"Worldscape","date":1535308275195,"synopsis":"Here we look at how we can use [[projection mapping]] and [[immersive sound]] to tell stories about the world."},{"slug":"edinburgh-international-science-festival","title":"Edinburgh International Science Festival","date":1535307619657,"synopsis":"The Edinburgh International Science Festival is a science festival which takes place each April in Edinburgh, Scotland. The festival features hundreds of talks, tours and exhibitions for children, families and adults in locations around the city. The festival was first held in 1989, and its principal sponsors are the Edinburgh City Council and the Scottish Executive."},{"slug":"dynamic-earth-edinburgh","title":"Dynamic Earth (Edinburgh)","date":1535307901195,"synopsis":"Dynamic Earth is a visitor attraction in Edinburgh, and also functions as a conference venue. It is in the Holyrood area, beside the Scottish Parliament building and at the foot of Salisbury Crags. - [https://en.wikipedia.org/wiki/Dynamic_Earth_(Edinburgh) wikipedia]"},{"slug":"glasgow-science-centre","title":"Glasgow Science Centre","date":1535307875699,"synopsis":"Glasgow Science Centre is a visitor attraction located in the Clyde Waterfront Regeneration area on the south bank of the River Clyde in Glasgow, Scotland. Queen Elizabeth II opened Glasgow Science Centre on 5 June 2001. It is one of Scotland's most popular paid-for visitor attractions. It is a purpose-built science centre composed of three principal buildings: Science Mall, Glasgow Tower and an IMAX cinema. The Scottish tourist board, VisitScotland, awarded Glasgow Science Centre a five star rating in the visitor attraction category. As well as its main"},{"slug":"worldscape-venues","title":"Worldscape Venues","date":1535308767712,"synopsis":"# See also"},{"slug":"allosphere","title":"AlloSphere","date":1535307003099,"synopsis":"The AlloSphere is a research facility in a theatre-like pavilion in a spherical shape, of opaque material, used to project computer-generated imagery and sounds. Included are GIS, scientific, artistic, and other information. Located at the University of California, Santa Barbara (UCSB) the AlloSphere grew out of the schools of electrical engineering and computer science, and the Media Arts & Technology program at UCSB. - [https://en.wikipedia.org/wiki/AlloSphere wikipedia]"},{"slug":"environmental-events","title":"Environmental Events","date":1535308387878,"synopsis":"Here we list events related to the environment:"},{"slug":"list-of-environmental-film-festivals","title":"List of environmental film festivals","date":1535308471921,"synopsis":"Many environmental film festivals present complete programs of films dedicated to environmental subjects on a regular basis, typically annually. Others are committed to presenting environmental films within their subprograms. The festivals listed below solicit and present films about nature, ecology, conservation, wildlife, pollution, habitat loss, climate change and related topics. Some of the festivals listed here are also members of the Green Film Network. This list is not exhaustive. - [https://en.wikipedia.org/wiki/List_of_environmental_film_festiva"},{"slug":"environmental-conferences","title":"Environmental Conferences","date":1535305084047,"synopsis":"The environmental movement has made considerable progress from the first Greenpeace protest involving six people and a boat in 1971, to the environmental conferences of today involving the world’s leaders and commanding global attention - [https://en.wikipedia.org/wiki/Environmental_mega_conferences wikipedia]"},{"slug":"poc21-innovation-camp","title":"POC21 innovation camp","date":1535304533641,"synopsis":"POC21 was an innovation camp that took place in Chateau de Millemont near Paris. It lasted for five weeks from August 15, 2015 until September 20, 2015. POC21 innovation camp hosted 100 makers, designers and innovators to develop a Proof of Concept of a truly sustainable society."},{"slug":"aberdeen-science-centre","title":"Aberdeen Science Centre","date":1535308593441,"synopsis":"Aberdeen Science Centre is a science museum in Aberdeen, Scotland. It contains exhibits which are aimed mainly at younger children. It attracts primary school groups around the year and its exhibits are 'hands on' so that everything can be played with and examined. The centre is a registered non-profit organization that is funded by the public and donations from local corporate sponsors. Birthday parties and other events for children may be held here by prior arrangement. - [https://en.wikipedia.org/wiki/Aberdeen_Science_Centre wikipedia]"},{"slug":"dundee-science-centre","title":"Dundee Science Centre","date":1535308657516,"synopsis":"Dundee Science Centre is a science centre located in Dundee, Scotland, and a part of the Scottish Science Centres Network. It is a registered non-profit organisation that is funded by the public and donations from local corporate sponsors. - [https://en.wikipedia.org/wiki/Dundee_Science_Centre wikipedia]"},{"slug":"pnyx","title":"Pnyx","date":1424364189780,"synopsis":"The Pnyx is a hill in central Athens, the capital of Greece. Beginning as early as 507 BC, the Athenians gathered on the Pnyx to host their popular assemblies, thus making the hill one of the earliest and most important sites in the creation of democracy."}]