[{"slug":"biodiversity-foundation","title":"Biodiversity Foundation","date":1512485331733,"synopsis":"In 1996, [[E.O Wilson]] officially retired from Harvard University, where he continues to hold the positions of Professor Emeritus and Honorary Curator in Entomology. He founded the E.O. Wilson Biodiversity Foundation, which finances the PEN/E. O. Wilson Literary Science Writing Award and is an \"independent foundation\" at the Nicholas School of the Environment, Duke University. Wilson became a special lecturer at Duke University as part of the agreement."},{"slug":"bioenergy-village","title":"Bioenergy village","date":1509035359109,"synopsis":"A bio-energy village is a regionally oriented concept for the use of renewable energy sources in rural areas. The system uses biomass from local agriculture and forestry in a biogas powerplant to meet the complete energy requirements of a village, such as electricity and district heating - [https://en.wikipedia.org/wiki/Bioenergy_village wikipedia]"},{"slug":"bioneers","title":"Bioneers","date":1509035364756,"synopsis":"Bioneers, under its parent foundation, Collective Heritage Institute, is a nonprofit organization based in New Mexico and California that promotes practical and innovative solutions to global environmental and bio-cultural challenges. The organization operates within a philosophy that recognizes and cultivates the value and wisdom of the natural world. Official Programs include Moonrise Women's Leadership, Restorative Food Systems, Indigeneity (Indigenous Forums,) Education for Action, and the award-winning Dreaming New Mexico community resilience progra"},{"slug":"changes-to-this-site","title":"Changes to this Site","date":1434641767059,"synopsis":"Below we list recent changes to this site only without also listing changes from the [[Neighbourhood]]:"},{"slug":"cohousing","title":"Cohousing","date":1509037043565,"synopsis":"Cohousing is an intentional community of private homes clustered around shared space. Each attached or single family home has traditional amenities, including a private kitchen. Shared spaces typically feature a common house, which may include a large kitchen and dining area, laundry, and recreational spaces. Shared outdoor space may include parking, walkways, open space, and gardens. Neighbors also share resources like tools and lawnmowers - [https://en.wikipedia.org/wiki/Cohousing wikipedia]"},{"slug":"collective-farming","title":"Collective farming","date":1509035899268,"synopsis":"Collective farming and communal farming are various types of agricultural production in which multiple farmers run their holdings as a joint enterprise. This type of collective is often an agricultural cooperative in which member-owners engage jointly in farming activities. The process by which farmland is aggregated (or forcefully donated) is called collectivization. In some countries (including the Soviet Union, the Eastern Bloc countries, China, and Vietnam), there have been state-run and cooperative-run variants. For example, the Soviet Union had bot"},{"slug":"communal-living","title":"Communal Living","date":1509035583026,"synopsis":"An intentional community is a planned residential community designed from the start to have a high degree of social cohesion and teamwork. The members of an intentional community typically hold a common social, political, religious, or spiritual vision and often follow an alternative lifestyle. They typically share responsibilities and resources. Intentional communities include collective households, cohousing communities, coliving, ecovillages, monasteries, communes, survivalist retreats, kibbutzim, ashrams, and housing cooperatives. New members of an i"},{"slug":"communal-living-projects","title":"Communal Living Projects","date":1509032891136,"synopsis":"<h3>Communal Living</h3>"},{"slug":"communities-directory","title":"Communities Directory","date":1509035325020,"synopsis":"The Communities Directory, A Comprehensive Guide to Intentional Community provides listing of intentional communities primarily from North America but also from around the world. The Communities Directory has both an (online)and a print edition, which is published based on data from the website - [https://en.wikipedia.org/wiki/Communities_Directory wikipedia]"},{"slug":"create-your-own-ecovillage","title":"Create Your Own Ecovillage","date":1509032862785,"synopsis":"Here we look at how to create your own [[ecovillage]]."},{"slug":"diggers-and-dreamers","title":"Diggers and Dreamers","date":1509035301853,"synopsis":"Diggers and Dreamers: The Guide to Communal Living is a primary resource for information, issues, and ideas about intentional communities in England, Scotland, Wales and Northern Ireland – from urban co-ops to cohousing groups to rural communes and low impact developments - [https://en.wikipedia.org/wiki/Diggers_and_Dreamers wikipedia]"},{"slug":"e-o-wilson","title":"E. O. Wilson","date":1512485154110,"synopsis":"Known to many as the founding father of socio-biology, E O Wilson is a big hitter in the world of evolutionary theory. But, recently he's criticised what's popularly known as The Selfish Gene theory of evolution that he once worked so hard to promote (and that now underpins the mainstream view on evolution)."},{"slug":"ecovillage","title":"Ecovillage","date":1509035597545,"synopsis":"Ecovillages are traditional or intentional communities whose goal is to become more socially, culturally, economically and ecologically sustainable."},{"slug":"ecovillage-investment","title":"Ecovillage Investment","date":1509035016025,"synopsis":"Below are a collection of links imported from [[OneTab]]. You can view these links here - [https://www.one-tab.com/page/j_nLAMGfST27Hw5MUKJV5Q one-tab.com]:"},{"slug":"fedwiki-tools","title":"Fedwiki Tools","date":1511705109115,"synopsis":"Here we list a few tools that are of particular use in managing and creating [[Fedwiki]] content. Check [[Recycled pages]] to find delted pages."},{"slug":"fellowship-for-intentional-community","title":"Fellowship for Intentional Community","date":1509035308856,"synopsis":"The Fellowship for Intentional Community (FIC) provides publications, referrals, support services, and \"sharing opportunities\" for a wide range of intentional communities, cohousing groups, ecovillages, community networks, support organizations, and people seeking a home in community. The FIC is a nonprofit 501(c)(3) organization in the United States - [https://en.wikipedia.org/wiki/Fellowship_for_Intentional_Community wikipedia]"},{"slug":"hacking-social-impact","title":"Hacking Social Impact","date":1512690899423,"synopsis":"To bring together in a dynamic and collaborative environment the leaders in social impact, business, and venture capital investment innovation. [http://socialventuresociety.org/unconference/ website] [http://us6.campaign-archive2.com/?u=adeb969bbfd2716b2416778ac&id=93902578be details]"},{"slug":"half-earth","title":"Half-Earth","date":1512484638490,"synopsis":"Half-Earth: Our Planet's Fight for Life is a 2016 book by [[E. O. Wilson]], in which the author proposes that half of the Earth's land should be designated a human-free natural reserve to preserve [[biodiversity]]. Wilson noted that the term \"Half-Earth\" was coined for this concept by Tony Hiss in his Smithsonian article \"Can the World Really Set Aside Half the Planet for Wildlife?\" - [https://en.wikipedia.org/wiki/Half-Earth wikipedia]"},{"slug":"intentional-community","title":"Intentional community","date":1509035691804,"synopsis":"An intentional community is a planned residential community designed from the start to have a high degree of social cohesion and teamwork. The members of an intentional community typically hold a common social, political, religious, or spiritual vision and often follow an alternative lifestyle. They typically share responsibilities and resources."},{"slug":"kibbutz","title":"Kibbutz","date":1509035842837,"synopsis":"A kibbutz (Hebrew: קִבּוּץ‎ / קיבוץ‎, lit. \"gathering, clustering\"; regular plural kibbutzim קִבּוּצִים‎ / קיבוצים‎) is a collective community in Israel that was traditionally based on agriculture. The first kibbutz, established in 1909, was Degania. Today, farming has been partly supplanted by other economic branches, including industrial plants and high-tech enterprises. Kibbutzim began as utopian communities, a combination of socialism and Zionism. In recent decades, some kibbutzim have been privatized and changes have been made in the communal lifest"},{"slug":"kim-stanley-robinson","title":"Kim Stanley Robinson","date":1512484625347,"synopsis":"Kim Stanley Robinson (born March 23, 1952) is an American writer of science fiction. He has published nineteen novels and numerous short stories but is best known for his Mars trilogy - [https://en.wikipedia.org/wiki/Kim_Stanley_Robinson wikipedia]"},{"slug":"kim-stanley-robinson---rethinking-our-relationship-to-the-biosphere--bioneers","title":"Kim Stanley Robinson - Rethinking Our Relationship to the Biosphere | Bioneers","date":1512484057364,"synopsis":"The coming century requires that we rethink and restructure our relationship with our planet to avoid endangering the integrity of the biosphere and risking ..- [https://www.youtube.com/watch?v=489I0gZlepM youtube.com]"},{"slug":"russ-vision","title":"RUSS vision","date":1511970257629,"synopsis":"An innovative approach to Community-Led Housing- [https://www.theruss.org/about/our-vision/ theruss.org]"},{"slug":"transgenerational-design","title":"Transgenerational design","date":1509035338136,"synopsis":"Transgenerational design is the practice of making products and environments compatible with those physical and sensory impairments associated with human aging and which limit major activities of daily living. The term transgenerational design was coined in 1986, by Syracuse University industrial design professor James J. Pirkl to describe and identify products and environments that accommodate, and appeal to, the widest spectrum of those who would use them—the young, the old, the able, the disabled—without penalty to any group. The transgenerational des"},{"slug":"vizzuality","title":"Vizzuality","date":1512485946822,"synopsis":"Vizzuality is a science and technology company focused on data visualization, web-GIS and tool development and committed to working on projects related to conservation, the environment and sustainable development. They have two offices, in Madrid and Cambridge - [https://en.wikipedia.org/wiki/Vizzuality wikipedia]"},{"slug":"welcome-visitors","title":"Welcome Visitors","date":1512484259323,"synopsis":"Here we collect research and write about [[Ecovillage]]s, and [[Communal Living Projects]]. Our aim is to collect a resource of best practice, and advice on how to [[Create Your Own Ecovillage]]."},{"slug":"wilsons-life-scientific","title":"Wilson's Life Scientific","date":1512484587099,"synopsis":"Wilson talks to Jim al-Khalili about his life scientific. [http://www.bbc.co.uk/programmes/b0639kzv bbc]"}]