[{"slug":"a-truly-serverless-web","title":"A truly serverless web","date":1523779639515,"synopsis":"A little while ago our Tech Lead Viktor Charypar wrote a blog about all things around peer-to-peer web called 'The end of the cloud: A truly serverless web.' It got picked up by Venture Beat and started a discussion on Twitter. Paul Frazee and Viktor started talking and eventually we invited him to come to London to give a talk at our very first 'We love tech' meet up."},{"slug":"advantages","title":"Advantages","date":1524233424586,"synopsis":"Serverless is more cost-effective than renting or purchasing a fixed quantity of servers, which generally involves significant periods of underutilization or idle time."},{"slug":"authoring-microservices","title":"Authoring Microservices","date":1523819664754,"synopsis":"One of the biggest priorities for this project is to attract good writers, coders, and speakers to the forthcoming [[Platform Earth]] events and podcasts."},{"slug":"beaker","title":"Beaker","date":1523779626006,"synopsis":"Beaker is an experimental Peer-to-Peer web browser, using Dat Protocol. [https://beakerbrowser.com/ site]"},{"slug":"browser-based-federation","title":"Browser-based Federation","date":1523465369210,"synopsis":"Pure javascript in the browser, combined with [[CORS]] headers, enables federation of content and services leveraging only the browser."},{"slug":"build-on-decentralised-protocols","title":"Build on decentralised protocols","date":1523786453304,"synopsis":"A page with 1 items."},{"slug":"changes-to-this-site","title":"Changes to this Site","date":1434532209841,"synopsis":"Below we list recent changes to this site only without also listing changes from the [[Neighbourhood]]:"},{"slug":"commons-server","title":"Commons server","date":1523714004943,"synopsis":"It is designed to be able to host a small number of individual federated wiki sites for a community of authors or cooperative."},{"slug":"containershipio","title":"containership.io","date":1497885958866,"synopsis":"Containership Cloud is a containers-as-a-service platform providing users with a single pane of glass to easily deploy, manage and scale their containerized applications on any public or private cloud - [https://docs.containership.io/getting-started/overview/what-is-containership-cloud containership.io]"},{"slug":"decentralised-protocols","title":"Decentralised protocols","date":1523465393680,"synopsis":"Here we review the rapidly expanding ecosystem of decentralised protocols that we can build with. We can use these protocols to create architectures that are p2p or federated, but that do not rely on conventional centralised servers."},{"slug":"decentralized-technology","title":"Decentralized Technology","date":1523463885111,"synopsis":"In recent times there has been a lot of interest in building decentralised technologies for the web. historically there have been many such attempts, but the newer technology stacks, thanks in no small part to the perceived success of [[blockchain]] technology, looks particulalry promissing."},{"slug":"drag-and-drop-publishing","title":"Drag-and-drop publishing","date":1523714014756,"synopsis":"A page with 1 items."},{"slug":"etherpad-lite","title":"Etherpad Lite","date":1512054976393,"synopsis":"[[Etherpad Lite]] is an almost complete rewrite of the original [[Etherpad]] software, based on different technical foundations and written by different authors."},{"slug":"federated-servers","title":"Federated servers","date":1523465377616,"synopsis":"Federated servers are a tried and tested basis for decentralised cooperation on the internet. Email is the classic example of such a federated architecture. Federated wiki reinvents this federation in a minimal way for web sites. Each minimal wiki-server provides an entry point into the federation, while maintaining only the smallest possible code base, relying instead on [[browser-based federation]] to work it's magic."},{"slug":"fedwiki-server","title":"Fedwiki Server","date":1517402974543,"synopsis":"This page is about the current and future of [[Fedwiki]] servers. The current reference implementation in [[Node]] can be found her on [https://github.com/fedwiki/wiki-node-server gitbub]"},{"slug":"fedwiki-tools","title":"Fedwiki Tools","date":1523477599939,"synopsis":"Here we list a few tools that are of particular use in managing and creating [[Fedwiki]] content. For a full list of transporters navigate to the site below:"},{"slug":"finding-and-writing-transporters","title":"Finding and Writing Transporters","date":1523810444140,"synopsis":"Here we will point to information about available transporters as well as tips for writing them yourself."},{"slug":"functional-specification","title":"Functional Specification","date":1523790461383,"synopsis":"A functional specification describes how a product will work entirely from the user's perspective. It doesn't care how the thing is implemented. It talks about features. It specifies screens, menus, dialogs, and so on - [http://www.joelonsoftware.com/articles/fog0000000035.html joelonsoftware.com]"},{"slug":"future-transport","title":"Future Transport","date":1523816837406,"synopsis":"Here we describe the present state and future directions of the Transporter concept."},{"slug":"hackmd","title":"HackMD","date":1525328140658,"synopsis":"HackMD is an alternative to [[etherpad-lite]]. It is a modern fully featured [[markdown]] editor based on [[meteor.js]]."},{"slug":"javascript-persists","title":"Javascript Persists","date":1523815755158,"synopsis":"I'm trying to think of a metaphor to describe why I find javascript fascinating even though it is certainly the most carelessly structured environment I have ever struggled to put to work."},{"slug":"json-pipeline","title":"JSON Pipeline","date":1523465400114,"synopsis":"Both @ (maybe we should call this [[Travelr]]) and the federation as a whole can be considered to be a set of loosely coupled services that consume and produce json. See [[JSON Schema]]."},{"slug":"kubeless","title":"Kubeless","date":1523747397181,"synopsis":"kubeless is a Kubernetes-native serverless framework that lets you deploy small bits of code without having to worry about the underlying infrastructure plumbing. It leverages Kubernetes resources to provide auto-scaling, API routing, monitoring, troubleshooting and more."},{"slug":"list-of-rest-apis","title":"List of REST API's","date":1523730636747,"synopsis":"Here we list [[REST API]]s that we have already worked with or are useful to build into [[platform.earth]]:"},{"slug":"loopback","title":"LoopBack","date":1523745829643,"synopsis":"LoopBack is a platform for building APIs and microservices in Node.js - [https://loopback.io/doc/en/lb4/index.html loopback.io]"},{"slug":"markdown","title":"Markdown","date":1525329015415,"synopsis":"Markdown is a lightweight markup language with plain text formatting syntax. It is designed so that it can be converted to HTML and many other formats using a tool by the same name - [https://en.wikipedia.org/wiki/Markdown wikipedia]"},{"slug":"markdown-files","title":"Markdown files","date":1525329033413,"synopsis":"[[Markdown]] is a lightweight markup language with plain text formatting syntax. It is designed so that it can be converted to HTML and many other formats using a tool by the same name - [https://en.wikipedia.org/wiki/Markdown wikipedia]"},{"slug":"microservice","title":"Microservice","date":1510671826092,"synopsis":"A microservice is for all intents and purposes a small [[restful web service]] :)"},{"slug":"move-to-a-better-web","title":"Move to a Better Web","date":1523816374968,"synopsis":"The [[About-Transport-Plugin]] automates import of web content into federated wiki where some responsibility for the result rests with the [[transporter]]'s author."},{"slug":"netflix-guide-to-microservices","title":"Netflix Guide to Microservices","date":1523776831966,"synopsis":"This video is very useful in terms of getting a realistic picture of what scaling implies when dealing with [[microservices]]."},{"slug":"netlify","title":"Netlify","date":1521534972583,"synopsis":"Netlify can be used both from a web UI or by using command line tools. You can create unlimited domains with the free account. For $45 a month you get team sharing, administrator roles, visitor password control, and email and chat support."},{"slug":"new-microservices","title":"New microservices","date":1523713103959,"synopsis":"A page with 1 items."},{"slug":"non-goals","title":"Non-goals","date":1523790342484,"synopsis":"- without suffering the traditional creep of centralised governance, and incentive systems that to date have destroyed, or at least severely damaged all previous attempts at true decentralisation."},{"slug":"openapi-specification","title":"OpenAPI Specification","date":1523745805479,"synopsis":"The OpenAPI Specification, originally known as the Swagger Specification, is a specification for machine-readable interface files for describing, producing, consuming, and visualizing RESTful Web services - [https://en.wikipedia.org/wiki/OpenAPI_Specification wikipedia]"},{"slug":"personas","title":"Personas","date":1523799125541,"synopsis":"We'll be developing and refining personas who will be the imagined actors as we develop more advanced uses cases. (Shift-click to see multiple personas.)"},{"slug":"platform-earth","title":"Platform Earth","date":1516040195327,"synopsis":"Platform Earth is a [[microservice]] platform for the commons. Microservices are traditionally employed by large companies, distributed across many departments and work teams, to achieve scalability, agility and the ability to maintain high reliability systems."},{"slug":"platform-earth-activity","title":"Platform Earth Activity","date":1524665026343,"synopsis":"View all activity from [[Platform Earth Sites]] listed in the roster below:"},{"slug":"platform-earth-microservices","title":"Platform Earth Microservices","date":1523776844752,"synopsis":"Here we outline a basic suite of [[microservices]] that we intend to build for [[Platform Earth Zero]]:"},{"slug":"polyglot-computing","title":"Polyglot (computing)","date":1523745756382,"synopsis":"In computing, a polyglot is a computer program or script written in a valid form of multiple programming languages, which performs the same operations or output independent of the programming language used to compile or interpret it. - [https://en.wikipedia.org/wiki/Polyglot_(computing) wikipedia]"},{"slug":"polyglot-earth","title":"Polyglot Earth","date":1523815532827,"synopsis":"On this page we look to a future version of wiki that fully embraces multiple computer languages, acting as a documentation layer, a form of glue between the communities."},{"slug":"polyglot-software-development","title":"Polyglot Software Development","date":1523814474988,"synopsis":"We look to enable coders to programme in their language of choice, by providing a robust [[RESTful]] [[Microservice Architecture]]."},{"slug":"polyglot-webservice-hosting","title":"Polyglot Webservice Hosting","date":1438352148620,"synopsis":"A proposal to create hosting infrastructure that we give to students to code restful Web services in any programming language."},{"slug":"polygot-service-design","title":"Polygot service design","date":1523724578326,"synopsis":"Ability to code services in a wide range of programming languages."},{"slug":"pragmatic-layered-approach","title":"Pragmatic Layered Approach","date":1523786358838,"synopsis":"Here we discuss the strategy of tackling decentralisation, with reference to the benefits of a federated approach that retains some of the features of more conventional architectures. See [[reclaiming servers]]."},{"slug":"reclaiming-servers","title":"Reclaiming Servers","date":1523780250464,"synopsis":"There are several ways of using [[decentralized technology]] to create [[the federation]]. The first and current way that has been prototyped in [[federated wiki]] is to place all the logic in [[client-side javascript]]. Let's call that technique [[browser-based federation]]. The second technique is to federate the servers. We need a new software stack for servers if they are to contribute to the federation."},{"slug":"restbase","title":"RESTBase","date":1455622211932,"synopsis":"RESTBase is a caching / storing API proxy. Its configuration is based on [[Swagger]] specs, and its primary storage backend is using [[Cassandra]]."},{"slug":"revealjs","title":"reveal.js","date":1459433443764,"synopsis":"A framework for easily creating beautiful presentations using HTML."},{"slug":"scenarios","title":"Scenarios","date":1523799140117,"synopsis":"When you're designing a product, you need to have some real live scenarios in mind for how people are going to use it. Otherwise you end up designing a product that doesn't correspond to any real-world usage. A scenario is closely related to a [[user-journey]], as a scene in a storyboard is related to a particular shot."},{"slug":"serverless-computing","title":"Serverless computing","date":1523746147857,"synopsis":"Serverless computing is a cloud computing execution model in which the cloud provider dynamically manages the allocation of machine resources. Pricing is based on the actual amount of resources consumed by an application, rather than on pre-purchased units of capacity. It is a form of utility computing. - [https://en.wikipedia.org/wiki/Serverless_computing wikipedia]"},{"slug":"serverless-microservices","title":"Serverless Microservices","date":1523779203908,"synopsis":"Using [[microservices]] on AWS. Is this to wiki's advantage? Can we exploit it without becoming it? See [[Computational Habitat]]."},{"slug":"simple-writing","title":"Simple Writing","date":1525327972558,"synopsis":"Authors need to be able to create textual content in a way that is fully compatible with [[the federation]], and yet familiar with the way they normally write."},{"slug":"social-relationship-to-code","title":"Social relationship to code","date":1523815810786,"synopsis":"Code is a political act. It is the means by which we express our ability and desire to act in the world. Code is at the heart of our financial institutions, our science, our ability to transact and navigate in the world, and increasingly the way knowledge is mediated to us. In the future it is likely to mediate our political expression."},{"slug":"specification-overview","title":"Specification Overview","date":1523824476585,"synopsis":"This is like the table of contents for your spec. It might be a simple flowchart, or it might be an extensive architectural discussion. Everybody will read this to get the big picture, then the details will make more sense."},{"slug":"static-site-microservices","title":"Static Site Microservices","date":1523044216328,"synopsis":"For [[platform.earth]] we are developing a suite of microservices for [[Static Site Generation]] that facilitate drag and drop creation of low cost (virtually free) web sites for the commons - ie cooperatives and the not-for-profit sector."},{"slug":"story-map","title":"Story Map","date":1523791805846,"synopsis":"A story map is a graphical, two-dimensional visualization of the [[Product Backlog]] - [https://en.wikipedia.org/wiki/User_Story#Story_map wikipedia]"},{"slug":"swagger","title":"Swagger","date":1523745693160,"synopsis":"Swagger is an open source software framework backed by a large ecosystem of tools that helps developers design, build, document, and consume RESTful Web services - [https://en.wikipedia.org/wiki/Swagger_(software) wikipedia]"},{"slug":"swagger-software","title":"Swagger (software)","date":1523745821296,"synopsis":"Swagger is an open source software framework backed by a large ecosystem of tools that helps developers design, build, document, and consume RESTful Web services - [https://en.wikipedia.org/wiki/Swagger_(software) wikipedia]"},{"slug":"the-federation","title":"The Federation","date":1523807824894,"synopsis":"Here we describe the The Federation. We should use this term wisely. It describes quite clearly the social aspects of this project, while also pointing gently towards [[Star Trek]] and the future of the [[Decentralised Web]]."},{"slug":"three-layers-of-federation","title":"Three layers of federation","date":1523465359301,"synopsis":"[[The Federation]] can be viewed as an interlocking set of layers that support decentralisation and federation."},{"slug":"transporter","title":"Transporter","date":1523815896308,"synopsis":"A [[Transporter]] is a web service that provides services to the Federation. Using the [[About-Transport-Plugin]] you can call these services simply by dragging and drooping a URL from an external site, or another [[Fedwiki]] site, in order to import of perform some other manipulation of the sites content."},{"slug":"transporter-drop","title":"Transporter Drop","date":1523816348174,"synopsis":"At present transporters are not particularly easy to use for new users. Even experienced users have difficulty finding the right page, or right site that provides a suitable [[transporter]]. the current mechanism is also somewhat alien to the way federated wiki works in other aspects."},{"slug":"universal-drag-and-drop","title":"Universal Drag-and-Drop","date":1523818294157,"synopsis":"A page with 1 items."},{"slug":"use-case","title":"Use case","date":1523798026554,"synopsis":"In software and systems engineering, a use case is a list of actions or event steps typically defining the interactions between a role and a system to achieve a goal. The actor can be a human or other external system. In systems engineering use cases are used at a higher level than within software engineering often representing missions or stakeholder goals. The detailed requirements may then be captured in the Systems Modeling Language (SysML) or as contractual statements. - [https://en.wikipedia.org/wiki/Use_case wikipedia]"},{"slug":"user-journey","title":"User journey","date":1523798882014,"synopsis":"# See also"},{"slug":"user-story","title":"User story","date":1523798101799,"synopsis":"In software development and product management, a user story is an informal, natural language description of one or more features of a software system. User stories are often written from the perspective of an end user or user of a system."},{"slug":"vertx","title":"Vert.x","date":1502221792886,"synopsis":"Eclipse Vert.x is a polyglot event-driven application framework that runs on the Java Virtual Machine - [https://en.wikipedia.org/wiki/Vert.x wikipedia]"},{"slug":"welcome-visitors","title":"Welcome Visitors","date":1525328196122,"synopsis":"[[Platform Earth]] is a [[microservice]] platform for the [[commons]]. Here we research and specify [[microservices]] that are of utility to social and cooperative enterprises"},{"slug":"wikidata","title":"Wikidata","date":1523733474469,"synopsis":"Wikidata is a powerful tool for obtaining commons related information using REST. It is a core aim of this project to fully integrate the wikidata rest api's into [[Platform Earth]] microserves."},{"slug":"wikidata-tools","title":"Wikidata tools","date":1523727061583,"synopsis":"Below are a collection of links imported from [[OneTab]]. You can view these links here - [https://www.one-tab.com/page/5grf-gZERiS-YaanN9OhGA one-tab.com]:"}]