[{"slug":"andrew-orford","title":"Andrew Orford","date":1511954680486,"synopsis":""},{"slug":"andrews-list-of-podcasts","title":"Andrew's List of Podcasts","date":1526378257372,"synopsis":"Here I will keep a synoptic list of podcasts to indicate content/formats that I am investigating."},{"slug":"andrews-notes-on-17-nov-2017","title":"Andrew's notes on 17 Nov 2017","date":1513540692814,"synopsis":"This our first ever meet is just a test."},{"slug":"asic-resistance","title":"ASIC Resistance","date":1522324716738,"synopsis":"An example of ASIC resistance is (amongst others) the [[Equihash]] algorithm."},{"slug":"david-bovill","title":"David Bovill","date":1489691927769,"synopsis":"On this site I write about [[Livecode]], the projects I am working on and the courses I am teaching."},{"slug":"douglas-hofstadter","title":"Douglas Hofstadter","date":1513542554244,"synopsis":"Douglas Richard Hofstadter (born February 15, 1945) is an American professor of cognitive science whose research focuses on the sense of \"I\" (sense of self in relation to the external world), consciousness, analogy-making, artistic creation, literary translation, and discovery in mathematics and physics. Hofstadter's book Gödel, Escher, Bach: An Eternal Golden Braid, first published in 1979, won both the Pulitzer Prize for general non-fiction and a National Book Award (at that time called The American Book Award) for Science. His 2007 book I Am a Strange"},{"slug":"edward-de-bono","title":"Edward de Bono","date":1513542460264,"synopsis":"Edward de Bono (born 19 May 1933) is a Maltese physician, psychologist, author, inventor and consultant psychologist. He originated the term lateral thinking, wrote the book Six Thinking Hats and is a proponent of the teaching of thinking as a subject in schools. Edward de Bono is regarded as the leading authority in creativity - [https://en.wikipedia.org/wiki/Edward_de_Bono wikipedia]"},{"slug":"metaphorical-language","title":"Metaphorical Language","date":1513534663989,"synopsis":"[[Douglas Hofstadter]]"},{"slug":"my-notes-on-this-process","title":"My Notes on this Process","date":1513533140519,"synopsis":"I started with a new site: andrew.outlandish.academy"},{"slug":"pamela-mclean","title":"Pamela McLean","date":1497864906211,"synopsis":"Pamela McLean has been a teacher/learner and creator of new knowledge related to the use of digital technologies since the late 1970s (when her name was Pam Fiddy)."},{"slug":"pod-club","title":"Pod Club","date":1516095559230,"synopsis":"Pod Club is an [[Asynchronous Salon]] format to explore speech based journalism and media literacy within the [[Public Sphere]]."},{"slug":"podcast-radio-hour","title":"Podcast Radio Hour","date":1516062561694,"synopsis":"Podcast Radio Hour is an 8 part series on BBC Radio 4 Extra, starting Fri 19th Jan 2018."},{"slug":"podcasts-remembered","title":"Podcasts Remembered","date":1516291447407,"synopsis":"The key to this format is asking listeners to remember a specific podcast which had a big impact."},{"slug":"practice-development","title":"Practice Development","date":1516291976602,"synopsis":"As part of practice development at Podclub we will be testing and refining formats. This process is perhaps similar to the production team in a studio working on the 'show format'."},{"slug":"rhetoric","title":"Rhetoric","date":1513535083351,"synopsis":"Rhetoric is the art of discourse, wherein a writer or speaker strives to inform, persuade or motivate particular audiences in specific situations. As a subject of formal study and a productive civic practice, rhetoric has played a central role in the European tradition. Its best known definition comes from Aristotle, who considers it a counterpart of both logic and politics, and calls it \"the faculty of observing in any given case the available means of persuasion.\" Rhetoric typically provides heuristics for understanding, discovering, and developing arg"},{"slug":"same-guest-different-podcast","title":"Same Guest Different Podcast","date":1519917935597,"synopsis":"Journalism and production techniques in podcasting become evident when hearing from the same guest (talking about 'their subject') but on different show formats."},{"slug":"sunny-sangha","title":"Sunny Sangha","date":1512075802421,"synopsis":"Sunny Sangha is a community organiser who seeks to bring people together from all walks of life, to help create a more open and fair society. A society ruled by love, rather than fear."},{"slug":"water-metaphors","title":"Water Metaphors","date":1513542475481,"synopsis":"[[Metaphorical Language]]"},{"slug":"welcome-visitors","title":"Welcome Visitors","date":1521071220483,"synopsis":"[[Andrew Orford]] at [[Pod Club]]"}]