[{"slug":"abstract","title":"Abstract","date":1504012569322,"synopsis":"**Purpose** The purpose of this paper is to provide an update on my continuing research into ‘Systemic Leadership in a Networked World’. I originally proposed to investigate how to maximize social media for open innovation and collective intelligence for organizational competitiveness, and this paper details findings resulting from research conducted to date; refinements to the original research question, with a specific focus on ‘Boundary’; and the proposed methodology for Phase 2 of the research."},{"slug":"africa-stories","title":"Africa Stories","date":1500379678388,"synopsis":"The intention here is to provide a \"library\" of real-life stories about and from places in Africa where work is being done by locals on the ground to grow their capacity and capabilities for sustainable prosperity. Unleashing the collective human, technological, economic and ecological genius of each place will accelerate progress toward the flourishing conditions wanted and needed."},{"slug":"africa-stories---page-2","title":"Africa Stories - page 2","date":1500469732026,"synopsis":"#From Local to Global"},{"slug":"africa-stories---page-3","title":"Africa Stories - page 3","date":1500471892674,"synopsis":"# Connecting the Unconnected"},{"slug":"aims","title":"Aims","date":1503849612551,"synopsis":"FEAST is an event that creates conversations between people. We aim to create a popular, massively scaleable, platform for collaboration and democratic engagement. To do this we build upon our nature as social beings, that for thousands of years have come together around food to converse, tell stories, and be entertained."},{"slug":"background","title":"Background","date":1504621955805,"synopsis":"Over the past eight years, the use of social technologies has seen improved risk management; faster innovation cycles; access to extensive and diverse internal and external global resources; on-demand pay-for-performance and/or service; retained knowledge and knowledge management; and improved business results, shareholder and stakeholder value (Bughin, 2009; Kalapesi et.al., 2010; Johnson et.al., 2011)."},{"slug":"big-accounting--finance","title":"BIG Accounting & Finance","date":1499421589878,"synopsis":"BIG Accounting & Finance is:"},{"slug":"big-society","title":"Big Society","date":1499875675975,"synopsis":"The Big Society was a political ideology developed in the early 21st century. The idea proposes \"integrating the free market with a theory of social solidarity based on hierarchy and voluntarism\". Conceptually it \"draws on a mix of conservative communitarianism and libertarian paternalism\". Its roots \"can be traced back to the 1990s, and to early attempts to develop a non-Thatcherite, or post-Thatcherite, brand of UK conservatism\" such as David Willets' Civic Conservatism and the revival of Red Toryism. Some commentators have seen the Big Society as invo"},{"slug":"big-society-reimagined","title":"BIG Society Reimagined","date":1499877388248,"synopsis":"Building on [[BIG Accounting & Finance]], what might a Bold, Inclusive, Generative Society look like?"},{"slug":"boundary-and-systems-thinking","title":"Boundary and Systems Thinking","date":1504030243701,"synopsis":"*“The boundary concept is fundamental: it is the core idea of systems thinking.”*"},{"slug":"changes-to-this-site","title":"Changes to this Site","date":1434532209841,"synopsis":"Below we list recent changes to this site only without also listing changes from the [[Neighbourhood]]:"},{"slug":"co-learner-questions","title":"Co-Learner Questions","date":1498550384488,"synopsis":"**20170626-1**"},{"slug":"collaborative-intelligence","title":"Collaborative Intelligence","date":1499851982809,"synopsis":"\"*Collaborative Intelligence is the measure of your ability to think with others on behalf of what matters to us all. To access that intelligence we must learn to dignify differences in how we think and use them to face complex challenges.*\" - Dawna Markova, Ph.D. and Angie McArthur, Collaborative Intelligence book published 2015."},{"slug":"collective-intelligence-and-inspirations","title":"Collective Intelligence and Inspirations","date":1503518906176,"synopsis":"An ever-evolving list of influences regarding new organisational and societal structures include:"},{"slug":"complementary-learning-systems-theory","title":"Complementary Learning Systems Theory","date":1499794322151,"synopsis":"Co-authored by the CEO and co-founder of Artificial Intelligence company DeepMind Technologies, Demis Hassabis, this paper was published in 2016, titled [https://stanford.edu/~jlmcc/papers/KumaranHassabisMcC16CLSUpdate.pdf What Learning Systems do Intelligent Agents Need? Complementary Learning Systems Theory Updated]"},{"slug":"conference-themes","title":"Conference Themes","date":1503849341477,"synopsis":"The radio shows and art events will focus on issues of sustainability and the environment, with a particular focus on the architecture of local engagement and global conversation and coordination of action. We look to realise new ways to establish conversations between groups and communities that have the ability to explore issues together over time."},{"slug":"crossmodalism","title":"Crossmodalism","date":1499798328906,"synopsis":"In essence, Crossmodalism is about the integration of information across different sensory modalities."},{"slug":"cultural-archive","title":"Cultural Archive","date":1503851870800,"synopsis":"FEAST is designed to encourage dialogue within communities and between communities. We will provide the infrastructure to permanently and freely archive this content as a free culture open archive, and will look to organisations such as archive.org and similar organisations to support this ambition."},{"slug":"culture-kit---a-local-festival-kit","title":"Culture Kit - a local festival kit","date":1503850302993,"synopsis":"We provide tools and sustainable hosting so that each local festival can have it’s own website and mobile app. Together with online training materials and centralised production support we aim to encourage local organisations, radio stations and individuals to start local festivals in their area. The combination of these tools will be designed to make it as simple as possible to create a sustainable local festival."},{"slug":"david-bovill","title":"David Bovill","date":1489691927769,"synopsis":"On this site I write about [[Livecode]], the projects I am working on and the courses I am teaching."},{"slug":"elfneh-bariso","title":"Elfneh Bariso","date":1500296125443,"synopsis":""},{"slug":"elfnehs-audioboos","title":"Elfneh's AudioBoos","date":1499875098283,"synopsis":"Elfneh posts on AudioBoom as ElfnehBariso1 - [https://audioboom.com/ElfnehBariso1 audioboom.com]"},{"slug":"event-info","title":"Event Info","date":1499595833847,"synopsis":"**July 2017**"},{"slug":"farmers-and-pastoralists-research-archive","title":"Farmers and Pastoralists Research Archive","date":1500587838000,"synopsis":"See [[Conflict Resolution Resources]]"},{"slug":"feast-futures-event-oct2017---initial-thoughts","title":"FEAST Futures Event Oct2017 - initial thoughts","date":1504633449171,"synopsis":"Following on from a call with David Bovill on 5 Sep 2017, Pam, Andrew and Gavin brainstorm ideas that could bring together [[GlobalNet21]] and [[London Futurists]] for an event potentially on Sunday the 8th of October 2017."},{"slug":"feast-open-cafe","title":"FEAST Open Cafe","date":1504696533651,"synopsis":"David Bovill used a term \"Open Cafe\" during a phone call on 05Sep2017 with Pamela McLean, Andrew Orford and Gavin Peacock."},{"slug":"feast-overview","title":"FEAST Overview","date":1503851901404,"synopsis":"This page originated from a March 2017 draft document produced by [[David Bovill]] about FEAST."},{"slug":"feast-website","title":"FEAST Website","date":1503844402400,"synopsis":"#FEAST"},{"slug":"fedwiki-tools","title":"Fedwiki Tools","date":1510668509421,"synopsis":"Here we list a few tools that are of particular use in managing and creating [[Fedwiki]] content."},{"slug":"garden-of-ideas","title":"Garden of Ideas","date":1500472974346,"synopsis":"[http://www.gardenofideas.org/garden-of-ideas.html Garden of Ideas] aims to become the \"next generation of visitor attraction\". A unique cultural destination, with ground breaking content created by an award winning team. ​​A re-imagining of the ancient pleasure gardens for the 21st century. With the best arts, science, technology and entertainment.  Proposed for key sites in the UK, China, India and the Middle East."},{"slug":"gavin-outlandish-home","title":"Gavin Outlandish Home","date":1504630043274,"synopsis":"Also, to find out what my \"neighbourhood\" outlandish community are doing, please feel free to visit the [[Outlandish Activity]] page."},{"slug":"gavin-peacock","title":"Gavin Peacock","date":1499119296630,"synopsis":"Born in the 1960s in South West London into an \"ordinary\" working household. Nothing traumatic that I can recall about my childhood, and I left school at 18 after my \"A\" Levels and fell straight into banking. Deep down, I didn't really have a strong sense of what I wanted to do, and where my brightest \"talents\" might lie."},{"slug":"gavins-activity","title":"Gavin's Activity","date":1503845634214,"synopsis":"Here we list Gavin's recent activity, and writing and research currently being focussed on."},{"slug":"global-goals-no4-quality-education","title":"Global Goals No.4: Quality Education","date":1499245214800,"synopsis":"# Ensure inclusive and quality education for all and promote lifelong learning"},{"slug":"holacracy-of-one","title":"Holacracy of One","date":1498157891206,"synopsis":"At the end of 2016 George Por posted an article called [http://www.enliveningedge.org/columns/mapping-a-lifework/ Mapping a LifeWork] which drew some of its inspiration from the workings of [http://www.holacracy.org/how-it-works/ Holacracy]. This evolving article attempts to map out my own “Circle of LifeWork” or “Holacracy of One”, seeing myself as a multi-faceted, multi-potential “human organization” of wholes within wholes…"},{"slug":"home-feasts","title":"Home FEASTs","date":1503849867115,"synopsis":"Taking part in the festival is as easy as cooking some food, inviting some friends and tuning into the radio. People can take part anywhere in the world, either listening to the live radio on the internet, or via a participating local radio station."},{"slug":"image-transporter","title":"Image Transporter","date":1504043285016,"synopsis":"This service creates wiki pages with images in several forms without loading image data within the page. Use this for large or detailed images that will be stored remotely."},{"slug":"inclusive-accounting--finance","title":"Inclusive Accounting & Finance","date":1499420680593,"synopsis":"A page with 0 items."},{"slug":"introduction","title":"Introduction","date":1504091601851,"synopsis":"*“The ‘Ideal’ of scientific knowledge underlying basic research is concerned with universal concepts, theories, models and methods.”*"},{"slug":"john-dada","title":"John Dada","date":1499719384212,"synopsis":""},{"slug":"john-dada-two-pager","title":"John Dada Two Pager","date":1500292644867,"synopsis":"A page with 0 items."},{"slug":"leadership-a-lens","title":"Leadership: A Lens","date":1499725091739,"synopsis":"A [http://www.businessballs.com/leadership-theories.htm brief outline] of the definitions and differences between Models, Philosophies, and Styles:"},{"slug":"leadership-a-manifesto","title":"Leadership: A Manifesto","date":1499726995860,"synopsis":"**What Kind Of Leaders Will Best Serve The World In Our VUCA 21st Century?**"},{"slug":"leadership-in-a-networked-world","title":"Leadership in a Networked World","date":1504092402098,"synopsis":"**[https://hydra.hull.ac.uk/resources/hull:13357 by Delia Pembrey MacNamara, University of Hull, 2014]**"},{"slug":"learning-passport","title":"Learning Passport","date":1498605545239,"synopsis":"Here I research the idea of creating a portable, secure, learning passport."},{"slug":"learning-roles","title":"Learning Roles","date":1499244596015,"synopsis":"In conversation with [[Mike Caulfield]] we started to outline a series of [[Roles or Hats]] that might enable a more explicit contract with people working together on a [[Happening]]:"},{"slug":"marketing","title":"Marketing","date":1503851567566,"synopsis":"FEAST will be marketed to audiences and creators in the following ways:"},{"slug":"methodology-and-rationale","title":"Methodology and Rationale","date":1504019578801,"synopsis":"*“Boundary: (noun) [ˈbaundəri]: An often imaginary line separating one thing from another.”*"},{"slug":"mindtravel","title":"MindTravel","date":1499795783715,"synopsis":"Composer and pianist [https://www.mindtravel.com/about-murray/ Murray Hidary] began his journey exploring more traditional modes of musical expression, creating symphonies in Russia, working with string quintets in the U.S. and, of course, continuing his daily piano practice that started as a child. This practice grounded him through personal tribulations and during his tenure as an entrepreneur. It became a voice, a language he used to connect to his higher sense of purpose.  He called it *MindTravel*."},{"slug":"music-festival","title":"Music Festival","date":1503848595737,"synopsis":"FEAST is designed to be a popular and adaptable festival that is able to engage as wide and diverse a community as possible. We will be creating a unique platform for emerging artists, buskers and new bands, and will work with project partners wherever possible to find, and help to promote new upcoming talent."},{"slug":"new-economics","title":"New Economics","date":1503521093512,"synopsis":"This page attempts to explore various writings about new [https://en.wikipedia.org/wiki/Economics economic] systems aiming to transcend the myopic lopsided limitations of current mainstream systems such as [https://en.wikipedia.org/wiki/Capitalism Capitalism]."},{"slug":"open-space-technology","title":"Open Space Technology","date":1504695764153,"synopsis":"[http://openspaceworld.org/wp2/what-is/ Open Space (Technology)] is a simple "},{"slug":"opencafe","title":"OpenCAFE","date":1504696309550,"synopsis":"The [http://opencafe.readthedocs.io/en/latest/ Common Automation Framework Engine (CAFE)] is the core engine/driver used to build an automated testing framework. It is designed to be used as the base engine for building an automated framework for API and non-UI resource testing. It is designed to support functional, integration and reliability testing. The engine is NOT designed to support performance or load testing."},{"slug":"outlandish-activity","title":"Outlandish Activity","date":1500814831211,"synopsis":"View all activity of the [[Outlandish Researchers]]  listed in the roster below, writing across education initiatives in the [[Outlandish Academy]]:"},{"slug":"pastoralists-also-need-peace","title":"Pastoralists Also Need Peace","date":1500586539041,"synopsis":"Pastoralists Also Need Peace"},{"slug":"production-partners","title":"Production Partners","date":1503850677065,"synopsis":"FEAST seeks to be an annual festival of radio and podcasting around the world. We look to celebrate the best in radio, and to attract new audiences to podcasters and local radio stations. Our aim is to establish as many co-productions as possible with existing organisations, and to license this content in such a way so as to encourage syndication, remixing and dialogue between shows. We are also looking to promote new talent, putting individuals in touch with local and international producers, and stations looking for fresh ideas, shows and talent."},{"slug":"purpose","title":"Purpose","date":1504013116121,"synopsis":"*“Social media is misnamed. It should be called ‘personal’ media”*."},{"slug":"radio-conference","title":"Radio Conference","date":1503848935277,"synopsis":"Radio as we understand it today is a broadcast medium. Conferences are events that take place in physical space. Both allow only limited forms of dialogue and questioning from the audience. FEAST aims to create an entirely new form of radio show and dialogue with the audience."},{"slug":"radio-production-templates","title":"Radio Production Templates","date":1503850119254,"synopsis":"FEAST makes it as easy as possible for people to produce their own panel discussions, game shows, or live music sessions on the radio. We provide templates and training to enable radio stations and individuals to produce their own shows and take part in decentralised radio conferences that take advantage of the networked gatherings that FEAST facilitates. In this way we can organise a variety of simple forms of interaction between the audience and the radio shows we produce."},{"slug":"recent-changes","title":"Recent Changes","date":1362955694011,"synopsis":"Here we list neighborhood pages with those most recently changed listed first. See also [[Local Changes]]."},{"slug":"recipe---the-radio-co-production-platform","title":"Recipe - the radio co-production platform","date":1503850480065,"synopsis":"We will provide a simple platform that makes it as easy as possible for local radio stations to enter into co-productions with international partners, or simply broadcast live shows, or pre-recorded podcasts created at other locations."},{"slug":"research-aims-and-objectives","title":"Research Aims and Objectives","date":1504015387790,"synopsis":"Whilst there are several interpretations of ‘systemic leadership’ (Campbell et.al., 1991; Cavaleri & Obloj, 1993; Allen & Cherrey, 2000; Midgley, 2000; Higham et.al., 2009; Tate, 2009; Taylor, 2010), arguably there is not, as yet, an explicit definition of the concept, how one can learn or practise it, and how it benefits the organisation as a whole (although Allen & Cherrey, 2000, and Taylor, 2010, provide an excellent foundation to build on). **(1)**"},{"slug":"research-methodology-and-principles","title":"Research Methodology and Principles","date":1504016101142,"synopsis":"Investigating the concept of ‘Boundary’ is a large undertaking within the context of a techno-social world**(3)**. To maintain focus and purpose I took inspiration from Ludwig von Bertalanffy (1968), widely recognized as one of the founding fathers of General System Theory (GST)**(4)**, where it is asserted that the principles of GST can be integrated into all areas of human experience (Davidson 1983). I aim for my research to:"},{"slug":"self-organising-learning-eco-systems","title":"Self-Organising Learning Eco-systems","date":1499197194889,"synopsis":""},{"slug":"significance-and-contribution-of-the-research","title":"Significance and Contribution of the Research","date":1504018439761,"synopsis":"*“If you know the rule, then you know how to break it.”*"},{"slug":"six-thinking-hats","title":"Six Thinking Hats","date":1499254392949,"synopsis":"[[Six Thinking Hats]] is a simple, effective parallel thinking process that helps people be more productive, focused, and mindfully involved."},{"slug":"structure-of-the-paper","title":"Structure of the Paper","date":1504019318059,"synopsis":"In Chapter 2, the concepts of ‘Boundary’, ‘leadership’ and ‘network’ are explored within the broad paradigms of the natural, social and technological sciences and their associated philosophical positions. The concept of ‘network’ in this paper is deployed within the context of social networks (both ‘online’ and ‘offline’), characterised by a plurality of technologies, technological systems, and humans operating with different paradigms and weltanschauung**(6)**."},{"slug":"sustainable-funding-model","title":"Sustainable Funding Model","date":1503850868790,"synopsis":"FEAST is designed from the outset to create a sustainable funding model around the creation and maintenance of local culture. We aim to avoid the traditional reliance on grant or local government funding, and to create relationships with local businesses and organisations in the local community that have a vested interest in promoting local culture."},{"slug":"sustainable-learning-model","title":"Sustainable Learning Model","date":1499259002640,"synopsis":"Our aim is to set up a flexible member based organisation through which we can structure international partnerships with as far as possible minimal and automated accountancy using internal software mediated mechanisms such as currency systems that account for soft contributions as well as hard contributions."},{"slug":"team-forming-storming","title":"Team Forming, Storming...","date":1499722703536,"synopsis":"**Bruce Tuckman's 1965 Forming Storming Norming Performing team-development model**"},{"slug":"technology-innovation-leadership-and-systems-thinking","title":"Technology, Innovation, Leadership and Systems Thinking","date":1504021334497,"synopsis":"*“Even a single different opinion can make a group wiser.”*"},{"slug":"testing-or-scratch-page","title":"Testing or scratch page","date":1504617794317,"synopsis":"A page to experiment with content using various plug ins before adding said content to  the relevant page(s)."},{"slug":"the-boundary-triage-a-theory-or-a-practical-tool","title":"The Boundary Triage: A Theory or a Practical Tool?","date":1504094829355,"synopsis":"**As Theory**"},{"slug":"the-boundary-triage-simple-form","title":"The Boundary Triage (Simple Form)","date":1504092440766,"synopsis":"#±𝑩=𝑪+𝑨+𝑹𝑭"},{"slug":"the-future-of-capitalism","title":"The Future of Capitalism?","date":1503522625469,"synopsis":"YOUTUBE LS0OUv6eiO4"},{"slug":"the-naming-of-the-boundary-triage","title":"The Naming of the Boundary Triage","date":1504092015493,"synopsis":"Firstly, it is important to define what the equation I am about to present is, and what it is not. The Boundary Triage is *not* a general theory of Boundary, and is not an axiom, mathematical equation or algorithm. As such, whilst it *appears* mathematical, it is not strictly so**(10)**."},{"slug":"the-story-of-imaginal-cells","title":"The Story of Imaginal Cells","date":1504043790462,"synopsis":"[http://imaginal-labs.com/imaginal-cells/ The term “Imaginal”] has connotations of imagination, the process of creating new ideas and concepts of things that do not yet exist."},{"slug":"the-zero-marginal-cost-society","title":"The Zero Marginal Cost Society","date":1503497973506,"synopsis":"YOUTUBE 3xOK2aJ-0Js"},{"slug":"things-you-must-do","title":"Things You Must Do","date":1498780380479,"synopsis":"You can wander all day in the federation, and it's easy to get sidetracked. Here we link you directly to the things you must be do/be able to do before the starting to work with others, in a nice linear style. You can still wander if you want, but if you want to do the minimum, go through this list, skip the byways, and you will be set."},{"slug":"thought-garden-installation","title":"Thought Garden Installation","date":1500390149069,"synopsis":"The [[Thought Garden]] installation is a [[conversational space]] that layers and places sound spatially in order to represent the architecture of the topic presented."},{"slug":"thoughts-on-futures-facilitation","title":"Thoughts on Futures Facilitation","date":1504696340631,"synopsis":"There are many facilitation processes practised in the world today aimed at capturing and channelling diverse collective intelligence for realising faster better progress and greater collective benefit."},{"slug":"timeline","title":"Timeline","date":1503849583055,"synopsis":"FEAST will take place 2nd - 10th September 2017. The main focus of the event will be the final weekend 8-10 September with a gradual build up of events and activities taking part the week before in order to give space and avoid programming clashes. In addition to these dates we look to organise:"},{"slug":"towards-an-ontology-of-boundary","title":"Towards an Ontology of Boundary","date":1504091276379,"synopsis":"The Networked world has surfaced the multiplicity of disciplines, paradigms and worldviews that exist, not only globally, but also locally. It has been identified in the areas of technology, information systems, innovation and knowledge management that successful leaders display boundary spanning skills across personal as well as horizontal and vertical organizational boundaries."},{"slug":"u-to-u-research","title":"U to U Research","date":1500034074172,"synopsis":"**U2U Generative Conversations**"},{"slug":"u2u-conversations","title":"U2U Conversations","date":1499879083178,"synopsis":"Here we look at how a conversation between two groups meeting at remote universities can work together. Our focus is on creating a new form of dialogue that is exciting and productive."},{"slug":"uni-to-uni-research","title":"uni to uni research","date":1500030310896,"synopsis":"https://audioboom.com/posts/6089307-uni-to-uni-research.mp3"},{"slug":"wanderbuch","title":"Wanderbuch","date":1498651809765,"synopsis":"A [[Journeyman]] would be required to keep a journal or [[Wanderbuch]]. This would often serve as both passport and a resumé - [http://www.peterspioneers.com/wanderbuch.htm peterspioneers.com]"},{"slug":"welcome-visitors","title":"Welcome Visitors","date":1511023938874,"synopsis":"This is the Outlandish Federated Wiki site of Gavin Peacock. The Smallest Federated Wiki project, instigated by Ward Cunningham, wants to be small in the \"easy to learn powerful ideas\" version of small. It wants to be a wiki so that strangers can meet and create works of value together. And it wants to be federated so that the burden of maintaining long-lasting content is shared among those who care."},{"slug":"wiser-together-guiding-principles","title":"Wiser Together Guiding Principles","date":1504694693233,"synopsis":"Wiser Together is a pioneering venture of conversational experiences, learning programs and consultation services designed to develop and sustain multi-generational collaboration on the most critical issues of today. Multi-generational World Café practitioners are poised to work within communities and organizations to tap into the collective wisdom and co-creativity that shows up when we intentionally invite the voices and unique contributions of all generations to participate."},{"slug":"workshops","title":"Workshops","date":1503849775011,"synopsis":"An important part of FEAST is the education and training elements that the festival requires. There are things we need to build and create, and skill that we need to learn. In particular we need the following, and aim to create these together with local communities through a series of workshops over the summer months:"},{"slug":"world-caf-design-principles","title":"World Café design principles","date":1504693550206,"synopsis":"The following seven World Café design principles are an integrated set of ideas and practices that form the basis of the pattern embodied in the World Café process (see also the [http://www.theworldcafe.com/services-programs/wiser-together/ Wiser Together guiding principles] for more about the World Cafe’s DNA)."},{"slug":"world-radio-day-conference-2018","title":"World Radio Day Conference 2018","date":1503852014475,"synopsis":"FEAST is designed to be an ongoing platform for dialogue and community engagement. We are launching this programme in Sept 8-10th 2017 (FEAST \"0\" Launch weekend 15-17Sep2017) as an autumn harvest celebration focussing on issues of the environment, food and sustainability. However we look to build on the community, expertise and technology we build through this event to programme and organise further events."}]