[{"slug":"-by-coach","title":"... by coach","date":1466457258870,"synopsis":"Major german coach services provide stops in Göttingen and Kassel."},{"slug":"-by-plane","title":"... by plane","date":1466457504351,"synopsis":"Closest airports to Kassel and Göttingen are Hannover, Leipzig or Frankfurt (Main)."},{"slug":"-by-train","title":"... by train","date":1466457129730,"synopsis":"There are frequent regional train services from Göttingen and Kassel to Witzenhausen Nord."},{"slug":"a-first-draft-of-a-transformap-pattern-language","title":"a first draft of a TransforMap pattern language","date":1467134762058,"synopsis":"We are aware of a certain number of patterns which make up a constituent frame for the language space to be granularised and recombined."},{"slug":"a-tempospatial--or-spatiotemporal--investigation","title":"A tempospatial ⸻ or spatiotemporal ⸻ investigation","date":1467051254889,"synopsis":"In recursion of the definatory premisses in which [[spacetime]] is a compound of embodied experiences, a dialectical mind dissolves this entanglement into separate categories of space and time. As such, we gain two then independent perspectives on where to look for distinct, perceptional qualities."},{"slug":"caps-communities","title":"CAPS communities","date":1466461396738,"synopsis":"This list is compiled from [https://ec.europa.eu/digital-single-market/caps-projects-FP7 CAPS projects in FP7]."},{"slug":"capssi-communities","title":"CAPSSI communities","date":1466461918774,"synopsis":"Derived from [https://ec.europa.eu/digital-single-market/en/news/22-new-caps-projects-horizon-2020 CAPS projects in Horizon 2020] and compiled here."},{"slug":"compendium","title":"Compendium","date":1466106481913,"synopsis":"A selected amount of epistems survives the controversial debate. Yet it is easy to disguise a programmatic intervention, may it be by imposing power through violence or referring to spiritistic imaginations, as an emotional affect. Quiet voices often remain unheard."},{"slug":"food-and-accomodation","title":"Food and accomodation","date":1467560886952,"synopsis":"We are being welcomed and hosted by the local [[Transition Haus Witzenhausen]] and its community."},{"slug":"meta-stabilisation-of-non-representational-plateaus","title":"Meta-stabilisation of non-representational plateaus","date":1467131410279,"synopsis":"If we take a truist reading of [[the geographic distribution]] for granted, yet-another-fallacy™ imposes itself on us: what is not being expressed and contained within the conditioning rule-set is left out of the discourse."},{"slug":"mmm-community","title":"MMM community","date":1466464803766,"synopsis":"The community emerged in late 2013, early 2014 around the slogan: \"Mapping all alternatives\" and found its title at the name-giving Mapping Meeting Munich."},{"slug":"objectives","title":"Objectives","date":1466457734214,"synopsis":"Strictly following the [[rationale]] of the collective speech act [[TransforMap]], a tremendous wealth of layers is encompassed by a kakophonic [[chorus of voices]]. Their tuning isn't just right yet. Which contexts are we looking at?"},{"slug":"pattern-language-community","title":"Pattern language community","date":1466463282339,"synopsis":"Utilising a pattern language approach is best understood via the preliminary work by"},{"slug":"patterns","title":"Patterns","date":1387554637566,"synopsis":"We recognize patterns in our work and patterns in the work of others we aspire to employ. We'll start with a list but expect this to grow into a system called a pattern language."},{"slug":"patterns-of-a-commons-world","title":"Patterns of a commons world","date":1466113483401,"synopsis":"Talking of an abundant Commons as an a priori cognitive condition still requires dedicated expression. Let's collect examples of where and when this has begun."},{"slug":"peering","title":"Peering","date":1461862381008,"synopsis":"In computer networking, peering is a voluntary interconnection of administratively separate Internet networks for the purpose of exchanging traffic between the users of each network. [https://en.wikipedia.org/wiki/Peering Wikipedia]"},{"slug":"programme","title":"Programme","date":1467152235493,"synopsis":"We will unfold an aspiration of a [[TransforMap]] pattern language. This happens June 29 & 30 2016 in Witzenhausen."},{"slug":"rationale","title":"Rationale","date":1465944757248,"synopsis":"A pattern starts with its seed environments. These may as well be other patterns themselves. They acknowledge for the originating context of a given case."},{"slug":"revealing-unintentional-meshworks-of-tribal-swarms","title":"Revealing unintentional meshworks of tribal swarms","date":1467131443124,"synopsis":"Looking at the connections between individuals and eventual groupings into formalised collective bodies has been part of network studies for half a century already, yet the intrinsic dynamics of such milieus tends to hide out. In our context, mapping actor networks of serendipituous encounters allows for modelling neglegted overlaps between intentful communities."},{"slug":"spacetime","title":"Spacetime","date":1459967428218,"synopsis":"Spacetime is a model used in human language to encompass the physical sensation of embodiment within an environment and the conscious experience of sequences of identifiable events."},{"slug":"target-audience","title":"Target audience","date":1466453526034,"synopsis":"The TransforMap pattern workshop is directed at networked individuals who are interested in mapping societal change and in distributing self-organisation."},{"slug":"the-geographic-distribution","title":"The geographic distribution","date":1466534602586,"synopsis":"The primary effect of relating to an everyday reenactment in economic articulations may suggestively be the notion of spatial embeddedness. While we regress to usage of containerised depictions of such artifacets - pointed interest in locations, aggregations of representations visualised into diagrams or curated collections - their intercourse with perpendicular experience domains cannot be denied."},{"slug":"transformap-community","title":"TransforMap community","date":1466465170483,"synopsis":"The TransforMap community formed only short after giving a name to what the [[MMM community]] conceived."},{"slug":"transformap-workshop-navigating-pattern-languages-for-mapping-the-transformations","title":"Transformap Workshop: Navigating pattern languages for mapping the transformations","date":1467234201979,"synopsis":"This workshop invites the users, communities and maintainers of the crowdmapping initiative [http://transformap.co TransforMap] to articulate [[a first draft of a TransforMap pattern language]] for mapping the transformations: a narration about the social, economic and technologic demands on a distributed mapping process."},{"slug":"travel-instructions","title":"Travel instructions","date":1467137623441,"synopsis":"The workshop takes place in the medieval city of Witzenhausen in Germany."},{"slug":"unconditional-redistribution-and-peer-matching","title":"Unconditional redistribution and peer matching","date":1467137416360,"synopsis":"The most challenging, and in the same time promising, idea from the TransforMap perimeters is a non-reciprocal dissemination of existing [[value flows]]. Notable approaches formulate input-process-output [[patterns]] of linked economic activity, while the more sophisticated intent networks aim at mediating and [[peering]] collective demand and individual needs."},{"slug":"value-flows","title":"Value flows.","date":1467134762059,"synopsis":"To understand economic activity, right now and retrospectively, on the surface of planet Earth and beyond, supply chain infrastructures and the movement of knowledge are of special interest."},{"slug":"ward-cunningham","title":"Ward Cunningham","date":1437700798837,"synopsis":"I have lots of ambition for federated wiki which I have explored at times and deferred to more mundane needs other times. Here I can describe ideas without declaring them as accepted direction."},{"slug":"welcome-visitors","title":"Welcome Visitors","date":1467831092980,"synopsis":"Welcome to this [[Federated Wiki]] site. From this page you can find who we are and what we do. New sites provide this information and then claim the site as their own. You will need your own site to participate."}]