[{"slug":"about-json-plugin","title":"About JSON Plugin","date":1491669637220,"synopsis":"The plugin exposes restful endpoints for reading and writing JSON data that will be stored within the item along with other items on the page. Changes in configuration of the plugin are recorded in the journal but updates to the data itself are recorded elsewhere."},{"slug":"about-provenance","title":"About Provenance","date":1414118102433,"synopsis":"Wiki uses domain names as the identity of individuals or organizations in the federation. We are pretty sure of the domain name for sites we contact directly. If we trust that site then we can work back further."},{"slug":"adhocracy","title":"Adhocracy","date":1520080198497,"synopsis":"Adhocracy is a flexible, adaptable and informal form of organization that is defined by a lack of formal structure. It operates in an opposite fashion to a bureaucracy. The term was coined by Warren Bennis in his 1968 book The Temporary Society, later popularized in 1970 by Alvin Toffler in Future Shock, and has since become often used in the theory of management of organizations (particularly online organizations). The concept has been further developed by academics such as Henry Mintzberg - [https://en.wikipedia.org/wiki/Adhocracy wikipedia]"},{"slug":"airpods-and-mics","title":"Airpods and mics","date":1498999410528,"synopsis":"Below are a collection of links imported from [[OneTab]]. You can view these links here - [https://www.one-tab.com/page/6uA3gKBJTHWy2guNrYetGA one-tab.com]:"},{"slug":"apparatus","title":"Apparatus","date":1511488410295,"synopsis":"I admire Apparatus which was brought to my attention by Bret Victor, whom I also admire.  Been thinking about how I might connect apparatus to wiki. [https://aprt.us site]"},{"slug":"aral-balkan","title":"Aral Balkan","date":1491388985853,"synopsis":"Aral Balkan is an activist, designer, and software developer - [https://ar.al/ ar.al]"},{"slug":"argument-map","title":"Argument map","date":1512310468569,"synopsis":"In informal logic and philosophy, an argument map or argument diagram is a visual representation of the structure of an argument - [https://en.wikipedia.org/wiki/Argument_map wikipedia]"},{"slug":"changes-to-this-site","title":"Changes to this Site","date":1434532209841,"synopsis":"Below we list recent changes to this site only without also listing changes from the [[Neighbourhood]]:"},{"slug":"charts","title":"Charts","date":1511643047382,"synopsis":"Here we look at how we might use existing services to make beautiful and dynamic graphs and charts."},{"slug":"citation-style-language","title":"Citation Style Language","date":1512209096536,"synopsis":"The Citation Style Language (CSL) is an open XML-based language to describe the formatting of citations and bibliographies. Reference management programs using CSL include Zotero, Mendeley and Papers - [https://en.wikipedia.org/wiki/Citation_Style_Language wikipedia]"},{"slug":"citizens-foundation","title":"Citizens Foundation","date":1519922111941,"synopsis":"<img src='https://www.google.com/s2/favicons?domain=www.regjeringen.no' style='vertical-align: middle; width:16px; height:16px' /><a target=_blank style='vertical-align: middle; padding-left: 10px; padding-right: 12px; text-decoration: none;' href='https://www.regjeringen.no/contentassets/a22bb750da2f4b23bb8f525beacf7125/robert-bjarnason-citizen-participation-and-digital-tools-for-democracy.pdf'>robert-bjarnason-citizen-participation-and-digital-tools-for-democracy.pdf</a>"},{"slug":"citoid","title":"Citoid","date":1510512744372,"synopsis":"Citoid is a stateless node service on the SCB cluster. It processes HTTP requests containing a URL or ISBN number by retrieving citation information from external sources with help from a local XULrunner-based Zotero server. It responds with a JSON structure containing the citation information - [https://wikitech.wikimedia.org/wiki/Citoid wikitech.wikimedia.org]"},{"slug":"collaborative-bookmarking","title":"Collaborative Bookmarking","date":1510515482439,"synopsis":"Collaborative bookmarking has been tried many times before, but never really taken off. This may be because of corporate priorities (Yahoo buying [[Delicio.us]]), or may be not many people want to collaborate this way. Here we look at simple and effective ways to share research, references and bookmarks."},{"slug":"connect-to-members","title":"Connect to Members","date":1520007541469,"synopsis":"This is probably the most needed requirement, and useful simply to organise discussion and feel connected to the wider membership. However it is also the base requirement for establishing consensus, or obtaining a minimum level of support for a proposal so that it can be considered for a poll or more formal vote."},{"slug":"consensus-computer-science","title":"Consensus (computer science)","date":1466345209229,"synopsis":"A fundamental problem in distributed computing and multi-agent systems is to achieve overall system reliability in the presence of a number of faulty processes. This often requires processes to agree on some data value that is needed during computation. Examples of applications of consensus include whether to commit a transaction to a database, agreeing on the identity of a leader, state machine replication, and atomic broadcasts. The real world applications include clock synchronization, PageRank, opinion formation, power smart grids, state estimation, "},{"slug":"constructive-feedback","title":"Constructive Feedback","date":1519926074948,"synopsis":"[[LiquidFeedback]] implements quantified [[constructive feedback]]. This can be broken down to:"},{"slug":"criticisms-of-liquidfeedback","title":"Criticisms of LiquidFeedback","date":1519936174401,"synopsis":"[[LiquidFeedback]] has been criticised on privacy grounds for the lack of anonymous voting ([[secret ballot]]). The developers rather emphasise the importance of [[Transparency]]."},{"slug":"cytoscapejs","title":"Cytoscape.js","date":1509545214346,"synopsis":"Cytoscape.js is an open-source graph theory (a.k.a. network) library written in JavaScript. You can use Cytoscape.js for graph analysis and visualisation - [http://js.cytoscape.org/ cytoscape.org]"},{"slug":"data-not-layout","title":"Data not Layout","date":1423333332525,"synopsis":"Pages are stored on federated wiki sites as JSON, a simple, easily parseable data format. You can see what this format looks like by clicking JSON at the bottom of the page."},{"slug":"data-security","title":"Data security","date":1520035207119,"synopsis":"For democratic purposes it is important that the voting data is:"},{"slug":"data-visualisation","title":"Data Visualisation","date":1511689182189,"synopsis":"Here we look at tools for data visualisation for [[Platform Earth]] and wiki."},{"slug":"debate-and-discuss","title":"Debate and discuss","date":1519986994863,"synopsis":"The platform should enable intuitive rich and constructive conversation and debate. This is more than traditional [[Forum software]] provides, or at least we need a modern flexible interface. [[Discuss]] is perhaps the minimal standard here."},{"slug":"deliberation","title":"Deliberation","date":1520005748489,"synopsis":"Deliberation is a process of thoughtfully weighing options, usually prior to voting. Deliberation emphasizes the use of logic and reason as opposed to power-struggle, creativity, or dialog. Group decisions are generally made after deliberation through a vote or consensus of those involved - [https://en.wikipedia.org/wiki/Deliberation wikipedia]"},{"slug":"deliberation-template","title":"Deliberation Template","date":1520034037186,"synopsis":"Here we breakdown and quantify aspects of the software which make it suitable for decentralised [[Deliberation]]:"},{"slug":"deliberatorium","title":"Deliberatorium","date":1512310400120,"synopsis":"A deliberatorium or collaboratorium is a form of online collaborative [[argument map]]ping. It was first deployed as the MIT Collaboratorium, and directed at the question of climate change - [https://en.wikipedia.org/wiki/Deliberatorium wikipedia]"},{"slug":"democracy-activity","title":"Democracy Activity","date":1519815163138,"synopsis":"View all activity from [[Democracy Sites]] listed in the roster below:"},{"slug":"democracy-notes","title":"Democracy Notes","date":1519985745949,"synopsis":"Here we list research and notes that needs further elaboration. Drag and drop links to other pages. Create new pages from here:"},{"slug":"democracy-using-ethereum","title":"Democracy using Ethereum","date":1519986556186,"synopsis":"This tutorial shows how to build a decentralized and democratic organization that exists solely on the blockchain, but that can do anything that a simple account would be able to - [https://www.ethereum.org/dao ethereum.org]"},{"slug":"democracyearth","title":"DemocracyEarth","date":1519925311116,"synopsis":"In a world that has succeeded in the globalization of financial assets while keeping political rights enclosed to territories, we need to build new models of democratic governance that enable humanity to collaborate and address pressing global issues."},{"slug":"democratic-features-template","title":"Democratic Features Template","date":1520037044073,"synopsis":"Now let's test the [[templates]] on some real scenarios:"},{"slug":"democratic-tools","title":"Democratic Tools","date":1520424258570,"synopsis":"Here I research and democratic tools, practices, and software that can be of use to democratic movements. In particular you may find the following research links useful:"},{"slug":"demographic-data","title":"Demographic Data","date":1509704528778,"synopsis":"Demographic data refers to data that is statistically socio-economic in nature such as population, race, income, education and employment, which represent specific geographic locations and are often associated with time."},{"slug":"digital-identity-template","title":"Digital identity Template","date":1520034111916,"synopsis":"Here we breakdown and quantify aspects of the software which make it suitable for providing decentralised [[Digital Identity]] for democratic purposes:"},{"slug":"display-feature-overview","title":"Display Feature Overview","date":1520034456473,"synopsis":"Here we explore how we might summarise a lot of data on a single page. See [[about radar plugin]], and [[about json plugin]], [[about tally plugin]] and [[about cypher plugin]]."},{"slug":"document-package","title":"Document Package","date":1502985557744,"synopsis":"Document packages give the illusion of a single document to users but provide you with flexibility in how you store the document data internally."},{"slug":"domination-of-extroverts","title":"Domination of extroverts","date":1519926324451,"synopsis":"The [[domination of extroverts]], which is the problem that regularly arises with grassroots democracy -"},{"slug":"dreamfactory","title":"DreamFactory","date":1501163138085,"synopsis":"DreamFactory automatically generates a comprehensive [[REST API]] for every popular [[SQL]] database, [[NoSQL]] document store, and file storage system - [https://www.dreamfactory.com/features html]."},{"slug":"dreamfactory-ipfs-service","title":"DreamFactory IPFS Service","date":1502992536734,"synopsis":"The aim here is to have the [[IPFS Daemon]] running on a [[docker]] and serving files from a cloud based data container, using [[DreamFactory]] to wrap this as a service which we can use in apps and manage authentication tokens for."},{"slug":"e-democracy","title":"E-democracy","date":1519922085530,"synopsis":"E-democracy (a combination of the words electronic and democracy), also known as digital democracy or Internet democracy, incorporates 21st-century information and communications technology to promote democracy. It is a form of government in which all adult citizens are presumed to be eligible to participate equally in the proposal, development, and creation of laws. E-democracy encompasses social, economic and cultural conditions that enable the free and equal practice of political self-determination - [https://en.wikipedia.org/wiki/E-democracy wikipedi"},{"slug":"ease-of-installation","title":"Ease of installation","date":1520035723887,"synopsis":"Software that is complex or otherwise hard to install can make it prohibitive to administer without a dedicated sys admin."},{"slug":"embedding-github-geojson","title":"Embedding GitHub Geojson","date":1492544914763,"synopsis":"Want to make your [[geoJSON]] map available someplace other than [[GitHub]]? Simply modify this template, and place it in any HTML page that supports javascript (e.g., [[GitHub Pages]]):"},{"slug":"etherpad","title":"Etherpad","date":1512051445442,"synopsis":"Etherpad (previously known as EtherPad) is an open source, web-based collaborative real-time editor, allowing authors to simultaneously edit a text document, and see all of the participants' edits in real-time, with the ability to display each author's text in their own color. There is also a chat box in the sidebar to allow meta communication - [https://en.wikipedia.org/wiki/Etherpad wikipedia]"},{"slug":"etherpad-lite","title":"Etherpad Lite","date":1512054976393,"synopsis":"[[Etherpad Lite]] is an almost complete rewrite of the original [[Etherpad]] software, based on different technical foundations and written by different authors."},{"slug":"experimental-interfaces","title":"Experimental Interfaces","date":1424049433342,"synopsis":"Some thoughts on the sort of interfaces that we can experiment with [[Federated Wiki]] data structures."},{"slug":"facilitate-action","title":"Facilitate action","date":1519988675666,"synopsis":"Democracy is not simply about talking. It is about discussion leading to decisions and action. An important part of the software required to facilitate this process is a direct and simple link that participants can follow to take action once a decision has been made."},{"slug":"federated-identity","title":"Federated identity","date":1510657504948,"synopsis":"A federated identity in information technology is the means of linking a person's electronic identity and attributes, stored across multiple distinct identity management systems - [https://en.wikipedia.org/wiki/Federated_identity wikipedia]"},{"slug":"fedwiki-tools","title":"Fedwiki Tools","date":1511705109115,"synopsis":"Here we list a few tools that are of particular use in managing and creating [[Fedwiki]] content. Check [[Recycled pages]] to find delted pages."},{"slug":"find-and-connect-to-members","title":"Find and connect to members","date":1520007557208,"synopsis":"This is probably the most needed requirement, and useful simply to organise discussion and feel connected to the wider membership. However it is also the base requirement for establishing consensus, or obtaining a minimum level of support for a proposal so that it can be considered for a poll or more formal vote."},{"slug":"gmap-algorithm","title":"GMap Algorithm","date":1426024628476,"synopsis":"GMap is an algorithm for visualizing graphs as maps. GMap (see also [[GvMap Algorithm]]), is a practical tool for visualizing relational data with geographic-like maps. It aims to capture the underlying structural information, clustering, and neighborhoods of complex data  - [http://www.graphviz.org/Documentation/GHK09.pdf pdf]"},{"slug":"gnu-social","title":"GNU social","date":1512132002204,"synopsis":"GNU social (previously known as StatusNet and once known as Laconica) is a free and open source software microblogging server written in PHP that implements the OStatus standard for interoperation between installations - [https://en.wikipedia.org/wiki/GNU_social wikipedia]"},{"slug":"grafana","title":"Grafana","date":1509314934586,"synopsis":"Grafana allows you to query, visualize, alert on and understand your metrics no matter where they are stored. Create, explore, and share dashboards with your team and foster a data driven culture."},{"slug":"graph-database-research","title":"Graph Database Research","date":1499445398039,"synopsis":"Here we look at how wiki can be used to author, or define a network simply be creating wiki links between pages, or by using a special markup within wiki."},{"slug":"heat-map","title":"Heat map","date":1511643460888,"synopsis":"A heat map (or heatmap) is a graphical representation of data where the individual values contained in a matrix are represented as colors. The term 'heat map' was originally coined and trademarked by software designer Cormac Kinney in 1991, to describe a 2D display depicting financial market information, though similar plots such as shading matrices have existed for over a century - [https://en.wikipedia.org/wiki/Heat_map wikipedia]"},{"slug":"holochain","title":"Holochain","date":1501590411891,"synopsis":"Holographic storage for distributed applications. A holochain is a validating distributed hash table (DHT) where every node enforces validation rules on data against the signed chains where the data originated - [http://ceptr.org/projects/holochain ceptr.org]"},{"slug":"html-to-svg","title":"HTML to SVG","date":1510699663043,"synopsis":"Below are a collection of links imported from [[OneTab]]. You can view these links here - [https://www.one-tab.com/page/rbCgH9ABTKmY732eEAWNXA one-tab.com]:"},{"slug":"human-ecosystems","title":"Human Ecosystems","date":1465482364389,"synopsis":"Human Ecosystems is a family of real-time system capturing information from social networks to visualise the human geography of cities, across space, time and relations - [http://human-ecosystems.com/home/about-the-human-ecosystems/ human-ecosystems.com]"},{"slug":"identity","title":"Identity","date":1449087570443,"synopsis":"This will be a collection of audio notes on the topic of idenity. Some subtopics below:"},{"slug":"identity-attributes","title":"Identity Attributes","date":1520036012573,"synopsis":"A page with 1 items."},{"slug":"installing-liquidfeedback","title":"Installing LiquidFeedback","date":1519941608423,"synopsis":"Some links and notes on how to install [[LiquidFeedback]]:"},{"slug":"internet-of-people","title":"Internet of People","date":1510491308430,"synopsis":"Our goal with this initiative is to create a compelling counter-narrative to Silicon Valley’s surveillance capitalism. To that end, we are drafting a progressive technology policy aimed at achieving three key objectives:"},{"slug":"javascript-charting-frameworks","title":"Javascript Charting Frameworks","date":1511642961721,"synopsis":"Here we research the latest and best javascript charting frameworks. Currently we like the look of [[Vega]] and / or [[Plotly]]."},{"slug":"json-ld","title":"JSON-LD","date":1458033169550,"synopsis":"JSON-LD, or JavaScript Object Notation for Linked Data, is a method of transporting [[Linked Data]] using [[JSON]] - [https://en.wikipedia.org/wiki/JSON-LD wikipedia]"},{"slug":"json-rpc","title":"JSON-RPC","date":1459816897297,"synopsis":"JSON-RPC is a remote procedure call protocol encoded in JSON. It is a very simple protocol (and very similar to [[XML-RPC]]), defining only a handful of data types and commands. JSON-RPC allows for notifications (data sent to the server that does not require a response) and for multiple calls to be sent to the server which may be answered out of order - [https://en.wikipedia.org/wiki/Json_Rpc wikipedia]"},{"slug":"jwt","title":"JWT","date":1510696589566,"synopsis":"[[JSON Web Token]] (JWT, pronounced jot) is a relatively new token format used in space-constrained environments such as HTTP Authorization headers. JWT is architected as a method for transferring security claims based between parties - [https://en.wikipedia.org/wiki/JSON_Web_Token wikipedia]"},{"slug":"languages-that-compile-to-javascript","title":"Languages that compile to Javascript","date":1510699590787,"synopsis":"Below are a collection of links imported from [[OneTab]]. You can view these links here - [https://www.one-tab.com/page/TqtX3HkKTLqtmpKFUzPanQ one-tab.com]:"},{"slug":"liquid-democracy","title":"Liquid Democracy","date":1519985671561,"synopsis":"Liquid Democracy is a combination of [[Direct Democracy]], and [[Representative Democracy]]. It aims to create a more flexible and fluid way for people to express their [[Democratic Preference]]."},{"slug":"liquid-democracy-notes","title":"Liquid Democracy Notes","date":1519999498173,"synopsis":"Here we list links and notes on democracy that need to be further researched and reviewed."},{"slug":"liquidfeedback","title":"LiquidFeedback","date":1519941651280,"synopsis":"LiquidFeedback is free software for political opinion formation and decision making, combining aspects of  [[Representative Democracy]] and [[Direct Democracy]] - [http://www.liquidfeedback.org/ liquidfeedback.org]."},{"slug":"liquidfeedback-api","title":"LiquidFeedback API","date":1519931684738,"synopsis":"The [[LiquidFeedback API]] is quite comprehensive but not yet fixed. It allows external applications to add additional features to the program - [http://dev.liquidfeedback.org/trac/lf/wiki/API dev.liquidfeedback.org]"},{"slug":"loomio","title":"Loomio","date":1519994131923,"synopsis":"Loomio is decision-making software designed to assist groups with the collaborative decision-making process. It is a free software web application, where users can initiate discussions and put up proposals. As the discussions progress to initiating a proposal, the group receives feedback through an updatable pie chart - [https://en.wikipedia.org/wiki/Loomio wikipedia]"},{"slug":"loomio-deliberation-assessment","title":"Loomio Deliberation Assessment","date":1520036443804,"synopsis":"Here we breakdown and quantify aspects of the software which make it suitable for decentralised [[Deliberation]]:"},{"slug":"loomio-identity-assessment","title":"Loomio Identity Assessment","date":1520036629337,"synopsis":"Here we breakdown and quantify aspects of the software which make it suitable for providing decentralised [[Digital Identity]] for democratic purposes:"},{"slug":"loomio-openness-assessment","title":"Loomio Openness Assessment","date":1520036552184,"synopsis":"Here we provide some tools to define and quantify [[Openness]]:"},{"slug":"loomio-voting-assessment","title":"Loomio Voting Assessment","date":1520037016211,"synopsis":"Here we breakdown and quantify aspects of the software which make it suitable for decentralised [[Voting]]:"},{"slug":"loose-coupling","title":"Loose coupling","date":1519988440097,"synopsis":"In computing and systems design a loosely coupled system is one in which each of its components has, or makes use of, little or no knowledge of the definitions of other separate components. Subareas include the coupling of classes, interfaces, data, and services. Loose coupling is the opposite of tight coupling - [https://en.wikipedia.org/wiki/Loose_coupling wikipedia]"},{"slug":"map-animation","title":"Map Animation","date":1511643946910,"synopsis":"Here we look at software and techniques that can be used to animate [[maps]]:"},{"slug":"maps","title":"Maps","date":1511644017467,"synopsis":"Here we look at how to work with maps in wiki. In particular we want to look out how we can use wiki to create and document walks, oral histories, and map festivals."},{"slug":"matrix","title":"Matrix","date":1509727615246,"synopsis":"Matrix is an open standard for interoperable, decentralised, real-time communication over IP. It can be used anywhere you need a standard HTTP API for publishing and subscribing to data whilst tracking the conversation history - [http://matrix.org/docs/guides/faq.html#general matrix.org]"},{"slug":"mendeley","title":"Mendeley","date":1512209193259,"synopsis":"Mendeley is a desktop and web program for managing and sharing research papers, discovering research data and collaborating online. It combines Mendeley Desktop, a PDF and reference management application (available for Windows, OS X and Linux) and Mendeley for Android and iOS, with Mendeley Web, an online social network for researchers - [https://en.wikipedia.org/wiki/Mendeley wikipedia]"},{"slug":"mendeley-suggest","title":"Mendeley Suggest","date":1510496062330,"synopsis":"[[Mendeley]]'s new “Suggest” page offers improved article suggestions, driven by four different recommendation algorithms to support different scientific needs: popular, trending, and, relevant to all or recent documents in your library -"},{"slug":"neo4j","title":"Neo4J","date":1520004893120,"synopsis":"Neo4j is an open-source graph database implemented in Java and accessible from software written in other languages using the Cypher query language through a transactional HTTP endpoint -"},{"slug":"network-visualisation","title":"Network Visualisation","date":1466289686584,"synopsis":"He we list a few pages and sites about graph and network visualisation as it relates to [[FedWiki]]."},{"slug":"new-front-matter-to-science","title":"New Front Matter to Science","date":1449421844643,"synopsis":"Wikipedia as the Front Matter to All Research. A brown bag talk on scholarly citations on Wikipedia with Geoffrey Bilder (CrossRef) and Dario Taraborelli (Wikimedia Foundation)."},{"slug":"norvig-on-data","title":"Norvig on Data","date":1427059163570,"synopsis":"Peter Norvig, et al. \"The Unreasonable Effectiveness of Data\" in IEEE Intelligent Systems (2011) [http://static.googleusercontent.com/media/research.google.com/en/us/pubs/archive/35179.pdf pdf]"},{"slug":"nvotes","title":"nVotes","date":1519941980815,"synopsis":"Below are a collection of links imported from [[OneTab]]. You can view these links here - [https://www.one-tab.com/page/qb5MgKj8SIKWkj8a4okNYA one-tab.com]:"},{"slug":"open-collective","title":"Open Collective","date":1509889111409,"synopsis":"While the Internet has been very good so far at helping people do things together, it is still very difficult for groups to collect money and use it transparently. As a result, we see initiatives, projects, movements popping up here and there that disappear quickly from lack of funding."},{"slug":"open-source","title":"Open Source","date":1520034588756,"synopsis":"Here we want to know if the code is open source and if so which licence does it use."},{"slug":"openness","title":"Openness","date":1520005712298,"synopsis":"Here we try to define \"openness\" as a quantifiable aspect of a piece of software.  In this case we look at it from the perspective of democratic software according to the following dimensions:"},{"slug":"openness-template","title":"Openness Template","date":1520034024211,"synopsis":"Here we provide some tools to define and quantify [[Openness]]:"},{"slug":"pandoc","title":"pandoc","date":1512209130407,"synopsis":"Pandoc is an open-source document converter, widely used as a writing tool (especially by scholars) and as a basis for publishing workflows - [https://en.wikipedia.org/wiki/Pandoc wikipedia]"},{"slug":"participatedb","title":"ParticipateDB","date":1519920984874,"synopsis":"<img src='https://www.google.com/s2/favicons?domain=participedia.net' style='vertical-align: middle; width:16px; height:16px' /><a target=_blank style='vertical-align: middle; padding-left: 10px; padding-right: 12px; text-decoration: none;' href='https://participedia.net/en/search?search_api_views_fulltext=software%20vote&f[0]=field_governance_contributions%3A66'>Search | Participedia</a>"},{"slug":"permanent-archive","title":"Permanent Archive","date":1503001427558,"synopsis":"The permanent archive is the immutable aspect of the [[permanent wiki]]. The aim is to create a publishing medium for wiki. It is designed to store immutable assets such as images, video and audio together with standard single page sites, and  finalise json data."},{"slug":"pico-projectors","title":"Pico Projectors","date":1510142486879,"synopsis":"LED based pico projectors are cheap and robust. They make an interesting basis for [[table-top projection]], and here we explore their use at [[Newspeak House]] and for the [[Worldscape]] installation."},{"slug":"pirate-party-germany","title":"Pirate Party Germany","date":1519936144705,"synopsis":"The Pirate Party Germany (German: Piratenpartei Deutschland), commonly known as Pirates (German: Piraten), is a political party in Germany founded in September 2006 at c-base. It states general agreement with the Swedish Piratpartiet as a party of the information society; it is part of the international movement of pirate parties and a member of the Pirate Parties International. In 2011/12, the party succeeded in attaining a high enough vote share to enter four state parliaments (Berlin, North Rhine-Westphalia, Saarland and Schleswig-Holstein) and the Eu"},{"slug":"plotly","title":"Plotly","date":1511687390798,"synopsis":"Plotly lets users easily create interactive charts and dashboards to share online with their audience."},{"slug":"plotly-dash-framework","title":"Plotly Dash Framework","date":1511687281845,"synopsis":"Dash is a productive Python framework for building web applications - [https://plot.ly/dash/introduction plot.ly]"},{"slug":"polling","title":"Polling","date":1519983788066,"synopsis":"Polling is not the same as voting - it is a rough and ready estimate of voting intention. A poll is non-binding. participants may well change their minds in an actual vote."},{"slug":"privacy","title":"Privacy","date":1520035116331,"synopsis":"For democratic purposes it is important that the voting data is:"},{"slug":"projection-mapping","title":"Projection mapping","date":1509800599078,"synopsis":"Projection mapping, also known as video mapping and spatial augmented reality, is a projection technology used to turn objects, often irregularly shaped, into a display surface for video projection - [https://en.wikipedia.org/wiki/Projection_mapping wikipedia]"},{"slug":"protection-of-minorities","title":"Protection of minorities","date":1519925992367,"synopsis":"LiquidFeedback provides several mechanisms to protect minorities. Even though decisions are finally made by majorities (see also: [[Majority rule]]), the software allows"},{"slug":"pseudonymity","title":"Pseudonymity","date":1467103909360,"synopsis":"Pseudonymity, a word derived from pseudonym, meaning 'false name', is a state of disguised identity."},{"slug":"public-key-infrastructure","title":"Public Key Infrastructure","date":1466675818715,"synopsis":"A public key infrastructure (PKI) is a set of roles, policies, and procedures needed to create, manage, distribute, use, store, and revoke digital certificates and manage public-key encryption. The purpose of a PKI is to facilitate the secure electronic transfer of information for a range of network activities such as e-commerce, internet banking and confidential email. It is required for activities where simple passwords are an inadequate authentication method and more rigorous proof is required to confirm the identity of the parties involved in the com"},{"slug":"pure-data","title":"Pure Data","date":1466336821200,"synopsis":"Pure Data (Pd) is a visual programming language developed by Miller Puckette in the 1990s for creating interactive computer music and multimedia works. While Puckette is the main author of the program, Pd is an open source project with a large developer base working on new extensions. It is released under a license similar to the BSD license. It runs on GNU/Linux, Mac OS X, iOS, Android and Windows. Ports exist for FreeBSD and IRIX - [https://en.wikipedia.org/wiki/Pure_data wikipedia]"},{"slug":"radical-transparency","title":"Radical transparency","date":1519936188655,"synopsis":"Radical transparency is a phrase used across fields of governance, politics, software design and business to describe actions and approaches that radically increase the openness of organizational process and data. Its usage was originally understood as an approach or act that uses abundant networked information to access previously confidential organizational process or outcome data - [https://en.wikipedia.org/wiki/Radical_transparency wikipedia]"},{"slug":"recent-activity","title":"Recent Activity","date":1512212749013,"synopsis":"On this page you can find [[research groups]] that are working on topics related to the current [[domain]]:"},{"slug":"representme","title":"Represent.me","date":1520424501049,"synopsis":"Blah - [https://en.wikipedia.org/wiki/Loomio wikipedia]"},{"slug":"rest-api","title":"Rest API","date":1520034971687,"synopsis":"A [[RESTful API]] provides an additional layer of [[openness]] as we have the freedom to interact with the software from any language."},{"slug":"restful-citations-api","title":"Restful Citations API","date":1510523726263,"synopsis":"Here we explore how to translate a web sites URL into a citation using a Restful API."},{"slug":"scholarly-identity","title":"Scholarly Identity","date":1510496071058,"synopsis":"A page with 1 items."},{"slug":"schulze-method","title":"Schulze method","date":1519936103300,"synopsis":"The Schulze method () is a electoral system developed in 1997 by Markus Schulze that selects a single winner using votes that express preferences. The method can also be used to create a sorted list of winners. The Schulze method is also known as Schwartz Sequential dropping (SSD), cloneproof Schwartz sequential dropping (CSSD), the beatpath method, beatpath winner, path voting, and path winner - [https://en.wikipedia.org/wiki/Schulze_method wikipedia]"},{"slug":"search-box-enhancement","title":"Search Box Enhancement","date":1503059470922,"synopsis":"Here we propose a simple enhancement to how the current search-box works."},{"slug":"secure-identity","title":"Secure Identity","date":1520036011171,"synopsis":"A page with 1 items."},{"slug":"secure-scuttlebutt","title":"Secure Scuttlebutt","date":1509847757545,"synopsis":"Scuttlebutt is a decent(ralised) secure gossip platform. Historically, sea-slang for gossip - a scuttlebutt is basically a watercooler on a ship."},{"slug":"security-token-service","title":"Security token service","date":1510659287681,"synopsis":"Security token service (STS) is a cross-platform open standard core component of the OASIS group's WS-Trust web services single sign-on infrastructure framework specification.cf. Within that claims-based identity framework, a secure token service is responsible for issuing, validating, renewing and cancelling security tokens. The tokens issued by security token services can then be used to identify the holder of the token to services that adhere to the WS-Trust standard. Security token service provides the same functionality as OpenID, but unlike OpenID "},{"slug":"sign-wiki-page-json","title":"Sign Wiki Page Json","date":1462564234031,"synopsis":"For the idea of a [[literate wiki]] to be safe we need to digitally sign the page json. This looks possible to do either with the new PGP signatures on GitHub or projects like [adsf keybase.io]"},{"slug":"simple-authentication","title":"Simple Authentication","date":1520035783943,"synopsis":"- Is it easy to sign on?"},{"slug":"simple-polling-tools","title":"Simple Polling Tools","date":1519983796011,"synopsis":"Here we look at tools that enable simple polling and voting. These are not ideal tools for secure voting, nor are they necessarily fully respectful of privacy and data protection concerns."},{"slug":"simulation","title":"Simulation","date":1511689552164,"synopsis":"Simulation is the imitation of the operation of a real-world process or system over time. The act of simulating something first requires that a model be developed; this model represents the key characteristics, behaviors and functions of the selected physical or abstract system or process. The model represents the system itself, whereas the simulation represents the operation of the system over time - [https://en.wikipedia.org/wiki/Simulation wikipedia]"},{"slug":"single-sign-on","title":"Single-sign-on","date":1520035828393,"synopsis":"For democratic purposes it is important that the voting software is:"},{"slug":"software-features-for-polling","title":"Software features for polling","date":1520005178441,"synopsis":"Here we describe in more detail some of the software features that are considered important for an easy to use, widely adopted [[polling]] app for decentralised communities such as [[DIEM25]]."},{"slug":"software-review-template","title":"Software Review Template","date":1520424393560,"synopsis":"Loomio is decision-making software designed to assist groups with the collaborative decision-making process. It is a free software web application, where users can initiate discussions and put up proposals. As the discussions progress to initiating a proposal, the group receives feedback through an updatable pie chart - [https://en.wikipedia.org/wiki/Loomio wikipedia]"},{"slug":"sovereignty","title":"Sovereignty","date":1520035993437,"synopsis":"For democratic purposes it is important you are:"},{"slug":"sovrin","title":"Sovrin","date":1519923861182,"synopsis":"The [[Sovrin Foundation]] is a private-sector, international non-profit that was established to govern the world’s first [[Self-sovereign Identity Network]]. It is one of the identity platforms being considered by [[DemocracyEarth]]."},{"slug":"splash-page-creation","title":"Splash Page Creation","date":1511547777003,"synopsis":"We can create a single-page web site from wiki (a [[Splash Page]]) by combining an [[HTML Wiki Template]] with structured information from wiki. Here we explore the basics of how we might do this."},{"slug":"static-site-generation","title":"Static Site Generation","date":1510480301170,"synopsis":"Static site generation is a simple and effective modern way to create web sites. Advantages include reduced complexity, easier compliance, cheaper hosting, amongst other benefits."},{"slug":"sustainability","title":"Sustainability","date":1520035482398,"synopsis":"It is important to choose a project that is well maintained. Things to look for include:"},{"slug":"technology-and-democracy","title":"Technology and Democracy","date":1471680672498,"synopsis":"Here we look at the issues, problems and potential of using technology to augment democratic practice."},{"slug":"templates","title":"Templates","date":1520011955657,"synopsis":"This site utilises a number of templates in order to standardise the [[Software evaluation]] of the [[democratic tools]] catalogued here:"},{"slug":"test","title":"Test","date":1520272269251,"synopsis":"Loomio is decision-making software designed to assist groups with the collaborative decision-making process. It is a free software web application, where users can initiate discussions and put up proposals. As the discussions progress to initiating a proposal, the group receives feedback through an updatable pie chart - [https://en.wikipedia.org/wiki/Loomio wikipedia]"},{"slug":"the-wise-democracy-pattern-language","title":"The Wise Democracy Pattern Language","date":1508513451474,"synopsis":"The 3 Dimensions: Power, Participation, Wisdom. [https://i1.wp.com/www.wd-pl.com/wp-content/uploads/Venn-Merge-Film-2.png?resize=300%2C240 source]"},{"slug":"tools-of-change","title":"Tools of Change","date":1491832773093,"synopsis":"Henrik Kniberg describes complex and confusing causal relationships with disarmingly simple drawings. Now he joins other graphic innovators in explaining climate change and our own obligations to address it."},{"slug":"transient-identity","title":"Transient Identity","date":1438183575495,"synopsis":"I'm trying to imagine the use case @opn is exploring. I think it works like this:"},{"slug":"unity-3d","title":"Unity 3D","date":1511688572605,"synopsis":"The [[Unity (game engine)]] is a cross-platform game engine developed by Unity Technologies, which is primarily used to develop video games and simulations for computers, consoles and mobile devices - [https://en.wikipedia.org/wiki/Unity_(game_engine) wikipedia]"},{"slug":"unity-game-engine","title":"Unity (game engine)","date":1511688585045,"synopsis":"[[Unity 3D]] is a cross-platform game engine developed by Unity Technologies, which is primarily used to develop video games and simulations for computers, consoles and mobile devices - [https://en.wikipedia.org/wiki/Unity_(game_engine) wikipedia]"},{"slug":"ushahidi","title":"Ushahidi","date":1455819771154,"synopsis":"Ushahidi, Inc. is a non-profit software company that develops free and open-source software (LGPL) for information collection, visualisation, and interactive mapping."},{"slug":"vega","title":"Vega","date":1511642146921,"synopsis":"Vega is a visualization grammar, a declarative format for creating, saving and sharing interactive visualization designs."},{"slug":"viewing-graphviz-with-javascript","title":"Viewing Graphviz with Javascript","date":1425057087838,"synopsis":"I'd like to view a graphviz file in wiki. I can process it on the server but it seems difficult to get any rich format to display on the screen. Of course I want links so this makes image formats a non-starter."},{"slug":"visualizing-differences","title":"Visualizing Differences","date":1419709599929,"synopsis":"Here is one way to do it."},{"slug":"voting-software","title":"Voting Software","date":1519941550249,"synopsis":"Below are a collection of links imported from [[OneTab]]. You can view these links here - [https://www.one-tab.com/page/7bWJ9nkgTQqX-w4AwQ8Dzg one-tab.com]:"},{"slug":"voting-template","title":"Voting Template","date":1520036996156,"synopsis":"Here we breakdown and quantify aspects of the software which make it suitable for decentralised [[Voting]]:"},{"slug":"web-archive-format","title":"Web Archive Format","date":1497698727314,"synopsis":"What format should we save our data, and code in the Federation? We look for the following properties and qualities for any solution we choose:"},{"slug":"web-components","title":"Web Components","date":1510699537905,"synopsis":"Web Components are a set of features currently being added by the W3C to the HTML and DOM specifications that allow for the creation of reusable widgets or components in web documents and web applications."},{"slug":"webgl","title":"WebGL","date":1511547167380,"synopsis":"WebGL (Web Graphics Library) is a JavaScript API for rendering interactive 2D and 3D graphics within any compatible web browser without the use of plug-ins - [https://en.wikipedia.org/wiki/WebGL wikipedia]"},{"slug":"webgl-examples","title":"WebGL Examples","date":1510697230090,"synopsis":"Here we list some WebGL examples that play well in a modern browser:"},{"slug":"webgl-frameworks","title":"WebGL Frameworks","date":1510697133393,"synopsis":"Below are a collection of links imported from [[OneTab]]. You can view these links here - [https://www.one-tab.com/page/mnqrmK_LTMmcNA-h5X4URw one-tab.com]:"},{"slug":"webgl-video-textures","title":"WebGL video textures","date":1510697986941,"synopsis":"You can play video, even stream video as a texture to 3D objects in [[WebGL]] using javascript."},{"slug":"welcome-visitors","title":"Welcome Visitors","date":1521034140771,"synopsis":"Welcome to this [[Federated Wiki]] site. The purpose of this site is to research practices, software and [[democratic tools]] that are of interest to progressive movements."},{"slug":"why-write-books","title":"Why Write Books","date":1511644218042,"synopsis":"We've run into some coding difficulties deep in the core of wiki while exploring an improved [[Print Plugin]]. The questions escalate to those of representing dynamic behavior in a static medium. Here we explore how wiki should cooperate with ebooks and print on demand."},{"slug":"wireless-microphones","title":"Wireless Microphones","date":1509742892715,"synopsis":"Here we look at wireless microphones that we could use for [[DIEM Café]]. See also [[Airpods and mics]]."},{"slug":"worldscape","title":"Worldscape","date":1510843517423,"synopsis":"Here we look at how we can use [[projection mapping]] and [[immersive sound]] to tell stories about the world."},{"slug":"your-priorities","title":"Your Priorities","date":1519923437536,"synopsis":"Your Priorities is a simple modern web app that has recently been updated to the latest web standards ([[web components]] and ....), and offers a very simple interface to debate priorities, together with the promise of more advanced AI style analytics if that is your thing."},{"slug":"zotero","title":"Zotero","date":1512209288784,"synopsis":"Zotero is software for managing bibliographic and other reference material, usually in research contexts. It is quite an agile tool, not only for storage of references but also for generation of citations, footnotes, bibliographies and reference lists in many formats - [https://en.wikipedia.org/wiki/Zotero wikipedia]"},{"slug":"zotero-standalone","title":"Zotero Standalone","date":1510521883871,"synopsis":"Installing the [[zotero standalone]] version is a simple as going to the donload page and choosing a package for your platform - [https://www.zotero.org/download/ zotero.org]"},{"slug":"zotero-translation-server","title":"Zotero translation server","date":1510513936635,"synopsis":"Server-side Zotero translation. Currently supports import, export, and web translation - [https://github.com/zotero/translation-server github]"},{"slug":"zotero-translators","title":"Zotero translators","date":1510532196623,"synopsis":"Zotero uses 'translators' – short pieces of computer code, or scripts – written by volunteers, to understand the structure of web pages and to parse them into citations using its internal formats:"}]