[{"slug":"a-sound-garden","title":"A Sound Garden","date":1501844972005,"synopsis":"A Sound Garden is one of six outdoor public art works on the National Oceanic and Atmospheric Administration (NOAA) campus that lies adjacent to the Warren G. Magnuson Park on the northwestern shore of Lake Washington in Seattle, Washington. The Seattle Arts Commission guided the jury selection headed by Sadao James Hilario, Engineer-in-charge of the GSA Art in Architecture Program for the NOAA Project, and the jury chose five artists from a pool of more than 250 - [https://en.wikipedia.org/wiki/A_Sound_Garden wikipedia]"},{"slug":"active-conference","title":"Active Conference","date":1511698617443,"synopsis":"An active conference is a conference that concentrates on action, rather than talk. More accurately any discussion, presentations and papers presented are assessed according to the merit of any action or call for participation they engender."},{"slug":"an-equation-for-good","title":"An Equation for Good","date":1473166845967,"synopsis":"In a brief snippet from a conversation Robert had with [[Richard Dawkins]] at the 92 Street Y in New York City, we learn that natural selection is often a brutal arms race, inherently full of suffering and cruelty. But if Darwin's big idea is really predicated on pain and selfishness, why does selflessness exist?"},{"slug":"andys-nine-issues","title":"Andy's Nine Issues","date":1424642964628,"synopsis":"Andy van Dam says, I've used a lot of hypertext systems and I think they are neat and show a lot of potential. I think we are just at the very beginning and it's too early to rush to judgment, but it's clear that collectively we have a lot of hard but exciting work to do to make this technology work and to create what has been called the electronic Alexandria."},{"slug":"argument-from-ignorance","title":"Argument from ignorance","date":1512664697828,"synopsis":"Argument from ignorance ([[Richard Dawkins]] more poetically labelled this \"argument from lack of imagination\"), also known as appeal to ignorance, is a fallacy in informal logic. It asserts that a proposition is true because it has not yet been proven false or a proposition is false because it has not yet been proven true."},{"slug":"argument-map","title":"Argument map","date":1512904306591,"synopsis":"Talking to [[Ray]]  I .."},{"slug":"baloney-detection-kit","title":"Baloney Detection Kit","date":1512665213909,"synopsis":"The [[Baloney Detection Kit]] is a set of tools for skeptical thinking that [[Karl Sagan]] lays out in his book [[The Demon-Haunted World]]. It's a [[Bullshit Detector]]."},{"slug":"barriers-to-a-garden-mindset","title":"Barriers to a Garden Mindset","date":1443640167282,"synopsis":"The biggest barrier is compared to stream, garden just feels weird."},{"slug":"bernie-sanders","title":"Bernie Sanders","date":1512904544827,"synopsis":"Bernard Sanders (born September 8, 1941) is an American politician who has been the junior United States Senator from Vermont since 2007. Sanders is the longest serving independent in U.S. congressional history. Since his election to the House of Representatives in 1990, he has caucused with the Democratic Party, which has entitled him to congressional committee assignments and at times given Democrats a majority - [https://en.wikipedia.org/wiki/Bernie_Sanders wikipedia]"},{"slug":"biological-inspiration","title":"Biological Inspiration","date":1523524403543,"synopsis":"We ask, through what thought processes have we guided federated wiki's mechanisms and has that guidance proven sound?"},{"slug":"book-from-the-ground","title":"Book from the Ground","date":1427364170256,"synopsis":"Book from the Ground is an artwork and book published by MIT Press, which uses visual symbols collected over seven years, to tell a story in a visual language ([[Pictograph]] anyone can understand - [http://mitpress.mit.edu/books/book-ground mitpress.mit.edu]"},{"slug":"changes-to-this-site","title":"Changes to this Site","date":1434532209841,"synopsis":"Below we list recent changes to this site only without also listing changes from the [[Neighbourhood]]:"},{"slug":"choice-framework","title":"Choice Framework","date":1502809030283,"synopsis":"This work by Dorothea Kleine has some useful potential meeting points where \"on the ground\" initiatives could connect with academia. We might take one or more of the diagrams in this video as starting points for exploring areas of overlap (first one is 7 minutes in). To people outside of academic ICT4D some of the development terminology may sound patronising, but it is challenging some of \"Development\" mindsets of the time, and and it is pointing to the creativity of people who are limited by their circumstances, but are making the most of what opportun"},{"slug":"chorus-of-voices","title":"Chorus of Voices","date":1419791919094,"synopsis":"Four distinct concerns surface when designing federated wiki based information communities. We identify each and suggest forces that must be resolved before creative collaboration will take place."},{"slug":"complexity","title":"Complexity","date":1533497267801,"synopsis":"Complexity characterises the behaviour of a system or model whose components interact in multiple ways and follow local rules, meaning there is no reasonable higher instruction to define the various possible interactions. - [https://en.wikipedia.org/wiki/Complexity wikipedia]"},{"slug":"constructing-explanations","title":"Constructing Explanations","date":1501835949173,"synopsis":"We seek explanation for what a system does and why. [[Microservices]] complicate this aspiration when mixed technologies have been assembled over years by evolving teams for changing business purpose."},{"slug":"conversational-space","title":"Conversational Space","date":1501842373351,"synopsis":"Here we describe the architecture of conversation, in a system or design perspective, not as a singular temporal event but as a network process that occurs across time and space."},{"slug":"daniel-kahneman","title":"Daniel Kahneman","date":1507290160320,"synopsis":"Daniel Kahneman is an Israeli-American psychologist notable for his work on the psychology of judgment and decision-making, as well as behavioral economics, for which he was awarded the 2002 Nobel Memorial Prize in Economic Sciences (shared with Vernon L. Smith). His empirical findings challenge the assumption of human rationality prevailing in modern economic theory - [https://en.wikipedia.org/wiki/Daniel_Kahneman wikipedia]"},{"slug":"digital-speakers-corner","title":"Digital Speakers Corner","date":1500111623899,"synopsis":"Below are a collection of links imported from [[OneTab]]. You can view these links here - [https://www.one-tab.com/page/wjAPiU0MTV-dBE4UgdPuYA one-tab.com]:"},{"slug":"dont-metaphor-me-in","title":"Don't Metaphor Me In","date":1466755177808,"synopsis":"[[Andy van Dam]]'s Hypertext '87 keynote ended with a discussion of [[Andy's Nine Issues]] deserving of further thought."},{"slug":"e-o-wilson","title":"E. O. Wilson","date":1512665007769,"synopsis":"Known to many as the founding father of socio-biology, E O Wilson is a big hitter in the world of evolutionary theory. But, recently he's criticised what's popularly known as The Selfish Gene theory of evolution that he once worked so hard to promote (and that now underpins the mainstream view on evolution)."},{"slug":"ecology","title":"Ecology","date":1533497281257,"synopsis":"Ecology is the branch of biology which studies the interactions among organisms and their environment. Objects of study include interactions of organisms with each other and with abiotic components of their environment. Topics of interest include the biodiversity, distribution, biomass, and populations of organisms, as well as cooperation and competition within and between species."},{"slug":"eric-berlow","title":"Eric Berlow","date":1533496790095,"synopsis":"Eric L. Berlow is an American ecologist and entrepreneur who co-founded Vibrant Data Inc. which was acquired by Rakuten Inc. His academic research is in the fields of [[ecology]] and [[complexity]] and food webs. - [https://en.wikipedia.org/wiki/Eric_Berlow wikipedia]"},{"slug":"escaping-addressing","title":"Escaping Addressing","date":1450805689996,"synopsis":"Address busses works well and are at the heart of both processor and memory design on a variety of scales. Address busses make computers a logical machine for when they are properly clocked we can reason knowing all elements have been considered. But this pattern is rare or nonexistent in nature. Let's understand why."},{"slug":"faculty-transformation","title":"Faculty Transformation","date":1499254988882,"synopsis":"Like many early adopters, my history with OER materials began out of desperation upon realizing that many of my students could not afford the textbook(s) I had assigned."},{"slug":"fedwiki-tools","title":"Fedwiki Tools","date":1523477599939,"synopsis":"Here we list a few tools that are of particular use in managing and creating [[Fedwiki]] content. For a full list of transporters navigate to the site below:"},{"slug":"forest-inside-your-head","title":"Forest Inside Your Head","date":1464544905605,"synopsis":"In the proliferation of thought and reason that we experience in [[writing with strangers]], we can lose the forest."},{"slug":"free-music-archive","title":"Free Music Archive","date":1456597751831,"synopsis":"The Free Music Archive (FMA) is a precious gem for readers who thrill to"},{"slug":"game-activity","title":"Game Activity","date":1519566631462,"synopsis":"View all activity from [[Game Sites]] listed in the roster below:"},{"slug":"game-sites","title":"Game Sites","date":1519575390801,"synopsis":"Here we list current sites related to [[Thought Garden]]. See [[Thought Garden Activity]] for a chronological view of all contributions."},{"slug":"garden-metaphor","title":"Garden Metaphor","date":1511863158354,"synopsis":"The concept of the [[permanent wiki]] differs from a traditionally organised [[archive]] in that we seek to structure it with a [[garden metaphor]]."},{"slug":"garden-of-your-mind","title":"Garden of Your Mind","date":1523524283230,"synopsis":"A song and a child-like presentation of [[Thought Garden]] based on [[Mister Rogers Neighborhood]], and remixed by [[melodysheep]]. Plenty of [[Garden Metaphor]]s for you delectation."},{"slug":"garden-patterns-inventory","title":"Garden Patterns Inventory","date":1465160229837,"synopsis":"We duplicate an illustration from Timeless Way of Building using Graph plugins and our graph building workflow."},{"slug":"gardens-meet","title":"Garden's Meet","date":1511863275362,"synopsis":"How would one prepare for a conference workshop if one were asked to provide a position statement in the form of a federated wiki site? How can we develop a style for this form of engagement?"},{"slug":"gardens-stream","title":"Garden's Stream","date":1450798852591,"synopsis":"Wiki favors tending its own rather than publishing breaking new from others. But can this chasm be crossed? We ask, what sort of stream of news might flow from a well tended garden?"},{"slug":"geographic-conversations","title":"Geographic Conversations","date":1501842335675,"synopsis":"We are collecting interviews and thought pieces from around the world using mobile phones, and archiving these sound samples together with their [[GPS]] locations."},{"slug":"harkness-table","title":"Harkness table","date":1507309494922,"synopsis":"The Harkness table, Harkness method, or Harkness discussion is a teaching and learning method involving students seated in a large, oval configuration to discuss ideas in an encouraging, open-minded environment with only occasional or minimal teacher intervention. The method is in use at many American boarding schools and colleges and encourages classes to be held in a discursive manner. The style is related to the Socratic method. Developed at Phillips Exeter Academy, the method's name comes from the oil magnate and philanthropist Edward Harkness, a gra"},{"slug":"inquiry-workflow","title":"Inquiry Workflow","date":1449883057455,"synopsis":"We suggest a workflow that might allow participants in this [[Experimental Interview]] to assert some direction upon the writing of others."},{"slug":"interview-pod-charter","title":"Interview Pod Charter","date":1450020536803,"synopsis":"We describe how we will collectively author a single chapter based on what we are calling an [[Experimental Interview]]."},{"slug":"knowledge-curation","title":"Knowledge Curation","date":1512904170535,"synopsis":"Somenotes on [[Argument Map]]s."},{"slug":"knowledge-done-right","title":"Knowledge Done Right","date":1493476017875,"synopsis":"This is a suggestion for the tagline for [[Thought Garden]]. The aim is to emphasise action and detoxify epistemology. A related concept is [[Action Research]] in sociology."},{"slug":"legal-constitution","title":"Legal Constitution","date":1498912659686,"synopsis":"We aim to create a flexible legal constitution for [[Thought Garden]] which enables us to accomplish a number of goals."},{"slug":"librarian","title":"Librarian","date":1502634865596,"synopsis":"What is the future, or alternative meaning of this term. What is the role of a librarian?"},{"slug":"life-at-scale","title":"Life at Scale","date":1501835215353,"synopsis":"Things, especially living things, but also information driven things, recur within scaling laws driven by how things work. Things become interesting at the limits, the biggest of things, the smallest of things, where the law fades."},{"slug":"meme","title":"Meme","date":1470128771828,"synopsis":"A meme is \"an idea, behaviour, or style that spreads from person to person within a culture\". A meme acts as a unit for carrying cultural ideas, symbols, or practices that can be transmitted from one mind to another through writing, speech, gestures, rituals, or other imitable phenomena with a mimicked theme - [https://en.wikipedia.org/wiki/Meme wikipedia]"},{"slug":"memebase","title":"MemeBase","date":1511703109075,"synopsis":"Federated wiki is essentially a [[Repository of Memes]]. [[Wiki page]]s float through [[the federation]], spreading from author to author - [[preserving attribution]]."},{"slug":"memex","title":"Memex","date":1498910887254,"synopsis":"The reciprocity of teaching and learning spaces is significant here. Compare this design to traditional classrooms where only the Teacher has the Big Desk, a design that is re-created in online learning using a [[Content Management System]]."},{"slug":"moore-moments","title":"Moore Moments","date":1450623141966,"synopsis":"<div align=center><img src=\"http://d15mj6e6qmt1na.cloudfront.net/i/18020529\" width=428></div>"},{"slug":"multi-stakeholder-coops","title":"Multi-Stakeholder Coops","date":1493219487686,"synopsis":"Most co--operative practice is single stakeholder. Therefore the co-op sector divides between typically consumer co-ops, worker co-ops and farmer co-ops, each generally with their backs to each other and walking away from each other. This one dimensional aspect is impeding in my view an untapped revolutionary economic potential for a new generation of full dimensional co-ops to ignite."},{"slug":"newspeak-library","title":"Newspeak Library","date":1502634691358,"synopsis":"This is a project of [[Newspeak House]] to curate a library of [[Newsgroup]]s - that is online social groups."},{"slug":"one-garden-one-planet","title":"One Garden One Planet","date":1501718842784,"synopsis":"'One Garden One Planet' is an experimental method to explore how the science of [[Conservation Biology]] is diffused. It takes the study of practical [[Conservation]] and examines its [[Knowledge Management]] challenges."},{"slug":"ontology-v-stigmergy","title":"Ontology v. Stigmergy","date":1500383124929,"synopsis":"By day I struggle to bring order to increasing complex and disorganized information while on nights and weekends I let [[Collaborative Link]]s do this work for me."},{"slug":"open-think-tank","title":"Open Think Tank","date":1507112754787,"synopsis":"There has been a proliferation of [[Think Tank]]s in recent years, with nearly 7,000 world wide. An [[Open Think Tank]] is a project to create a think tank that uses a structured but open collaboration model."},{"slug":"origin-and-evolution-of-life","title":"Origin and evolution of life","date":1511863173727,"synopsis":"In both sides of the debate regarding [[Teleology]] or the role of purpose in science (and even courts in their decisions) [[Karl Popper]]'s criterion of falsifiability (see [[Daubert standard]] have frequently been invoked. Here we begin to write and research about these ideas."},{"slug":"pattern-language","title":"Pattern language","date":1507111706296,"synopsis":"A pattern language is a method of describing good design practices or patterns of useful organization within a field of expertise. The term was coined by architect [[Christopher Alexander]] and popularized by his 1977 book A Pattern Language - [https://en.wikipedia.org/wiki/Pattern_language wikipedia]"},{"slug":"permanent-web","title":"Permanent Web","date":1466863114677,"synopsis":"What is the permanent web? Why is it important? Here we have an initial discussion of the permanent web, and how we can start creating it with a mixture of existing technologies."},{"slug":"plantoid","title":"Plantoid","date":1495234565599,"synopsis":"Below is the original proposal sent to Primavera (and dated) - [https://docs.google.com/document/d/1puG_Pzv7DsP5woNjfrdmGNuCjSxhDLHDRHQavuJcMH4/edit#heading=h.e0d9jhgec6bo docs.google.com]"},{"slug":"politics-of-nature","title":"Politics of Nature","date":1425155310369,"synopsis":"Politics of Nature: How to Bring the Sciences Into Democracy - is an influential book by the French theorist and philosopher of science [[Bruno Latour]] - [https://en.wikipedia.org/wiki/Politics_of_Nature Wikipedia]."},{"slug":"radio-thoughts","title":"Radio Thoughts","date":1512691551526,"synopsis":"Stuff about radio:"},{"slug":"research-group-activity","title":"Research Group Activity","date":1519566485096,"synopsis":"Here we list views of the activity of groups and individual related to the current project. You may want to keep an eye on:"},{"slug":"richard-dawkins","title":"Richard Dawkins","date":1512664959799,"synopsis":"Richard Dawkins (born 26 March 1941) is an English ethologist, evolutionary biologist and author. He is an emeritus fellow of New College, Oxford, and was the University of Oxford's Professor for Public Understanding of Science from 1995 until 2008 - [https://en.wikipedia.org/wiki/Richard_Dawkins wikipedia]"},{"slug":"rolf-gelhaar","title":"Rolf Gelhaar","date":1501861382965,"synopsis":"Rolf Gehlhaar, born in 1943 in Breslau (Silesia, Germany), emigrated with his family in 1953 to the USA, grew up in New Mexico and California, attended Yale University (class of ‘ 65) and the University of California, Berkeley."},{"slug":"socrates-cafe","title":"Socrates Cafe","date":1507310607723,"synopsis":"Socrates Café are gatherings around the world where people from different backgrounds get together and exchange thoughtfully developed philosophical perspectives, based on their unique experiences, while embracing the version of the [[Socratic Method]] developed by founder Christopher Phillips."},{"slug":"socratic-method","title":"Socratic method","date":1507309518196,"synopsis":"The Socratic method, also can be known as maieutics, method of elenchus, elenctic method, or Socratic debate, is a form of cooperative argumentative dialogue between individuals, based on asking and answering questions to stimulate critical thinking and to draw out ideas and underlying presumptions. It is a dialectical method, involving a discussion in which the defense of one point of view is questioned; one participant may lead another to contradict themselves in some way, thus weakening the defender's point. This method is named after the Classical Gr"},{"slug":"sound-garden","title":"Sound Garden","date":1501861359970,"synopsis":"The Sound Garden installation uses spatialised or 3D [[Immersive Sound]] to reflect the location of the speakers in geographical or conceptual space."},{"slug":"soundcloud-plugin","title":"SoundCloud Plugin","date":1438368621082,"synopsis":"The SoundCloud plugin enables an author to add a SoundCloud widget to their site."},{"slug":"soundscape","title":"Soundscape","date":1501861314968,"synopsis":"A soundscape is a sonic landscape. It is a way of picturing a space or an idea in sound."},{"slug":"soundspace","title":"Sound=Space","date":1501861375484,"synopsis":"SOUND=SPACE is an electronic musical instrument that is played - by one person or several at the same time - by moving around in an empty space."},{"slug":"structure-grows","title":"Structure Grows","date":1443641454415,"synopsis":"Doug Engelbart, the guy who developed one of the first working versions of hypertext had a great marginal comment on his copy of As We May Think's \"bow example\". It simply says \"structure grows\"."},{"slug":"tagteam","title":"TagTeam","date":1493477373938,"synopsis":"A page with 0 items."},{"slug":"techne-as-an-art-in-rhetoric","title":"Techne as an art in rhetoric","date":1498657369713,"synopsis":"Techne is often used as a term to further define the process of rhetoric as an art of persuasion.  In his writing Toward a Sophistic Definition of Rhetoric, rhetoric scholar Dr. [[John Poulakos]] explains how the [[Sophist]]s believed rhetoric to be an art that aimed for terpis, or aesthetic pleasure, while maintaining a medium of [[logos]]."},{"slug":"the-garden-and-the-stream","title":"The Garden and the Stream","date":1443628241987,"synopsis":"A decade and a half ago a set of innovators mapped Usenet and mailing list culture onto the hypertext environment of the web. Many good things resulted, but the cracks in this approach are beginning to show. We propose that an older and alternate approach to conversation, here named The Garden, is required to balance the useful energy of the endless stream of self-assertion we find ourselves in."},{"slug":"the-garden-of-forking-paths","title":"The Garden of Forking Paths","date":1424577080199,"synopsis":"\"The Garden of Forking Paths\" [http://wsblog.iash.unibe.ch/wp-content/uploads/Borges_The-Garden-of-Forking-Paths.pdf PDF] - Jorge Luis Borges (1941)"},{"slug":"the-humane-representation-of-thought","title":"The Humane Representation of Thought","date":1425763117671,"synopsis":"VIMEO 115154289"},{"slug":"the-hypertext-garden","title":"The Hypertext Garden","date":1498910480109,"synopsis":"The original vision of hypertext was textual and timeless. When [[Vannevar Bush]] and [[Ted Nelson]] imagined hypertext, they imagined a conversation between documents, data, and other media, not individual banter."},{"slug":"the-master-algorithm","title":"The Master Algorithm","date":1502288923634,"synopsis":"YOUTUBE B8J4uefCQMc"},{"slug":"the-memex","title":"The Memex","date":1498910880328,"synopsis":"Imagined by [[Vannevar Bush]] in [http://www.theatlantic.com/magazine/archive/1945/07/as-we-may-think/303881/ \"As We May Think,\"] in 1945, the memex is a desk-sized scholar workstation containing a microfilm library. Text and images are displayed on two screens, and can be annotated by hand. Most importantly, texts and images can be linked, so that bringing up a text on one screen brings up a linked text on the other. These links can be organized into trails, and the trails shared with others."},{"slug":"the-re-emerging-garden","title":"The Re-emerging Garden","date":1443628432488,"synopsis":"Popular sites:"},{"slug":"think-tank","title":"Think Tank","date":1493215815529,"synopsis":"A think tank, policy institute, or research institute is an organization that performs research and advocacy concerning topics such as social policy, political strategy, economics, military, technology, and culture."},{"slug":"thought-garden","title":"Thought Garden","date":1498931970259,"synopsis":"Thought Garden is an [[Open Think Tank]], where we look to have new forms of conversation."},{"slug":"thought-garden-activity","title":"Thought Garden Activity","date":1501864022703,"synopsis":"View all activity from [[Thought Garden Sites]] listed in the roster below:"},{"slug":"thought-garden-events","title":"Thought Garden Events","date":1502797740662,"synopsis":"Here we look to fix down and describe a series of events for September 2017 through to September 2018."},{"slug":"thought-garden-installation","title":"Thought Garden Installation","date":1501844491689,"synopsis":"The [[Thought Garden]] installation is a [[conversational space]] that layers and places sound spatially in order to represent the architecture of the topic presented."},{"slug":"thought-garden-project-activity","title":"Thought Garden Project Activity","date":1509880476589,"synopsis":"View all activity from the [[Thought Garden Projects]] roster below:"},{"slug":"thought-garden-projects","title":"Thought Garden Projects","date":1509880366279,"synopsis":"[[Thought Garden]] projects are a bit like film or documentary projects in that they are long term projects, which do not necessarily have a production or release date."},{"slug":"thought-garden-sites","title":"Thought Garden Sites","date":1523704023440,"synopsis":"Here we list current sites related to [[Thought Garden]]. See [[Thought Garden Activity]] for a chronological view of all contributions."},{"slug":"thought-soup","title":"Thought Soup","date":1523183125158,"synopsis":"We reflect on this happening using the metaphorical model of soup as in primordial soup or even stone soup."},{"slug":"walking-charrette","title":"Walking Charrette","date":1469024012791,"synopsis":"The proposal is that we organise a series of events, supported by a from of writing and research that uses wiki, but is based on the physical act of walking and discussing ideas of relevance the the physical location of the walk."},{"slug":"wards-recent-activity","title":"Ward's Recent Activity","date":1499418923458,"synopsis":"The question here is how would I go about creating a page of Wards recent activity across all his sites?"},{"slug":"welcome-visitors","title":"Welcome Visitors","date":1519566659447,"synopsis":"Here we gather notes and research regarding [[Thought Garden]] and [[Thought Garden Projects]]."},{"slug":"world-caf","title":"World Café","date":1507311395672,"synopsis":"Small groups of four or five participants sit around a table and discuss an open-ended question for a structured amount of time."},{"slug":"world-of-the-commons","title":"World of the Commons","date":1498933394389,"synopsis":"The [[Commons]] is not a singular thing. There are many diverse forms of commons. Here we collect them together so that they can learn from and inform each other."},{"slug":"world-radio-day","title":"World Radio Day","date":1502718285798,"synopsis":"World Radio Day is an observance day held annually on 13 February. World Radio Day is about celebrating radio, why we love it and why we need it today more than ever."},{"slug":"world-radio-day-2017","title":"World Radio Day 2017","date":1501675629109,"synopsis":"[http://www.diamundialradio.org World Radio Day 2017] was held on 13 February 2017 around the theme of \"'''Radio is You\"''', with the goal of celebrating how audiences interact with Radio. The theme was designed to encourage radio stations to be the best they can, by having audience engagement policies, ethical committees, public editors, self review programmes and by ensuring their community radio networks were strong. A record number of countries, took part in World Radio Day 2017 with more than 500 events worldwide."},{"slug":"world-radio-day-2018","title":"World Radio Day 2018","date":1502803008919,"synopsis":"During the week of [[World Radio Day]] we aim to create an annual fringe event, featuring the future and history of radio, and sounds from stations from all over the world."},{"slug":"writing-with-strangers","title":"Writing with Strangers","date":1429804097374,"synopsis":"Writing in the presence of rampant forking calls into question [[What it Means to Write]] and how to do it well."}]