[{"slug":"a-beautiful-death","title":"A Beautiful Death","date":1471504424301,"synopsis":"Here we look at the last moments of life and ask ourselves how we would like to leave."},{"slug":"alexithymia","title":"Alexithymia","date":1515855122547,"synopsis":"Alexithymia  is a personality construct characterized by the subclinical inability to identify and describe emotions in the self."},{"slug":"badges-go-viral--emotions","title":"Badges go viral:  emotions","date":1438534557417,"synopsis":"Very rough notes and poor audio quality on an idea fir a game based on emotional competency."},{"slug":"blame","title":"Blame","date":1468162543610,"synopsis":"We've all felt it, that irresistible urge to point the finger. But why do we need blame and how is new technology complicating accountability? - [http://www.radiolab.org/story/317421-blame/?utm_source=sharedUrl&utm_medium=metatag&utm_campaign=sharedUrl radiolab.org]"},{"slug":"cathexis","title":"Cathexis","date":1507115482197,"synopsis":"In psychoanalysis, cathexis is defined as the process of investment of mental or emotional energy in a person, object, or idea - [https://en.wikipedia.org/wiki/Cathexis wikipedia]"},{"slug":"changes-to-this-site","title":"Changes to this Site","date":1434532209841,"synopsis":"Below we list recent changes to this site only without also listing changes from the [[Neighbourhood]]:"},{"slug":"chorus-of-voices","title":"Chorus of Voices","date":1497873755629,"synopsis":"Four distinct concerns surface when designing federated wiki based information communities. We identify each and suggest forces that must be resolved before creative collaboration will take place."},{"slug":"currently-working-on","title":"Currently Working On","date":1507108415194,"synopsis":"Here is a list of [[Recent Changes]] I consider important. View our experiments on the [[Scratch]] page. To clear stuff saved in your browser try [[Local Changes]]."},{"slug":"dead-reckoning","title":"Dead Reckoning","date":1509834621310,"synopsis":"From a duel with the world's deadliest disease to a surprising peek into the way doctors think about [[Death]], in this hour Radiolab tries to reckon with the grim reaper - [http://www.radiolab.org/story/dead-reckoning/?utm_source=sharedUrl&utm_medium=metatag&utm_campaign=sharedUrl radiolab.org]"},{"slug":"death","title":"Death","date":1471627274436,"synopsis":"Death is the termination of all biological functions that sustain an organism - [https://en.wikipedia.org/wiki/Death wikipedia]"},{"slug":"emotional","title":"Emotional","date":1498173766467,"synopsis":"Below are a collection of links imported from [[OneTab]]. You can view these links here - [https://www.one-tab.com/page/XUC6eaL9TWOihSdYK11Exg one-tab.com]:"},{"slug":"emotional-dictionary","title":"Emotional Dictionary","date":1496588005479,"synopsis":"The Emotional Dictionary was a project I started with artist [[Dilek Winchester]] some time around 2001, to create a visual and multimedia dictionary of emotions."},{"slug":"evil","title":"Evil","date":1507123969069,"synopsis":"Peck discusses [[evil]] in his book ''People of the Lie: The Hope for Healing Human Evil'', and also in a chapter of ''The Road Less Traveled'' - [https://en.wikipedia.org/wiki/M._Scott_Peck#Evil wikipedia]"},{"slug":"fathers","title":"Fathers","date":1497787649730,"synopsis":"He we collect links about fathers, and paternalism."},{"slug":"fedwiki-tools","title":"Fedwiki Tools","date":1507026694222,"synopsis":"Here we list a few tools that are of particular use in managing and creating [[Fedwiki]] content. Check [[Recycled pages]] to find delted pages."},{"slug":"guilt-emotion","title":"Guilt (emotion)","date":1467803387876,"synopsis":"Guilt is a cognitive or an emotional experience that occurs when a person believes or realizes—accurately or not—that he or she has compromised his or her own standards of conduct or has violated a moral standard and bears significant responsibility for that violation. It is closely related to the concept of remorse - [https://en.wikipedia.org/wiki/Guilt_(emotion) wikipedia]"},{"slug":"harmony","title":"Harmony","date":1471674469457,"synopsis":"In music, harmony is the use of simultaneous pitches (tones, notes), or chords - [https://en.wikipedia.org/wiki/Harmony wikipedia]"},{"slug":"hearing-voices","title":"Hearing Voices","date":1471675480165,"synopsis":"Here we collect stories and experiences of people we have know that hear voices:"},{"slug":"inner-voices","title":"Inner Voices","date":1471675192600,"synopsis":"How the voices in our heads shape us, for better and for worse - [http://www.radiolab.org/story/301401-inner-voices/?utm_source=sharedUrl&utm_medium=metatag&utm_campaign=sharedUrl radiolab.org]"},{"slug":"loneliness","title":"Loneliness","date":1470928155340,"synopsis":"Loneliness is a complex and usually unpleasant emotional response to isolation or lack of companionship. Loneliness typically includes anxious feelings about a lack of connection or communication with other beings, both in the present and extending into the future. As such, loneliness can be felt even when surrounded by other people. The causes of loneliness are varied and include social, mental, emotional or even physical factors - [https://en.wikipedia.org/wiki/Loneliness wikipedia]"},{"slug":"neurodiversity","title":"Neurodiversity","date":1507631798176,"synopsis":"Neurodiversity is an approach to learning and disability that argues diverse neurological conditions are result of normal variations in the human genome."},{"slug":"neurotypical","title":"Neurotypical","date":1507631481671,"synopsis":"Neurotypical or NT, an abbreviation of neurologically typical, is a neologism widely used in the autistic community as a label for people who are not on the autism spectrum. However, the term eventually became narrowed to refer to those with strictly typical neurology; that is, people without a defined neurological disorder - [https://en.wikipedia.org/wiki/Neurotypical wikipedia]"},{"slug":"paranoia","title":"Paranoia","date":1466581037108,"synopsis":"Paranoia is a thought process believed to be heavily influenced by anxiety or fear, often to the point of delusion and irrationality."},{"slug":"pattern","title":"Pattern","date":1507108646838,"synopsis":"A pattern is a stable arrangement of something over time. In this context we are looking to describe our inner emotional world, and external social context in terms of regularly repeating patterns of thoughts, feelings and behaviours."},{"slug":"prejudice","title":"Prejudice","date":1497779185530,"synopsis":"Here we begin to collect podcasts, stories and science about prejudice."},{"slug":"secure-scuttlebutt","title":"Secure Scuttlebutt","date":1509847757545,"synopsis":"Scuttlebutt is a decent(ralised) secure gossip platform. Historically, sea-slang for gossip - a scuttlebutt is basically a watercooler on a ship."},{"slug":"swedish-suicide-myth","title":"Swedish Suicide Myth","date":1420243522403,"synopsis":"There is a myth that Sweden has a particularly high suicide rate. Sweden actually has a rate comparable to other Western countries, and high rates in the 1960s were likely the result of shoddy reporting. [http://nymag.com/scienceofus/2014/05/sweden-to-world-were-not-suicidal.html html]"},{"slug":"the-door-test","title":"The Door Test","date":1467099233250,"synopsis":"A mafia boss gives advice to a young man about women. A recipe for sexism and cliche which strangely doesn't live up to expectations."},{"slug":"the-emotions-of-normal-people","title":"The Emotions of Normal People","date":1425711074462,"synopsis":"In 1928, William Moulton Marston published The Emotions of Normal People, based on his theory of human personality divided into four quadrants: dominance, inducement, submission and compliance."},{"slug":"the-king-of-tears","title":"The King Of Tears","date":1500997615907,"synopsis":"Why country music makes you cry, and rock and roll doesn’t: A musical interpretation of divided America."},{"slug":"welcome-visitors","title":"Welcome Visitors","date":1507636848033,"synopsis":"Here we collect, gather and research emotions. The [[Emotional dictionary]] is a part of the [[Anthropological Archive]] project."}]