[{"slug":"agile-governance-structure","title":"Agile Governance Structure","date":1522671127335,"synopsis":"With governance, as with other aspects, we should apply the same bootstrapping philosophy we use with building currency and software in general. Explicitly that means working on software implementation, interface design, and (soft) process in small agile increments."},{"slug":"autonomy-and-independence","title":"Autonomy and independence","date":1522255160427,"synopsis":"The fourth of the Rochdale Principles states that co-operative societies must be autonomous and independent. According to the ICA's Statement on the Co-operative Identity, “Co-operatives are autonomous, self-help organizations controlled by their members. If they enter into agreements with other organizations, including governments, or raise capital from external sources, they do so on terms that ensure democratic control by their members and maintain their co-operative autonomy.”"},{"slug":"bootstrapcoop","title":"Bootstrap.coop","date":1522236110183,"synopsis":"Here we look at the business plan for bootstrapping cooperative exchanges. Our aim here is to define more clearly our project aims in writing and to put this forwards to the [[Unfound Coop]] incubator support - [http://unfound.coop/ unfound.coop]"},{"slug":"business-plan","title":"Business Plan","date":1522255963494,"synopsis":"The starting place is the [[Business Plan]], which I've started making notes on here - [[Bootstrap.coop]]. It's just a working title - [[Coop Platform]] may be a better one, or simple [[Platform Earth]]."},{"slug":"concern-for-community","title":"Concern for community","date":1522255207955,"synopsis":"The seventh of the Rochdale Principles states that co-operative societies must have concern for their communities. According to the ICA's Statement on the Co-operative Identity, “Co-operatives work for the sustainable development of their communities through policies approved by their members.”"},{"slug":"cooperation-among-cooperatives","title":"Cooperation among cooperatives","date":1522255196406,"synopsis":"The sixth of the Rochdale Principles states that co-operatives cooperate with each other. According to the ICA's Statement on the Co-operative Identity, “Co-operatives serve their members most effectively and strengthen the co-operative movement by working together through local, national, regional and international structures.”"},{"slug":"cooperative","title":"Cooperative","date":1522253494638,"synopsis":"A cooperative (also known as co-operative, co-op, or coop) is \"an autonomous association of persons united voluntarily to meet their common economic, social, and cultural needs and aspirations through a jointly-owned and democratically-controlled enterprise\" - [https://en.wikipedia.org/wiki/Cooperative wikipedia]"},{"slug":"cooperative-banking","title":"Cooperative Banking","date":1522253756021,"synopsis":"Banking and finance is a particularly fertile ground for cooperative legal structures - often organised as a [[cooperative federation]] (ie second-tier coop)."},{"slug":"cooperative-federated-hosting","title":"Cooperative Federated Hosting","date":1522255820508,"synopsis":"A page with 0 items."},{"slug":"cooperative-federation","title":"Cooperative federation","date":1522253680090,"synopsis":"A co-operative federation or secondary co-operative is a co-operative in which all members are, in turn, co-operatives. Historically, co-operative federations have predominantly come in the form of co-operative wholesale societies and co-operative unions."},{"slug":"current-ica-version-of-co-operative-principles","title":"Current ICA version of co-operative principles","date":1522255207952,"synopsis":"The Rochdale Principles, according to the 1995 ICA revision, can be summarised as follows."},{"slug":"democratic-member-control","title":"Democratic member control","date":1522255040206,"synopsis":"The second of the Rochdale Principles states that co-operative societies must have democratic member control. According to the ICA's Statement on the Co-operative Identity, “Co-operatives are democratic organizations controlled by their members, who actively participate in setting their policies and making decisions. Men and women serving as elected representatives are accountable to the membership. In primary co-operatives members have equal voting rights (one member, one vote) and co-operatives at other levels are also organised in a democratic manner."},{"slug":"econommy","title":"Econommy","date":1522755561605,"synopsis":"This video and the original footage are made available to you by Remix the Commons to document and illustrate the ideas and practices surrounding the commons - [http://remixthecommons.org remixthecommons.org]"},{"slug":"education-training-and-information","title":"Education, training, and information","date":1522255174222,"synopsis":"The fifth of the Rochdale Principles states that co-operative societies must provide education and training to their members and the public. According to the ICA's Statement on the Co-operative Identity, “Co-operatives provide education and training for their members, elected representatives, managers and employees so they can contribute effectively to the development of their co-operatives. They inform the general public – particularly young people and opinion leaders – about the nature and benefits of co-operation.”"},{"slug":"fourth-estate-association","title":"Fourth Estate (association)","date":1522253188628,"synopsis":"The Fourth Estate Public Benefit Corporation is a United States based international, non-partisan, membership organization whose stated mission is to \"contribute to a healthy society by fostering, supporting and incubating a sustainable and vibrant free press.\" - [https://en.wikipedia.org/wiki/Fourth_Estate_(association) wikipedia]"},{"slug":"inter-coop-governance","title":"Inter-coop Governance","date":1522252584779,"synopsis":"Here we look at structures, and in particular legals governance structures and [[fintech]] tools that facilitate exchanges between coops."},{"slug":"key-challenges-we-face","title":"Key challenges we face","date":1522574990450,"synopsis":"[[Platform Earth]] faces the following problems and issues:"},{"slug":"member-economic-participation","title":"Member economic participation","date":1522255144122,"synopsis":"Member economic participation is one of the defining features of co-operative societies, and constitutes the third Rochdale Principle in the ICA's Statement on the Co-operative Identity."},{"slug":"membership-and-social-value","title":"Membership and social value","date":1522575381245,"synopsis":"In order to design [[Platform Earth]] we need the participation of as wide a group of stakeholders as possible. Our target audience for services and products are cooperatives, and social organisations that are aligned with our purpose. These groups are widely geographically dispersed and vary widely in terms of technical capability, and cultural context."},{"slug":"new-generation-cooperative","title":"New generation cooperative","date":1522253364562,"synopsis":"[[New generation cooperative]]s (NGCs) are an adaptation of traditional cooperative structures to modern, capital intensive industries.  They are sometimes described as a hybrid between traditional co-ops and limited liability companies or public benefit corporations."},{"slug":"non-monetary-cooperative","title":"Non-monetary cooperative","date":1522253096749,"synopsis":"A [[non-monetary cooperative]] provides a service based on entirely voluntary labour in the maintenance and provision of a particular service or good, working in the identical manner of a library. These co-ops are locally owned and operated and provides the free rental of equipments of all kinds (bicycles, sports, gear). This idea has been said to reduce general human consumption of goods, a key subject in sustainable development."},{"slug":"our-governance","title":"Our Governance","date":1522670498582,"synopsis":"The Culture Collective is currently constituted as a voluntary association, and we use OneClickOrgs for democratic member based governance."},{"slug":"our-service-or-product","title":"Our Service or product","date":1522256701238,"synopsis":"Platform Earth is building a number of core services and products. These include but are not limited to:"},{"slug":"project-cybersyn","title":"Project Cybersyn","date":1522559943245,"synopsis":"Project Cybersyn was a Chilean project from 1971–1973 during the presidency of Salvador Allende aimed at constructing a distributed decision support system to aid in the management of the national economy. The project consisted of four modules: an economic simulator, custom software to check factory performance, an operations room, and a national network of telex machines that were linked to one mainframe computer - [https://en.wikipedia.org/wiki/Project_Cybersyn wikipedia]"},{"slug":"purpose-of-the-business","title":"Purpose of the business","date":1522236960198,"synopsis":"The purpose of the business is to create technical, social and governance tools that enable cooperative businesses to exchange value and engage in coproductions which are currently difficult to achieve, complex to negotiate, and lack clear legal frameworks and incentive structures that would enable such cooperations to scale and produce useful products and services."},{"slug":"rochdale-principles","title":"Rochdale Principles","date":1522254312111,"synopsis":"The Rochdale Principles are a set of ideals for the operation of cooperatives. They were first set out in 1844 by the Rochdale Society of Equitable Pioneers in Rochdale, England and have formed the basis for the principles on which co-operatives around the world continue to operate. The implications of the Rochdale Principles are a focus of study in co-operative economics."},{"slug":"social-cooperative","title":"Social cooperative","date":1522253165179,"synopsis":"Social cooperatives exist to provide social services such as the care of children, elderly and disabled people, and the integration of unemployed people into the workforce. The phenomenon is most developed in Italy, but exists in various forms in many countries. In countries such as Sweden and Britain they exist without any special legislation, while elements of the Italian model have been legislated for in Belgium (société à finalité sociale / venootschap met sociaal oogmerk) and Poland - [https://en.wikipedia.org/wiki/Social_cooperative wikipedia]"},{"slug":"stafford-beer","title":"Stafford Beer","date":1522559972524,"synopsis":"Stafford Beer (born Anthony Stafford Beer, 25 September 1926 – 23 August 2002) was a British theorist, consultant and professor at the Manchester Business School. He is best known for his work in the fields of operational research and management cybernetics - [https://en.wikipedia.org/wiki/Stafford_Beer wikipedia]"},{"slug":"technology-behind-the-platform","title":"Technology behind the platform","date":1522237522886,"synopsis":"The services we have been building are based around a number of technical choices designed to facilitate large scale cooperation between independent cooperatives that seek to manage, host and maintain their own technical services, user interfaces, and social structures."},{"slug":"viable-system-model","title":"Viable system model","date":1522517982688,"synopsis":"The viable system model (VSM) is a model of the organisational structure of any autonomous system capable of producing itself -  [https://en.wikipedia.org/wiki/Viable_system_model wikipedia]"},{"slug":"voluntary-and-open-membership","title":"Voluntary and open membership","date":1522255013423,"synopsis":"The first of the Rochdale Principles states that co-operative societies must have an open and voluntary ([[wikt:voluntary]]) membership. According to the ICA's Statement on the Co-operative Identity, \"Co-operatives are voluntary organisations, open to all persons able to use their services and willing to accept the responsibilities of membership, without gender, social, racial, political or religious discrimination.\""},{"slug":"welcome-visitors","title":"Welcome Visitors","date":1523603253029,"synopsis":"Here we explore cooperatives, their needs, and in particular the type of structures and tools the cooperative movement could benefit from at the [[Inter-coop Governance]] level. The is also the starting place for our [[Business Plan]]."}]