[{"slug":"48-hours-neuklln","title":"48 Hours Neukölln","date":1489871222568,"synopsis":"[[48 Hours]] Neukölln is a map-based (whats the nice word for this?) festival that has been taking place in [[Neukölln]] in [[Berlin]] for the last 18 years. This form of art festival is growing in popularity, and we can look to the format as an inspiration for [[FEAST]] - [http://48-stunden-neukoelln.de/en/page/mission-statement 48-stunden-neukoelln.de]"},{"slug":"access-to-nature","title":"Access to Nature","date":1503248996256,"synopsis":"Understanding our relationship to nature (in the city) is a long and detailed social history of the development of cities and of local government."},{"slug":"african-food","title":"African food","date":1504471884210,"synopsis":"Here we look at takeaway options for ordering African food in [[Finsbury Park]] area:"},{"slug":"alexander-mackenzie","title":"Alexander Mackenzie","date":1503251657167,"synopsis":"Alexander McKenzie was landscape designer to the Metropolitan Board of Works. He designed several public parks, including Alexandra Palace. He became the first superintendent of Alexandra Palace Park, and was also bailiff of Epping Forest and Burnham Beeches."},{"slug":"alternative-splash-markup","title":"Alternative Splash Markup","date":1497826787724,"synopsis":"Here we store some examples of alternative markup for a [[Splash]] page."},{"slug":"andrews-activity","title":"Andrew's Activity","date":1504463682384,"synopsis":"Here we list [[Andrew Orford]]'s writing:"},{"slug":"anthropological-radio","title":"Anthropological Radio","date":1493561358157,"synopsis":"Here we make some early notes about a technique or practice that we could use to research a podcast for the radio involving multiple remote locations."},{"slug":"anthropological-radio-methodology","title":"Anthropological Radio Methodology","date":1490224060240,"synopsis":"A shorter title is always preferred:  [[Anthropological Radio]]"},{"slug":"anthropological-soundscape","title":"Anthropological Soundscape","date":1499878559329,"synopsis":"In order to create a compelling atmosphere to engage groups in conversation around a theme, the thought is to create a soundscape that places the conversation in context. Here we look at a few pragmatic ideas about how to make this possible:"},{"slug":"antonio-machado","title":"Antonio Machado","date":1489757829792,"synopsis":"Antonio Machado, in full Antonio Cipriano José María y Francisco de Santa Ana Machado y Ruiz (26 July 1875 – 22 February 1939), was a Spanish poet and one of the leading figures of the Spanish literary movement known as the Generation of '98 - [https://en.wikipedia.org/wiki/Antonio_Machado wikipedia]"},{"slug":"aral-balkan","title":"Aral Balkan","date":1491388985853,"synopsis":"Aral Balkan is an activist, designer, and software developer - [https://ar.al/ ar.al]"},{"slug":"archivist-manifesto","title":"Archivist Manifesto","date":1490211992687,"synopsis":"There appears to be no publicly available text for thsi manifesto?"},{"slug":"art","title":"Art","date":1497825581444,"synopsis":"Art as local culture. Situated in a place. We act, create, perform, face-to-face."},{"slug":"astoria-finsbury-park","title":"Astoria Finsbury Park","date":1503315333038,"synopsis":"When it opened in 1930, the Astoria Cinema was one of the largest in the world. Standing at the junction of Isledon Road and Seven Sisters Road on an island site, it was the fourth of the famous London suburban Astoria Theatres ([[London Astoria]]) built by film exhibitor Arthur Segal. It was opened on 29 September 1930: there were three other Astorias, [[Streatham]], [[Old Kent Road]] and [[Brixton]]. It was in use as a cinema until September 1971 when it was permanently given over to live music – although rock concerts had been a feature throughout the"},{"slug":"audio-messaging","title":"Audio Messaging","date":1491129486618,"synopsis":"Audio messaging is a relatively new technique as far as mass consumer adoption is concerned."},{"slug":"baaba-maal","title":"Baaba Maal","date":1491943790279,"synopsis":"Baaba Maal (born 12 November 1953) is a Senegalese singer and guitarist born in Podor, on the Senegal River. He is well known in Africa and internationally is one of Senegal's most famous musicians. In addition to acoustic guitar, he also plays percussion. He has released several albums, both for independent and major labels. In July 2003, he was made a UNDP Youth Emissary - [https://en.wikipedia.org/wiki/Baaba_Maal wikipedia]"},{"slug":"barcelona-feast","title":"Barcelona FEAST","date":1491927370669,"synopsis":"One possibility here is to visit [[Bilbao]] for 14-18th May Ramics Community Currency Conference. Then go back via a week in [[Bilbao]], to [[Pigny]]"},{"slug":"bermondsy-artists-group","title":"Bermondsy Artists Group","date":1503252555552,"synopsis":"Established in 1983 the Bermondsey Artists’ Group (BAG) is an artist-led initiative that supports [[CGP London]] and creates opportunities for artists who live, work or study in Southwark -"},{"slug":"bernard-stiegler","title":"Bernard Stiegler","date":1490211753829,"synopsis":"Bernard Stiegler (French: [stiɡlɛʁ]; born 1 April 1952) is a French philosopher. He is head of the Institut de recherche et d'innovation (IRI), which he founded in 2006 at the Centre Georges-Pompidou. He is also the founder in 2005 of the political and cultural group, Ars Industrialis, and the founder in 2010 of the philosophy school, pharmakon.fr, held at Épineuil-le-Fleuriel. His best known work is Technics and Time, 1: The Fault of Epimetheus - [https://en.wikipedia.org/wiki/Bernard_Stiegler wikipedia]"},{"slug":"bilbao","title":"Bilbao","date":1490205608969,"synopsis":"Bilbao (/bɪlˈbaʊˌ -ˈbɑːoʊ/; Spanish: [bilˈβao]; Basque: Bilbo [bilβo]) is a city in northern Spain, the largest city in the province of Biscay and in the Basque Country as a whole. Bilbao is the tenth largest city in Spain, with a population of 345,141 As of 2015. The Bilbao metropolitan area has roughly 1 million inhabitants, making it one of the most populous metropolitan areas in northern Spain; with a population of 875,552 the comarca of Greater Bilbao is the fifth-largest urban area in Spain. Bilbao is also the main urban area in what is defined as "},{"slug":"bilbaos-flow--a-year-ago-","title":"Bilbao's flow : a year ago ?","date":1490205545108,"synopsis":"#korus #howtogetlostin [[Bilbao]]"},{"slug":"birkenhead-park","title":"Birkenhead Park","date":1503240007068,"synopsis":"Birkenhead Park is a public park in the centre of Birkenhead, in the Metropolitan Borough of Wirral, in Merseyside, England. It was designed by Joseph Paxton and opened on 5 April 1847. It is generally acknowledged as the first publicly funded civic park in the world. Paxton had earlier designed Princes Park, Liverpool, a private development - [https://en.wikipedia.org/wiki/Birkenhead_Park wikipedia]"},{"slug":"birmingham-lunar-society","title":"Birmingham Lunar Society","date":1489920787158,"synopsis":"In the latter part of the 20th Century the University of [[Birmingham Lunar Society]] met every Thursday to debate and discuss all manner of topics in the Guild bar. In 2011, steps were undertaken to reform the discussion society as an alternative to the more regulated debate options available at the university. This was agreed by the University's Guild of Students in autumn 2012."},{"slug":"blighty-cafe","title":"Blighty Cafe","date":1501535339535,"synopsis":"On Saturday 16 September Blighty's chefs create a special day menu in cooperation with [[Crop Drop]] to make sure all the ingredients in the pot are local!"},{"slug":"bohemia","title":"Bohemia","date":1489876529902,"synopsis":"Bohemia (Czech: Čechy; German:  Böhmen ; Polish: Czechy; French: Bohême; Latin: Bohemia; Italian: Boemia) is the westernmost and largest historical region of the Czech lands in the present-day Czech Republic. In a broader meaning, Bohemia sometimes refers to the entire Czech territory, including Moravia and Czech Silesia, especially in a historical context, such as the Lands of the Bohemian Crown ruled by Bohemian kings - [https://en.wikipedia.org/wiki/Bohemia wikipedia]"},{"slug":"bohemianism","title":"Bohemianism","date":1489875289709,"synopsis":"Bohemianism is the practice of an unconventional lifestyle, often in the company of like-minded people, with few permanent ties, involving musical, artistic, literary or spiritual pursuits. In this context, Bohemians may be wanderers, adventurers, or vagabonds - [https://en.wikipedia.org/wiki/Bohemianism wikipedia]"},{"slug":"bowbridge-house","title":"Bowbridge House","date":1490087589421,"synopsis":"Not much info on this - other than it was a venue for the [[Lunar Society of Birmingham]]."},{"slug":"broad-street-pump","title":"Broad Street pump","date":1489839993943,"synopsis":"A significant event in the history of [[epidemiology]] and [[public health]] was Dr. John Snow ([[John Snow (physician)]])'s study of an 1854 outbreak ([[Broad Street cholera outbreak]]) of [[cholera]] in Soho."},{"slug":"camelot","title":"Camelot","date":1489762468142,"synopsis":"[[Camelot Property Management]] Ltd. (Dutch: Camelot Beheer BV) is a vacant property management firm started in the Netherlands in 1993. Camelot manages commercial and residential property on behalf of landlords and property developers, assigning people to occupy vacant buildings to deter squatters - [https://en.wikipedia.org/wiki/Camelot_Property_Management wikipedia]"},{"slug":"camelot-property-management","title":"Camelot Property Management","date":1489762404598,"synopsis":"Camelot Property Management Ltd. (Dutch: Camelot Beheer BV) is a vacant property management firm started in the Netherlands in 1993. Camelot manages commercial and residential property on behalf of landlords and property developers, assigning people to occupy vacant buildings to deter squatters - [https://en.wikipedia.org/wiki/Camelot_Property_Management wikipedia]"},{"slug":"casa-museo-jos-carlos-maritegui","title":"Casa Museo José Carlos Mariátegui","date":1489761898870,"synopsis":"The Casa Museo José Carlos Mariátegui housed Mariátegui during the last five and most productive years of his life (1925-1930)."},{"slug":"cgp-london","title":"CGP London","date":1503252645154,"synopsis":"CGP London is an artist led gallery of contemporary art based across two venues in [[Southwark Park]]; The Gallery and Dilston Grove."},{"slug":"change-my-flag","title":"Change My Flag","date":1493213127825,"synopsis":"The [[About Flagmatic Plugin]] offers an assortment of flags that can replace that of the logged-in site."},{"slug":"changes-to-this-site","title":"Changes to this Site","date":1434532209841,"synopsis":"Below we list recent changes to this site only without also listing changes from the [[Neighbourhood]]:"},{"slug":"chaos-radio","title":"Chaos Radio","date":1457616227986,"synopsis":"Just came across this site which relates to the [[CCC]] and as an emaple here is a [[Podcast]] about [[Wikipedia]] (in German):"},{"slug":"chatbot","title":"Chatbot","date":1501939442947,"synopsis":"A chatbot (also known as a talkbot, chatterbot, Bot, chatterbox, IM bot, interactive agent, or Artificial Conversational Entity) is a computer program which conducts a conversation via auditory or textual methods."},{"slug":"chief-gbade-adejumo","title":"Chief Gbade Adejumo","date":1491944723643,"synopsis":"[[Chief Gbade Adejumo]] has researched pastoralist-farmer issues."},{"slug":"coalition-of-the-willing","title":"Coalition of the Willing","date":1490365343688,"synopsis":"[[Coalition of the Willing]] is a collaborative animated film and web-based event about an online war against global warming in a 'post Copenhagen' world."},{"slug":"community-festival","title":"Community Festival","date":1490202146052,"synopsis":"A core goal of FEAST is to create new and better community festivals - to network them and make it cheaper and easier to finance them and involve local communities in productive ways."},{"slug":"community-interest-company","title":"Community Interest Company","date":1489869181919,"synopsis":"A Community Interest Company (CIC) is a type of company introduced by the UK Government in 2005 under the Companies (Audit, Investigations and Community Enterprise) Act 2004, designed for social enterprises that want to use their profits and assets for the public good."},{"slug":"community-land-trust","title":"Community land trust","date":1490960265928,"synopsis":"A community land trust is a nonprofit corporation that develops and stewards affordable housing, community gardens, civic buildings, commercial spaces and other community assets on behalf of a community. “CLTs” balance the needs of individuals to access land and maintain security of tenure with a community’s need to maintain affordability, economic diversity and local access to essential services - [https://en.wikipedia.org/wiki/Community_land_trust wikipedia]"},{"slug":"conflict-resolution","title":"Conflict Resolution","date":1492418622143,"synopsis":"This is the working title of a proposed radio programme (or programmes) to be broadcast by SOAS radio and produced by Pamela McLean."},{"slug":"considered-feedback","title":"Considered Feedback","date":1491126723793,"synopsis":"Feedback in [[FEAST]] isn't the usual quick-response feedback of a phone-in programme. It's the result of conversation between people that is usually face to face, and takes place over time."},{"slug":"crop-drop","title":"Crop Drop","date":1503167839645,"synopsis":"We're a not-for-profit organisation that prioritises local food, direct trade with farmers and community-scale food chains. Crop Drop is run by Haringey residents and only deliver our service in Haringey. We keep costs down for customers, give farmers a fair price and plough our profits back into supporting sustainable agriculture and urban growing - [https://www.cropdrop.co.uk/our-producers cropdrop.co.uk]"},{"slug":"crowdfunding","title":"Crowdfunding","date":1466269030954,"synopsis":"Crowdfunding is the practice of funding a project or venture by raising monetary contributions from a large number of people. It is a form of alternative finance, which has emerged outside of the traditional financial system - [https://en.wikipedia.org/wiki/Crowdfunding wikipedia]"},{"slug":"crowdfunding-platforms","title":"Crowdfunding platforms","date":1466269498683,"synopsis":"As of 2012, there were over 450 crowdfunding platforms - [http://www.triplepundit.com/special/rise-of-the-sharing-economy/emerging-next-generation-crowdfunding-platform-roundup/# triplepundit.com]"},{"slug":"cultural-commons","title":"Cultural Commons","date":1457620612710,"synopsis":"Today, the commons are also understood within a [[cultural]] sphere. These commons include literature, music, arts, design, film, video, television, radio, information, software and sites of heritage. [[Wikipedia]] is an example of the production and maintenance of [[Common Good]]s by a contributor community in the form of encyclopedic knowledge that can be freely accessed by anyone without a central authority."},{"slug":"currently-working-on","title":"Currently Working On","date":1500399008586,"synopsis":"Here is a list of [[Recent Changes]] I consider important. View our experiments on the [[Scratch]] page. To clear stuff saved in your browser try [[Local Changes]]."},{"slug":"dancing-lessons-from-god","title":"Dancing Lessons From God","date":1494360476708,"synopsis":"“As Bokonon says: 'peculiar travel suggestions are dancing lessons from god.”"},{"slug":"daniel-goriounov","title":"Daniel Goriounov","date":1491934987156,"synopsis":"I am obsessed with the future of our Civilization."},{"slug":"danish-policeman-is-sorry","title":"Danish Policeman Is Sorry","date":1492418568804,"synopsis":"This is a story about [[Non Complementary Behavior]] and what happens when a policeman says sorry."},{"slug":"david-bovill","title":"David Bovill","date":1423596531201,"synopsis":"On this site I write about [[Livecode]], the projects I am working on and the courses I am teaching."},{"slug":"davids-sites","title":"David's Sites","date":1504533050839,"synopsis":"Here is a list of some of the sites I write on for [[FEAST]] and related projects:"},{"slug":"dead-sites","title":"Dead Sites","date":1491949037524,"synopsis":"A list of dead sites whose domain names have lapsed:"},{"slug":"deer-park-england","title":"Deer park (England)","date":1503237984995,"synopsis":"In medieval and Early Modern England, a deer park was an enclosed area containing deer. It was bounded by a ditch and bank with a wooden park pale on top of the bank, or by a stone or brick wall."},{"slug":"derby-arboretum","title":"Derby Arboretum","date":1503239061180,"synopsis":"Derby Arboretum is a public park and arboretum in the city of Derby, England, located about 1 mile (1.6 km) south of the city centre in the Rose Hill area - [https://en.wikipedia.org/wiki/Derby_Arboretum wikipedia]"},{"slug":"distributed-djs","title":"Distributed DJs","date":1418150083579,"synopsis":"We live in an age where music is more diverse than ever but the radio is at its most homogenous in decades. Why is this?"},{"slug":"doc-searls","title":"Doc Searls","date":1491307103579,"synopsis":"David \"Doc\" Searls (born July 29, 1947), is an American journalist, columnist, and a widely read blogger, co-author of The Cluetrain Manifesto and author of The Intention Economy: When Customers Take Charge, a fellow at the Center for Information Technology & Society (CITS) at the University of California, Santa Barbara, and an alumnus fellow (2006–2010) of the Berkman Center for Internet & Society at Harvard University - [https://en.wikipedia.org/wiki/Doc_Searls wikipedia]"},{"slug":"durational-conference","title":"Durational Conference","date":1490013689869,"synopsis":"A durational conference is a format for an intense 48 hour conference for a small group of people that are required to take an active part in the discussion."},{"slug":"early-history-of-soho","title":"Early History Of Soho","date":1489839672923,"synopsis":"In the [[Middle Ages]], what is now Soho was known as Saint Giles Field, a farmland belonging to the Convent of Abingdon and the master of Burton St Lazar ([[Burton Lazars]]) Hospital in [[Leicestershire]], who owned a leper ([[leprosy]]) hospital in [[St Giles in the Fields]]. In 1536, the land was taken by Henry VIII ([[Henry VIII of England]]) as a royal park for the [[Palace of Whitehall]].[http://www.british-history.ac.uk/survey-london/vols33-4/pp20-26 Estate and Parish History] - [https://en.wikipedia.org/wiki/Soho#Early_history wikipedia]"},{"slug":"eco-mindshift","title":"Eco-mindshift","date":1490963994245,"synopsis":"Natalie Jeremijenko blends art, engineering, environmentalism, biochemistry and more to create real-life experiments that enable social change."},{"slug":"education-folks","title":"Education Folks","date":1434212609155,"synopsis":"[[Education In Page Title]]"},{"slug":"emilia-tognacchini","title":"Emilia Tognacchini","date":1489756909397,"synopsis":"Emilia this is for you to write and correct. here are my notes by the way of introducing you to others. When you've fixed it - I'll fork it back here :)"},{"slug":"emotional-dictionary","title":"Emotional Dictionary","date":1490088104865,"synopsis":"The idea here is to curate a [[radio conference]] on emotions, or emotional health. Can we look at mental health from a positive perspective? Can we explore the diversity of reactions to emotional situations? Let's collect some ideas and research around this subject."},{"slug":"erasmus-darwin","title":"Erasmus Darwin","date":1490088013744,"synopsis":"Erasmus Darwin (12 December 1731 – 18 April 1802) was an English physician. One of the key thinkers of the Midlands Enlightenment, he was also a natural philosopher, physiologist, slave-trade abolitionist, inventor and poet - [https://en.wikipedia.org/wiki/Erasmus_Darwin wikipedia]"},{"slug":"erasmus-darwin-house","title":"Erasmus Darwin House","date":1490087985921,"synopsis":"Erasmus Darwin House in Lichfield, Staffordshire is the former home of the English poet and physician [[Erasmus Darwin]], grandfather of naturalist Charles Darwin. The house is a Grade I listed building, and is now a writer's house museum commemorating Erasmus Darwin's life - [https://en.wikipedia.org/wiki/Erasmus_Darwin_House wikipedia]"},{"slug":"ethical-design-manifesto","title":"Ethical Design Manifesto","date":1491389025730,"synopsis":"The Ethical Design manifesto was written by [[Aral Balkan]] and the Ind.ie team. I am proposing working with this as a guiding principle for the people facing published surface of the [[Anthropological Archive]] and [[Permanent Wiki]]."},{"slug":"european-food","title":"European Food","date":1504465651732,"synopsis":"Here we look at takeaway options for ordering European food in [[Finsbury Park]] area:"},{"slug":"exfed","title":"ExFed","date":1503405193417,"synopsis":"The ExFed warehouse space is a new venue with a capcity of up to 500 people."},{"slug":"exfed-inner-space","title":"ExFed Inner Space","date":1503405193416,"synopsis":"The inner dimensions of the ExFed performance space of new river Studios."},{"slug":"exponentially-human","title":"Exponentially Human","date":1489684382816,"synopsis":"Exponentially Human is a mixture of fact and fiction, which becomes more factual with every passing day."},{"slug":"face-to-face-conversation","title":"Face-to-face Conversation","date":1506689280617,"synopsis":"Face-to-face conversations are an essential and founding component of [[FEAST]]. We do not prioritise text. Writing is a supplement, an addition to the dialogue that enables us to weave together and relate conversations."},{"slug":"fear-of-early-exposure","title":"Fear of Early Exposure","date":1450359981088,"synopsis":"In many fields we are trained from a young age to share only when our thoughts are considered finished enough for public presentation. This starts in school, and continues in our professional lives."},{"slug":"feast","title":"FEAST","date":1498213544061,"synopsis":"FEAST is a celebration of local cultures that are unique yet connected. We come together around food, music, and conversation, which we celebrate locally while connecting globally to other communities through the medium of radio."},{"slug":"feast-activity","title":"FEAST Activity","date":1491944607960,"synopsis":"This form of writing and co-creation that we explore is new. It is an unusual and new way to collaborate, one which encourages us to share our early thoughts as we see them pass from hand to hand. This process we have called before [[Writing With Strangers]]."},{"slug":"feast-as-dialogue","title":"FEAST as Dialogue","date":1506689267921,"synopsis":"FEAST defines dialogue as a socratic process leading to an implicit change or action. Armchair philosophy is not our goal. It is not exciting, it is not sufficient, it is not enough. Here we agree with Marx."},{"slug":"feast-box","title":"FEAST Box","date":1491578684651,"synopsis":"The FEAST box is a low cost hardware device that combines an embedded device and audio software enabling anyone to conduct a [[FEAST]] and take part in radio shows and education courses."},{"slug":"feast-conversations","title":"FEAST Conversations","date":1490016003509,"synopsis":"FEAST Conversations are a set of walks, and conversations that take place over a weekend in Soho. These conversations can take place in a café, and open studio, or larger venue. They can also take place as organised walks, or as conversations that take place on the radio."},{"slug":"feast-films--images","title":"Feast Films & Images","date":1500827771060,"synopsis":"Here we research films and images that inspire or we can screen as part of [[FEAST]]."},{"slug":"feast-food","title":"FEAST Food","date":1503243451892,"synopsis":"There would be no FEAST without food. Here we explore and celebrate the many sides a vairieties of food."},{"slug":"feast-food-films","title":"Feast Food Films","date":1502299228380,"synopsis":"Short Films inspiration for the New River Studios screening on 16.9.2017"},{"slug":"feast-home-page","title":"FEAST Home Page","date":1501534181749,"synopsis":"Here we list the toplevel images for the FEAST home page."},{"slug":"feast-is-a-conference","title":"FEAST is a Conference","date":1507024784723,"synopsis":"[[FEAST]] creates a platform for a decentralised conference, in which groups can engage in in-depth discussion face-to-face, and then give feedback in the form of a live audio podcast."},{"slug":"feast-is-a-feast","title":"FEAST is a FEAST","date":1504469544049,"synopsis":"After all FEAST is at heart just a FEAST. So let's explore some formats."},{"slug":"feast-is-a-festival","title":"FEAST is a Festival","date":1489772120013,"synopsis":"FEAST is designed to be a popular and adaptable festival that is able to engage as wide and diverse a community as possible. We will be creating a unique platform for emerging artists, buskers and new bands, and will work with project partners wherever possible to find, and help to promote new upcoming talent."},{"slug":"feast-is-platform","title":"FEAST is Platform","date":1504355192270,"synopsis":"FEAST is also a platform for sustainably financed, self-organised community festivals. We create a template designed to make it as simple as possible for anyone to create a festival in their community. This template enables local artists, community organisations to work with and gain the support of local businesses, cafés, bars and venues to create a sustainable festival that benefits the whole community."},{"slug":"feast-music","title":"Feast Music","date":1502025408940,"synopsis":"<a href=\"https://www.flickr.com/photos/151173643@N06/36358560396/in/dateposted-public/\"target=\"_blank\"><img src=\"https://farm5.staticflickr.com/4425/36358560396_e3e84da625.jpg\" width=100%></a>"},{"slug":"feast-on-the-bridge","title":"Feast on the Bridge","date":1490974104676,"synopsis":"Southwark Bridge is transformed into a giant banqueting space, designed by Cathy Wren, with visitors invited to share a meal, to eat, drink, dance and make merry  - [http://totallythames.org/events/info/feast_on_the_bridge4 totallythames.org]"},{"slug":"feast-radio","title":"FEAST Radio","date":1501852617209,"synopsis":"[[FEAST.fm]] is an internet radio station which is designed to concentrate on music and talk shows to accompany the [[FEAST Festival]]."},{"slug":"feast-tools","title":"FEAST Tools","date":1498482897735,"synopsis":"Here we list a few useful tools. See [[Changes to this site]]."},{"slug":"feast-visual-installation","title":"Feast Visual installation","date":1502031358579,"synopsis":"Visual installation in ExFed Space in Manor House will be a site specific project presenting material made to take the viewer on the \"glocal\" journey of food."},{"slug":"feastfm","title":"FEAST.fm","date":1501677215409,"synopsis":"[[FEAST Radio]] is an internet radio station which is designed to concentrate on music and talk shows to accompany the [[FEAST Festival]]."},{"slug":"feastfm-radio-conferences","title":"FEASTfm Radio-Conferences","date":1491143341752,"synopsis":"FEASTfm Radio-Conferences"},{"slug":"fedwiki-tools","title":"Fedwiki Tools","date":1507026694222,"synopsis":"Here we list a few tools that are of particular use in managing and creating [[Fedwiki]] content. Check [[Recycled pages]] to find delted pages."},{"slug":"festival-of-mint","title":"Festival of Mint","date":1490201146460,"synopsis":"The MINT Festival is a celebration of local growing. One weekend a year they work with local cafés, restaurants, bars and growing spaces to serve fresh locally grown produce."},{"slug":"festivals-in-finsbury-park","title":"Festivals in Finsbury Park","date":1503175184063,"synopsis":"[[Finsbury Park]] has a long history of music festivals going back to [[Hendrix at the Astoria (1967)]] - [https://en.wikipedia.org/wiki/Finsbury_Park#Live_music_in_Finsbury_Park wikipedia]"},{"slug":"fetchh","title":"Fetchh","date":1501939250077,"synopsis":"Fetchh is a [[chatbot]] that makes it easy to order food, drink and other produce from local shops. It integrates into FaceBook Messenger, and is in an early stage of development."},{"slug":"finsbury-park","title":"Finsbury Park","date":1503251818522,"synopsis":"Finsbury Park is a public park in the ward of the London neighbourhood of Harringay. It is in the area formerly covered by the historic parish of Hornsey, succeeded by the Municipal Borough of Hornsey - [https://en.wikipedia.org/wiki/Finsbury_Park wikipedia]"},{"slug":"finsbury-park-act-of-1857","title":"Finsbury Park Act of 1857","date":1503159189927,"synopsis":"I had a search on the National Archives website for the Finsbury Park Act 1857 and there aren't any records. I wonder if it was replaced by subsequent law on public open spaces without being repealed (as often seems to happen in English law)."},{"slug":"finsbury-park-empire","title":"Finsbury Park Empire","date":1503178718129,"synopsis":"# See also"},{"slug":"finsbury-park-feast","title":"Finsbury Park FEAST","date":1503176903006,"synopsis":"Finsbury Park [[FEAST]] is the format for a series of local cultural events leading up to the 150th Anniversary of the [[Founding of Finsbury Park]]."},{"slug":"finsbury-park-venues","title":"Finsbury Park Venues","date":1503325739542,"synopsis":"There are a number of great historical and cultural venues in [[Finsbury Park]]."},{"slug":"founding-of-finsbury-park","title":"Founding of Finsbury Park","date":1503251686901,"synopsis":"An 'out-county' park for Finsbury residents was first proposed in 1850 because of severe overcrowding and the [[Finsbury Park Act of 1857]], the earliest act for a municipal park for London, set aside 250 acres (104ha) of land."},{"slug":"free-music-archive","title":"Free Music Archive","date":1456597751831,"synopsis":"The Free Music Archive (FMA) is a precious gem for readers who thrill to"},{"slug":"fula-people","title":"Fula people","date":1491944201740,"synopsis":"The Fula people or Fulani, numbering between 20 and 25 million people in total, are one of the largest and a widely dispersed Muslim ethnic group in Sahel and West Africa."},{"slug":"fulani","title":"Fulani","date":1491943446197,"synopsis":"The [[Fula people]] or Fulani, numbering between 20 and 25 million people in total, are one of the largest and a widely dispersed Muslim ethnic group in Sahel and West Africa."},{"slug":"fulani-herding","title":"Fulani Herding","date":1491944201741,"synopsis":"Fula are primarily known to be pastoralist ([[Pastoralism]])s, but are also traders in some areas. Most Fula in the countryside spend long times alone on foot,  and can be seen frequently parading with their cattle throughout the west African [[hinterland]], moving their herds in search of water and better pasture."},{"slug":"fulani-music","title":"Fulani music","date":1491943857267,"synopsis":"The Fula have a rich musical culture and play a variety of traditional instruments including drums, ''hoddu ([[xalam]])'' (a plucked skin-covered lute similar to a banjo), and ''riti'' or ''riiti'' (a one-string bowed instrument similar to a violin), in addition to vocal music. The well-known Senegalese Fula musician [[Baaba Maal]] sings in Pulaar on his recordings. ''Zaghareet'' or ululation is a popular form of vocal music formed by rapidly moving the tongue sideways and making a sharp, high sound - [https://en.wikipedia.org/wiki/Fula_people#Music wiki"},{"slug":"full-moon-happenings","title":"Full Moon Happenings","date":1440612865434,"synopsis":"A [[Happening]] is a [[Near-synchronous Event]], taking place at several places during the same time period, in which we code, write, and research together on a single focused topic."},{"slug":"garden-patterns-inventory","title":"Garden Patterns Inventory","date":1465160229837,"synopsis":"We duplicate an illustration from Timeless Way of Building using Graph plugins and our graph building workflow."},{"slug":"gardens-meet","title":"Garden's Meet","date":1451160472715,"synopsis":"How would one prepare for a conference workshop if one were asked to provide a position statement in the form of a federated wiki site? How can we develop a style for this form of engagement?"},{"slug":"gathered-round-the-table","title":"Gathered Round The Table","date":1489684673551,"synopsis":"Working with FedWiki — things heard on the 03/15/17"},{"slug":"gaumont-finsbury-park","title":"Gaumont Finsbury Park","date":1503178485398,"synopsis":"fasd"},{"slug":"gavins-activity","title":"Gavin's Activity","date":1502196556626,"synopsis":"Here we list Gavin's recent activity, and writing and research currently being focussed on."},{"slug":"gbade-adejumo","title":"Gbade Adejumo","date":1490704314065,"synopsis":"Pam can you write a short bio here - somethign that would go on a web page about the podcast?"},{"slug":"gbade-adejumo-research","title":"Gbade Adejumo Research","date":1490801605565,"synopsis":"The conflict between Farmers and Pastoralists has been existing for a long time and it is rooted in the control of resources. The two groups depend on land as a major resource of their occupations and since it is limited, it becomes a source of conflict between the two groups in many parts of Nigeria and West Africa. In this regard, there have been clashes between Pastoralists and Farmers in Ogun, Osun, Benue, Plateau, Kaduna, Taraba and many other States of Nigeria."},{"slug":"glassbunker","title":"GlassBunker","date":1490223887775,"synopsis":"A house, a feast — i think there still is the question of the scale of the events in september and if they should try to coincidate, but I propose my studio, the bunker, for a north-east Paris venue."},{"slug":"glassbunker-feast","title":"GlassBunker FEAST","date":1490223699493,"synopsis":"I think we can accommodate 20 to 25 people, with non-stop cooking, hacking, live music and circles of discussion — tuning in to the radio altogether. Since it is my place, I think i’ll be able to explain the rules of the game and framework of the whole day (from noon to midnight)."},{"slug":"grassroots-venues","title":"Grassroots Venues","date":1489868941083,"synopsis":"These we called earlier [[Real Space]] venues."},{"slug":"great-barr-hall","title":"Great Barr Hall","date":1489919633768,"synopsis":"Great Barr Hall is an 18th-century mansion situated at Pheasey, Walsall, on the border with Great Barr, Birmingham, West Midlands, England. It has associations with the [[Lunar Society]] and is a Grade II* listed building. It is, however, in a very poor state of repair and is on the Buildings at Risk Register - [https://en.wikipedia.org/wiki/Great_Barr_Hall wikipedia]"},{"slug":"grub-club","title":"Grub Club","date":1490962408525,"synopsis":"GrubClub is London's No.1 platform for PopUp Restaurants and Supperclubs. We connect foodies with great food and even greater chefs. If your looking for new and exciting dining experiences in the capital than you've come to the right place!"},{"slug":"hendrix-at-the-astoria-1967","title":"Hendrix at the Astoria (1967)","date":1503159685139,"synopsis":"In March, when the Jimi Hendrix Experience joined a crowded British tour — which included the Walker Brothers, Engelbert Humperdinck and Cat Stevens — Hendrix and Chandler cooked up an entirely new way to get attention from fans and the press. And it had to do with a new song the Experience were playing at their shows: “Fire.” - [http://ultimateclassicrock.com/jimi-hendrix-guitar-fire/?trackback=tsmclip ultimateclassicrock.com]"},{"slug":"historic-lunar-society","title":"Historic Lunar Society","date":1489924052399,"synopsis":"At first called the Lunar Circle, \"Lunar Society\" became the formal name by 1775. The name arose because the society would meet during the full moon, as the extra light made the journey home easier and safer in the absence of street lighting."},{"slug":"history-of-finsbury-park","title":"History of Finsbury Park","date":1503236789154,"synopsis":"Here we look at the various aspects of the history of [[Finsbury Park]], leading up to celebrating it's 150th year anniversary in 2019."},{"slug":"history-of-public-parks","title":"History of Public Parks","date":1503250966118,"synopsis":"Here we look at researching and gathering information about public parks, that is parks that were brought into existence by local councils."},{"slug":"history-of-radio","title":"History Of Radio","date":1497787409472,"synopsis":"In 1864 [[James Clerk Maxwell]] showed mathematically that electromagnetic waves could propagate through free space."},{"slug":"history-of-soho","title":"History Of Soho","date":1489846758845,"synopsis":"- [https://en.wikipedia.org/wiki/History_Of_Soho wikipedia]"},{"slug":"history-of-the-project","title":"History Of The Project","date":1489738585108,"synopsis":"Some notes on the history of [[FEAST]]."},{"slug":"html5-audio","title":"HTML5 Audio","date":1501837399552,"synopsis":"HTML5 Audio is a subject of the HTML5 specification, investigating audio input, playback, synthesis, as well as speech to text in the browser - [https://en.wikipedia.org/wiki/HTML5_Audio wikipedia]"},{"slug":"i-know-you","title":"I Know You","date":1493475913294,"synopsis":"A chapter in which we make the argument that only deep knowledge based on real [[Factual]] (anthropological) knowledge recorded and transcribed on an anthropological archive (the [[permanent wiki]]), can truly be a basis for knowledge."},{"slug":"ikov-television-tower","title":"Žižkov Television Tower","date":1501532160841,"synopsis":"The [[Žižkov Television Tower]] (Czech: Žižkovský vysílač) is a unique transmitter tower built in Prague between 1985 and 1992."},{"slug":"impermanent-web","title":"Impermanent Web","date":1448029266122,"synopsis":"The impermanent web is the existing world wide web of HTML pages and broken links - where sites come and go, and links to image, videoa and other web pages are forever being broken."},{"slug":"incentives-of-war","title":"Incentives Of War","date":1491732825889,"synopsis":"A page with 1 items."},{"slug":"instituto-favela-da-paz","title":"Instituto Favela da Paz","date":1490955195346,"synopsis":"Ana suggests a connection with this project in Sao Paulo. You can find them on [https://www.facebook.com/pg/INSTITUTOPSS/videos/?ref=page_internal facebook] where their phone number is listed."},{"slug":"international-day-of-un-peacekeepers","title":"International Day of UN Peacekeepers","date":1492459065310,"synopsis":"I am delighted to let you know that registration is now open for this year's conference to mark the International Day of UN Peacekeepers. The conference will take place at Royal United Services Institute (RUSI), Whitehall, London, SW1A 2ET on the 24 May between 0930 and 1615."},{"slug":"internet-enabled-local-radio","title":"Internet Enabled Local Radio","date":1490202131270,"synopsis":"Internet radio stations are increasingly common. There are over 40,000 listed in [[Radio Garden]]. There are many more analogue radio stations around the world yet to have an internet presence."},{"slug":"interplanetary-file-system","title":"InterPlanetary File System","date":1490213790868,"synopsis":"InterPlanetary File System ([[IPFS]]) is a content-addressable, peer-to-peer hypermedia distribution protocol. Nodes in the IPFS network form a distributed file system. IPFS is an open source project developed by Protocol Labs with help from the open source community. It was initially designed by Juan Benet - [https://en.wikipedia.org/wiki/Interplanetary_file_system wikipedia]"},{"slug":"jeremy-corbyn","title":"Jeremy Corbyn","date":1489772182476,"synopsis":"Some notes about getting him involved."},{"slug":"john-dada","title":"John Dada","date":1490481140331,"synopsis":"This page will have information about John Dada harvested from various sources."},{"slug":"jos-carlos-maritegui","title":"José Carlos Mariátegui","date":1489761960115,"synopsis":"I've been meaning for a while to have a discussion about private property with José-Carlos - either as an interview, or ideally by organising a talk in conjuction with [[Casa afds} in Lima."},{"slug":"journal-cleaner-transport","title":"Journal Cleaner Transport","date":1489837562999,"synopsis":"This [[transport]] takes a [[Fedwiki Lineup]] url, and looks at the [[wiki-page]] that is furthest right in the lineup - returning a [[ghost page]] containing a version of the same page but with a stripped down [[journal]]."},{"slug":"kickstarter-party","title":"Kickstarter Party","date":1490527382184,"synopsis":"The idea here is to more clearly formulate the convergence between a fundraising event, dinner, or party and a Kickstarter. How far can we get in merging these things into a single whole?"},{"slug":"kinolab-prague","title":"KinoLab Prague","date":1501535284070,"synopsis":"<a href=\"https://www.flickr.com/photos/151173643@N06/35814055930/in/dateposted/\"target=\"_blank\"><img src=\"https://farm5.staticflickr.com/4294/35814055930_29208d9b55.jpg\" width=100%></a>"},{"slug":"knowledge-done-right","title":"Knowledge Done Right","date":1493476017875,"synopsis":"This is a suggestion for the tagline for [[Thought Garden]]. The aim is to emphasise action and detoxify epistemology. A related concept is [[Action Research]] in sociology."},{"slug":"latitudinal-cuisine","title":"Latitudinal Cuisine","date":1490963700951,"synopsis":"Latitudinal Cuisine is a BYOB/BYOF geo-specific supper club that has been running weekly since April 2009."},{"slug":"legacy-and-immortality","title":"Legacy and Immortality","date":1490213613535,"synopsis":"The aim here is to work on a project that create a sustainable archive of cultural and personal conversations and oral histories."},{"slug":"legal-constitution","title":"Legal Constitution","date":1493219151864,"synopsis":"We aim to create a flexible legal constitution for [[Thought Garden]] which enables us to accomplish a number of goals."},{"slug":"lets","title":"LETS","date":1492362228756,"synopsis":"A [[local exchange trading system]] (also local employment and trading system or local energy transfer system; abbreviated LETS) is a locally initiated, democratically organised, not-for-profit community enterprise that provides a community information service and records transactions of members exchanging goods and services by using locally created currency."},{"slug":"lets-scheme","title":"LETS Scheme","date":1492362308296,"synopsis":"LETS Stands for Local Exchange and Trading Scheme."},{"slug":"letsfromafeaturephone","title":"LETSFromAFeaturePhone","date":1492362506569,"synopsis":"If you have a system that does all these things, then you have a [[LETS Scheme]]."},{"slug":"live-audio-podcast","title":"Live Audio Podcast","date":1491126476410,"synopsis":"A Live audio podcasts is a radio show in which we include live conversation or audio feedback from a [[Live Panel Discussion]] or a [[Live Phone In]]."},{"slug":"live-feedback","title":"Live Feedback","date":1491129928482,"synopsis":"Live Feedback involves recording live audio in the radio programme, either via panel guests brought into the studio, live phone ins via the internet or telephone, or through on location mobile radio stations streaming the broadcast live."},{"slug":"live-music","title":"Live Music","date":1489870453820,"synopsis":"A page with 0 items."},{"slug":"local-exchange-trading-system","title":"Local Exchange Trading System","date":1492362451110,"synopsis":"A local exchange trading system (also local employment and trading system or local energy transfer system; abbreviated [[LETS]]) is a locally initiated, democratically organised, not-for-profit community enterprise that provides a community information service and records transactions of members exchanging goods and services by using locally created currency."},{"slug":"long-term-constitutional-goals","title":"Long Term Constitutional Goals","date":1493217701356,"synopsis":"A page with 0 items."},{"slug":"lunar-society","title":"Lunar Society","date":1489924071505,"synopsis":"The Lunar Society of Birmingham was a dinner club and informal learned society of prominent figures in the Midlands Enlightenment, including industrialists, natural philosophers and intellectuals, who met regularly between 1765 and 1813 in Birmingham, England."},{"slug":"lunar-society-of-birmingham","title":"Lunar Society of Birmingham","date":1489919476465,"synopsis":"The Lunar Society of Birmingham was a dinner club and informal learned society of prominent figures in the Midlands Enlightenment, including industrialists, natural philosophers and intellectuals, who met regularly between 1765 and 1813 in Birmingham, England."},{"slug":"mcdonalds-broke-my-heart","title":"McDonald’s Broke My Heart","date":1502370578003,"synopsis":"They made the world’s greatest French Fry. Then they threw it away."},{"slug":"means-of-communication","title":"Means of Communication","date":1490223861706,"synopsis":"A means of communication could be a manifold thing. We can practice establishing a personal wiki to knowing how to do an easy Coptic knot to bind a small notebook from discarded paper."},{"slug":"mediastream-processing-api","title":"MediaStream Processing API","date":1501839475559,"synopsis":"In order to explore fully the potential of [[FEAST]] we should look at implementing software using the MediaStream Processing API."},{"slug":"minciu-sodas","title":"Minciu Sodas","date":1493216007538,"synopsis":"[[Minciu Sodas]] is Lithuanian for [[Orchard of Thoughts]]. Thoughts were gathered in a wiki - [http://www.ms.lt/ ms.lt]"},{"slug":"modern-lunar-societies","title":"Modern Lunar Societies","date":1489924496149,"synopsis":"In Australia, [[The Lunaticks Society of Newcastle]] was formed by leading digital entrepreneurs, software developers, educators, film producers, creatives, investors to encourage creative thinking and new ideas in a digital age."},{"slug":"movie-theatres-in-finsbury-park","title":"Movie Theatres in Finsbury Park","date":1503178939988,"synopsis":"- [[Astoria Finsbury Park]]"},{"slug":"multi-stakeholder-coops","title":"Multi-Stakeholder Coops","date":1493219487686,"synopsis":"Most co--operative practice is single stakeholder. Therefore the co-op sector divides between typically consumer co-ops, worker co-ops and farmer co-ops, each generally with their backs to each other and walking away from each other. This one dimensional aspect is impeding in my view an untapped revolutionary economic potential for a new generation of full dimensional co-ops to ignite."},{"slug":"neuklln","title":"Neukölln","date":1489838572308,"synopsis":"Neukölln is the eighth borough of Berlin, located in the southeastern part of the city and was part of the former American sector under the Four-Power occupation of the city. It features many Gründerzeit buildings and is characterized by having one of the highest percentage of immigrants in Berlin - [https://en.wikipedia.org/wiki/Neuk%C3%B6lln wikipedia]"},{"slug":"new-river-caf","title":"New River Café","date":1503405242275,"synopsis":"The New River Café is a cosy bar, café and performance space, and home to [[199 Radio]]."},{"slug":"new-river-party","title":"New River Party","date":1501436016772,"synopsis":"So here I describe how I see this single space at [[New River Studios]] being used to host a number of events over the [[FEAST Opening Weekend]]."},{"slug":"new-river-studios","title":"New River Studios","date":1503403470816,"synopsis":"New River Studios is a new venue situated by the New River Canal, and part of the warehouse community in the area."},{"slug":"newspeak-house","title":"Newspeak House","date":1504444368979,"synopsis":"Newspeak House at 133 Bethnal Green Rd is a club which hosts public and private events for researching the intersection of Politics, Media and Government."},{"slug":"nigerian-food","title":"Nigerian Food","date":1504469915650,"synopsis":"I'm not aware of any Nigerian restaurants in Finsbury Park."},{"slug":"north-african-food","title":"North African Food","date":1504465648201,"synopsis":"Here we look at takeaway options for ordering North African food in [[Finsbury Park]] area:"},{"slug":"nowness-food-shorts","title":"Nowness food shorts","date":1502299177515,"synopsis":"Below are a collection of links imported from [[OneTab]]. You can view these links here - [https://www.one-tab.com/page/SxAG9NPsRV-LIDHmK0RCGA one-tab.com]:"},{"slug":"of-coffeehouses-and-salons","title":"Of coffeehouses and salons","date":1425176841212,"synopsis":"This wee think piece (ward, note, page, scribble - note to self need a term that stands for all possible names in a FedWiki) was prompted by Mike's thoughts on the Fri/Sat hangout. It struck me and I tried to capture a bit of it in [[reflections on a friday saturday hangout]] but thought it needed a bit more elaboration."},{"slug":"one-big-wiki","title":"One Big Wiki","date":1503088742737,"synopsis":"Once wiki pages have been published to the [[permanent wiki]], pages are now immutable, and effectively reside in one huge global namespace."},{"slug":"onetab","title":"OneTab","date":1498133001583,"synopsis":"OneTab converts all of your tabs into a list. When you need to access the tabs again, you can either restore them individually or all at once - [https://www.one-tab.com/ one-tab.com]"},{"slug":"onetab-transport","title":"OneTab Transport","date":1498133146113,"synopsis":"[[OneTab]] converts all of your tabs into a list. When you need to access the tabs again, you can either restore them individually or all at once."},{"slug":"open-think-tank","title":"Open Think Tank","date":1493216462724,"synopsis":"There has been a proliferation of [[Think Tank]]s in recent years, with nearly 7,000 world wide. An [[Open Think Tank]] is a project to create a think tank that uses a structured but open collaboration model."},{"slug":"openstreetmap","title":"OpenStreetMap","date":1490085482213,"synopsis":"OpenStreetMap (OSM) is a collaborative project to create a free editable map of the world - [http://www.openstreetmap.org openstreetmap.org]"},{"slug":"outlandish-activity","title":"Outlandish Activity","date":1498775011304,"synopsis":"View all activity of the [[Outlandish Researchers]]  listed in the roster below, writing across education initiatives in the [[Outlandish Academy]]:"},{"slug":"outlandish-researchers","title":"Outlandish Researchers","date":1504529991906,"synopsis":"Here we list current researchers for the [[Outlandish Academy]]. Based on the content being developed we will recruit [[Learners]] and provide them with their own writing and collaboration space."},{"slug":"pages-as-public-spaces","title":"Pages as Public Spaces","date":1475589338018,"synopsis":"What I'm trying to do here is to create a rhetorical situation what will help writers get themselves organized and help them create content that can be better built on than we've seen before. The idea of Pages as Public Spaces may or may not work."},{"slug":"pamelas-activity","title":"Pamela's Activity","date":1498757687704,"synopsis":"Here are all the changes across all my sites. If I want to add a new site drag a [[About Reference Plugin]] link to my page called [[Pamela Mclean]]."},{"slug":"parasitic-conference","title":"Parasitic Conference","date":1470926700767,"synopsis":"A parasitic conference is a conference that takes place, feeds off, and is dependent on an existing conference. It is in a sense a popup conference that can take place at informal venues, or be structured as part of an existing conference in which participants discuss the topics and themes taking place in the host conference."},{"slug":"paris-feast","title":"Paris FEAST","date":1490223322568,"synopsis":"We start creating a [[FEAST]] in Paris. Following our [[Guiding Principles]] we start small, and grow the conversation at the pace it wants to grow at. We are not ready to, and may never choose to adopt the techniques of mass marketing. We prefer at this stage to use [[Word of Mouth]]."},{"slug":"park","title":"Park","date":1503237945786,"synopsis":"A park is an area of natural, semi-natural or planted space set aside for human enjoyment and recreation or for the protection of wildlife or natural habitats - [https://en.wikipedia.org/wiki/Park wikipedia]"},{"slug":"party","title":"Party","date":1489881186773,"synopsis":"A party is a gathering of people who have been invited by a host for the purposes of socializing, conversation, recreation, or as part of a festival or other commemoration of a special occasion. A party will typically feature food and beverages, and often music and dancing or other forms of entertainment. In many Western countries, parties for teens and adults are associated with drinking alcohol such as beer, wine or distilled spirits - [https://en.wikipedia.org/wiki/Party wikipedia]"},{"slug":"pastoralism","title":"Pastoralism","date":1491943681723,"synopsis":"Pastoralism is the branch of agriculture concerned with the raising of livestock. It is animal husbandry: the care, tending and use of animals such as camels, goats, cattle, yaks, llamas, and sheep. \"Pastoralism\" generally has a mobile aspect; moving the herds in search of fresh pasture and water (in contrast to pastoral farming, in which non-nomadic farmers grow crops and improve pastures for their livestock) - [https://en.wikipedia.org/wiki/Pastoralism wikipedia]"},{"slug":"pastoralist-encounters","title":"Pastoralist Encounters","date":1497787087263,"synopsis":"On this page we look to structure a radio programme and podcast on [[Pastoralist Encounters]] together with the following people:"},{"slug":"pastoralists-also-need-peace","title":"Pastoralists Also Need Peace","date":1490268151327,"synopsis":"Pastoralists Also Need Peace"},{"slug":"peel-park-salford","title":"Peel Park, Salford","date":1503239659120,"synopsis":"Peel Park is a public urban park in Salford, Greater Manchester, England, located on the flood plain of the River Irwell below Salford Crescent and adjacent to the University of Salford - [https://en.wikipedia.org/wiki/Peel_Park,_Salford wikipedia]"},{"slug":"performative-populism","title":"Performative Populism","date":1435936602159,"synopsis":"\"Performative Populism\", a phrase coined by Albert Burneko, describes the sort of populism one sees on Good Morning America, talk radio, and Twitter when some hallowed national or regional tradition is mucked with. Can people say \"Season's Greetings\" instead of Merry Christmas? Are weddings weddings if they toss birdseed instead of rice? Can real Americans put peas in guacamole? Can one eat pizza with a knife and fork? [http://foodspin.deadspin.com/put-peas-in-your-guacamole-if-you-want-to-1715449139 post]"},{"slug":"permanent-wiki","title":"Permanent Wiki","date":1490213370405,"synopsis":"The [[Permanent Wiki]] is a project that I have been working towards for several years now."},{"slug":"pigny","title":"Pigny","date":1490212296042,"synopsis":"Pigny is a commune in the Cher department in the Centre region of France - [https://en.wikipedia.org/wiki/Pigny wikipedia]"},{"slug":"pirate-tv","title":"Pirate TV","date":1501435772081,"synopsis":"Here we look at how we might create a studio space that uses old school analogue TV sets and a low energy VHF transmitter to create a pirate TV station at [[New River Studios]]."},{"slug":"podcast-research-group","title":"Podcast Research Group","date":1489693389951,"synopsis":"A podcast [[research group]] is a group of people researching together around an ill-defined topic. We look to find new subjects and stories, we [[Forage]] and [[Dig Deep]]."},{"slug":"pop-up-community","title":"Pop-Up Community","date":1489699996735,"synopsis":"We consider the fastest way to get a wiki community going over local wifi and then leave them with something they can share. We anticipate zero-conf, ipfs, electron and thumb drives as enabling technology."},{"slug":"practicing","title":"Practicing","date":1490704190734,"synopsis":"this is what Gbade suggested  yesterday ref content - The important points from my end I believe is some historical background, causes of the conflict, possible solutions and any other issue"},{"slug":"prague-feast","title":"Prague Feast","date":1501535401729,"synopsis":"FEAST (Festival of Environment, Arts & Sustainable Technology) je mezinárodní festival, jehož myšlenka pochází z Londýna a má za cíl propojit nejrůznější kultury srkze témata spojená s jídlem a tendencemi dnešního stravování. KINOLAB se do projektu FEAST zapojí v rámci akce ZAŽÍT MĚSTO JINAK ve spolupráci s alternativním prostorem zaměstanávající lidi bez domova Přestupní stanice. Tématem pražské sekce tohoto mezinárodního festivalu budou otázky spojené s plýtváním jídla, dumpster divingem a formami dnešního stravování."},{"slug":"praha-smchov-railway-station","title":"Praha-Smíchov Railway Station","date":1501532002482,"synopsis":"Praha-Smíchov railway station (Czech: Nádraží Praha-Smíchov, [ˈsmiːxof]) is a major railway station in Prague, Czech Republic, located in Smíchov, in the south-west of the city. It serves as a major railway station on the Czech national rail network, and is connected to the rest of Prague by its metro station of the same name and numerous tram routes which stop on Nádražní street outside the station."},{"slug":"princes-park-liverpool","title":"Prince's Park, Liverpool","date":1503239308992,"synopsis":"Prince's Park in Toxteth, Liverpool, England, is a 45 ha (110 acres) municipal park, 2 mi (3.2 km) south east of Liverpool city centre. In 2009, its status was upgraded to a Grade II* Historic Park by English Heritage - [https://en.wikipedia.org/wiki/Prince%27s_Park,_Liverpool wikipedia]"},{"slug":"prinzessinnengarten","title":"Prinzessinnengarten","date":1490372407875,"synopsis":"Nomadisch Grün (Nomadic Green) Starting in the summer of 2009, the non-profit company „Nomadisch Grün“ has leased a site in Berlin/Kreuzberg in order to create a mobile urban farm: The Prinzessinnengarten."},{"slug":"public-space","title":"Public Space","date":1489762157409,"synopsis":"Here we start to explore and gather writing and research regarding the notion of public space, both in the physical world and on the internet."},{"slug":"quartier-pigalle","title":"Quartier Pigalle","date":1490124703495,"synopsis":"Pigalle (French pronunciation: ​[pi.ɡal]) is an area in Paris around the Place Pigalle, on the border between the 9th and the 18th arrondissements. It is named after the sculptor Jean-Baptiste Pigalle (1714–1785) - [https://en.wikipedia.org/wiki/Quartier_Pigalle wikipedia]"},{"slug":"question","title":"Question","date":1459943778365,"synopsis":"Here we list questions for this site:"},{"slug":"quito","title":"Quito","date":1489752052213,"synopsis":"Quito (Spanish pronunciation: [ˈkito]) (Quechua: Kitu; Aymara: Kitu), formally San Francisco de Quito, is the capital city of Ecuador, and at an elevation of 2,850 metres (9,350 ft) above sea level, it is the highest official capital city in the world and the one which is closest to the equator. It is located in the Guayllabamba river basin, on the eastern slopes of Pichincha, an active stratovolcano in the Andes mountains. With a population of 2,671,191 according to the last census (2014), Quito is the second most populous city in Ecuador, after Guayaqu"},{"slug":"radio","title":"Radio","date":1501836904434,"synopsis":"FEAST aims to work with local radio stations and podcasters around the world to celebrate the diverse and vibrant culture of local radio. It is structured as an artist led coop, and we create and provide tools that make it simpler and legal for stations to share content and collaborate on productions."},{"slug":"radio---general","title":"Radio - general","date":1500480467358,"synopsis":"This is the grey subtitle"},{"slug":"radio-conference","title":"Radio Conference","date":1491928023879,"synopsis":"Radio as we understand it today is a broadcast medium. Conferences are events that take place in physical space. Both allow only limited forms of dialogue and questioning from the audience. FEAST aims to create an entirely new form of radio show and dialogue with the audience."},{"slug":"radio-garden","title":"Radio Garden","date":1490201856859,"synopsis":"By bringing distant voices close, radio connects people and places. Radio Garden allows listeners to explore processes of broadcasting and hearing identities across the entire globe. From its very beginning, radio signals have crossed borders. Radio makers and listeners have imagined both connecting with distant cultures, as well as re-connecting with people from ‘home’ from thousands of miles away – or using local community radio to make and enrich new homes - [http://radio.garden/ radio.garden]"},{"slug":"radio-network-simulator","title":"Radio Network Simulator","date":1420390431175,"synopsis":"I simulated a store-and-forward network composed of 173 vhf radios. I implemented a hierarchal routing and showed that it could route traffic backwards to use a discovered transcontinental link. [http://c2.com/~ward/morse/SimNet/ website]"},{"slug":"radio-prague","title":"Radio Prague","date":1501532265168,"synopsis":"[[Radio Prague]] is on Wednesday celebrating the 80th anniversary of its first, shortwave broadcast, which was from outside Pardubice in East Bohemia on 31 August 1936 - [http://www.radio.cz/en/section/news/radio-prague-celebrates-80th-anniversary-of-first-broadcast radio.cz]"},{"slug":"radio-station","title":"Radio Station","date":1501675423905,"synopsis":"Here we research how internet radio works, the tools you need, and how we cooperate to syndicate content amongst local stations."},{"slug":"radio-stations","title":"Radio Stations","date":1501675317886,"synopsis":"Feast.fm connects radio stations from all around the world encouraging content sharing, discussion and a multi-language exchange."},{"slug":"radio-university","title":"Radio University","date":1493479562889,"synopsis":"In January 1924 the Columbia Spectator reported experiments in broadcasting educational content \"wirelessly\" to a mass audience, and anticipated that in the future this could see the establishment of a Radio University."},{"slug":"radiolab","title":"Radiolab","date":1489693437018,"synopsis":"Radiolab is a radio program produced by [[WNYC]], a public radio station in New York City, and broadcast on public radio stations in the United States. The show is nationally syndicated and is available as a podcast. In 2008, Radiolab began offering live shows - [https://en.wikipedia.org/wiki/Radiolab wikipedia]"},{"slug":"rainbow-theatre","title":"Rainbow Theatre","date":1503324659624,"synopsis":"The Rainbow Theatre, originally known as the [[Astoria Finsbury Park]], is a Grade II listed building in Finsbury Park, London. Built as a cinema in 1930, it later became known as a music venue, boxing venue and is now a Pentecostal church - [https://en.wikipedia.org/wiki/Rainbow_Theatre wikipedia]"},{"slug":"raspberry-pi","title":"Raspberry Pi","date":1437998572101,"synopsis":"The Raspberry Pi is a credit card–sized single-board computer developed in the UK by the [[Raspberry Pi Foundation]] with the intention of promoting the teaching of basic computer science in schools - [https://en.wikipedia.org/wiki/Raspberry_Pi - wikipedia]"},{"slug":"recent-history-of-soho","title":"Recent History Of Soho","date":1489846540972,"synopsis":"On 30 April 1999, the Admiral Duncan ([[Admiral Duncan (pub)]]) pub on Old Compton Street, which serves the gay community, was damaged by a [[nail bomb]] that left three dead and 30 injured. The bomb was the third that had been planted by [[Neo-Nazi]] [[David Copeland]], who was attempting to stir up ethnic ([[ethnic minority]]) and homophobic ([[homophobia]]) tensions by carrying out a series of bombings - [https://en.wikipedia.org/wiki/Soho#Recent_history wikipedia]"},{"slug":"recordtv","title":"RecordTV","date":1503337522285,"synopsis":"RecordTV (Rede Record) is a Brazilian free-to-air television network, founded in 1953 by Paulo Machado de Carvalho, also founder of Rádio Record. Currently it is owned by Brazilian businessman Edir Macedo, who is also founder and bishop of the Universal Church of the Kingdom of God - [https://en.wikipedia.org/wiki/RecordTV wikipedia]"},{"slug":"red-fulani-cattle","title":"Red Fulani cattle","date":1491944441523,"synopsis":"Red Fulani cattle are found from Mali across Niger and northern Nigeria to Chad and Cameroon - [https://en.wikipedia.org/wiki/Red_Fulani_cattle wikipedia]"},{"slug":"research-group-activity","title":"Research Group Activity","date":1504529643074,"synopsis":"Here we list views of the activity of groups and individual related to the current project. You may want to keep an eye on:"},{"slug":"restaurants-in-soho","title":"Restaurants In Soho","date":1489846524892,"synopsis":"Many small and easily affordable restaurants and cafes were established in Soho during the 19th century, particularly as a result of Greek and Italian immigration. The restaurants were not looked upon favourably at first, but their reputation changed at the start of the 20th century. In 1924, a guide reported \"of late years, the inexpensive restaurants of Soho have enjoyed an extraordinary vogue.\" - [https://en.wikipedia.org/wiki/Soho#Restaurants wikipedia]"},{"slug":"rewards-based-crowdfunding","title":"Rewards-based Crowdfunding","date":1466270498005,"synopsis":"Reward-based crowdfunding has been used for a wide range of purposes, including motion picture promotion ([http://www.indiatimes.com/bollywood/crowd-funding-an-emerging-trend-in-bollywood-15652.html indiatimes.com/]), [[free software]] development, inventions development, scientific research ([http://blog.scienceexchange.com/2012/05/crowdfunding-as-the-future-of-science-funding/ scienceexchange.com]) and civic projects ([http://www.academia.edu/3415172/Crowdfunding_and_Civic_Society_in_Europe_A_Profitable_Partnership academia.edu])."},{"slug":"rimini-protokoll","title":"Rimini Protokoll","date":1507025785254,"synopsis":"Rimini Protokoll works in the realm of theater, sound and radio plays, film and installation emerge in constellations of two or three and solo as well."},{"slug":"save-soho","title":"Save Soho","date":1490124224660,"synopsis":"Save Soho was created on December 1st 2014 by local Soho singer songwriter Tim Arnold and actor Stephen Fry after the closure and repossession of world renown club Madame Jojo’s.  Under's their instigation, a coalition of performers, residents and politicians came together out of concern for the future of Soho's historic role as a national platform for the performing arts."},{"slug":"saved-search-result","title":"Saved Search Result","date":1491928310363,"synopsis":"We want to render search results in something that looks like a roster except that each flag links to a specific title."},{"slug":"settleforlove","title":"SettleForLove","date":1497787436002,"synopsis":"SettleForLove (Settle For Love sometimes abbreviated as SFL) is a free online dating, friendship, and social networking app / website."},{"slug":"sex-industry-in-soho","title":"Sex Industry in Soho","date":1489863437720,"synopsis":"The Soho area has been at the heart of London's [[sex industry]] for over 200 years; between 1778 and 1801 21 Soho Square ([[Manor House, 21 Soho Square]]) was location of the White House, a [[brothel]] described by the magistrate [[Henry Mayhew]] as \"a notorious place of ill-fame\". - [https://en.wikipedia.org/wiki/Soho#Sex_industry wikipedia]"},{"slug":"short-term-constitutional-goals","title":"Short Term Constitutional Goals","date":1493217683672,"synopsis":"A page with 0 items."},{"slug":"site-template-pages","title":"Site Template Pages","date":1500399068659,"synopsis":"Here we can see a few template pages that we are planning to use in the site:"},{"slug":"snapshots-of-wiki","title":"Snapshots of Wiki","date":1504121541927,"synopsis":"lfsdlkj"},{"slug":"soas-preparation","title":"SOAS Preparation","date":1501674976732,"synopsis":"Where I collect information for connecting SOAS Radio and [[FEAST.fm]]."},{"slug":"soho","title":"Soho","date":1489924106790,"synopsis":"Soho is an area of the City of Westminster and is part of the West End of London, England. Long established as an entertainment district, for much of the 20th century Soho had a reputation as a base for the sex industry in addition to its night life and its location for the headquarters of leading film companies - [https://en.wikipedia.org/wiki/Soho wikipedia]"},{"slug":"soho-conversations","title":"Soho Conversations","date":1490350080750,"synopsis":"FEAST Conversations are a set of walks, and conversations that take place over a weekend in Soho. These conversations can take place in a café, and open studio, or larger venue. They can also take place as organised walks, or as conversations that take place on the radio."},{"slug":"soho-feast","title":"Soho FEAST","date":1490974480010,"synopsis":"Soho FEAST is an annual community festival we look to start in [[Soho]] as part of FEAST. As with an [[Local FEAST]] we look to create a locally run and managed event that celebrates the history and diversity of local culture."},{"slug":"soho-hong-kong","title":"SoHo, Hong Kong","date":1489885232757,"synopsis":"The SoHo district in Hong Kong is an entertainment zone located in Central and bordering Sheung Wan, within Central. The name is derived from its location: South of Hollywood Road - [https://en.wikipedia.org/wiki/SoHo,_Hong_Kong wikipedia]"},{"slug":"soho-house","title":"Soho House","date":1489916872478,"synopsis":"Soho House is a Grade II* listed 18th-century house in Handsworth (historically in the county of Staffordshire, but part of Birmingham since 1911), England."},{"slug":"soho-live-music","title":"Soho Live Music","date":1489884161902,"synopsis":"As a part of the [[Soho FEAST]] we look to promote the [[Grassroots Venues]] that play [[Live Music]] in [[Soho]]."},{"slug":"soho-manhattan","title":"SoHo, Manhattan","date":1489914931893,"synopsis":"SoHo, sometimes written Soho, is a neighborhood in Lower Manhattan, New York City, which in recent history came to the public's attention for being the location of many artists' lofts and art galleries, but is now better known for its variety of shops ranging from trendy upscale boutiques to national and international chain store outlets. The area's history is an archetypal example of inner-city regeneration and gentrification, encompassing socioeconomic, cultural, political, and architectural developments - [https://en.wikipedia.org/wiki/SoHo,_Manhattan"},{"slug":"soho-music-scene","title":"Soho Music Scene","date":1489846014416,"synopsis":"The music scene in Soho can be traced back to 1948 and [[Club Eleven]], generally regarded as the first venue where modern jazz, or [[bebop]],  was performed in the UK. The Harmony Inn was a hang-out for musicians on Archer Street operating during the 1940s and 1950s. It stayed open very late and attracted jazz fans from the nearby [[Cy Laurie]] Jazz Club - [https://en.wikipedia.org/wiki/Soho#Music_scene wikipedia]"},{"slug":"soho-radio","title":"Soho Radio","date":1501535137434,"synopsis":"Soho’s online community radio station"},{"slug":"soho-restaurants","title":"Soho Restaurants","date":1490018031333,"synopsis":"Many small and easily affordable restaurants and cafes were established in Soho during the 19th century, particularly as a result of Greek and Italian immigration. The restaurants were not looked upon favourably at first, but their reputation changed at the start of the 20th century. In 1924, a guide reported \"of late years, the inexpensive restaurants of Soho have enjoyed an extraordinary vogue.\" - [https://en.wikipedia.org/wiki/Soho#Restaurants wikipedia]"},{"slug":"soho-tampa","title":"Soho (Tampa)","date":1489915815752,"synopsis":"SoHo Tampa, short for \"South Howard Avenue (Tampa)\" is an entertainment district within the Hyde Park neighborhood of Tampa. Some of the main cross streets are Kennedy Boulevard (SoHo's starting point), Cleveland Street, Platt Street and Swann Avenue."},{"slug":"soho-themes","title":"Soho Themes","date":1490349433443,"synopsis":"Here we research and archive material and thoughts that may be usefully packaged into a [[Conversation Topic]] that could be usefully used in a [[Soho Conversation]] or a [[Soho Walk]]."},{"slug":"soho-walks","title":"Soho Walks","date":1490014072913,"synopsis":"As part of [[Soho Conversations]] we will organise a number of walks to places of historic or contemporary interest to the area and what it represents."},{"slug":"soho-west-midlands","title":"Soho, West Midlands","date":1489916068065,"synopsis":"Soho is an area on the borders of Central Birmingham and Smethwick, approximately 2 miles north west of Birmingham city centre on the A41. The name is an abbreviation of South House, denoting that it was located to the south of Handsworth. The section of the A41 separating Handsworth from Winson Green is known as Soho Road - [https://en.wikipedia.org/wiki/Soho,_West_Midlands wikipedia]"},{"slug":"sohos-around-the-world","title":"Soho's Around The World","date":1490124529890,"synopsis":"The name \"[[Soho]]\" first appears in the 17th century. Most authorities believe that the name derives from a former hunting cry. James Scott, 1st Duke of Monmouth, used \"soho\" as a rallying call for his men at the Battle of Sedgemoor on 6 July 1685, half a century after the name was first used for this area of London."},{"slug":"soire","title":"Soirée","date":1489876752188,"synopsis":"In the 18th century, in France and England, it became fashionable for wealthy, well married ladies who had a residence \"in town\" to invite accomplished guests to visit their home in the evening, to partake of refreshments and cultural conversation. Soirées often included refined musical entertainment, and the term is still sometimes used to define a certain sophisticated type of evening party - [https://en.wikipedia.org/wiki/Party#soir.c3.a9es#Soirées wikipedia]"},{"slug":"solidarityfm","title":"Solidarity.fm","date":1501677198776,"synopsis":"Solidarity.fm is a decentralised radio station similar in design aims to [[FEAST.fm]]. It is a part of the [[Synergiehub]] project based in Switzerland."},{"slug":"sonic-pi","title":"Sonic Pi","date":1491157352098,"synopsis":"The Live Coding Music Synth for Everyone."},{"slug":"soundcloud-plugin","title":"SoundCloud Plugin","date":1438368621082,"synopsis":"The SoundCloud plugin enables an author to add a SoundCloud widget to their site."},{"slug":"south-african-food","title":"South African Food","date":1504470491526,"synopsis":"In Finsbury Park we have PiriPir chicken from:"},{"slug":"southwark-park","title":"Southwark Park","date":1503252143123,"synopsis":"Southwark Park is located in Rotherhithe, in central South East London, and is managed by the London Borough of Southwark. It first opened in 1869 by the Metropolitan Board of Works as one of its first parks. It was designed by Alexander McKenzie and covers 63 acres (250,000 m2). It takes its name from being in what was the old Parliamentary constituency of Southwark at the time of its opening - [https://en.wikipedia.org/wiki/Southwark_Park wikipedia]"},{"slug":"speak","title":"Speak","date":1497825810774,"synopsis":"Express yourself. Sing. Use your voice. Converse. Play. FEAST encourages dialogue. Using the medium of radio, we connect groups in conversations. Discussions in cafés, or at home are connected and aired. Live events broadcast around the world. FEAST weaves these group conversations together in a unique podcasting and creative writing platform."},{"slug":"splash","title":"Splash","date":1497872710813,"synopsis":"This wiki page is for creating a splash page for www.feast,fm. The paragraphs before the first markdown header are for helpful comments."},{"slug":"spoken-word","title":"Spoken word","date":1490606086477,"synopsis":"Spoken word is a performance art that is word based. It is an oral art that focuses on the aesthetics of word play and intonation and voice inflection. It is a 'catchall' that includes any kind of poetry recited aloud, including hip-hop, jazz poetry, poetry slams, traditional poetry readings and can include comedy routines and 'prose monologues' - [https://en.wikipedia.org/wiki/Spoken_word wikipedia]"},{"slug":"synergiehub","title":"Synergiehub","date":1501676471032,"synopsis":"The Synergiehub is an open network that invites you to participate in projects for fair economy, grassroots governance, free education and citizen journalism. The projects include activities in the domains of agriculture, housing, health and technology. We strive to co-create a future that embraces Permaculture principles in all aspects of life [https://synergiehub.ch/index.html synergiehub.ch]"},{"slug":"takeaway-soho","title":"Takeaway Soho","date":1490015907611,"synopsis":"Not exactly sure what this is - just has a ring to it."},{"slug":"tap-fwiki-roles","title":"TAP fwiki roles","date":1490965037992,"synopsis":"Here I will link to a page I created that suggests different types of role for wiki based research.... I believe the page is on a site for which the domain has lapsed."},{"slug":"task","title":"Task","date":1459943277259,"synopsis":"Here I list tasks and my personal To Do's:"},{"slug":"tasmania","title":"Tasmania","date":1489882779406,"synopsis":"Tasmania (/tæzˈmeɪniə/;, abbreviated as Tas and known colloquially as \"Tassie\") is an island state of the Commonwealth of Australia. It is located 240 km (150 mi) to the south of the Australian mainland, separated by Bass Strait. The state encompasses the main island of Tasmania, the 26th-largest island in the world, and the surrounding 334 islands. The state has a population of around 519,100 (as of June 2016), just over forty percent of which resides in the Greater Hobart precinct, which forms the metropolitan area of the state capital and largest city"},{"slug":"telegram","title":"Telegram","date":1491128746461,"synopsis":"[[Telegram]] stands out because of its strong encryption (making intelligence services unhappy). And FireChat works without cellular service: users’ phones communicate directly, which was a popular feature during recent protests in Hong Kong."},{"slug":"temple-of-solomon-so-paulo","title":"Temple of Solomon (São Paulo)","date":1503317545320,"synopsis":"The Temple of Solomon is a replica of the Temple of Solomon built by the Universal Church of the Kingdom of God in São Paulo - [https://en.wikipedia.org/wiki/Temple_of_Solomon_(S%C3%A3o_Paulo) wikipedia]"},{"slug":"testing-plugmatic-plugin","title":"Testing Plugmatic Plugin","date":1491929010356,"synopsis":"Now we try inquiry about a specific inventory."},{"slug":"the-global-challenge","title":"The Global Challenge","date":1489685785779,"synopsis":"[https://www.globalchallenges.org/en/the-prize/criteria The Global Challenge]: the Prize."},{"slug":"the-value-of-contradiction","title":"The Value of Contradiction","date":1506866218170,"synopsis":"This understanding is based on the appreciation of people as curious, and fearful / or, tribal while driven to avoid conflict, not simply as problematic logic, but also as creative possibility. We can be consensual yet preserve individuality. In short we believe in the power and benefit of contradiction, not just as a pragmatic spur to tolerance, but as a guiding principle behind an open mind."},{"slug":"things-heard-around-the-work-table","title":"Things heard around the work table","date":1489684575669,"synopsis":"I prefer shorter titles like this - [[Gathered Round The Table]]."},{"slug":"think-tank","title":"Think Tank","date":1493215815529,"synopsis":"A think tank, policy institute, or research institute is an organization that performs research and advocacy concerning topics such as social policy, political strategy, economics, military, technology, and culture."},{"slug":"this-week","title":"This Week","date":1497820854454,"synopsis":"This page is for each of our agreed personal to-do items that we are working on this week."},{"slug":"thought-garden","title":"Thought Garden","date":1493214611063,"synopsis":"Thought Garden is an [[Open Think Tank]], where we look to have new forms of conversation."},{"slug":"thought-garden-activity","title":"Thought Garden Activity","date":1501864022703,"synopsis":"View all activity from [[Thought Garden Sites]] listed in the roster below:"},{"slug":"thought-garden-project-activity","title":"Thought Garden Project Activity","date":1503250152070,"synopsis":"View all activity from the [[Thought Garden Projects]] roster below:"},{"slug":"thought-soup","title":"Thought Soup","date":1420295843598,"synopsis":"We reflect on this happening using the metaphorical model of soup as in primordial soup or even stone soup."},{"slug":"traditional-livelihood","title":"Traditional livelihood","date":1491943048133,"synopsis":"The Fulani are traditionally a [[nomad]]ic, pastoralist ([[Pastoralism]]) trading ([[trade]]) people. They herd [[cattle]], [[goat]]s and [[sheep]] across the vast dry hinterlands of their domain, keeping somewhat separate from the local agricultural populations. They are the largest nomadic ethnic group in the world, and inhabit several territories over an area larger in size than the continental United States - [https://en.wikipedia.org/wiki/Fula_people#Traditional_livelihood wikipedia]"},{"slug":"transmediale","title":"Transmediale","date":1452424752151,"synopsis":"Annual film festival held in Berlin, Germany. The 29th edition of transmediale takes place from 2 to 7 February 2016 at House of World Cultures in Berlin."},{"slug":"trevors-activity","title":"Trevor's Activity","date":1502271266649,"synopsis":"Here we list Trevor's recent activity, and writing and research currently being focussed on."},{"slug":"truth","title":"Truth","date":1439114093310,"synopsis":"He we collect the truth, or some aspects of it:"},{"slug":"truth-in-code","title":"Truth in Code","date":1439107473397,"synopsis":"Truth is an important concept in code and logic. It's history of implementation however is unreasonably amusing. So much so that I think these \"facts\" need checking."},{"slug":"truth-warriors","title":"Truth Warriors","date":1502370975276,"synopsis":"A great podcast about truth, whipped cream and the obsession to uncover it. The stories of a few folks ready to fight the future of fakery - [http://www.radiolab.org/story/truth-warriors/?utm_source=sharedUrl&utm_medium=metatag&utm_campaign=sharedUrl radiolab.org]"},{"slug":"turing-test","title":"Turing Test","date":1427535627670,"synopsis":"[[Alan Turing]] first proposed an \"imitation game' as a way to test an entity for the presence of the ability to think - that is intelligence."},{"slug":"uckg-and-film-promotion","title":"UCKG and film promotion","date":1503321829369,"synopsis":"\"The Ten Commandments\" is a film released in 2016 by UCKG-controlled Rede Record ([[RecordTV]]), in association with Paris Filmes. It is an adaptation of the eponymous television series presented by [[RecordTV]] in 2015 -"},{"slug":"universal-church-of-the-kingdom-of-god","title":"Universal Church of the Kingdom of God","date":1503321953745,"synopsis":"The Universal Church of the Kingdom of God (Igreja Universal do Reino de Deus) is a Pentecostal Christian denomination with its headquarters at the [[Temple of Solomon (São Paulo)]]. It was founded on July 9, 1977 in Rio de Janeiro by Edir Macedo - [https://en.wikipedia.org/wiki/Universal_Church_of_the_Kingdom_of_God wikipedia]"},{"slug":"university-of-louisvilles-radio-assisted-courses","title":"University of Louisville's \"Radio-assisted\" courses","date":1402602256961,"synopsis":"\"The chairman of the Federal Communications Commission grandly predicted that \"college-by-radio\" would put \"American education 25 years ahead.\" Local residents could pay U of L tuition, receive study materials in the mail, and listen to classroom discussions on the radio. The university offered \"radio-assisted correspondence courses\" entitled \"Problems of Modern Society\" and \"Contemporary American Literature\" in the fall semester of 1948, with WHAS and WRXW each handling student discussions two days a week.\""},{"slug":"utopia-studios-04","title":"Utopia Studios: 04","date":1507026775046,"synopsis":"Music, mobile interface, and multi-channel sound for the #BuildingUtopia project."},{"slug":"vigny","title":"Vigny","date":1489690561077,"synopsis":"The event will take place mid-may 2017 and gather writers, artists, librarian and philosophers to discuss Yuk Hui's [[Archivist Manifesto]], explore new tools to build and share knowledge. To reflect on the politics of archiving, the set of practices it englobes, reveals and hides."},{"slug":"walk-and-talks","title":"Walk And Talks","date":1490013799806,"synopsis":"The format is one in which people gather, and someone presents a theme, topic or conversation piece. The audience then pairs off in two's or three's, and instead of everyone sitting and discussing things around a table or in a conference setting, people are encouraged to walk, and talk while walking somewhere."},{"slug":"walkytalky","title":"WalkyTalky","date":1490013899096,"synopsis":"Trying to think of a name here for [[Walk And Talks]]. It would make sense to create a mobile app for this, that could play music, or audio to listeners while walking under the control of the guide, or on autopilot?"},{"slug":"we-make-the-road-by-walking","title":"We Make The Road By Walking","date":1489757341095,"synopsis":"This is the title of a [http://www.amazon.com/Make-Road-Walking-Conversations-Education/dp/0877227756  book] published in 1990, transcribing a series of conversations between radical educators [[Myles Horton]] and [[Paolo Friere]] in 1987. The phrase Freire is quoting is from a poem about pilgrimage by the Spanish poet [[Antonio Machado]]."},{"slug":"web-audio-api","title":"Web Audio API","date":1501838590036,"synopsis":"The [[Web Audio API]] specification developed by [[W3C]] describes a high-level JavaScript API for processing and synthesizing audio in web applications."},{"slug":"welcome-visitors","title":"Welcome Visitors","date":1506012382153,"synopsis":"[[FEAST]] is a global decentralised conference and music festival, connected by radio. It is a celebration of local culture, with communities around the world sharing conversation, sound and music."},{"slug":"what-is-a-feast","title":"What is a feast?","date":1492345408828,"synopsis":"A feast is essentially a celebration of sharing that often occurs in times of bounty, when for instance a hunter, or fisherman returns home with an unusually large catch. This form of sharing also occurs in other situations of adversity or conflict as a symbol of solidarity."},{"slug":"whatsapp","title":"WhatsApp","date":1491162390716,"synopsis":"WhatsApp Messenger is a freeware, cross-platform and end-to-end encrypted instant messaging application for smartphones - [https://en.wikipedia.org/wiki/WhatsApp wikipedia]"},{"slug":"wiki---012","title":"Wiki - 0.12","date":1504524788527,"synopsis":"Wiki v0.12 sees the introduction of ability to delete pages, together with a 'recycle bin' which will not only contain deleted pages but also pages that have been forked over. Also added is an assets directory."},{"slug":"wikpedia-image-import","title":"Wikpedia Image Import","date":1491942550953,"synopsis":"Here is an image from Wikipedia ready to drag onto your page..."},{"slug":"wild-west","title":"Wild West","date":1494360407589,"synopsis":"I was wondering if what needs to be done will require labor , young programmers... I have access to a lot of them in Cameroon. Sometimes I feel too old to take on all what is requested to get these things to fly. We just need to define clearly what the training will be about and what degree will they win after (degrees are a must for parents who can even pay)"},{"slug":"wnyc","title":"WNYC","date":1489693446363,"synopsis":"WNYC is the trademark, and a set of call letters shared by a pair of non-profit, noncommercial, public radio stations located in New York City - [https://en.wikipedia.org/wiki/WNYC wikipedia]"},{"slug":"world-caf","title":"World Café","date":1506019455447,"synopsis":"Small groups of four or five participants sit around a table and discuss an open-ended question for a structured amount of time."},{"slug":"world-radio-day","title":"World Radio Day","date":1501675488219,"synopsis":"World Radio Day is an observance day held annually on 13 February. World Radio Day is about celebrating radio, why we love it and why we need it today more than ever."},{"slug":"world-radio-day-2016","title":"World Radio Day 2016","date":1501675592607,"synopsis":"[http://www.diamundialradio.org/2016 World Radio Day 2016] was held on 13 February 2016 around the theme of '''Radio in Times of Emergency and Disaster''', with the goal of building partnerships with the humanitarian and emergency sector, as well as the community at large. The sub-themes of the Day were:"},{"slug":"world-radio-day-2017","title":"World Radio Day 2017","date":1501675629109,"synopsis":"[http://www.diamundialradio.org World Radio Day 2017] was held on 13 February 2017 around the theme of \"'''Radio is You\"''', with the goal of celebrating how audiences interact with Radio. The theme was designed to encourage radio stations to be the best they can, by having audience engagement policies, ethical committees, public editors, self review programmes and by ensuring their community radio networks were strong. A record number of countries, took part in World Radio Day 2017 with more than 500 events worldwide."},{"slug":"worldscape","title":"Worldscape","date":1504362895251,"synopsis":"During [[FEAST Zero]] we will be organising a number of dinners, screenings, gatherings and conversations around an amazing table from our friends at [http://www.atmosstudio.com/Worldscape atmosstudio.com]"}]