[{"slug":"21st-century-competencies","title":"21st century competencies","date":1423587461263,"synopsis":"A page with 0 items."},{"slug":"about-markdown-plugin","title":"About Markdown Plugin","date":1446373084040,"synopsis":"The Markdown plugin allows you to format text using a paragraph oriented subset of markdown. We add link syntax from Federated Wiki and task lists from GitHub."},{"slug":"about-method-plugin","title":"About Method Plugin","date":1425403002895,"synopsis":"The Method plugin keeps a running tally of calculations expressed as a series of lines."},{"slug":"academies-are-dockers","title":"Academies are Dockers","date":1438684288531,"synopsis":"[[Docker]]s are great - but what do they have to do with [[Academies]]?"},{"slug":"add-videos","title":"Add Videos","date":1420517487483,"synopsis":"Video services offer \"embed\" codes that can be used to add video play windows to wiki pages. We offer a few tips for working with this sort of media."},{"slug":"advanced-distributed-learning","title":"Advanced Distributed Learning","date":1432832308278,"synopsis":"The vision of the ADL Initiative is to provide access to the highest quality learning and performance aiding that can be tailored to individual needs, and delivered cost effectively at the right time and at the right place."},{"slug":"agile-project-management","title":"Agile Project Management","date":1426861630325,"synopsis":"[[Agile Project Management]] or [[Agile Management]] is an iterative and incremental method of managing the design and build activities for any new product or service."},{"slug":"agile-teachers","title":"Agile Teachers","date":1425398483005,"synopsis":"In the Viral Academy we use a modified version of [[Agile Project Management]] as our teaching philosophy and methodology"},{"slug":"all-pages-in-neighborhood","title":"All Pages in Neighborhood","date":1423760208993,"synopsis":"We've talked about the Neighborhood, but have not gone into it in great detail. Here we talk about what the Neighborhood is, and how to list all pages in it."},{"slug":"avoid-lock-in","title":"Avoid Lock In","date":1423924147374,"synopsis":"There are a number of important considerations when choosing to use, or avoid tools, and here we try and list them:"},{"slug":"building-utopia","title":"Building Utopia","date":1446732210194,"synopsis":"To coincide with the 500 year anniversary of the original publication, we reconstruct the mythical island of Utopia in Minecraft, with the governance and economy coded in smart contracts on the blockchain. The laws, and designs will be selected through a participatory design process, styled as an architectural competition."},{"slug":"camps-and-retreats","title":"Camps and Retreats","date":1436783336808,"synopsis":"Here we collect infromation about great events, camps and retreats that can be used to get together with a group of like-minded souls to hack on a project."},{"slug":"changing-your-flag","title":"Changing Your Flag","date":1419318649193,"synopsis":"How I changed my anonymous flag to a photo. It's not particularly accessible to non-programmers yet, but I'm sure will be added to the SFW code soon. My instructions assume you are using a Mac."},{"slug":"chaos-communication-camp","title":"Chaos Communication Camp","date":1434728158862,"synopsis":"The Chaos Communication Camp is an international meeting of hackers that takes place every four years, organized by the [[Chaos Computer Club]] (CCC)."},{"slug":"claim-your-federated-wiki-space","title":"Claim Your Federated Wiki Space","date":1424176739131,"synopsis":"Claiming your own [[Smallest Federated Wiki]] space is easy. Simply choose your own personal domain name, and head over there - then click on the link at the bottom of the screen marked \"Claim your"},{"slug":"commenting","title":"Commenting","date":1423762497344,"synopsis":"There is no single stream on federated wiki, so commenting in federated wiki should be used for comments on the document, not for extended back and forth discussion."},{"slug":"compose-by-refactoring","title":"Compose by Refactoring","date":1423944878276,"synopsis":"Writing is traditionally considered composing new and original text. This idea is dated and disrespectful. Real writing always builds on the shoulders of others. Writing in a [[Federated Wiki]] is inherently about reuse, re-purposing and refactoring."},{"slug":"courses","title":"Courses","date":1425393525621,"synopsis":"Here is a list of the courses we are currently developing:"},{"slug":"crowd-funding-course","title":"Crowd Funding Course","date":1423946156668,"synopsis":"We will be running a crowd funding course in which students will learn the theory and practice of running a crowd funding campaigns, through taking part in an actual campaign."},{"slug":"crypto-academy","title":"Crypto Academy","date":1423850595889,"synopsis":"The [http://cryptoacademy.org cryptoacademy.org] is a course and repository of [[Open Learning Resources]] on cryptography."},{"slug":"currently-working-on","title":"Currently Working On","date":1446756539953,"synopsis":"Here is a list of [[Recent Changes]] I consider important. View our experiments on the [[Scratch]] page. To clear stuff saved in your browser try [[Local Changes]]."},{"slug":"dapp","title":"DApp","date":1424133605232,"synopsis":"DApp stands for \"distributed app\" - an acronym for a form of software application that communicates with other applications without a centralised server - [http://www.coindesk.com/decentralised-apps-promise-new-way-business-online/ Coindesk]."},{"slug":"dapp-club","title":"DApp Club","date":1424134742990,"synopsis":"We think www.dapp.club is a cool name. It's the place to learn to make [[DApps]] - join the club! OK - so we couldn't get [http://dapp.academy dapp.academy]"},{"slug":"daq","title":"DAQ","date":1423929580606,"synopsis":"DAQ stands for \"dumb arsed questions\" - the aim is to encourage people to ask the most basic questions, exactly those questions they feel too shy to ask - on the basis that every one else will probably be asking themselves the same thing!"},{"slug":"data-and-javascript","title":"Data and Javascript","date":1427925127952,"synopsis":"COWL (Confinement with Origin Web Labels) is a robust JavaScript confinement system for modern web browsers. COWL introduces label-based mandatory access control to browsing contexts (pages, iframes, etc.) in a way that is fully backward-compatible with legacy web content - [http://cowl.ws/ cowl.ws]"},{"slug":"data-not-layout","title":"Data not Layout","date":1423333332525,"synopsis":"Pages are stored on federated wiki sites as JSON, a simple, easily parseable data format. You can see what this format looks like by clicking JSON at the bottom of the page."},{"slug":"david-bovill","title":"David Bovill","date":1424076495009,"synopsis":"I am a founder of the [[Viral Academy]], where I teach a number of [http://david.viral.academy/view/welcome-visitors/view/david-bovill/view/courses Courses], and am aiming to include SFW in the toolkit we use."},{"slug":"democratic-schools","title":"Democratic Schools","date":1432470672015,"synopsis":"Democratic education is an educational ideal in which democracy is both a goal and a method of instruction - [https://en.wikipedia.org/wiki/Democratic_education wikipedia]"},{"slug":"digital-nomadism-and-learning","title":"Digital Nomadism and Learning","date":1425216925975,"synopsis":"Digital Nomadism is an emerging trend amongst opinion leaders and young entrepreneurs. [[Digital Nomads]] make ideal teachers. We call these teachers [[Nomadic Teachers]]."},{"slug":"digital-nomads","title":"Digital Nomads","date":1425213861720,"synopsis":"Digital nomads are individuals who leverage telecommunications technologies to perform their work duties, and more generally conduct their lifestyle in a nomadic manner - [http://en.wikipedia.org/wiki/Digital_nomad wikipedia:] ."},{"slug":"direct-instruction","title":"Direct Instruction","date":1439157333228,"synopsis":"Direct Instruction (DI) is an instructional method that is focused on systematic curriculum design and skilful implementation of a prescribed behavioral script - [https://en.wikipedia.org/wiki/Direct_Instruction wikpedia]"},{"slug":"discussing-names","title":"Discussing Names","date":1423961234649,"synopsis":"Here we discuss names, and controversies surrounding them!"},{"slug":"docker","title":"Docker","date":1438598963415,"synopsis":"Docker is an open-source project that automates the deployment of applications inside software containers - [https://en.wikipedia.org/wiki/Docker_%28software%29 wikipedia]"},{"slug":"docker-questions","title":"Docker Questions","date":1438684411813,"synopsis":"Here ask a few basic questions we try to answer best we can:"},{"slug":"easy-to-use","title":"Easy to Use","date":1423930175829,"synopsis":"User-friendliness is generally described as being \"easy to use\"\" but in point of fact what most people mean by this is that it is easy to learn."},{"slug":"edtech","title":"EdTech","date":1423929738522,"synopsis":"This page is a place for me to collect examples and ideas for technology that may be useful in a learning context."},{"slug":"edtech-notes","title":"EdTech Notes","date":1436783382581,"synopsis":"A scrapbook of notes and links to everything related to technology for education:"},{"slug":"education-for-all","title":"Education for All","date":1436693245799,"synopsis":"Education For All — The Student Story - a Youtube playlist on Al Jazeera English - [https://www.youtube.com/playlist?list=PLzGHKb8i9vTwsd7NUWiu5WTAIEq931nM7 youtube.com]"},{"slug":"education-quotes","title":"Education Quotes","date":1427132925037,"synopsis":"None of the things they are to learn, should ever be made a burthen to them, or impos'd on them as a task. Whatever is so propos'd, presently becomes irksome; the mind takes an aversion to it, though before it were a thing of delight or indifferency."},{"slug":"educational-media","title":"Educational Media","date":1436784460440,"synopsis":"It is important to separate as best we can media assets used in education, into assets that are of long term value, and those which we create as a dynamic part of the learnign experience."},{"slug":"embedded-academy","title":"Embedded Academy","date":1446374336875,"synopsis":"Please provide a brief summary of your project and tell us why we should support it. (50 words)"},{"slug":"episodes","title":"Episodes","date":1420949763193,"synopsis":"This pattern language describes a form of software development appropriate for an entrepreneurial organization."},{"slug":"exams-are-expensive","title":"Exams are Expensive","date":1425294388293,"synopsis":"A great deal of resources are often expended by an educational institution simply in order to evaluate and mark students and students work. Potential employees demand this, and it helps provide necessary incentives for students."},{"slug":"experience-api","title":"Experience API","date":1432832170186,"synopsis":"The Experience API (xAPI), also known as the Tin Can API is an e-learning software specification that allows learning content and learning systems to speak to each other in a manner that records and tracks all types of learning experiences - [https://en.wikipedia.org/wiki/Experience_API_%28Tin_Can_API%29 WikiPedia]"},{"slug":"federated-wiki","title":"Federated Wiki","date":1423949758056,"synopsis":"Here we discuss the basic features and motivations for using a federated wiki."},{"slug":"federated-wiki-app","title":"Federated Wiki App","date":1424117032342,"synopsis":"I am working on turning the [[Smallest Federated Wiki]] into an app. The idea is to run a technical course on [[Wiki's]], [[JSON]] and [[Federated Data]]. During the course we will create a desktop and mobile app - for short let's call this [[WikiApp]]."},{"slug":"federated-wiki-dapp","title":"Federated Wiki DApp","date":1424081307266,"synopsis":"A  federated wiki [[DApp]] would combine the flexibility of wiki federation, with the robust decentralised power of the [[Blockchain]]."},{"slug":"federated-wiki-page","title":"Federated Wiki Page","date":1423908608457,"synopsis":"A federated wiki page is a potentially confusing term. It could refer to a web (or wiki) page - or it could refer to the [[Story]] or [[Wiki Panel]] - which is the vertical pane - several of which make up a wiki page."},{"slug":"fedwiki-content","title":"FedWiki Content","date":1423766126787,"synopsis":"He we gather great [[Federated Wiki]] or to be precise [[Smallest Federated Wiki]] content (with a particular emphasis on education)."},{"slug":"fedwiki-tools","title":"Fedwiki Tools","date":1498482905320,"synopsis":"Here we list a few tools that are of particular use in managing and creating [[Fedwiki]] content."},{"slug":"financing-teaching","title":"Financing Teaching","date":1424256759318,"synopsis":"We would like teachers to be well paid. We feel teachers, and teaching is not respected enough, and that teachers should be paid more."},{"slug":"flipped-classroom","title":"Flipped Classroom","date":1427130063939,"synopsis":"Flipped classroom is a form of blended learning which brings an interactive engagement pedagogy to classrooms by having students learn content online, usually at home, and homework is done in class with teachers and students discussing and solving questions - [https://en.wikipedia.org/wiki/Flipped_classroom wikipedia]"},{"slug":"free-culture","title":"Free Culture","date":1424132668230,"synopsis":"All the content and that we use and create is [http://creativecommons.org/freeworks Free Culture], and the code we create is [http://en.wikipedia.org/wiki/Free_software Free Software]. Freedom Defined names four necessary characteristics of a free cultural work:"},{"slug":"future-of-federation","title":"Future of Federation","date":1424080966912,"synopsis":"Looking forward to the [[Future of Federation]], there are new fully decentralised server-less technologies based on the [[Blockchain]] which we can leverage to create a [[Federated Wiki DApp]]."},{"slug":"genius-hour","title":"Genius Hour","date":1432745142671,"synopsis":"[[Genius Hour]] has roots in tech, with many attributing the open format concept to large tech companies where developers are encouraged to spend a portion of their time solving problems that interest them."},{"slug":"get-involved","title":"Get Involved","date":1423939887830,"synopsis":"[[Principles of Collaboration]]"},{"slug":"history-of-federated-wiki","title":"History of Federated Wiki","date":1423943781662,"synopsis":"Here we list some important stages in the history of the development of the [[Smallest Federated Wiki]] software."},{"slug":"history-of-nomadism","title":"History of Nomadism","date":1425216444899,"synopsis":"Nomadism has an interesting and relevant history for todays [[Digital Nomads]]. [[Journeyman]] date back to medieval times, and are still common in Germany and France."},{"slug":"hive-learning-networks","title":"Hive Learning Networks","date":1431615411183,"synopsis":"Hive Learning Network is a Mozilla foundation project in popup, participatory learning methodology."},{"slug":"host-with-us","title":"Host With Us","date":1424171489483,"synopsis":"A [[Viral Academy]] is built around two main web sites, and we make it as easy as possible to host these. We will host the [[First 20 Academies]] for free, but aim in the long term to cover our central hosting costs with a small membership fee."},{"slug":"hyperlocal-servers","title":"Hyperlocal Servers","date":1437483857075,"synopsis":"A [[Hyperlocal Server]] is term I coined for a local web server that a use may run at home, or in a local business, school, or cafe."},{"slug":"ideas-of-federated-wiki","title":"Ideas of Federated Wiki","date":1423008702213,"synopsis":"Federated Wiki combines a few powerful, well-chosen ideas. It's helpful to know what these are. Most of these ideas exist someplace else, the particular power is the combination of the ideas in a single environment."},{"slug":"incremental-paragraphs","title":"Incremental Paragraphs","date":1420512381493,"synopsis":"A complete thought is more important than a complete sentence. Write to be read in progress. Expect your work to be consumed and discarded before it is finished."},{"slug":"interface-names","title":"Interface Names","date":1420995898634,"synopsis":"The user interface presents information in graphical forms. We often refer to these forms by the same names as the information."},{"slug":"ipfs","title":"IPFS","date":1436786170130,"synopsis":"IPFS stands for the \"inter-planetary file system\". It enables files to be stored as if they are in one single global hard disk (hence the name)."},{"slug":"ivan-illich","title":"Ivan Illich","date":1432470623005,"synopsis":"Ivan Illich, was an Austrian [[Philosopher]], [[Roman Catholic]] priest, and \"maverick social critic\" of the institutions of contemporary Western culture and their effects on the provenance and practice of education, medicine, work, energy use, transportation, and economic development - [https://en.wikipedia.org/wiki/Ivan_Illich wikipideia]"},{"slug":"journeyman","title":"Journeyman","date":1430682315834,"synopsis":"A journeyman (Wandergeselle in German), is an individual who has completed an apprenticeship and is fully educated in a trade or craft, but not yet a master - [https://en.wikipedia.org/wiki/Journeyman wikipedia]"},{"slug":"know-possible-traps","title":"Know Possible Traps","date":1423160832532,"synopsis":"Federated Wiki should be regarded as a Developer Release or Technology Preview. Expect certain things to go wrong. Roll with it...."},{"slug":"learndash","title":"LearnDash","date":1427931453591,"synopsis":"LearnDash has a bunch of features and plugins that we can use."},{"slug":"learndash-groups","title":"LearnDash Groups","date":1427931253989,"synopsis":"Using the new LearnDash Groups feature, you can now assign Group Leaders to manage any number of users. So, using the example above, you can have a teacher manage and track their students‚Äô progress."},{"slug":"learning-assets","title":"Learning Assets","date":1436786428939,"synopsis":"Here we list sources of open learning materials that are of long term value. Links to these resources should not break, and we need to find low cost ways to host and distribute these assets between learners, and learning institutions."},{"slug":"learning-object","title":"Learning Object","date":1423602189764,"synopsis":"A page with 1 items."},{"slug":"learning-timebank","title":"Learning TimeBank","date":1425213406472,"synopsis":"We use a time based currency: Students are required to pass on their learning in order to earn credits that they can use to take further free courses."},{"slug":"like-riding-a-bicycle","title":"Like Riding a Bicycle","date":1423930436346,"synopsis":"A good example of \"hard to learn, easy to use\" is the [[Computer Mouse]].  A bicycle is another example often used by Doug Engelbart. A bicycle is harder to learn to use than a tricycle by an order of magnitude, but rewards the effort with flexibility and power."},{"slug":"lineup","title":"Lineup","date":1423922639900,"synopsis":"The lineup is the list of wiki pages currently displayed within one tab, in order, with duplication possible."},{"slug":"list-of-lists-of-sites","title":"List of Lists of Sites","date":1420512504674,"synopsis":"We collect and manage lists of lists. Just peeking at one of these lists will expand your browsing neighborhood and make searches look further."},{"slug":"livecode-wiki-course","title":"LiveCode Wiki Course","date":1424077723825,"synopsis":"The idea of this course is to experiment with creating a LiveCode app, which works with [[Wiki]]s - in particular the [[Smallest Federated Wiki]] and [[MediaWiki]] software."},{"slug":"looking-back-and-looking-forward","title":"Looking back and Looking Forward","date":1424115781974,"synopsis":"Currently, federated wiki is a new sort of browser inside and old sort of browser. So we have this somewhat parasitic approach of building a new sort of web by piggybacking on the old one."},{"slug":"looking-back-at-1989","title":"Looking Back at 1989","date":1424115736792,"synopsis":"Currently, federated wiki is a new sort of browser inside and old sort of browser. So we have this somewhat parasitic approach of building a new sort of web by piggybacking on the old one."},{"slug":"minecraft","title":"Minecraft","date":1424136925523,"synopsis":"Minecraft"},{"slug":"minimap-page","title":"Minimap Page","date":1425299623251,"synopsis":"An minimap-page is a [[Wikinote]] that contains a [[Wiki Minimap]] that serves to define the bounds and scope of a [[Wiki Cluster]]. It is usually created from a [[Minimap Template]]"},{"slug":"mit-opencourseware","title":"MIT OpenCourseWare","date":1423840131296,"synopsis":"[http://ocw.mit.edu/index.htm MIT OpenCourseWare] is a large-scale, web-based publication of MIT course materials. The project was announced in October 2002 and uses Creative Commons Attribution-Noncommercial-Share Alike license."},{"slug":"mobile-app-development","title":"Mobile App Development","date":1423844379707,"synopsis":"In this course we will learn how to create a native mobile application for Android and iOS. If you are interested in joining this course we will work together in a small group to design, code, and publish an app to the relevant [[Mobile App Store]]s"},{"slug":"mobile-first","title":"Mobile First","date":1438337698171,"synopsis":"Early on we decided that the [[Viral Academy]] would plan it's technical strategy by emphasising mobile, and in particular off-line mobile access first."},{"slug":"motivational-pyramid","title":"Motivational Pyramid","date":1424866650532,"synopsis":"The motivational pyramid consists of two main parts:  first the motivation to take more in-depth advanced courses, and second the motivation to be in small group learning settings with well know expert teachers."},{"slug":"my-neighbourhood","title":"My Neighbourhood","date":1427028839561,"synopsis":"Below we list the sites that are in [[Our Neighbourhood]]:"},{"slug":"need-to-know-writing","title":"Need To Know Writing","date":1423932938933,"synopsis":"Writing course content this way can be a challenge for a teacher used to creating, or learning in ore traditional environments. Throwing yourself into the process is an act of faith."},{"slug":"new-projects","title":"New Projects","date":1446733979600,"synopsis":"We are [[currently working on]] the following new projects:"},{"slug":"nomadic-teachers","title":"Nomadic Teachers","date":1427126871275,"synopsis":"Nomadic teachers travel from town to town, visiting communities and conferences picking up knowledge as they travel. The [[Viral Academy]] is seeking to encourage and facilitate this form of teaching using new technology."},{"slug":"nomads","title":"Nomads","date":1425202758002,"synopsis":"Nomadism is a way of life that exists outside of the organizational state. The nomadic way of life is characterized by movement across space which exists in sharp contrast to the rigid and static boundaries of the state - [http://www.rhizomes.net/issue5/poke/glossary.html - rhizomes.net]"},{"slug":"notes","title":"Notes","date":1423856047190,"synopsis":"Things to spice up my own site:"},{"slug":"online-experts","title":"Online Experts","date":1423608852519,"synopsis":"The [[Viral Academy]] invites mentors and experts to volunteer time in the support of learners. Online Experts are asked to volunteer a minimum of 10 hours online support over a year, and provided with an easy to manage interface allowing them to effectively manage their time."},{"slug":"open-badges","title":"Open Badges","date":1425214085290,"synopsis":"We use Mozilla Open Badges to to acknowledge the skills learned, and emphasise the social and communications skills required for successful group work."},{"slug":"open-education","title":"Open Education","date":1423826150320,"synopsis":"Here are some links on open education (much of which was taken from [http://en.wikipedia.org/wiki/Open_education this Wikipedia article]:"},{"slug":"opencourseware","title":"OpenCourseWare","date":1423827243907,"synopsis":"The OpenCourseWare movement started in 1999 when the University of T√ºbingen in Germany published videos of lectures online for its ''timms'' initiative ([http://timms.uni-tuebingen.de/archive/sose99.aspx T√ºbinger Internet Multimedia Server])."},{"slug":"our-neighbourhood","title":"Our Neighbourhood","date":1427028839563,"synopsis":"Our neighbourhood is a list of sites we write on. This catalogue of external sites is useful to meet people and load their [[Site Maps]] into your [[Neighbourhood]]."},{"slug":"paulo-freire","title":"Paulo Freire","date":1423505102607,"synopsis":"Paulo Reglus Neves Freire was a Brazilian [[educator]] and [[philosopher]] who was a leading advocate of [[critical pedagogy]]. He is best known for his influential work, ''[[Pedagogy of the Oppressed]]'', which is considered one of the foundational texts of the critical pedagogy movement."},{"slug":"pedagogy","title":"Pedagogy","date":1427132910507,"synopsis":"Notes on teaching theory and practice. Here we collect ideas and real world experiments related to the Viral Academy."},{"slug":"personas","title":"Personas","date":1423755621617,"synopsis":"We'll be developing and refining personas who will be the imagined actors as we develop more advanced uses cases. (Shift-click to see multiple personas.)"},{"slug":"popup-academies","title":"Popup Academies","date":1438684237966,"synopsis":"The Viral Academy is not about creating a centralised site or platform. One of it's [[Core objectives]] is to facilitate [[Diversity in Learning]]. To acheive this objective we need to scale down the cost and size of academy creation, running and management to a sustainable core - so that we can quickly and easily pop-up an academy for a context, and motivation which may be transient, or non-commercial."},{"slug":"principles-of-collaboration","title":"Principles of Collaboration","date":1423932951217,"synopsis":"The principles of collaboration are simple - if it looks like you put time into it, other people are encouraged to do the same. If it looks like you jotted a couple of words on a piece of paper - then they tend not to take it seriously - or not to be motivated. Visible work - not too much - not too little."},{"slug":"project-based-learning","title":"Project Based Learning","date":1423954447036,"synopsis":"The [[Viral Academy]] is structured around [[Projects]] not [[Courses]], but we have had to adapt the methodology to weave in both components. However we always strive to base learning around the activity of making."},{"slug":"project-template","title":"Project Template","date":1446373720313,"synopsis":"Please provide a brief summary of your project and tell us why we should support it (50 words max.):"},{"slug":"promise-fund","title":"Promise Fund","date":1446734154362,"synopsis":"The Promise Fund is a new way to create a global interoperable [[Time Bank]], which has the unique feature of being able to turn promises of help, into [[Time Credits]]."},{"slug":"protip-application","title":"ProTip Application","date":1446577114888,"synopsis":"ProTip is a lightweight bitcoin wallet that helps people be rewarded for doing what they love anywhere on the web."},{"slug":"real-space-association","title":"Real Space Association","date":1431618752455,"synopsis":"The Real Space Association is an international network of physical spaces that have joined forces to explore the potential of distributed events, unConferneces, and hackathons."},{"slug":"real-time-and-chat","title":"Real Time and Chat","date":1423751452802,"synopsis":"Real-time and chat links and implementations of interest to [[FedWiki]]."},{"slug":"reflections","title":"Reflections","date":1423460888706,"synopsis":"We imagine federated wiki as a medium for authoring, distributing and consuming reports."},{"slug":"residency-programme","title":"Residency Programme","date":1431618884200,"synopsis":"We are providing a series of month long residencies in London, and are looking to partner with other spaces to provide a network of spaces so that members can take part in [[Residency Exchanges]]."},{"slug":"reusable-learning-objects","title":"Reusable Learning Objects","date":1423503110661,"synopsis":"The term [[Learning Object]] has been used before, and appears to have developed a bad reputation. I assume that was because of poor and inflexible implementations coming out of computer science."},{"slug":"rhizomatic-learning","title":"Rhizomatic Learning","date":1429178741786,"synopsis":"http://rhizomatic.net/2015/04/14/learning-subjectives-designing-for-when-you-dont-know-where-youre-going/"},{"slug":"rhizomatic-philosophy","title":"Rhizomatic Philosophy","date":1429178592210,"synopsis":"The concept of the rhizome as a representation of the structure of knowledge was first proposed by Gilles Deleuze and Felix Guattari in [[A Thousand Plateaus]] - [http://en.wikipedia.org/wiki/Rhizome_%28philosophy%29 wikipedia]"},{"slug":"sands-school","title":"Sands School","date":1432470788216,"synopsis":"Talking to Luke about Sands - it is perhaps more democratic. More like a home or mansion house, while summer Hill is like a huge mansion with loads grounds."},{"slug":"schedule-path","title":"Schedule Path","date":1426863462269,"synopsis":"A schedule is not made up only of activities, however, but of strings of activities linked together in logical sequences - [http://www.gpmfirst.com/books/practical-schedule-risk-analysis/uncertainty-along-schedule-path-using-monte-carlo-simulation - www.gpmfirst.com]"},{"slug":"scratch","title":"Scratch","date":1427133121330,"synopsis":"<svg xmlns=\"http://www.w3.org/2000/svg\""},{"slug":"sfw-hacks-and-tricks","title":"SFW Hacks and Tricks","date":1423929777222,"synopsis":"[[Changing Your Flag]]"},{"slug":"sharing-through-federation","title":"Sharing through Federation","date":1423944566404,"synopsis":"We show how drag-and-drop between federated wiki pages creates a new model for sharing. A simple JSON model of the page makes this all straightforward."},{"slug":"smallest-federated-wiki","title":"Smallest Federated Wiki","date":1423949730452,"synopsis":"We introduce the parts of a Federated Wiki page. A \"story\" is a collection of paragraph like items. A \"journal\" collects story edits."},{"slug":"smart-phone","title":"Smart Phone","date":1425225551216,"synopsis":"Today two billion phones are in use worldwide, and this number is expected to double by the end of the decade."},{"slug":"smartphone-use","title":"Smartphone Use","date":1425225721205,"synopsis":"When comparing overall screen time however, the smartphone still has some catching up to do to match the allure of longer established technologies like television."},{"slug":"software-development","title":"Software Development","date":1423943147076,"synopsis":"How done is this software? Who makes it and how? Do we want more ideas? Do we want coding help?"},{"slug":"sputnik","title":"Sputnik","date":1426459365258,"synopsis":"How Sputnik changed U.S. education. A 2007 panel observed that the nation responded to the security threat by targeting education, a reaction it has repeated since, including after the 9/11 terrorist attacks. [http://news.harvard.edu/gazette/story/2007/10/how-sputnik-changed-u-s-education/ post]"},{"slug":"start-your-own-academy","title":"Start Your Own Academy","date":1424172101970,"synopsis":"The [[Viral Academy]] is a [[Free Culture]] facilitator of learning. Our mission is to make it as [[Easy As Possible]] to create and re-purpose educational content for your community. Go ahead and [[Fork Us]]."},{"slug":"synthesis-and-critique","title":"Synthesis and Critique","date":1427017586077,"synopsis":"In [[Happening]]s we practice a sort of conversation through editing. It's a weird experience, but many like it. Key to creating that dynamic is that we not only read, write, and fork, but that we synthesize as well."},{"slug":"take-part","title":"Take Part","date":1427111260340,"synopsis":"You can sign up to one of our [[Free Courses]], or join as one of our fabulous: [[Teachers]] or [[Experts and Mentors]]. You can even fork us and [[Start Your Own Academy]]. Just follow the links - or tweet us @Viral_Academy. See more on how to [[Get Involved]] here."},{"slug":"teachers","title":"Teachers","date":1424256378892,"synopsis":"Teachers is a misnomer in the Viral Academy - we don;t really distinguish between teachers and students. Any student can, and is encouraged to lead a class, and for us leading, or facilitating a class is teaching."},{"slug":"teaching-as-creative-writing","title":"Teaching as Creative Writing","date":1425295967928,"synopsis":"Teaching using [[Smallest Federated Wiki]] is in large part the task of leading a [[Creative Writing Class]], or more accurately a [[Collaborative Creative Writing Class]]."},{"slug":"teaching-machines-sites","title":"Teaching Machines Sites","date":1429416795476,"synopsis":"A list of people involved in the [[Teaching Machines]] Happening."},{"slug":"teaching-sites","title":"Teaching Sites","date":1436783413177,"synopsis":"A catalogue of people interested in education, or technology related to education:"},{"slug":"technology-sites","title":"Technology Sites","date":1427188764500,"synopsis":"A list of sites that document technology related to the [[Smallest Federated Wiki]]"},{"slug":"terminology","title":"Terminology","date":1423960759182,"synopsis":"The terminology that I personally find new and important to highlight includes:"},{"slug":"things-you-must-do","title":"Things You Must Do","date":1423922927241,"synopsis":"You can wander all day in the federation, and it's easy to get sidetracked. A [[Federated Wiki]] is [[Like Riding a Bicycle]] - learning to ride can be tricky but it is worth it. Below are some steps which will help get you oriented:"},{"slug":"time-bank","title":"Time Bank","date":1446467510118,"synopsis":"In economics, a time-based currency is an alternative currency where the unit of exchange is the person-hour."},{"slug":"trello","title":"Trello","date":1432745142668,"synopsis":"Trello is a closed source [[Kanban]] that can be used in a similar way to [[Federated Wiki]] - [http://blog.trello.com/teachers-using-trello-how-to-foster-genius-in-the-classroom/?utm_source=email&utm_medium=link&utm_content=genius_hour&utm_campaign=maynewsletter blog.trello.com]"},{"slug":"ubiquitous-learning","title":"Ubiquitous Learning","date":1425225793486,"synopsis":"One of the principles of the Viral Academy is that learning takes place everywhere - it should be embedded in the experience of doing things."},{"slug":"use-conversation-clubs","title":"Use Conversation Clubs","date":1423777847407,"synopsis":"You should have a \"Conversation Clubs\" link on your site from previous steps in the orientation."},{"slug":"user-journeys","title":"User Journeys","date":1423942944110,"synopsis":"Here we tell some stories about how different types of users [[Personas]] may seek to interact with a federated wiki:"},{"slug":"utopia-academy","title":"Utopia Academy","date":1424134839064,"synopsis":"The Utopia Academy is a course designed to explore the idea of \"utopian urbanity\". In plain English this means we will explore through a structured discussion issues about the design and practice of living in an near-future city."},{"slug":"viral-academy","title":"Viral Academy","date":1427128261896,"synopsis":"The Viral Academy is an open distributed education project for offline and online group work. Our aim is to make online learning more social, personalised, and flexible - [http://viral.academy viral.academy]"},{"slug":"viral-academy-course-sites","title":"Viral Academy Course Sites","date":1425393505040,"synopsis":"Here we list all the sites that have been set up to run Viral Academy [[Courses]]."},{"slug":"viral-academy-focus","title":"Viral Academy Focus","date":1498590736252,"synopsis":"Here we document the ever-changing sands of shifting focus that is the Viral Academy. It is time for a consoldation. We have settled on a strange and beautiful platform, and we have refined a strategy. We need to write it down in plain English:"},{"slug":"viral-academy-methodology","title":"Viral Academy Methodology","date":1438680845995,"synopsis":"The [[Viral Academy]] is a P2P framework for creating online and offline learning experiences. Students are encouraged to pass on their learning by the built in [[Learning TimeBank]], which enables us to offer all courses for free to anyone in the world."},{"slug":"vision","title":"Vision","date":1423943241896,"synopsis":"The vision and ideas that we are building into the [[Smallest Federated Wiki]]."},{"slug":"wanderbuch","title":"Wanderbuch","date":1430682233012,"synopsis":"A [[Journeyman]] would be required to keep a journal or [[Wanderbuch]]. This would often serve as both passport and a resumé - [http://www.peterspioneers.com/wanderbuch.htm peterspioneers.com]"},{"slug":"wants-and-needs","title":"Wants and Needs","date":1423658546206,"synopsis":"These are ideas that we've thought about over and over but not done yet. Soon. See also [[Finished Work]]. Colleagues are welcome to [[Submit Changes]]."},{"slug":"welcome-visitors","title":"Welcome Visitors","date":1498590809607,"synopsis":"This [[Federated Wiki]] site is a synthesis of ideas and material the we work on in the [[Viral Academy]]. Take a look at [[Recent Changes]] to see what we are [[Currently Working On]]."},{"slug":"what-the-heck-do-we-call-fedwiki-pieces","title":"What The Heck Do We Call FedWiki Pieces?","date":1423961260420,"synopsis":"This thing I am creating, writing into, one atomic unit, one building block of a Federated Wiki- what do we call it?"},{"slug":"why-to-wiki","title":"Why to Wiki","date":1423940680645,"synopsis":"This is a motivation page, for the educational and pedagogical uses of wiki-writing and refactoring."},{"slug":"wiki-essay","title":"Wiki Essay","date":1425296904453,"synopsis":"A wiki-essay is a cluster of wiki-pages (notes), that forms a coherent and complete whole. A wiki-essay is of particular use in setting [[Assignments]], but it also of use to a reader when looking to familiarise herself with an new area."},{"slug":"wiki-minimap","title":"Wiki Minimap","date":1425297933127,"synopsis":"An wiki-minimap is a type [[Minimap]] that serves to define the bounds and scope of a collection of wiki-notes."},{"slug":"wiki-page","title":"Wiki Page","date":1423909301991,"synopsis":"A wiki page (think wikipedia page) - is content specifically designed to be easily authored and combined with other similarly formatted pages to be viewed as a hypertext."},{"slug":"wiki-writing-style","title":"Wiki Writing Style","date":1423576556210,"synopsis":"[[Wiki Writing Style]]"},{"slug":"worksheet-template","title":"Worksheet Template","date":1425226980711,"synopsis":"Use this worksheet as a guide through the self-paced phases of our History of Hypertext [[Assignments]]."},{"slug":"worksheet-template-considered","title":"Worksheet Template Considered","date":1425236450912,"synopsis":"We are challenged to learn a subject, a technology and a pedagogy all at once. Perhaps a worksheet will help."},{"slug":"wrap-data-with-visualisation","title":"Wrap Data with Visualisation","date":1427710123493,"synopsis":"The [[Smallest Federated Wiki]] is designed around the idea of data, or [[Linked Data]] to be precise. Every paragraph, that is every item in a wiki panel or [[Wiki Story]] is data (a [[JSON Object]])."},{"slug":"yellow-halo-of-death","title":"Yellow Halo of Death","date":1423588430002,"synopsis":"Sometimes a yellow halo will appear around your document. Other times you may find that your site has different content on your browser than on someone else's."}]