[{"slug":"adversarial-review","title":"Adversarial review","date":1496668593889,"synopsis":"Adversarial review is the process by which some law, hypothesis, or proposal is reviewed by its author's adversaries - [https://en.wikipedia.org/wiki/Adversarial_review wikipedia]"},{"slug":"alexandra-elbakyan","title":"Alexandra Elbakyan","date":1529669544756,"synopsis":"Alexandra Asanovna Elbakyan is a Kazakhstani graduate student, computer programmer, internet pirate in hiding, and the creator of the site Sci-Hub. Nature has listed her in 2016 in the top ten people that mattered in science and Ars Technica has compared her to Aaron Swartz and the New York Times has compared her to Edward Snowden. - [https://en.wikipedia.org/wiki/Alexandra_Elbakyan wikipedia]"},{"slug":"argument-map","title":"Argument map","date":1528187390196,"synopsis":"In informal logic and philosophy, an argument map or argument diagram is a visual representation of the structure of an argument - [https://en.wikipedia.org/wiki/Argument_map wikipedia]"},{"slug":"author-level-metrics","title":"Author-level metrics","date":1496668581630,"synopsis":"Author-level metrics are citation metrics that measure the bibliometric impact of individual authors, researchers, academics, and scholars. A prime example is the h-index. Other metrics originally developed for academic journals can be reported at researcher level, such as the author-level eigenfactor and the author impact factor - [https://en.wikipedia.org/wiki/Author-level_metrics wikipedia]"},{"slug":"bad-pharma","title":"Bad Pharma","date":1496690711029,"synopsis":"Bad Pharma: How Drug Companies Mislead Doctors and Harm Patients is a book by the British physician and academic Ben Goldacre about the pharmaceutical industry, its relationship with the medical profession, and the extent to which it controls academic research into its own products. It was published in the UK in September 2012 by the Fourth Estate imprint of HarperCollins, and in the United States in February 2013 by Faber and Faber - [https://en.wikipedia.org/wiki/Bad_Pharma wikipedia]"},{"slug":"bad-science-book","title":"Bad Science (book)","date":1496690728002,"synopsis":"Bad Science is a book by Ben Goldacre, criticising mainstream media reporting on health and science issues. It was published by Fourth Estate in September 2008. It has been positively reviewed by the British Medical Journal and the Daily Telegraph and has reached the Top 10 bestseller list for Amazon Books. It was shortlisted for the 2009 Samuel Johnson Prize. Bad Science or BadScience is also the title of Goldacre's column in The Guardian and his website - [https://en.wikipedia.org/wiki/Bad_Science_(book) wikipedia]"},{"slug":"bealls-list","title":"Beall's List","date":1515514709267,"synopsis":"In academic publishing, predatory open access publishing is an exploitative open-access publishing business model that involves charging publication fees to authors without providing the editorial and publishing services associated with legitimate journals (open access or not) - [https://en.wikipedia.org/wiki/Predatory_open_access_publishing wikipedia]"},{"slug":"biodiversity-foundation","title":"Biodiversity Foundation","date":1512485331733,"synopsis":"In 1996, [[E.O Wilson]] officially retired from Harvard University, where he continues to hold the positions of Professor Emeritus and Honorary Curator in Entomology. He founded the E.O. Wilson Biodiversity Foundation, which finances the PEN/E. O. Wilson Literary Science Writing Award and is an \"independent foundation\" at the Nicholas School of the Environment, Duke University. Wilson became a special lecturer at Duke University as part of the agreement."},{"slug":"biological-materials-transfer-project","title":"Biological Materials Transfer Project","date":1436211009834,"synopsis":"The [[Biological Materials Transfer Project]] (MTA) developed and deployed standard, modular contracts to lower the costs of transferring biological materials such as DNA, cell lines, model animals and more - [https://en.wikipedia.org/wiki/Science_Commons#Biological_Materials_Transfer_Project wikipedia]"},{"slug":"blockchain-for-science","title":"Blockchain for Science","date":1524322593219,"synopsis":"A page with 2 items."},{"slug":"bogus-journals","title":"Bogus Journals","date":1417534690998,"synopsis":"The Bogus Academic Journal Racket Is Officially Out of Control, By Rebecca Schuman. [http://www.slate.com/blogs/browbeat/2014/11/24/bogus_academic_journal_accepts_paper_that_reads_get_me_off_your_fucking.html slate]"},{"slug":"bret-victor","title":"Bret Victor","date":1469879485974,"synopsis":"Bret Victor worked at Apple (2007-2010) as a member of the “HID Proto” future-interface prototyping team, designing UI concepts for experimental hardware platforms."},{"slug":"bruno-latour","title":"Bruno Latour","date":1470389020098,"synopsis":"Bruno Latour is a philosopher of science and sympathetic critic of [[Deep Ecology]], which he seeks to replace with a [[Political Ecology]]. I sometimes blog about these things over at [http://parliamentofthings.org parliamentofthings.org]."},{"slug":"budapest-open-access-initiative--budapest-open-access","title":"Budapest Open Access Initiative | Budapest Open Access","date":1524304794231,"synopsis":"The Budapest Open Access Initiative: an international effort to make research articles in all academic fields freely available on the internet- [http://www.budapestopenaccessinitiative.org/ budapestopenaccessinitiative.org]"},{"slug":"cafe-scientifique","title":"Cafe Scientifique","date":1524294863138,"synopsis":"[[Cafe Scientifique]] is a place where, for the price of a cup of coffee or a glass of wine, anyone can come to explore the latest ideas in science and technology. Meetings take place in cafes, bars, restaurants and even theatres, but always outside a traditional academic context - [http://www.cafescientifique.org/ cafescientifique.org]"},{"slug":"catcall-research-methods","title":"Catcall Research Methods","date":1415982408785,"synopsis":"The recent \"catcalling\" video is a good demonstration of why research methods matter for everyone, not just scientists. Increasingly the public is presented with data that has the appearance and tone of science, but lacks the rigor.  This can lead to misunderstandings of what data means. (See Zeynep Tufekci's post:[https://medium.com/message/that-catcalling-video-and-why-research-methods-is-such-an-exciting-topic-really-32223ac9c9e8 html])"},{"slug":"changes-to-this-site","title":"Changes to this Site","date":1434532209841,"synopsis":"Below we list recent changes to this site only without also listing changes from the [[Neighbourhood]]:"},{"slug":"citation","title":"Citation","date":1510609737208,"synopsis":"Broadly, a citation is a reference to a published or unpublished source (not always the original source). More precisely, a citation is an abbreviated alphanumeric expression embedded in the body of an intellectual work that denotes an entry in the bibliographic references section of the work for the purpose of acknowledging the relevance of the works of others to the topic of discussion at the spot where the citation appears. Generally the combination of both the in-body citation and the bibliographic entry constitutes what is commonly thought of as a c"},{"slug":"citation-index","title":"Citation Index","date":1426177908222,"synopsis":"A citation index is a kind of bibliographic database, an index of citations between publications, allowing the user to easily establish which later documents cite which earlier documents."},{"slug":"citoid","title":"Citoid","date":1524308788893,"synopsis":"Citoid is a stateless node service on the SCB cluster. It processes HTTP requests containing a URL or ISBN number by retrieving citation information from external sources with help from a local XULrunner-based Zotero server. It responds with a JSON structure containing the citation information - [https://wikitech.wikimedia.org/wiki/Citoid wikitech.wikimedia.org]"},{"slug":"collaborative-research-in-science","title":"Collaborative Research in Science","date":1470907454362,"synopsis":"Here we look at the importance and issue of collaborative research in science."},{"slug":"commons-server","title":"Commons server","date":1523714004943,"synopsis":"It is designed to be able to host a small number of individual federated wiki sites for a community of authors or cooperative."},{"slug":"compendium-software","title":"Compendium (software)","date":1470316009292,"synopsis":"Compendium is a computer program and social science tool that facilitates the mapping and management of ideas and arguments. The software provides a visual environment that allows people to structure and record collaboration as they discuss and work through 'wicked problems' - [https://en.wikipedia.org/wiki/Compendium_(software) wikipedia]"},{"slug":"conflict-free-replicated-data-type","title":"Conflict-free replicated data type","date":1524315781073,"synopsis":"In distributed computing, a conflict-free replicated data type (CRDT) is a data structure which can be replicated across multiple computers in a network, where the replicas can be updated independently and concurrently without coordination between the replicas, and where it is always mathematically possible to resolve inconsistencies which might result. - [https://en.wikipedia.org/wiki/Conflict-free_replicated_data_type wikipedia]"},{"slug":"corin-logan-logancorina--twitter","title":"Corinⓐ Logan (@LoganCorina) | Twitter","date":1524304920094,"synopsis":"The latest Tweets from Corinⓐ Logan (@LoganCorina)."},{"slug":"darvoz","title":"Darvoz","date":1521797840159,"synopsis":"[[Darvoz]] is Portuguese for \"to give voice\"."},{"slug":"data-science-trello-board","title":"Data Science Trello Board","date":1450556617897,"synopsis":"Having collected data science resources for years, Thai has now updated his collection and placed them into a neat Trello list, open to all. [http://www.datasciencecentral.com/profiles/blogs/huge-trello-list-of-great-data-science-resources post] [https://trello.com/b/rbpEfMld/data-science trello]"},{"slug":"decentralised-media-commons","title":"Decentralised Media Commons","date":1502550713381,"synopsis":"The Decentralised Media Archive aims to fulfil the same function as [[Wikimedia Commons]] but for the decentralised or permanent web."},{"slug":"deip","title":"DEIP","date":1527761595749,"synopsis":"Crypto-economic platform for open investment, production and dissemination of science."},{"slug":"discover-dimensions-but-specify-limits","title":"Discover Dimensions but Specify Limits","date":1349297972181,"synopsis":"An example radar chart were the dimensions  are discovered from available data but a single limit is specified for all dimensions. See [[About Radar Plugin]] for more options."},{"slug":"ehud-shapiro","title":"Ehud Shapiro","date":1512240942129,"synopsis":"Ehud Shapiro is a multi-disciplinary scientist, artist, entrepreneur and a Professor of Computer Science and Biology at the Weizmann Institute of Science - [https://en.wikipedia.org/wiki/Ehud_Shapiro wikipedia]"},{"slug":"episteme","title":"Episteme","date":1471702384874,"synopsis":"Episteme means knowledge, as in \"justified true belief\" in the terminology of the philosopher Plato. It is etymologically derived from the Ancient Greek word ἐπιστήμη for knowledge or science, which comes from the verb ἐπίσταμαι, \"to know\". Episteme as knowledge contrasts doxa, Plato's term for common belief or opinion. Episteme is distinguished from techne, which is knowledge in an applied way as in a craft. The word epistemology, means the study of knowledge, and is derived from episteme - [https://en.wikipedia.org/wiki/Episteme wikipedia]"},{"slug":"epistemology","title":"Epistemology","date":1530173970047,"synopsis":"Epistemology is the branch of philosophy concerned with the theory of knowledge. - [https://en.wikipedia.org/wiki/Epistemology wikipedia]"},{"slug":"eternity-wall","title":"Eternity Wall","date":1496770749488,"synopsis":"At Eternity Wall we think putting hash of data in the blockchain and putting the data themselves are two completely different things - [https://eternitywall.com/ eternitywall.com]"},{"slug":"evidence-based-medicine","title":"Evidence-based medicine","date":1496689325650,"synopsis":"Evidence-based medicine (EBM) is an approach to medical practice intended to optimize decision-making by emphasizing the use of evidence from well-designed and well-conducted research. Although all medicine based on science has some degree of empirical support, EBM goes further, classifying evidence by its epistemologic strength and requiring that only the strongest types (coming from meta-analyses, systematic reviews, and randomized controlled trials) can yield strong recommendations; weaker types (such as from case-control studies) can yield only weak "},{"slug":"fair-data","title":"FAIR Data","date":1524311374088,"synopsis":"Distribution begets centralisation."},{"slug":"federated-data","title":"Federated Data","date":1525945849159,"synopsis":"Liquid Democracy is a combination of [[Direct Democracy]], and [[Representative Democracy]]. It aims to create a more flexible and fluid way for people to express their [[Democratic Preference]].kdsfjhfsadijh"},{"slug":"fedwiki-tools","title":"Fedwiki Tools","date":1524393496785,"synopsis":"Here we list a few tools that are of particular use in managing and creating [[Fedwiki]] content. For a full list of transporters navigate to the site below:"},{"slug":"frankl","title":"Frankl","date":1524316588591,"synopsis":"@drbrocktagon Dr Jon Brock"},{"slug":"functional-specification","title":"Functional Specification","date":1524304842065,"synopsis":"A functional specification describes how a product will work entirely from the user's perspective. It doesn't care how the thing is implemented. It talks about features. It specifies screens, menus, dialogs, and so on - [http://www.joelonsoftware.com/articles/fog0000000035.html joelonsoftware.com]"},{"slug":"hackteria","title":"Hackteria","date":1457269997143,"synopsis":"Hackteria is a web platform and collection of open source Biological Art projects instigated in February 2009 by Andy Gracie, Marc Dusseiller and Yashas Shetty, after collaboration during the Interactivos?09 Garage Science at Medialab Prado in Madrid - [https://en.wikipedia.org/wiki/Hackteria wikipedia]"},{"slug":"how-we-find-data","title":"How We Find Data","date":1525945865410,"synopsis":"Pages from many sites can find each other when they arrive together in a browser and at that moment connect  data to computations and computations to visualizations. Here we explain how that happens."},{"slug":"how-we-find-even-more-data","title":"How We Find Even More Data","date":1527685193107,"synopsis":"This page has more data that illustrates how the Radar Plugin can be used to compare things on multiple dimensions. See [[How We Find Data]]"},{"slug":"impactstory","title":"ImpactStory","date":1529669608427,"synopsis":"ImpactStory is an open source, web-based tool that provides altmetrics to help researchers measure and share the impacts of all their research outputs—from traditional ones such as journal articles, to alternative research outputs such as blog posts, datasets, and software. It aims to change the focus of the scholarly reward system to value and encourage web-native scholarship. ImpactStory is a nonprofit organisation funded by the Alfred P. Sloan Foundation and the National Science Foundation. - [https://en.wikipedia.org/wiki/ImpactStory wikipedia]"},{"slug":"importantconcepts","title":"Important_concepts","date":1529674571624,"synopsis":"Social constructions are human created ideas, objects, or events created by a series of choices and interactions.[ Science Technology and Society] These interactions have consequences that change the perception that different groups of people have on these constructs. Some examples of social construction include class, race, money, and citizenship - [https://en.wikipedia.org/wiki/Science_And_Technology_Studies#Important_concepts wikipedia]"},{"slug":"incentivising-sharing","title":"Incentivising Sharing","date":1496664844513,"synopsis":"Here we explore our current publishing structures and how these can be modified to incentivise sharing."},{"slug":"invalid-science","title":"Invalid science","date":1496690772045,"synopsis":"Invalid science consists of scientific claims based on experiments that cannot be reproduced or that are contradicted by experiments that can be reproduced. Recent analyses indicate that the proportion of invalid claims in the scientific literature is steadily increasing. The number of retractions has grown tenfold over the past decade. But they still make up no more than 0.2% of the 1.4m papers published annually in scholarly journals - [https://en.wikipedia.org/wiki/Invalid_science wikipedia]"},{"slug":"is-the-staggeringly-profitable-business-of-scientific-publishing-bad-for-science","title":"Is the staggeringly profitable business of scientific publishing bad for science?","date":1524304455190,"synopsis":"The long read: It is an industry like no other, with profit margins to rival Google – and it was created by one of Britain’s most notorious tycoons: Robert Maxwell- [https://www.theguardian.com/science/2017/jun/27/profitable-business-scientific-publishing-bad-for-science theguardian.com]"},{"slug":"karl-popper","title":"Karl Popper","date":1469276327353,"synopsis":"Sir Karl Raimund Popper CH FBA FRS (28 July 1902 – 17 September 1994) was an Austrian-British philosopher and professor. He is generally regarded as one of the greatest philosophers of science of the 20th century - [https://en.wikipedia.org/wiki/Karl_Popper wikipedia]"},{"slug":"kleins-list","title":"Klein's List","date":1426171309687,"synopsis":"Many of the ideas explored on this site were spawned from Samuel Klein's response. [http://lists.wikimedia.org/pipermail/wiki-research-l/2012-September/002337.html email]"},{"slug":"kubeless","title":"Kubeless","date":1524355660325,"synopsis":"kubeless is a Kubernetes-native serverless framework that lets you deploy small bits of code without having to worry about the underlying infrastructure plumbing. It leverages Kubernetes resources to provide auto-scaling, API routing, monitoring, troubleshooting and more."},{"slug":"leslie-lamport","title":"Leslie Lamport","date":1527523715479,"synopsis":"Leslie B. Lamport (born February 7, 1941) is an American computer scientist. Lamport is best known for his seminal work in distributed systems and as the initial developer of the document preparation system LaTeX - [https://en.wikipedia.org/wiki/Leslie_lamport wikipedia]"},{"slug":"linked-data","title":"Linked Data","date":1436210610390,"synopsis":"In computing, linked data (often capitalized as Linked Data) describes a method of publishing structured data so that it can be interlinked and become more useful through semantic queries - [https://en.wikipedia.org/wiki/Linked_data wikipedia]"},{"slug":"liquid-democracy","title":"Liquid Democracy","date":1527523628192,"synopsis":"Liquid Democracy is a combination of [[Direct Democracy]], and [[Representative Democracy]]. It aims to create a more flexible and fluid way for people to express their [[Democratic Preference]]."},{"slug":"liquid-peer-review","title":"Liquid Peer Review","date":1524399218584,"synopsis":"Liquid Peer Review is the application of [[Liquid Democracy]] to [[peer review]]."},{"slug":"liquid-wiki","title":"Liquid Wiki","date":1524398058886,"synopsis":"A key sprint aim of the [[Holo Sprintathon]] week will be to implement a version of Federated Wiki on [[Holo]], which has been christened [[Liquid Wiki]]."},{"slug":"living-journal","title":"Living Journal","date":1524389629332,"synopsis":"A page with 0 items."},{"slug":"map-of-science","title":"Map of Science","date":1527511188889,"synopsis":"Science mapping, at its most basic, is a combination of classification and visualization."},{"slug":"maven-index","title":"Maven Index","date":1496914248329,"synopsis":"A [[Maven Index]] is a reputation metric derived from the success of an individual in knowledgeably assessing the quality of other peoples scientific work."},{"slug":"maven-science","title":"Maven Science","date":1536151208809,"synopsis":"Maven.science is the application of the scientific methodology to the institutions of science. It takes an understanding of complexity science, anthropology, knowledge modelling, artificial intelligence, management science, cybernetics, and applies it pragmatically to the institutional knowledge flows of science itself."},{"slug":"mnemoscene","title":"Mnemoscene","date":1524315951528,"synopsis":"Based in Brighton - opensource viewer of cultural heritage content."},{"slug":"mozilla-science-lab","title":"Mozilla Science Lab","date":1458846176594,"synopsis":"Join our next project call, Thursday, March 24th at 12pm ET, to learn how you can get involved in open source and open science! Each month, we celebrate new contributors, hear updates on our Collaborate projects, and share tips on working openly and collaboratively on research software."},{"slug":"new-front-matter-to-science","title":"New Front Matter to Science","date":1449421844643,"synopsis":"Wikipedia as the Front Matter to All Research. A brown bag talk on scholarly citations on Wikipedia with Geoffrey Bilder (CrossRef) and Dario Taraborelli (Wikimedia Foundation)."},{"slug":"no-copyright-law-the-real-reason-for-germanys-industrial","title":"No Copyright Law: The Real Reason for Germany's Industrial","date":1524304539896,"synopsis":"Did Germany experience rapid industrial expansion in the 19th century due to an absence of copyright law? A German historian argues that the massive proliferation of books, and thus knowledge, laid the foundation for the country's industrial might- [http://www.spiegel.de/international/zeitgeist/no-copyright-law-the-real-reason-for-germany-s-industrial-expansion-a-710976.html spiegel.de]"},{"slug":"normative-science","title":"Normative science","date":1509638412106,"synopsis":"In the applied sciences, normative science is a type of information that is developed, presented, or interpreted based on an assumed, usually unstated, preference for a particular policy or class of policies. Regular or traditional science does not presuppose a policy preference, but normative science, by definition, does - [https://en.wikipedia.org/wiki/Normative_science wikipedia]"},{"slug":"null-result","title":"Null result","date":1496690962788,"synopsis":"In science, a null result is a result without the expected content: that is, the proposed result is absent. It is an experimental outcome which does not show an otherwise expected effect. This does not imply a result of zero or nothing, simply a result that does not support the hypothesis. The term is a translation of the scientific Latin nullus resultarum, meaning \"no consequence\" - [https://en.wikipedia.org/wiki/Null_result wikipedia]"},{"slug":"nullius-in-verba","title":"Nullius in verba","date":1524316545246,"synopsis":"Nullius in verba is the motto of the Royal Society. John Evelyn and other Fellows of the Royal Society chose the motto soon after the founding of the Society. - [https://en.wikipedia.org/wiki/Nullius_in_verba wikipedia]"},{"slug":"observable","title":"Observable","date":1518012340974,"synopsis":"@mbostock offers a five minute introduction: [https://beta.observablehq.com/@mbostock/five-minute-introduction link]"},{"slug":"observation-inseparable-from-theory","title":"Observation inseparable from theory","date":1529673614926,"synopsis":"Observations that cannot be separated from theoretical interpretation are said to be [[theory-laden]]."},{"slug":"one-garden-one-planet","title":"One Garden One Planet","date":1501718842784,"synopsis":"'One Garden One Planet' is an experimental method to explore how the science of [[Conservation Biology]] is diffused. It takes the study of practical [[Conservation]] and examines its [[Knowledge Management]] challenges."},{"slug":"open-access-journal","title":"Open access journal","date":1515514415244,"synopsis":"Open access (OA) journals are scholarly journals that are available online to the reader \"without financial, legal, or technical barriers other than those inseparable from gaining access to the internet itself.\" They remove price barriers (e.g. subscription, licensing fees, pay-per-view fees) and most permission barriers (e.g. copyright and licensing restrictions). While open access journals are freely available to the reader, there are still costs associated with the publication and production of such journals. Some are subsidized, and some require paym"},{"slug":"open-data-in-science","title":"Open data in science","date":1466251225587,"synopsis":"The concept of \"open access to scientific data\" was institutionally established with the formation of the [[World Data Center]] system, in preparation for the [[International Geophysical Year]] of 1957–1958 - [http://books.nap.edu/openbook.php?record_id=11991&page=6 books.nap.edu]"},{"slug":"open-peer-review","title":"Open Peer Review","date":1496691752779,"synopsis":"Open peer review (also called \"public peer review\", \"transparent peer review\") denotes several, closely related forms of scholarly peer review - [https://en.wikipedia.org/wiki/Open_peer_review wikipedia]"},{"slug":"open-science","title":"Open Science","date":1530172520536,"synopsis":"Here we look at open science and teh [[Open Science Ecosystem]]."},{"slug":"open-science-ecosystem","title":"Open Science Ecosystem","date":1530174908111,"synopsis":"Much criticisms of current science practice centres on the publishing process, and practices. On this page we start to examine the problems of science, and potential opportunities for growth by looking at the scientific system as a whole."},{"slug":"open-simulation-archive","title":"Open Simulation Archive","date":1426181466857,"synopsis":"[[Open Simulation Archive]] is an open archive of 3D science models and simulations. This ‚Äúbiomedical 3D warehouse‚Äù would be the science equivalent to Google Warehouse."},{"slug":"orcid","title":"ORCID","date":1436210520895,"synopsis":"ORCID (Open Researcher and Contributor ID) is a nonproprietary alphanumeric code to uniquely identify scientific and other academic authors - [https://en.wikipedia.org/wiki/ORCID wikipedia]"},{"slug":"p5js","title":"p5.js","date":1512650852680,"synopsis":"p5.js looks like an excellent framework and community to work with for building [[simulation]]s into wiki."},{"slug":"pandoc","title":"pandoc","date":1512244517364,"synopsis":"Pandoc is an open-source document converter, widely used as a writing tool (especially by scholars) and as a basis for publishing workflows - [https://en.wikipedia.org/wiki/Pandoc wikipedia]"},{"slug":"peer-review","title":"Peer review","date":1524294917299,"synopsis":"Peer review is the evaluation of work by one or more people of similar competence to the producers of the work (peers). It constitutes a form of self-regulation by qualified members of a profession within the relevant field."},{"slug":"peer-review-scam","title":"Peer Review Scam","date":1417546629857,"synopsis":"Nature News: Publishing: The peer-review scam."},{"slug":"permanent-web","title":"Permanent Web","date":1466863114677,"synopsis":"What is the permanent web? Why is it important? Here we have an initial discussion of the permanent web, and how we can start creating it with a mixture of existing technologies."},{"slug":"permanent-wiki","title":"Permanent Wiki","date":1512466043729,"synopsis":"The permanent wiki is a project to create a new form of internet publishing that balances the dynamic [[Fluid Nature of Wiki]] with the immutable permanence of the [[Permanent Web]]."},{"slug":"philosophy-of-science","title":"Philosophy of science","date":1530173715576,"synopsis":"Philosophy of science is a branch of philosophy concerned with the foundations, methods, and implications of science. The central questions of this study concern what qualifies as science, the reliability of scientific theories, and the ultimate purpose of science. This discipline overlaps with metaphysics, ontology, and epistemology, for example, when it explores the relationship between science and truth - [https://en.wikipedia.org/wiki/Philosophy_of_science wikipedia]"},{"slug":"polkadot","title":"Polkadot","date":1524768262423,"synopsis":"Present-day blockchain architectures all suffer from a number of issues not least practical means of extensi- bility and scalability - [https://polkadot.io/ polkadot.io]"},{"slug":"post-blockchain","title":"Post-blockchain","date":1524389621947,"synopsis":"A post-blockchain architecture is a decentralised architecture that implements many of the ideas of classic blockchains, but with a new twist. Typically this involves replacing [[proof of work]] with another approach."},{"slug":"predatory-open-access-publishing","title":"Predatory open access publishing","date":1515514612951,"synopsis":"In academic publishing, predatory open-access publishing is an exploitative open-access publishing business model that involves charging publication fees to authors without providing the editorial and publishing services associated with legitimate journals (open access or not) - [https://en.wikipedia.org/wiki/Predatory_open_access_publishing wikipedia]"},{"slug":"public-library-of-science","title":"Public Library of Science","date":1505828365210,"synopsis":"PLOS logo. [https://upload.wikimedia.org/wikipedia/commons/thumb/a/a0/PLoS_logo.svg/179px-PLoS_logo.svg.png source]"},{"slug":"publishing-platform","title":"Publishing Platform","date":1524322578990,"synopsis":"The aim of this project is to create,  or ideally collaborate with institutions and publishers to co-create, an decentralised open scientific publishing platform."},{"slug":"redefining-liquid-democracy","title":"Redefining Liquid Democracy","date":1527523628194,"synopsis":"ljoiasfoid"},{"slug":"related-sites","title":"Related Sites","date":1535886925997,"synopsis":"Here we list sites that are related in some way to the current site:"},{"slug":"replication-crisis","title":"Replication crisis","date":1496689307874,"synopsis":"The replication crisis (or replicability crisis) refers to a methodological crisis in science in which scientists have found that the results of many scientific experiments are difficult or impossible to replicate on subsequent investigation, either by independent researchers or by the original researchers themselves. While the crisis has long-standing roots, the phrase was coined in the early 2010s as part of a growing awareness of the problem - [https://en.wikipedia.org/wiki/Replication_crisis wikipedia]"},{"slug":"reproducibility-project","title":"Reproducibility Project","date":1496689414140,"synopsis":"The Reproducibility Project: Psychology was a collaboration of 270 contributing authors to repeat 100 published experimental and correlational psychological studies. This project was led by the Center for Open Science and its co-founder, Brian Nosek, who started the project in November 2011. The results of this collaboration were published in August 2015. Reproducibility is the ability to produce a copy or duplicate, in this case it is the ability to replicate the results of the original studies. The project has illustrated the growing problem of failed "},{"slug":"richard-dawkins","title":"Richard Dawkins","date":1470128820025,"synopsis":"Richard Dawkins (born 26 March 1941) is an English ethologist, evolutionary biologist and author. He is an emeritus fellow of New College, Oxford, and was the University of Oxford's Professor for Public Understanding of Science from 1995 until 2008 - [https://en.wikipedia.org/wiki/Richard_Dawkins wikipedia]"},{"slug":"royal-society","title":"Royal Society","date":1470904961948,"synopsis":"The President, Council, and Fellows of the Royal Society of London for Improving Natural Knowledge, commonly known as the Royal Society, is a learned society for science and is possibly the oldest such society still in existence - [https://en.wikipedia.org/wiki/Royal_Society wikipedia]"},{"slug":"sci-hub","title":"Sci-Hub","date":1529672506526,"synopsis":"Sci-Hub is a website with over 67 million academic papers and articles available for direct download. It bypasses publisher paywalls by allowing access through educational institution proxies. Sci-Hub stores papers in its own cache to speed up future requests. - [https://en.wikipedia.org/wiki/Sci-Hub wikipedia]"},{"slug":"science-and-technology-studies","title":"Science and technology studies","date":1529674556358,"synopsis":"Science and technology studies, or science, technology and society studies is the study of how society, politics, and culture affect scientific research and technological innovation, and how these, in turn, affect society, politics and culture. - [https://en.wikipedia.org/wiki/Science_and_technology_studies wikipedia]"},{"slug":"science-commons","title":"Science Commons","date":1524294415405,"synopsis":"Science Commons (SC) was a Creative Commons project for designing strategies and tools for faster, more efficient web-enabled scientific research."},{"slug":"science-in-public","title":"Science in Public","date":1426179525793,"synopsis":"How, how much, and why science should be conducted in public. Notes from the Mozilla open Science Call can be found here [https://etherpad.mozilla.org/sciencelab-calls-mar12-2015 etherpad]"},{"slug":"science-publishing","title":"Science Publishing","date":1498196015666,"synopsis":"Below are a collection of links imported from [[OneTab]]. You can view these links here - [https://www.one-tab.com/page/QEOeJXGnRP6TijMxvsQ4Dw one-tab.com]:"},{"slug":"science-wars","title":"Science wars","date":1529674473468,"synopsis":"The science wars were a series of intellectual exchanges, between scientific realists and postmodernist critics, about the nature of scientific theory and intellectual inquiry. They took place principally in the United States in the 1990s in the academic and mainstream press."},{"slug":"scientific-errors","title":"Scientific Errors","date":1470236692067,"synopsis":"Here we look at errors in science and scientific publishing. Scientific institutions are just one more example of the [[Medieval Institutions]] that surround us."},{"slug":"scientific-institution","title":"Scientific Institution","date":1426181320533,"synopsis":"What sort of organisational structure is best suited to science? What type of organisational structure would we end up with if we applied rigorous scientific principles to the organisational basis of science?"},{"slug":"scientific-journals-for-null-results","title":"Scientific journals for null results","date":1496690971939,"synopsis":"There are now several scientific journals dedicated to the publication of negative or null results, including the following: - [https://en.wikipedia.org/wiki/Null_result#scientific_journals_for_null_results#Scientific_journals_for_null_results wikipedia]"},{"slug":"scientific-method","title":"Scientific method","date":1496689486170,"synopsis":"The scientific method is a body of techniques for investigating phenomena, acquiring new knowledge, or correcting and integrating previous knowledge. To be termed scientific, a method of inquiry is commonly based on empirical or measurable evidence subject to specific principles of reasoning. The Oxford Dictionaries Online define the scientific method as \"a method or procedure that has characterized natural science since the 17th century, consisting in systematic observation, measurement, and experiment, and the formulation, testing, and modification of "},{"slug":"scitopia","title":"SciTopia","date":1426155463631,"synopsis":"[[SciTopia]] is a science project (originally proposed to the Welcome Trust in 2012), that looks to create a new form of [[Scientific Institution]], based on an analysis of the activities and practice of real world science."},{"slug":"shuttleworth-foundation","title":"Shuttleworth Foundation","date":1524305411444,"synopsis":"The Shuttleworth Foundation was established in January 2001 by South African entrepreneur Mark Shuttleworth as an experiment with the purpose of providing funding for people engaged in social change. While there have been various iterations of the foundation, its structure and how it invests in social innovation, the current model employs a fellowship model where fellows are given funding commensurate with their experience to match a year's salary, allowing them to spend that year developing a particular idea. - [https://en.wikipedia.org/wiki/Shuttlewort"},{"slug":"simulation","title":"Simulation","date":1525955943924,"synopsis":"Simulation is the imitation of the operation of a real-world process or system over time.  We look here at how we might create and include robust simulations in the [[permanent web]]."},{"slug":"snapshot-publishing","title":"Snapshot Publishing","date":1524398500443,"synopsis":"Here we outline and specify tools of taking snapshots of dynamic time stamped science contributions, and publishing them as an academic journal:"},{"slug":"sociology-of-scientific-knowledge","title":"Sociology of scientific knowledge","date":1529674223773,"synopsis":"The sociology of scientific knowledge (SSK) is the study of science as a social activity, especially dealing with \"the social conditions and effects of science, and with the social structures and processes of scientific activity.\" The sociology of scientific ignorance (SSI) is complementary to the sociology of scientific knowledge. For comparison, the sociology of knowledge studies the impact of human knowledge and the prevailing ideas on societies and relations between knowledge and the social context within which it arises. - [https://en.wikipedia.org/"},{"slug":"software-for-science","title":"Software for Science","date":1426181694592,"synopsis":"Here we list some interesting projects and software in science:"},{"slug":"tektology","title":"Tektology","date":1426007295055,"synopsis":"Tektology is regarded a precursor of system science. I'm proposing reusing this term for a new science of topographical representation of fluid, but stable complexes of thought."},{"slug":"the-part-time-parliament","title":"The Part Time Parliament","date":1466347146026,"synopsis":"This is a funny, but important story for science and anyone interested noth in how academic pubishing works, and how we might improve it."},{"slug":"trust-situated-knowing","title":"Trust Situated Knowing","date":1508779866213,"synopsis":"Modern science, economics, law and other fields often purport that their forms of knowledge are more or less universal and invariant to which individual experience, subjective insights, and local knowledge must be subordinated as less reliable and useful."},{"slug":"welcome-visitors","title":"Welcome Visitors","date":1538755222237,"synopsis":"Here we research and specify the design of the decentralised open access [[Publishing Platform]] for [[Platform Earth]]."},{"slug":"wikidata-for-research","title":"Wikidata for Research","date":1417798227066,"synopsis":"... we plan to draft a proposal that aims at establishing Wikidata as a central hub for linked open research data more generally, so that it can facilitate fruitful interactions at scale between professional research institutions and citizen science and knowledge initiatives. We plan to draft this proposal in public – you can join us and help develop it via a dedicated page on Wikidata. [http://blog.wikimedia.de/2014/12/05/wikidata-for-research-a-grant-proposal-that-anyone-can-edit/ post]"},{"slug":"zotero","title":"Zotero","date":1510508565630,"synopsis":"Zotero is software for managing bibliographic and other reference material, usually in research contexts. It is quite an agile tool, not only for storage of references but also for generation of citations, footnotes, bibliographies and reference lists in many formats - [https://en.wikipedia.org/wiki/Zotero wikipedia]"},{"slug":"netlify","title":"Netlify","date":1534374678017,"synopsis":"Netlify can be used both from a web UI or by using command line tools. You can create unlimited domains with the free account. For $45 a month you get team sharing, administrator roles, visitor password control, and email and chat support."},{"slug":"netlify-earth","title":"Netlify Earth","date":1537981840727,"synopsis":"Here we research more on using [[Netlify]] for [[Platform Earth]]. Here we look at creating a simple HTML site from a github project."},{"slug":"netlify-app","title":"Netlify App","date":1538042429242,"synopsis":"The [[Netlify]] App is a web application that allows you to easily create new sites from HTML you have uploaded to [[Github]]."},{"slug":"federated-wiki--dat","title":"Federated Wiki + Dat","date":1537960305824,"synopsis":"There has been an interest in making use of Dat with Federated Wiki for sometime. This includes both for working with external data, and as a different way of storing wiki pages. Here we track these uses."},{"slug":"charts","title":"Charts","date":1538754659694,"synopsis":"Here we look at how we might use existing services to make beautiful and dynamic graphs and charts."}]