[{"slug":"about-activity-plugin","title":"About Activity Plugin","date":1465566839751,"synopsis":"The Activity plugin lists pages in your neighborhood. It expand as your neighborhood grows. Page names used on multiple sites are grouped together with the most current site listed first. Read [[More About Activity Plugin]]."},{"slug":"aeration","title":"Aeration","date":1466190328702,"synopsis":"Aeration (also called aerification) is the process by which air is circulated through, mixed with or dissolved in a liquid or substance - [https://en.wikipedia.org/wiki/Aeration wikipedia]"},{"slug":"apache","title":"Apache","date":1466664957279,"synopsis":"Interesting indeed that ancient words, span many periods with different meanings. One mans open source server software, is another mans Western, or spiritual story."},{"slug":"asian-american","title":"Asian American","date":1466616477143,"synopsis":"Asian Americans are Americans of Asian descent. The term refers to a panethnic group that includes diverse populations who have ancestral origins in East Asia, Southeast Asia, or South Asia, as defined by the U.S. Census Bureau. This includes people who indicate their race(s) on the census as \"Asian\" or reported entries such as \"Indian\", \"Sri Lankan\", \"Chinese\", \"Filipino\", \"Korean\", \"Japanese\", \"Taiwanese\", \"Vietnamese\", \"Pakistani\", \"Cambodian\", \"Hmong\", or an other Asian group. Asian Americans with no other ancestry comprise 4.8% of the U.S. populatio"},{"slug":"bilbao","title":"Bilbao","date":1466694463135,"synopsis":"Bilbao is a municipality and city in Spain, a major city in the province of Biscay in the autonomous community of the Basque Country - [https://en.wikipedia.org/wiki/Bilbao wikipedia]"},{"slug":"bilbao-commons-researchers","title":"Bilbao Commons Researchers","date":1466708515139,"synopsis":"We start small, and begin to write together about the creation and protection of the commons in [[Bilbao]]:"},{"slug":"bilbao-data-lab","title":"Bilbao Data Lab","date":1466250675395,"synopsis":"We gave a couple of presentations at Bilbao Data Lab, on data visualisation and collaborative research and writing tools."},{"slug":"bilbao-open-server","title":"Bilbao Open Server","date":1466259717917,"synopsis":"The Bilbao Open Server is a proposal that we presented at the [[Bilbao Data Lab]] to create a common shared and sustainable resource, where we can store all and any information regarding [[free culture]] resources and information in and around [[Bilbao]]."},{"slug":"bilbao-writings","title":"Bilbao Writings","date":1466708592568,"synopsis":"Here we can follow recent writings from researchers as [[OSCEDays]] in Bilbao. Here we follow changes from [[Bilbao Commons Researchers]] and [[Projects in Blibao]]"},{"slug":"bilbo-server","title":"Bilbo Server","date":1466259762901,"synopsis":"The \"Bilbo Server\" is named after the original [[Basque]] name for [[Bilbao]]."},{"slug":"bill-mollison","title":"Bill Mollison","date":1466193121971,"synopsis":"Bruce Charles \"Bill\" Mollison (born 1928 in Stanley, Tasmania) is an Australian researcher, author, scientist, teacher, and biologist. He is considered to be the \"father of permaculture\" (although Joseph Russell Smith was the first to write about a system of permanent agriculture in a book entitled Tree Crops, published in 1929, and also a book from 1910 entitled Breeding and Use of Tree Crops). Permaculture is an integrated system of design which Mollison co-developed with David Holmgren, and it encompasses not only agriculture, horticulture, architectu"},{"slug":"bio-commons-camp","title":"Bio-Commons Camp","date":1466598667656,"synopsis":"First day at the bio-commons camp at the Rural Hub in Italy."},{"slug":"birika-food-currency","title":"Birika Food Currency","date":1466185606278,"synopsis":"We began a discussion regarding the creation of a blockchain based food currency for Bilbao."},{"slug":"birika-permacultura","title":"Birika Permacultura","date":1465821038736,"synopsis":"The Birika Permacultura project seeks to establish land here in Bilbao to grow quality local food sustainably using permaculture principles."},{"slug":"birika-researchers","title":"Birika Researchers","date":1465820816089,"synopsis":"Here we list individuals interested in researching together to support this initiative."},{"slug":"birka-collaborations","title":"Birka Collaborations","date":1465820877246,"synopsis":"Here we begin to make a list of network partners that we are aware of, in order to establish an ongoing [[research group]] with the purpose of sharing knowledge of permaculture, as well as establishing [[businesses models]] based on the shared experience of interactional projects at various stages of development."},{"slug":"bordeaux","title":"Bordeaux","date":1466587632242,"synopsis":"Bordeaux (French pronunciation: ​[bɔʁdo]; Gascon: Bordèu) is a port city on the Garonne River in the Gironde department in southwestern France - [https://en.wikipedia.org/wiki/Bordeaux wikipedia]"},{"slug":"brest-france","title":"Brest, France","date":1466687078294,"synopsis":"Brest is a city in the Finistère département in Brittany in northwestern France. Located in a sheltered position not far from the western tip of the Breton peninsula, and the western extremity of metropolitan France, Brest is an important harbour and the second French military port after Toulon - [https://en.wikipedia.org/wiki/Brest,_France wikipedia]"},{"slug":"carbon-tax","title":"Carbon tax","date":1466617054341,"synopsis":"A carbon tax is a tax levied on the carbon content of fuels. It is a form of carbon pricing. Carbon is present in every hydrocarbon fuel (coal, petroleum, and natural gas) and is released as carbon dioxide - [https://en.wikipedia.org/wiki/Carbon_Tax wikipedia]"},{"slug":"changes-to-this-site","title":"Changes to this Site","date":1434641767059,"synopsis":"Below we list recent changes to this site only without also listing changes from the [[Neighbourhood]]:"},{"slug":"collaboration-map","title":"Collaboration Map","date":1466617711862,"synopsis":"Maps in wiki"},{"slug":"communicating-with-plants","title":"Communicating With Plants","date":1464537512870,"synopsis":"As a start, we are a group of 5 individuals from Bilbao and London who will meetup during from 9-13 June at OSCEdays Bilbao."},{"slug":"core-tenets-and-principles-of-design","title":"Core tenets and principles of design","date":1466193085624,"synopsis":"The three core tenets of permaculture are:[ ] - [https://en.wikipedia.org/wiki/Permaculture#Core_tenets_and_principles_of_design wikipedia]"},{"slug":"culture","title":"Culture","date":1466196228413,"synopsis":"Bilbao has several theatres and concert halls ([[Teatro Arriaga]], Palacio Euskalduna), cinemas, and a regular opera season offered by ABAO (Bilbao Association of Opera Lovers) . The [[Bilbao Symphony Orchestra]] was founded in 1922, its current conductor Günter Neuhold being appointed in 2008. Choral music is very popular in the Basque Country and concerts are offered regularly. The Bilbao Choral Society (Sociedad Coral de Bilbao) was founded in 1886 - [https://en.wikipedia.org/wiki/Bilbao#Culture wikipedia]"},{"slug":"current-topic","title":"Current Topic","date":1465830757617,"synopsis":"[[ARS MEMORIALIS]]"},{"slug":"currently-working-here","title":"Currently Working Here","date":1466185051560,"synopsis":"HERE"},{"slug":"currently-working-on","title":"Currently Working On","date":1466362777399,"synopsis":"Here is a list of [[Recent Changes]] I consider important. View our experiments on the [[Scratch]] page. To clear stuff saved in your browser try [[Local Changes]]."},{"slug":"dante","title":"Dante","date":1466664825117,"synopsis":"A valiant tag. Or do we see two words?"},{"slug":"david-bovill","title":"David Bovill","date":1465551908812,"synopsis":"On this site I write about my experiences of the people and projects I met in [[Bilbao]] as part of [[OSCEDays]]."},{"slug":"diego-plato-hedro","title":"Diego Plato Hedro","date":1466175459203,"synopsis":"Playing with sound in Medellin, Colombia. Did a workshop there."},{"slug":"diverse-communities","title":"Diverse Communities","date":1465553698313,"synopsis":"No project seeking to address [[Complex Problems]] can succeed without the contribution of diverse communities of expertise. Here we describe the nature of the people and contributions we seek to work with."},{"slug":"drone","title":"Drone","date":1468595632940,"synopsis":"So much to say, so little time. To drone on. For me I will be thinking of [[The Sound Of Bees]]."},{"slug":"economy","title":"Economy","date":1466196035451,"synopsis":"Bilbao has been the economic center of the Basque Country ([[Basque Country (autonomous community)]]) since the times of the Consulate, mainly because of commerce in Castilian ([[Castile (historical region)]]) products on the town's port ([[Port of Bilbao]]), but it was not until the 19th century when it experimented with big development, mainly based on the exploitation of the iron mines and [[siderurgy]], which promoted the maritimal traffic, the portuary activity and the construction of ships. During those years ''Banco de Bilbao'' (Bank of Bilbao), f"},{"slug":"fedwiki-tools","title":"Fedwiki Tools","date":1449105067435,"synopsis":"Here we list a few tools that are of particular use in managing and creating [[Fedwiki]] content."},{"slug":"fish","title":"Fish","date":1466188656026,"synopsis":"A fish is any member of a paraphyletic group of organisms that consist of all gill-bearing aquatic craniate animals that lack limbs with digits. Included in this definition are the living hagfish, lampreys, and cartilaginous and bony fish, as well as various extinct related groups. Most fish are ectothermic (\"cold-blooded\"), allowing their body temperatures to vary as ambient temperatures change, though some of the large active swimmers like white shark and tuna can hold a higher core temperature. Fish are abundant in most bodies of water. They can be fo"},{"slug":"for-and-against-open-data","title":"For And Against Open Data","date":1466251027079,"synopsis":"The debate on Open Data is still evolving. The best open government applications seek to empower citizens, to help small businesses, or to create value in some other positive, constructive way - [https://en.wikipedia.org/wiki/Open_data#Arguments_for_and_against_open_data wikipedia]"},{"slug":"garden-patterns-inventory","title":"Garden Patterns Inventory","date":1462335552831,"synopsis":"We duplicate an illustration from Timeless Way of Building using Graph plugins and our graph building workflow."},{"slug":"geography","title":"Geography","date":1466195967506,"synopsis":"The municipality of Bilbao is located near the northern edge of the [[Iberian Peninsula]], about 16kmmi from the Bay of Biscay. It covers an area of 40.65mi, of which 17.35 are urban and the remaining 23.30 consist of the surrounding mountains.[ ] The official average altitude is 1923.30, although there are measurements between 6 and 32. It is also the core of the ''comarca ([[Comarcas of Spain]])'' of [[Greater Bilbao]]. It is surrounded by the municipalities of [[Derio]], [[Etxebarri]], [[Galdakao]], [[Loiu]], [[Sondika]], and [[Zamudio]] to the north;"},{"slug":"habib","title":"Habib","date":1465551992857,"synopsis":"Born in South of France, son of two 1st-generation maghrebis. Once a teenager, I first wanted to understand the money world, and studied information systems and agile management in a business school. Mainly worked in the communication & online tech field."},{"slug":"hacking-social-impact","title":"Hacking Social Impact","date":1466186091306,"synopsis":"To bring together in a dynamic and collaborative environment the leaders in social impact, business, and venture capital investment innovation. [http://socialventuresociety.org/unconference/ website] [http://us6.campaign-archive2.com/?u=adeb969bbfd2716b2416778ac&id=93902578be details]"},{"slug":"half-hidden-garden","title":"Half-Hidden Garden","date":1462338313088,"synopsis":"If a garden is too close to the street, people won't use it because it isn't private enough. But if it is too far from the street, then it won't be used either, because it is too isolated."},{"slug":"history","title":"History","date":1466193073639,"synopsis":"In 1929, Joseph Russell Smith took up an antecedent term as the subtitle for ''Tree Crops: A Permanent Agriculture'', a book in which he summed up his long experience experimenting with fruits and nuts as crops for human food and animal feed.[http://books.google.co.uk/books?id=0PQvqpVnFbAC&lpg=PP1 ]  Smith saw the world as an inter-related whole and suggested mixed systems of trees and crops underneath. This book inspired many individuals intent on making agriculture more sustainable, such as [[Toyohiko Kagawa]] who pioneered [[forest farming]] in [[Japa"},{"slug":"human-ecosystems","title":"Human Ecosystems","date":1465482364389,"synopsis":"Human Ecosystems is a family of real-time system capturing information from social networks to visualise the human geography of cities, across space, time and relations - [http://human-ecosystems.com/home/about-the-human-ecosystems/ human-ecosystems.com]"},{"slug":"images-of-bilbao-oscedays","title":"Images Of Bilbao OSCEDays","date":1466665526580,"synopsis":"Here we collect images of the people and projects that took part in [[Blibao OSCEDays 2016]]."},{"slug":"keops","title":"Keops","date":1466664105813,"synopsis":"Or should that be Keiops? Sounds like Chaos."},{"slug":"kronos","title":"Kronos","date":1466664236443,"synopsis":"What's in Time's entry ? Where is the time — and do we own it. Personal stratagems, measurement systems (remember the decimal clocks of the French Revolution!) and babylonian duodecimals enjoying quite a long run."},{"slug":"liquid-desire","title":"Liquid Desire","date":1466185616451,"synopsis":"This page is about the emergent properties of the \"value\" of money, in the sense of what it represents, or what characteristics of human behaviour it amplifies."},{"slug":"list","title":"List","date":1466582091718,"synopsis":"est-ce LIST ou LOST ?"},{"slug":"magik","title":"Magik","date":1466664742160,"synopsis":"Magik - it turns the world upside down. A dyslexic magician perhaps. Though that would be most definitely condescending to the magic of the dyslexic - who by his very nature excels where text is absent. What better reason to drop the a letter which serves no purpose?"},{"slug":"map-production","title":"Map production","date":1466250012941,"synopsis":"Map data is collected from scratch by volunteers performing systematic ground surveys using tools such as a handheld GPS unit, a notebook, digital camera, or a voice recorder. The data is then entered into the OpenStreetMap database - [https://en.wikipedia.org/wiki/Openstreetmap#Map_production wikipedia]"},{"slug":"map-test","title":"Map Test","date":1467305656514,"synopsis":"Write a description of the image here...."},{"slug":"mouans-sartoux","title":"Mouans-Sartoux","date":1434554867534,"synopsis":"From the 11th to 15th of June,  will gather in Mouans-Sartoux to facilitate workshops, teardowns, co-design and prototyping sessions."},{"slug":"noam-assayag","title":"Noam Assayag","date":1466624028862,"synopsis":"Translater, jack-of-all-trades, bodyguard, private eye(s)."},{"slug":"notable-permaculturists","title":"Notable permaculturists","date":1466193093611,"synopsis":"Joseph Russell Smith took up an antecedent term as the subtitle for ''Tree Crops: A Permanent Agriculture'', a book in which he summed up his long experience experimenting with fruits and nuts as crops for human food and animal feed. By that year (1929), Smith saw the world as an interrelated whole and suggested mixed systems of trees and crops underneath. This book inspired many individuals intent on making permaculture a valid means of sustainable food production. [[Bill Mollison]] and [[David Holmgren]] developed it further, and permaculturists were t"},{"slug":"ogro","title":"Ogro","date":1466665022427,"synopsis":"Ogro and ogre have to be the closest. Agro as in trouble? And strangely makes me think of gold as in \"oro\"."},{"slug":"open-bee-lab","title":"Open Bee Lab","date":1467716477998,"synopsis":"OpenBeeLab is Free and open-source research programme about bees - [http://openbeelab.org/ openbeelab.org]"},{"slug":"open-data","title":"Open data","date":1466251073545,"synopsis":"Open data is the idea that some data should be freely available to everyone to use and republish as they wish, without restrictions from copyright, patents or other mechanisms of control - [https://en.wikipedia.org/wiki/Open_data wikipedia]"},{"slug":"open-data-in-government","title":"Open data in government","date":1466251056437,"synopsis":"There are a range of different arguments for open government data.[http://dx.doi.org/10.2139/ssrn.2605828 Towards a Genealogy of Open Data][http://www.stlr.org/volumes/volume-ix-2007-2008/brito/ Hack, Mash, & Peer: Crowdsourcing Government Transparency] For example, some advocates contend that making government information available to the public as machine readable open data can facilitate government transparency, accountability and public participation. Some make the case that opening up official information can support technological innovation and eco"},{"slug":"open-data-in-science","title":"Open data in science","date":1466251225587,"synopsis":"The concept of \"open access to scientific data\" was institutionally established with the formation of the [[World Data Center]] system, in preparation for the [[International Geophysical Year]] of 1957–1958 - [http://books.nap.edu/openbook.php?record_id=11991&page=6 books.nap.edu]"},{"slug":"open-source-software","title":"Open-source software","date":1466582939747,"synopsis":"As developed by [[Bernard Stiegler]] and other philosophers before him, technics and technology is a part of human beings, it is part of the hominization process, it is a manifestation of human beings fulfilling themselves."},{"slug":"openstreetmap","title":"OpenStreetMap","date":1466250484927,"synopsis":"OpenStreetMap (OSM) is a collaborative project to create a free editable map of the world. Two major driving forces behind the establishment and growth of OSM have been restrictions on use or availability of map information across much of the world and the advent of inexpensive portable satellite navigation devices. OSM is considered a prominent example of volunteered geographic information - [https://en.wikipedia.org/wiki/Openstreetmap wikipedia]"},{"slug":"oscedays","title":"OSCEdays","date":1465552425666,"synopsis":"A global distributed event (JUNE 11th – 15th, 2015), exploring the [[Open Source]] and the [[Circular Economy]] - [https://oscedays.org/ oscedays.org]"},{"slug":"oscedays-bilbao","title":"Oscedays Bilbao","date":1466623831173,"synopsis":"<div style='padding: 12px; background:#eee; width:96%; align=centered;'>"},{"slug":"oscedays-bilbao-2016","title":"OSCEdays Bilbao 2016","date":1466582948281,"synopsis":"The Opensource Circular Economy Days in Bilbao, was part of [[OSCEdays]] global event, 5 days from 9 to 13 of June during which people gathered on 4 continents in 63 cities to co-create around the topics of OpenSource and Circular Economy  - [http://oscedaysbilbao.hotglue.me/ hotglue.me]"},{"slug":"permaculture","title":"Permaculture","date":1466193425178,"synopsis":"Permaculture is a system of agricultural and social design principles centered on simulating or directly utilizing the patterns and features observed in natural ecosystems."},{"slug":"plant-electric-fields","title":"Plant Electric Fields","date":1466092550218,"synopsis":"Bees don’t just recognise flowers by their colour and scent; they can also pick up on their minute electric fields. Such fields—which form from the imbalance of charge between the ground and the atmosphere—are unique to each species, based on the plant’s distance from the ground and shape - [http://www.sciencemag.org/news/2016/05/video-how-bees-sense-flower-s-electric-field sciencemag.org]"},{"slug":"plant-intelligence","title":"Plant Intelligence","date":1469976080271,"synopsis":"Plants behave in some oddly intelligent ways: fighting predators, maximizing food opportunities ... But can we think of them as actually having a form of intelligence of their own?"},{"slug":"plantoid","title":"Plantoid","date":1465479291909,"synopsis":"A plantoid is a hypothetical robot or synthetic organism designed to look, act and grow like a plant."},{"slug":"pre-reservation-culture","title":"Pre-reservation culture","date":1466626892186,"synopsis":"A page with 0 items."},{"slug":"projects-in-bilbao","title":"Projects in Bilbao","date":1466021621942,"synopsis":"Here we also document the process, and development of the [[Projects in Blibao]] begun as a part of [[OSCEDays]]."},{"slug":"projects-in-blibao","title":"Projects in Blibao","date":1466021515701,"synopsis":"This page is a typo - see here for the real deal."},{"slug":"proposed-columbia-gorge-casino","title":"Proposed Columbia Gorge casino","date":1466752168513,"synopsis":"We use this page to look at how we might improve and enhance the:"},{"slug":"que-vamos-a-hacer-juntos","title":"Que Vamos A Hacer Juntos?","date":1464691069651,"synopsis":"Experimentar con las plantas en entorno urbano."},{"slug":"quienes-somos","title":"Quienes Somos?","date":1464811193382,"synopsis":"David : ..."},{"slug":"singing-with-plants","title":"Singing With Plants","date":1466175758615,"synopsis":"In this project we look to research, document and write together on a project to examine [[How Plants Communicate]]."},{"slug":"the-sound-of-bees","title":"The Sound Of Bees","date":1472462212385,"synopsis":"Here we will explore the forthcoming networked event in London, which weaves a number of themes into one overpowering sound. [[Drone]] is the meme and name of the event."},{"slug":"theory","title":"Theory","date":1466193134712,"synopsis":"No section text, so add your own here.. - [https://en.wikipedia.org/wiki/Permaculture#Theory wikipedia]"},{"slug":"tinc-protocol","title":"Tinc (protocol)","date":1467465890244,"synopsis":"Tinc is an open-source, self-routing, mesh networking protocol, used for compressed, encrypted, virtual private networks. It was started in 1998 by Guus Sliepen, Ivo Timmermans, and Wessel Dankers, and released as a GPL-licensed project - [https://en.wikipedia.org/wiki/Tinc_(protocol) wikipedia]"},{"slug":"twelve-design-principles","title":"Twelve design principles","date":1466193212072,"synopsis":"Twelve Permaculture design principles articulated by David Holmgren in his ''Permaculture: Principles and Pathways Beyond Sustainability'':[http://holmgren.com.au/product/principles/ Permaculture: Principles and Pathways Beyond Sustainability] - [https://en.wikipedia.org/wiki/Permaculture#Twelve_design_principles wikipedia]"},{"slug":"vega","title":"Vega","date":1466665433084,"synopsis":"Vega - is it a star? Interestingly it is also a visualisation grammar - vega.io"},{"slug":"welcome-visitors","title":"Welcome Visitors","date":1467464174121,"synopsis":"As part of [[OSCEDays]] we look to write and research together on topics related to creating sustainable commons, whether biological, social or digital in and around the area of [[Bilbao]]."},{"slug":"writing-with-wikipedia","title":"Writing With Wikipedia","date":1466750395131,"synopsis":"Here we explore how we may write using [[Wikipedia]] not simply as a source and a reference, but as a creative asset in the authoring of new ideas."}]