[{"slug":"-discovery---bbc-world-service","title":" Discovery - BBC World Service","date":1507312156702,"synopsis":"With the coming of the World Wide Web in the 1990s internet access opened up to everybody, it was no longer the preserve of academics and computer hobbyists. Already prior to the Web, the burgeoning internet user groups and chat rooms had tested what was acceptable behaviour online, but access was still limited. - [http://www.bbc.co.uk/programmes/w3csvnzd bbc]"},{"slug":"-seriously---bbc-radio-4","title":" Seriously... - BBC Radio 4","date":1498311234352,"synopsis":"Frances Stonor-Saunders explores how the young [[Donald Trump]] stormed into Manhattan from the outer boroughs in the late 1970s and headed straight for New York's most outrageous nightclub - [[Studio 54]]."},{"slug":"-the-compass---bbc-world-service","title":" The Compass - BBC World Service","date":1510751228148,"synopsis":"American democracy can easily frustrate change. The country’s Constitution is almost impossible to amend. The many interest groups swirling through Congress often paralyse or colonise it; and corralling 50 states is often beyond the capacity of the most able president. - [http://www.bbc.co.uk/programmes/w3cswbm4 bbc]"},{"slug":"-witness---bbc-world-service","title":" Witness - BBC World Service","date":1496657706264,"synopsis":"The story of our times told by the people who were there. Take a look at the archive here -"},{"slug":"agile-parliament","title":"Agile Parliament","date":1393795991000,"synopsis":"One of the [[Enterprise Pattern]]s in the upcoming [[Open Agile Pattern Language]] - an initiative in [[Agile Tng]]."},{"slug":"aristotelian-notes","title":"Aristotelian Notes","date":1419794321503,"synopsis":"In the 13th century a number of texts, primarily those based around Aristotle's work, adopted a \"pillared\" approach to textual annotation. We will call these Aristotelian Notes. Here we discuss how the system worked and its import."},{"slug":"art-of-politics","title":"Art of Politics","date":1511693142287,"synopsis":"Here we explore projects and ideas that integrate art practice, theatre and documentary into political debate."},{"slug":"brian-eno","title":"Brian Eno","date":1507040309525,"synopsis":"Brian Peter George St John le Baptiste de la Salle Eno, RDI (; born 15 May 1948 and originally christened Brian Peter George Eno) is an English musician, composer, record producer, singer, writer, and visual artist. He is best known for his pioneering work in rock, ambient, pop, and electronic music. A self-described \"non-musician\", Eno has helped to introduce a variety of unique conceptual approaches and recording techniques into contemporary music, advocating a methodology of \"theory over practice\" throughout his career. He has been described as one of"},{"slug":"changes-to-this-site","title":"Changes to this Site","date":1434641767059,"synopsis":"Below we list recent changes to this site only without also listing changes from the [[Neighbourhood]]:"},{"slug":"corbyn-election","title":"Corbyn Election","date":1535879319498,"synopsis":"The results of the general election are in - but what do they mean? Did more young people vote than expected? Have we now got a more diverse parliament? How many extra votes would [[Jeremy Corbyn]] have needed to become Prime Minister - these are just some of the claims and questions that have been floating around on social media and in the press. Tim Harford and the team are going to analyse, add context and try and find answers. - [http://www.bbc.co.uk/programmes/p056b7l1 bbc]"},{"slug":"dark-side-of-the-world-wide-web","title":"Dark Side of the World Wide Web","date":1507313879869,"synopsis":"With the coming of the World Wide Web in the 1990s internet access opened up to everybody, it was no longer the preserve of academics and computer hobbyists. Already prior to the Web, the burgeoning internet user groups and chat rooms had tested what was acceptable behaviour online, but access was still limited. - [http://www.bbc.co.uk/programmes/w3csvnzd bbc]"},{"slug":"deep-democracy","title":"Deep Democracy","date":1454022772717,"synopsis":"Is a form of [[democracy]] that goes further than voting."},{"slug":"deliberative-democracy","title":"Deliberative democracy","date":1510232371877,"synopsis":"Deliberative democracy or discursive democracy is a form of democracy in which deliberation is central to decision-making. It adopts elements of both consensus decision-making and majority rule - [https://en.wikipedia.org/wiki/Deliberative_democracy wikipedia]"},{"slug":"democracy-activity","title":"Democracy Activity","date":1519815163138,"synopsis":"View all activity from [[Democracy Sites]] listed in the roster below:"},{"slug":"democracy-in-europe-movement-2025","title":"Democracy in Europe Movement 2025","date":1498333758020,"synopsis":"The Democracy in Europe Movement 2025, or [[DiEM25]], is a Pan-European political movement launched in 2015 by former Greek finance minister Yanis Varoufakis. The movement was officially presented at a ceremonial event held on 9 February 2016 in the Volksbühne theatre in Berlin and on the 23rd March in Rome. Their movement aims to reform the European Union's existing institutions to create a \"full-fledged democracy with a sovereign Parliament respecting national self-determination and sharing power with national Parliaments, regional assemblies and munic"},{"slug":"diem25","title":"DiEM25","date":1498334207927,"synopsis":"The movement's declared aim is to reinvigorate the idea of [[Europe]] as a union of people governed with democratic ([[democracy]]) consent rather than what the movement fears the [[European Union]] is heading to: a [[superstate]] ruled by technocrats ([[technocracy]]) issuing [[edicts]]."},{"slug":"donald-trump","title":"Donald Trump","date":1498311327122,"synopsis":"Donald John Trump (born June 14, 1946) is the 45th and current President of the United States, in office since January 20, 2017. Before entering politics, he was a businessman and television personality - [https://en.wikipedia.org/wiki/Donald_Trump wikipedia]"},{"slug":"fedwiki-tools","title":"Fedwiki Tools","date":1511692903593,"synopsis":"Here we list a few tools that are of particular use in managing and creating [[Fedwiki]] content. Check [[Recycled pages]] to find delted pages."},{"slug":"francis-fukuyama","title":"Francis Fukuyama","date":1507537715992,"synopsis":"Yascha Mounk discusses the degree to which democracy in the United States is under threat, the slow erosion of liberal norms, and the future of American identity with Francis Fukuyama."},{"slug":"frankfurt-school","title":"Frankfurt School","date":1516546856707,"synopsis":"The Frankfurt School (German: Frankfurter Schule) is a school of social theory and philosophy associated in part with the Institute for Social Research at the Goethe University Frankfurt. Founded during the interwar period, the School consisted of neo-Marxist dissidents who felt at home in none of the existent capitalist, fascist, or communist systems of the time. Many of these theorists believed that traditional theory could not adequately explain the turbulent and unexpected development of capitalist societies in the twentieth century. Critical of both"},{"slug":"garden-of-eden","title":"Garden of Eden","date":1520422433215,"synopsis":"The Garden of Eden (Hebrew גַּן עֵדֶן, Gan ʿEḏen) or (often) Paradise, is the biblical \"garden of God\", described most notably in the Book of Genesis chapters 2 and 3, and also in the Book of Ezekiel. Genesis 13:10 refers to the \"garden of God\" (not called Eden by name), and the \"trees of the garden\" are mentioned in Ezekiel 31. The Book of Zechariah and the Book of Psalms also refer to trees and water in relation to the temple without explicitly mentioning Eden - [https://en.wikipedia.org/wiki/Garden_of_Eden wikipedia]"},{"slug":"internet-of-things","title":"Internet of Things","date":1507312194660,"synopsis":"Can we Control the Dark Side of the Internet? - [http://www.bbc.co.uk/programmes/w3csvnzf bbc]"},{"slug":"irish-pubs-saved-the-economy","title":"Irish Pubs Saved the Economy","date":1496657507068,"synopsis":"In May 1970 Ireland's banks were forced to close for 6 months when workers went on strike. But in an age before ATMs and debit cards the Irish found a way of getting hold of their money - at the pub. - [http://www.bbc.co.uk/programmes/p0534pqk#play bbc]"},{"slug":"its-a-rich-mans-world","title":"It's A Rich Man's World","date":1494066756720,"synopsis":"It's a Rich Man's World is a performance conference and immersive musical event which celebrates the world of [[The One Percent]]. It's [[Harry Enfield]] set to music."},{"slug":"jrgen-habermas","title":"Jürgen Habermas","date":1516546780845,"synopsis":"Jürgen Habermas (born 18 June 1929) is a German sociologist and philosopher in the tradition of critical theory and pragmatism. He is perhaps best known for his theories on communicative rationality and the [[public sphere]] - [https://en.wikipedia.org/wiki/J%C3%BCrgen_Habermas wikipedia]"},{"slug":"karl-popper","title":"Karl Popper","date":1511862458757,"synopsis":"Sir Karl Raimund Popper CH FBA FRS (28 July 1902 – 17 September 1994) was an Austrian-British philosopher and professor. He is generally regarded as one of the greatest philosophers of science of the 20th century - [https://en.wikipedia.org/wiki/Karl_Popper wikipedia]"},{"slug":"kleroterion","title":"Kleroterion","date":1511718768840,"synopsis":"A kleroterion was a randomisation device used by the Athenian polis during the period of democracy to select citizens to the boule, to most state offices, to the nomothetai, and to court juries - [https://en.wikipedia.org/wiki/Kleroterion wikipedia]"},{"slug":"legislative-theatre","title":"Legislative Theatre","date":1429365294847,"synopsis":"Legislative Theatre is an extension of Augusto Boal's [[Forum Theatre]] techniques and functions to determine the need for, create, and enact laws. Beyond community building and issue awareness. Legislative Theatre uses theatrical techniques to create concrete and specific socio-political impact."},{"slug":"liquid-democracy","title":"Liquid Democracy","date":1513460674080,"synopsis":"Liquid Democracy is a combination of [[Direct Democracy]], and [[Representative Democracy]]. It aims to create a more flexible and fluid way for people to express their [[Democratic Preference]]."},{"slug":"listen-maybe","title":"Listen Maybe","date":1498333479414,"synopsis":"Here we list some things that may be worth listening too:"},{"slug":"map-of-science","title":"Map of Science","date":1447004834106,"synopsis":"Science mapping, at its most basic, is a combination of classification and visualization."},{"slug":"matthew-dancona","title":"Matthew D’Ancona","date":1507537623528,"synopsis":"Yascha Mounk and Matthew d’Ancona discuss why lies have taken over our politics; what kinds of policies might be able to move us past the post-truth age; and how Democrats can win in 2020."},{"slug":"nassim-nicholas-taleb","title":"Nassim Nicholas Taleb","date":1520245887574,"synopsis":"Nassim Nicholas Taleb (Arabic: نسيم نقولا طالب‎, alternatively Nessim or Nissim, born 1960) is a Lebanese–American essayist, scholar, statistician, former trader, and risk analyst, whose work focuses on problems of randomness, probability, and uncertainty. His 2007 book [[The Black Swan]] was described in a review by The Sunday Times as one of the twelve most influential books since World War II - [https://en.wikipedia.org/wiki/Nassim_Nicholas_Taleb wikipedia]"},{"slug":"one-hundred-percent","title":"One Hundred Percent","date":1511693056092,"synopsis":"This is a derivative work based on [[Rimini Protokoll]]s [[100 % City]] - [https://vimeo.com/riminiprotokoll vimeo]"},{"slug":"open-simulation-archive","title":"Open Simulation Archive","date":1493483671415,"synopsis":"[[Open Simulation Archive]] is an open archive of 3D science models and simulations. This biomedical 3D warehouse would be the science equivalent to Google Warehouse."},{"slug":"origin-and-evolution-of-life","title":"Origin and evolution of life","date":1511863042196,"synopsis":"In both sides of the debate regarding [[Teleology]] or the role of purpose in science (and even courts in their decisions) [[Karl Popper]]'s criterion of falsifiability (see [[Daubert standard]] have frequently been invoked. Here we begin to write and research about these ideas."},{"slug":"parliament-of-things","title":"Parliament of Things","date":1492507269988,"synopsis":"[[Bruno Latour]] is the philosopher behind the title of this wiki. On this wiki we [[Idea Mine]] a range of disciplines around the notion that science, law, media and politics can be remixed in new and potentially fruitful ways."},{"slug":"podcast-transport","title":"Podcast Transport","date":1498167658160,"synopsis":"# Podcast Transport"},{"slug":"poison-control","title":"Poison Control","date":1528186821715,"synopsis":"When reporter Brenna Farrell was a new mom, her son gave her and her husband a scare -- prompting them to call Poison Control."},{"slug":"post-democracy","title":"Post-Democracy","date":1421824635173,"synopsis":"[http://markcarrigan.net/2015/01/11/what-will-post-democracy-look-like/ Interesting post by Mark Carrigan] that mirrors a couple of recent conversations I've had on similar topics e.g. the illusion of democratic functions when money buys the ability to set the agenda."},{"slug":"public-sphere","title":"Public sphere","date":1509806842807,"synopsis":"The public sphere (German Öffentlichkeit) is an area in social life where individuals can come together to freely discuss and identify societal problems, and through that discussion influence political action - [https://en.wikipedia.org/wiki/Public_sphere wikipedia]"},{"slug":"rimini-protokoll","title":"Rimini Protokoll","date":1509641491249,"synopsis":"Rimini Protokoll works in the realm of theater, sound and radio plays, film and installation emerge in constellations of two or three and solo as well."},{"slug":"scitopia","title":"SciTopia","date":1493484484183,"synopsis":"[[SciTopia]] is a science project (originally proposed to the Welcome Trust in 2012), that looks to create a new form of [[Scientific Institution]], based on an analysis of the activities and practice of real world science."},{"slug":"skin-in-the-game","title":"Skin in the Game","date":1520246084276,"synopsis":"I came across this podcast today, and found it the first lucent example of a moral principle that is not generally discussed and has significant implications for economic and political thought. I don't feel comfortable with the argument, which is generally a good sign."},{"slug":"socrates","title":"Socrates","date":1514732916995,"synopsis":"Socrates (c. 470 – 399 BC) was a classical Greek (Athenian) philosopher credited as one of the founders of Western philosophy, and as being the first moral philosopher,  of the western ethical tradition of thought - [https://en.wikipedia.org/wiki/Socrates wikipedia]"},{"slug":"sortition","title":"Sortition","date":1511692984137,"synopsis":"In governance, sortition (also known as allotment or demarchy) selects political officials as a random sample from a larger pool of candidates - [https://en.wikipedia.org/wiki/Sortition wikipedia]"},{"slug":"the-appearance-of-wisdom","title":"The Appearance of Wisdom","date":1514732689365,"synopsis":"[[Plato]]'s Phaedrus is a book on the art of rhetoric.  In it [[Socrates]] argues that the invention of writing will be the death of memory:"},{"slug":"the-black-swan","title":"The Black Swan","date":1520246101620,"synopsis":"See [[The Black Swan: The Impact of the Highly Improbable]]"},{"slug":"the-black-swan-the-impact-of-the-highly-improbable","title":"The Black Swan: The Impact of the Highly Improbable","date":1520246107765,"synopsis":"[[The Black Swan]]: The Impact of the Highly Improbable is a book by the essayist, scholar, philosopher, and statistician [[Nassim Nicholas Taleb]], released April 17, 2007 by Random House. The book focuses on the extreme impact of certain kinds of rare and unpredictable events (outliers) and humans' tendency to find simplistic explanations for these events retrospectively. This theory has since become known as the black swan theory - [https://en.wikipedia.org/wiki/The_Black_Swan:_The_Impact_of_the_Highly_Improbable wikipedia]"},{"slug":"the-economist-asks-should-leaders-face-the-music","title":"The Economist asks: Should leaders face the music?","date":1520245507974,"synopsis":"What risk does Anne McElvoy, our senior editor, take when she talks to Nassim Nicholas Taleb? The author of Skin in the Game discusses whether having more at stake would make the powerful better leaders- [https://player.fm/1pZbkf player.fm]"},{"slug":"the-origin-of-the-internet","title":"The Origin of the Internet","date":1507312236392,"synopsis":"Just how did the Internet become the most powerful communications medium on the planet, and why does it seem to be an uncontrollable medium for good and bad?"},{"slug":"the-week-ahead-xi-forever","title":"The week ahead: Xi forever?","date":1520245219745,"synopsis":"Could Xi Jinping's rule as president last until his death? Also, Italy's woeful election choices."},{"slug":"theatre-of-the-oppressed","title":"Theatre of the Oppressed","date":1511693153032,"synopsis":"The Theatre of the Oppressed (TO) describes theatrical forms that the Brazilian theatre practitioner [[Augusto Boal]] first elaborated in the 1970s, initially in Brazil and later in Europe. Boal was influenced by the work of the educator and theorist [[Paulo Freire]] - [https://en.wikipedia.org/wiki/Theatre_of_the_Oppressed wikipedia]"},{"slug":"thing-assembly","title":"Thing (assembly)","date":1426129179656,"synopsis":"A \"thing\" was the governing assembly of a Germanic society, made up of the free people of the community presided over by [[Lawspeaker]]s. Its meeting-place was called a [[Thingstead]]."},{"slug":"welcome-visitors","title":"Welcome Visitors","date":1520422414159,"synopsis":"Welcome to this [[Federated Wiki]] site. This is my site for integrating notes I feel relevant to [[Deep Democracy]]. It's an eclectic mix of notes and discussions on [[Deep Ecology]], [[Liquid Democracy]], [[Legislative Theatre]], and the [[Parliament of Things]]."},{"slug":"freedom-of-speech","title":"Freedom of speech","date":1535879231718,"synopsis":"Freedom of speech is a principle that supports the freedom of an individual or a community to articulate their opinions and ideas without fear of retaliation, censorship, or sanction. The term \"freedom of expression\" is sometimes used synonymously but includes any act of seeking, receiving, and imparting information or ideas, regardless of the medium used. - [https://en.wikipedia.org/wiki/Freedom_of_speech wikipedia]"},{"slug":"generation-snowflake","title":"Generation Snowflake","date":1535877088343,"synopsis":"Generation Snowflake, or Snowflake Generation, is a neologistic term used to characterize the young adults of the 2010s as being more prone to taking offence and less resilient than previous generations, or as being too emotionally vulnerable to cope with views that challenge their own. The term is considered derogatory. It is one of several informal examples of usage of the word snowflake to refer to people. - [https://en.wikipedia.org/wiki/Generation_Snowflake wikipedia]"},{"slug":"the-good-judgment-project","title":"The Good Judgment Project","date":1535879172930,"synopsis":"The Good Judgment Project (GJP) is a project \"harnessing the wisdom of the crowd to forecast world events\". It was co-created by Philip E. Tetlock, decision scientist Barbara Mellers, and Don Moore. It was a participant in the Aggregative Contingent Estimation (ACE) program of the Intelligence Advanced Research Projects Activity (IARPA) in the United States. Predictions are scored using Brier scores. The top forecasters in GJP are \"reportedly 30% better than intelligence officers with access to actual classified information.\" - [https://en.wikipedia.org/"},{"slug":"speakers-corner","title":"Speakers' Corner","date":1535879382118,"synopsis":"A Speakers' Corner is an area where open-air public speaking, debate, and discussion are allowed. The original and most noted is in the northeast corner of Hyde Park in London, England."}]