[{"slug":"bitcoin-full-node","title":"Bitcoin Full Node","date":1446468190121,"synopsis":"The aim of this exercise was to see if I could build a a Bitcoin Full node for less than £100.<p>\n\nYou will see I was successful in achieving this aim although using consumer hardware like the Raspberry Pi did mean initial setup extended in to many weeks. Here was my shopping list:\n\n<ul>\n  <li><a href=\"http://www.amazon.co.uk/Raspberry-Pi-Model-Desktop-Linux/dp/B00T2U7R7I/ref=sr_1_1?s=computers&ie=UTF8&qid=1446465134&sr=1-1&keywords=raspberry+pi+2\">Raspberry Pi 2 </a><b>£30</b></li>\n  <li><a href=\"http://www.amazon.co.uk/gp/product/B00TET78DA\">Tontec Case with fan </a> <b>£10</b></li>\n  <li><a href=\"http://www.amazon.co.uk/gp/product/B00SNLIG5O\">128gb memory card</a> <b>£36</b></li>\n<li>Micro USB Cable £1</li>\n</ul>\n\n<b>Total £77</b>\n\n"},{"slug":"bruno-latour","title":"Bruno Latour","date":1427406591798,"synopsis":"Bruno Latour is a philosopher of science and sympathetic critic of [[Deep Ecology]], which he seeks to replace with a [[Political Ecology]]. I sometimes blog about these things over at [http://parliamentofthings.org parliamentofthings.org]."},{"slug":"chris-ellis","title":"Chris Ellis","date":1429187698532,"synopsis":"I am a micropreneurial journalist."},{"slug":"crypto-greenhouse-project","title":"Crypto Greenhouse Project","date":1444135342153,"synopsis":"In many ways you could see an ecosystem like this being more organic than we are as humans; much like animals every part of the greenhouse apparatus could be turned back to the Earth making it whole.\n\nIf you like this video please tip me using http://ProTip.is 13U4gmroMmFwHAwd2Sukn4fE2WvHG6hP8e\n\nCAD Drawing: https://www.tinkercad.com/things/fVI1XhbAZIu-crypto-greenhouse\n\n"},{"slug":"currently-working-on","title":"Currently Working On","date":1434987927294,"synopsis":"Here is a list of [[Recent Changes]] I consider important. View our experiments on the [[Scratch]] page. To clear stuff saved in your browser try [[Local Changes]]."},{"slug":"docker-on-a-pi","title":"Docker on a Pi","date":1438625385788,"synopsis":"There are a number of ways of getting Docker running on a Raspberry Pi. here we list our experience:"},{"slug":"early-prototyping","title":"Early Prototyping","date":1444136020870,"synopsis":"Uploaded image"},{"slug":"form-world","title":"Form World","date":1429188261863,"synopsis":"[[Form World]] is the place in [[The Federation]] where [[Law]] is drafted, stored, and adjudicated. It is the [[MineCraft]] world which houses [[The Institutions of the Federation]].  "},{"slug":"how-to-prepare-a-water-filter-jug","title":"How to prepare a water filter jug","date":1439063534624,"synopsis":"YOUTUBE dJY3Ur6bM9o\n[[Preparing a water filter jug]]"},{"slug":"identity","title":"Identity","date":1432046644551,"synopsis":"A page with 0 items."},{"slug":"identity-research","title":"Identity Research","date":1432046965445,"synopsis":"[[Space and Place]] by Paulette Robinson"},{"slug":"installing-ipfs-on-raspberry-pi-2","title":"Installing IPFS on Raspberry Pi 2","date":1437997909251,"synopsis":"A page with 0 items."},{"slug":"installing-minecraft-on-a-docker-using-digitalocean-droplet","title":"Installing Minecraft on a Docker using DigitalOcean Droplet","date":1446460959384,"synopsis":"In this video David Bovill and Chris Ellis setup a Minecraft Server on Digital Ocean."},{"slug":"installing-screen-shot-on-raspberry-pi-2","title":"Installing Screen Shot on Raspberry Pi 2","date":1437998032916,"synopsis":"A page with 1 items."},{"slug":"on-hannah-arendt-research","title":"On Hannah Arendt research","date":1431295877798,"synopsis":"<p>I have been reading this <a href=\"http://plato.stanford.edu/entries/arendt/#AreConCit\">on Hannah Arendt</a> and it's fucking awesome.</p>\n\n<p>She has some great stuff in here on Identity.</p>\n\n[[Promises and Forgiveness]]"},{"slug":"place","title":"place","date":1432047443666,"synopsis":"A page with 0 items."},{"slug":"project-template","title":"Project Template","date":1446373720313,"synopsis":"Please provide a brief summary of your project and tell us why we should support it (50 words max.):"},{"slug":"promises-and-forgiveness","title":"Promises and Forgiveness","date":1431296038723,"synopsis":"<p><q>The remedy which the tradition of Western thought has proposed for the unpredictability and irreversibility of action has consisted in abstaining from action altogether, in the withdrawal from the sphere of interaction with others, in the hope that one's freedom and integrity could thereby be preserved. Platonism, Stoicism and Christianity elevated the sphere of contemplation above the sphere of action, precisely because in the former one could be free from the entanglements and frustrations of action. Arendt's proposal, by contrast, is not to turn one's back on the realm of human affairs, but to rely on two faculties inherent in action itself, the faculty of forgiving and the faculty of promising. These two faculties are closely connected, the former mitigating the irreversibility of action by absolving the actor from the unintended consequences of his or her deeds, the latter moderating the uncertainty of its outcome by binding actors to certain courses of action and thereby setting some limit to the unpredictability of the future. Both faculties are, in this respect, connected to temporality: from the standpoint of the present forgiving looks backward to what has happened and absolves the actor from what was unintentionally done, while promising looks forward as it seeks to establish islands of security in an otherwise uncertain and unpredictable future.</q><br>\n<a href=\"http://plato.stanford.edu/entries/arendt/#ActUnpIrr\">- Action, Unpredictability, and Irreversibility</a></p>"},{"slug":"protip-application","title":"ProTip Application","date":1446629867244,"synopsis":"ProTip allows anyone with a browser to instal a simple chrome extension and pay small amounts of money to teachers, artists and community projects without a middleman taking a cut."},{"slug":"protip-final-day","title":"ProTip Final Day","date":1429186481575,"synopsis":"# This was the final video before the end of the ProTip Crowd Fund\n\nWe look back over the last month of fund raising. Featuring Theo Goodman and Thomas Hunt."},{"slug":"space-and-place","title":"Space and Place","date":1432048546287,"synopsis":"<a href=\"https://www.evernote.com/l/AE5JoaHrMRNPMYF7phtvu0dc-fGEREq05Ys\">Space and Place</a> by <a href=\"https://www.linkedin.com/in/pauletterobinson\">Paulette Robinson</a>. Original webpage now defunct."},{"slug":"stream-of-consciousness-on-gravity","title":"Stream of consciousness on gravity","date":1429198660754,"synopsis":"Prediction is a memory of a memory.\n\nJust thinking about the way we handle predictions of the future. I think they arrive from a simultaneity of many actors all producing the same mental image caused by the capability of the physical body which produces the mind.  \n\nGravity is not a cause it is an effect of stillness. It is an inertia of particles surrounded by an accelerating expansion.  \n\nDistance is discovery. Distance surrounds the interconnected network of a body. The edge of the universe surrounds us. We continually move in to the universe.  \n\nSo if the planets are held together by the stillness which we recognise as gravity post hoc, we apply the rules of gravity prior to with our observation. So what observation is being applied to sense this stillness? Why when we attend with our tension do we perceive planets in the mass of information in the universe?  \n\nWell we know that gravity works with or without conscious observeration. For example something could fall from the sky and hit me on the head with or without someone being there to observe it. So even when hidden the stillness exists and extends in to private observation and from there in to the public discourse.  \n\nSo something is observing the stillness in the universe for it to be still in relation to a change. I think that is the future remembering the past. We are being remembered as well as becoming the remembering.  \n\nWe are gods of teh past, we bring the past to life. Depending on the proximty to the past, a distance in time, will depend on the effect we have on it.  \n\nIt’s like the memory of a memory idea with predictions. The future becomes the future as the memory distances itself from the past. As the memory of the memory loses its faithfulness to its origin/ethnos it becomes recognised as a future possibility because of its ghostly quality. It becomes probable as we become attached to it as a future possibility.  \n\nNot only does it remind us of a spirit with its transience the future images in the mind are hard to slow down, they lack gravitas or stillness of the physical matter of the world around us.  "},{"slug":"thing-assembly","title":"Thing (assembly)","date":1426129179656,"synopsis":"A \"thing\" was the governing assembly of a Germanic society, made up of the free people of the community presided over by [[Lawspeaker]]s. Its meeting-place was called a [[Thingstead]]."},{"slug":"wanderbuch","title":"Wanderbuch","date":1429981472996,"synopsis":"A [[Journeyman]] would be required to keep a journal or [[Wanderbuch]]. This would often serve as both passport and a resum√© - [http://www.peterspioneers.com/wanderbuch.htm peterspioneers.com]"},{"slug":"welcome-visitors","title":"Welcome Visitors","date":1453165497369,"synopsis":"Welcome to my [[Federated Wiki]] site. Follow [[Recent Changes]] to find out what I am [[Currently Working On]]."}]