[{"slug":"2027-time-capsule","title":"#2027 Time Capsule","date":1504262379214,"synopsis":"You are invited to contribute to the time capsule that we will be opening in ten years time at Exponentially Human Twenty Twenty-Seven  - called [[XH2027]] for short"},{"slug":"androrithms","title":"Androrithms","date":1504286168140,"synopsis":"PfPE, Dr D*, and the Social Systemics Foundation collaborated from 2018 to 2021 to develop the Virtue Androrithm (VA) for EH."},{"slug":"chosen-pages","title":"Chosen Pages","date":1504282634034,"synopsis":"# - Start reading here -"},{"slug":"community-and-culture","title":"Community and culture","date":1504286446429,"synopsis":"Making music together, and creating stories, songs, plays and poetry, is a joy. It also adds to a sense of community and shared culture. EH uses drama for fun and for serious investigation into themes and feelings. Sometimes this means producing plays, but it also includes immersive theatre, improvisation and social presencing theatre."},{"slug":"cultural-shifts-and-mental-models","title":"Cultural shifts and mental models","date":1504286885520,"synopsis":"There have been many cultural shifts during the Leap. Ways of doing things or thinking about them have changed from one norm to another."},{"slug":"disruption","title":"Disruption","date":1504284083442,"synopsis":"The Leap has seen the crumbling of structures no longer fit for purpose. All manner of political, social and economic disruption has occurred. Technology has altered how we live and work, and even what it is to be human."},{"slug":"ethics","title":"Ethics","date":1504285775338,"synopsis":"“Technology has no ethics, yet a society without ethics is doomed” Gerd Leonhard in **[http://www.techvshuman.com/ “Technology vs Humans”]**"},{"slug":"exponentially-human","title":"Exponentially Human","date":1504284531245,"synopsis":"The term Exponentially Human (EH) originated within an informal network of practical innovators and thinkers. The idea of EH was increasingly adopted by individuals and organisations drawn together through their purposes and values. The EH Community of Purpose gradually emerged, including people in a widely scattered network (using virtual meetings) and people in sufficient proximity to meet face-to-face."},{"slug":"exponentially-human---an-intro-mini-booklet","title":"Exponentially Human - an intro \"mini-booklet\"","date":1504739112281,"synopsis":"#Our Why..."},{"slug":"exponentially-human---the-chapter","title":"Exponentially Human - The Chapter","date":1504286915883,"synopsis":"**By [[Pamela McLean]]**"},{"slug":"exponentially-human-twenty-twenty-seven","title":"Exponentially Human Twenty Twenty-Seven","date":1504262010383,"synopsis":"*[[Pamela McLean]] is responsible for content here*"},{"slug":"founders-pre-conference-message","title":"Founder’s pre-conference message","date":1504287172050,"synopsis":"Thank you to everyone who has ever responded to the call to collaborate within and around the idea of Exponentially Human. I look forward to revisiting the past decade through the perspective of “The Exponential Leap (2017-2027)” and exploring its implications with you all at our conference."},{"slug":"pamela-mclean","title":"Pamela McLean","date":1499122920340,"synopsis":"Pamela McLean has been a teacher/learner and creator of new knowledge related to the use of digital technologies since the late 1970s (when her name was Pam Fiddy)."},{"slug":"recent-changes","title":"Recent Changes","date":1362955694011,"synopsis":"Here we list neighborhood pages with those most recently changed listed first. See also [[Local Changes]]."},{"slug":"scope","title":"Scope","date":1504283663450,"synopsis":"The publication covers the period of the Exponential Leap (later referred to as the Leap) from 2017-2027 (i.e. from the start of Exponentially Human to the present). It uses the Cambridge Dictionary definition of exponential (increase)  -  An exponential rate of increase becomes quicker and quicker as the thing that increases becomes larger."},{"slug":"time-capsule---images-2017","title":"Time Capsule - Images 2017","date":1506357927903,"synopsis":"Here are images from people in 2017 who were inspired to share their Time Capsule items for XH2027:"},{"slug":"time-capsule---more-info","title":"Time Capsule - more info","date":1506421036675,"synopsis":"Here are some links with additional information about the XH2027 Time Capsule and its exponential landscape of change context:"},{"slug":"welcome-visitors","title":"Welcome Visitors","date":1506416100647,"synopsis":"Welcome to this [[Federated Wiki]] site. From this page you can find who we are and what we do. New sites provide this information and then claim the site as their own. You will need your own site to participate."},{"slug":"xh2027","title":"XH2027","date":1504262359756,"synopsis":"XH2027 is short for Exponentially Human Twenty Twenty-Seven. It will be held on 16-18 September 2027 and will be a celebration. The idea behind the event is that we can affect the future. Imagining it is a good first step. How much we have to celebrate in 2017 depends in no small way on how well we imagine it now."}]