[{"slug":"bio-commons-camp","title":"Bio-Commons Camp","date":1466363351203,"synopsis":"First day at the bio-commons camp at the Rural Hub in Italy."},{"slug":"bio-strike","title":"Bio-Strike","date":1444135678802,"synopsis":"The overuse of available antibiotics and subsequent [[evolutionary pressure]] has led to the development of multi-resistant bacteria. In the Bio-Strike initiative, citizen around the globe collaborate to by raise awareness on the issue and find new antibiotics and overcome the antibiotics crisis."},{"slug":"biocommons","title":"BioCommons","date":1466320322014,"synopsis":"The biocommons is a place to safeguard and steward the legacy of millions of years of biological evolution. The biocommons is a place to archive, research, and share information about biology, genetics and ecology."},{"slug":"carbon-tax","title":"Carbon Tax","date":1466599787139,"synopsis":"YOUTUBE xKCuDxpccYM"},{"slug":"community","title":"Community","date":1443606605294,"synopsis":"People contributing to this Fedwiki"},{"slug":"diybio","title":"DIYBio","date":1444127406232,"synopsis":"DIYbio Community"},{"slug":"evolutionary-pressure","title":"evolutionary pressure","date":1444135713475,"synopsis":"An overuse of the available antibiotics and subsequent evolutionary pressure led to the development of multi-resistant bacteria. By now, the situation is becoming urgent, as very few effective drugs are left to treat infections. Antibiotic resistance development is a natural process. Bacteria are under selective pressure and evolve mechanisms to avoid the antimicrobial effects of the antibiotics. Once developed, the genes for the resistance then rapidly spread even cross over between different species - a process called horizontal gene transfer. It there"},{"slug":"fedwiki-tools","title":"Fedwiki Tools","date":1466362633746,"synopsis":"Here we list a few tools that are of particular use in managing and creating [[Fedwiki]] content:"},{"slug":"staph-retreat","title":"Staph Retreat","date":1468072752376,"synopsis":"In the war on devilish microbes, our weapons are starting to fail us.What if the only way forward is backward? - [http://www.radiolab.org/story/best-medicine/?utm_source=sharedUrl&utm_medium=metatag&utm_campaign=sharedUrl radiolab.org]"},{"slug":"welcome-visitors","title":"Welcome Visitors","date":1468075245670,"synopsis":"Here we gather information about the [[Biocommons]]."}]