[{"slug":"building-utopia","title":"Building Utopia","date":1429270330380,"synopsis":"In this project we take the historical story (written in 1515), and reconstruct the island and it's governance in Minecraft."},{"slug":"governance-game","title":"Governance Game","date":1429429833584,"synopsis":"[[Utopia]] is a governance game. It is a [[Social Simulation]] of a society in which participants can trade, vote, and participate in how the world is governed."},{"slug":"island","title":"Island","date":1429270562922,"synopsis":"Island suggests isolation - a bad thing?  a stronghold - a good thing?  an \"insular\" thing - a narrow thing.  A lonely challenging thing - Robinson Cruso's thing. an impossible thing - [[No Man is an Island]]."},{"slug":"moira-bovill","title":"Moira Bovill","date":1431164152766,"synopsis":"I am going to assume that I am talking to someone on mars.  Very intelligent but utterly ignorant of my world.  That helps because I can then explain everything from my point of view without being considered patronising, or talking down to whoever is listening."},{"slug":"new-page","title":"New page","date":1429385272134,"synopsis":"A page with 1 items."},{"slug":"no-man-is-an-island","title":"No Man is an Island","date":1429271015051,"synopsis":"This comes from John Donne - [https://en.wikipedia.org/wiki/John_Donne wikipedia]"},{"slug":"platos-republic","title":"Plato's Republic","date":1429273117821,"synopsis":"Was he serious?  That this was a Utopia?  No creatives - no change allowed, because everything is already perfection.  That seems to me to be an absolutely essential mistake.  The whole essence of things human is that we NEVER achieve perfection.  Our best efforts must embrace the possibility of change."},{"slug":"the-game","title":"The Game","date":1429428232114,"synopsis":"Need to know more about Minecraft."},{"slug":"welcome-visitors","title":"Welcome Visitors","date":1429272884240,"synopsis":"I have no idea what I am going to do with this space.  Or who I'm talking to."},{"slug":"who-likes-to-play","title":"who likes to play","date":1429429799457,"synopsis":"A page with 0 items."},{"slug":"who-plays","title":"who plays","date":1429432698288,"synopsis":"We know who plays [[Minecraft]].  Young people who are interested in building things and like to do it in a multiplayer game - ie in collaboration with others."}]