[{"slug":"architectural-pattern","title":"Architectural pattern","date":1507112219464,"synopsis":"An architectural pattern is a general, reusable solution to a commonly occurring problem in software architecture within a given context. Architectural patterns are similar to software design pattern but have a broader scope. The architectural patterns address various issues in software engineering, such as computer hardware performance limitations, high availability and minimization of a business risk. Some architectural patterns have been implemented within software frameworks - [https://en.wikipedia.org/wiki/Architectural_pattern wikipedia]"},{"slug":"argument-map","title":"Argument map","date":1471262644122,"synopsis":"In informal logic and philosophy, an argument map or argument diagram is a visual representation of the structure of an argument - [https://en.wikipedia.org/wiki/Argument_map wikipedia]"},{"slug":"artificial-intelligence","title":"Artificial intelligence","date":1507290994489,"synopsis":"Artificial intelligence (AI, also machine intelligence, MI) is apparently intelligent behaviour by machines, rather than the natural intelligence (NI) of humans and other animals."},{"slug":"artificial-neural-network","title":"Artificial neural network","date":1507291317099,"synopsis":"Artificial neural networks (ANNs) or connectionist systems are computing systems inspired by the biological neural networks that constitute animal brains. Such systems learn (progressively improve performance) to do tasks by considering examples, generally without task-specific programming - [https://en.wikipedia.org/wiki/Artificial_neural_network wikipedia]"},{"slug":"aspect-oriented-programming","title":"Aspect-oriented programming","date":1507112483563,"synopsis":"In computing, aspect-oriented programming (AOP) is a programming paradigm that aims to increase modularity by allowing the separation of cross-cutting concerns. It does so by adding additional behavior to existing code (an advice) without modifying the code itself, instead separately specifying which code is modified via a \"pointcut\" specification, such as \"log all function calls when the function's name begins with 'set'\". This allows behaviors that are not central to the business logic (such as logging) to be added to a program without cluttering the c"},{"slug":"bret-victor","title":"Bret Victor","date":1507632482796,"synopsis":"Bret Victor worked at Apple (2007-2010) as a member of the “HID Proto” future-interface prototyping team, designing UI concepts for experimental hardware platforms."},{"slug":"capturing-the-pattern-space","title":"Capturing the Pattern Space","date":1509205836486,"synopsis":"Publishing patterns in a repository seems to be a promising solution and, to date, many repositories have been"},{"slug":"catalog-of-architectural-patterns","title":"Catalog of architectural patterns","date":1507112311175,"synopsis":"*Three-tier ([[Three-tier (computing)]])"},{"slug":"catalog-of-architectural-styles","title":"Catalog of architectural styles","date":1507112341185,"synopsis":"*Component-based ([[Software componentry]])"},{"slug":"causal-loop-diagram","title":"Causal loop diagram","date":1507553134138,"synopsis":"A causal loop diagram (CLD) is a causal diagram that aids in visualizing how different variables in a system are interrelated. The diagram consists of a set of nodes and edges. Nodes represent the variables and edges are the links that represent a connection or a relation between the two variables. A link marked positive indicates a positive relation and a link marked negative indicates a negative relation. A positive causal link means the two nodes change in the same direction, i.e. if the node in which the link starts decreases, the other node also dec"},{"slug":"causal-model","title":"Causal model","date":1507552273552,"synopsis":"A causal model is an abstract model that describes the causal mechanisms of a system. The model must express more than correlation because correlation does not imply causation. Sewall Wright's path analysis is the theoretical ancestor of causal modeling and causal graphs - [https://en.wikipedia.org/wiki/Causal_model wikipedia]"},{"slug":"causal-networks","title":"Causal networks","date":1507552698281,"synopsis":"A [[causal network]] is a Bayesian network with an explicit requirement that the relationships be causal - [https://en.wikipedia.org/wiki/Bayesian_network#Causal_networks wikipedia]"},{"slug":"changes-to-this-site","title":"Changes to this Site","date":1434532209841,"synopsis":"Below we list recent changes to this site only without also listing changes from the [[Neighbourhood]]:"},{"slug":"christopher-alexander","title":"Christopher Alexander","date":1507111659701,"synopsis":"Christopher Wolfgang Alexander (born 4 October 1936 in Vienna, Austria) is a widely influential architect and design theorist, and currently emeritus professor at the University of California, Berkeley. His theories about the nature of human-centered design have affected fields beyond architecture, including urban design, software, sociology and others. Alexander has designed and personally built over 100 buildings, both as an architect and a general contractor - [https://en.wikipedia.org/wiki/Christopher_Alexander wikipedia]"},{"slug":"cognitive-map","title":"Cognitive map","date":1507552350845,"synopsis":"A cognitive map (sometimes called a mental map or mental model) is a type of mental representation which serves an individual to acquire, code, store, recall, and decode information about the relative locations and attributes of phenomena in their everyday or metaphorical spatial environment. The concept was introduced by Edward Tolman in 1948. The term was later generalized by some researchers, especially in the field of operations research, to refer to a kind of semantic network representing an individual's personal knowledge or schemas - [https://en.w"},{"slug":"critique-of-mind-maps","title":"Critique Of Mind Maps","date":1507543562590,"synopsis":"Mind maps have been around in popular consciousness for a long while, and they don't work anywhere near as well as advocates had hoped."},{"slug":"currently-working-on","title":"Currently Working On","date":1507289912434,"synopsis":"Here is a list of [[Recent Changes]] I consider important. View our experiments on the [[Scratch]] page. To clear stuff saved in your browser try [[Local Changes]]."},{"slug":"cybernetics","title":"Cybernetics","date":1507291210472,"synopsis":"Cybernetics is a transdisciplinary approach for exploring regulatory systems, their structures, constraints, and possibilities. In the 21st century, the term is often used in a rather loose way to imply \"control of any system using technology.\" - [https://en.wikipedia.org/wiki/Cybernetics wikipedia]"},{"slug":"fedwiki-tools","title":"Fedwiki Tools","date":1501695928166,"synopsis":"Here we list a few tools that are of particular use in managing and creating [[Fedwiki]] content."},{"slug":"fuzzy-cognitive-map","title":"Fuzzy cognitive map","date":1507546003890,"synopsis":"A fuzzy cognitive map is a cognitive map within which the relations between the elements (e.g. concepts, events, project resources) of a \"mental landscape\" can be used to compute the \"strength of impact\" of these elements. Fuzzy cognitive maps were introduced by Bart Kosko. Ron Axelrod introduced cognitive maps as a formal way of representing social scientific knowledge and modeling decision making in social and political systems, then brought in the computation fuzzy logic - [https://en.wikipedia.org/wiki/Fuzzy_cognitive_map wikipedia]"},{"slug":"garden-patterns-inventory","title":"Garden Patterns Inventory","date":1465160229837,"synopsis":"We duplicate an illustration from Timeless Way of Building using Graph plugins and our graph building workflow."},{"slug":"gradually-then-suddenly","title":"Gradually, Then Suddenly","date":1511875243420,"synopsis":"One argument favored by education futurists is that while things have changed little in the past century they may change quickly when we least expect it. AI is often cited as a possible trigger. A Hemingway quote from The Sun Also Rises provides the title and context for this idea. (Topics: Artificial Intelligence, Disruption, Education Narratives)."},{"slug":"ishikawa-diagram","title":"Ishikawa diagram","date":1507552498370,"synopsis":"Ishikawa diagrams (fishbone diagrams, herringbone diagrams, cause-and-effect diagrams, or Fishikawa) are causal diagrams created by Kaoru Ishikawa (1968) that show the causes of a specific event - [https://en.wikipedia.org/wiki/Ishikawa_diagram wikipedia]"},{"slug":"logic","title":"Logic","date":1507291993798,"synopsis":"Furthermore, computers can be used as tools for logicians. For example, in symbolic logic and mathematical logic, proofs by humans can be computer-assisted. Using [[automated theorem proving]], the machines can find and check proofs, as well as work with proofs too lengthy to write out by hand."},{"slug":"martin-fowler","title":"Martin Fowler","date":1507112146136,"synopsis":"Martin Fowler (born 1963) is a British software developer, author and international public speaker on software development, specializing in object-oriented analysis and design, UML, patterns, and agile software development methodologies, including extreme programming - [https://en.wikipedia.org/wiki/Martin_Fowler wikipedia]"},{"slug":"michael-mehaffy","title":"Michael Mehaffy","date":1523178801120,"synopsis":"Michael West Mehaffy (born October 24, 1955 in Beaumont, Texas) is an architectural theorist, urban philosopher, researcher, educator, and executive director of [[Sustasis Foundation]], based in Portland, Oregon, USA - [http://www.sustasis.net  sustasis.net]"},{"slug":"mind-map","title":"Mind map","date":1507545844541,"synopsis":"A mind map is a diagram used to visually organize information. A mind map is hierarchical and shows relationships among pieces of the whole. It is often created around a single concept, drawn as an image in the center of a blank page, to which associated representations of ideas such as images, words and parts of words are added. Major ideas are connected directly to the central concept, and other ideas branch out from those - [https://en.wikipedia.org/wiki/Mind_map wikipedia]"},{"slug":"neural-network","title":"Neural network","date":1507291323766,"synopsis":"Artificial neural networks (ANNs) or connectionist systems are computing systems inspired by the biological neural networks that constitute animal brains. Such systems learn (progressively improve performance) to do tasks by considering examples, generally without task-specific programming - [https://en.wikipedia.org/wiki/Artificial_neural_network wikipedia]"},{"slug":"pattern","title":"Pattern","date":1507108646838,"synopsis":"A pattern is a stable arrangement of something over time. In this context we are looking to describe our inner emotional world, and external social context in terms of regularly repeating patterns of thoughts, feelings and behaviours."},{"slug":"pattern-academy","title":"Pattern Academy","date":1507111479282,"synopsis":"The Pattern Academy is about learning together and collecting information about [[Design Pattterns]]."},{"slug":"pattern-language","title":"Pattern language","date":1507111706296,"synopsis":"A pattern language is a method of describing good design practices or patterns of useful organization within a field of expertise. The term was coined by architect [[Christopher Alexander]] and popularized by his 1977 book A Pattern Language - [https://en.wikipedia.org/wiki/Pattern_language wikipedia]"},{"slug":"patterns-of-commoning","title":"Patterns of Commoning","date":1501857049766,"synopsis":"This anthology of essays, co-edited by David Bollier and Silke Helfrich and published in 2015, surveys dozens of notable commons from around the world that exhibit different forms of governance and provisioning in different resource domains."},{"slug":"repository-focus-group","title":"Repository Focus Group","date":1509206067285,"synopsis":"In PLoP 2015, the focus group entitled “Developing an Open, Collaborative Design Pattern Repository\" was conducted"},{"slug":"semantic-network","title":"Semantic Network","date":1471727859207,"synopsis":"A semantic network is a graphic notation for representing knowledge in patterns of interconnected nodes and arcs. It is one way for knowledge visualization and presentation."},{"slug":"simulation","title":"Simulation","date":1507110499670,"synopsis":"Simulation is the imitation of the operation of a real-world process or system over time. The act of simulating something first requires that a model be developed; this model represents the key characteristics, behaviors and functions of the selected physical or abstract system or process. The model represents the system itself, whereas the simulation represents the operation of the system over time - [https://en.wikipedia.org/wiki/Simulation wikipedia]"},{"slug":"software-design-pattern","title":"Software design pattern","date":1507111615487,"synopsis":"In software engineering, a software design pattern is a general reusable solution to a commonly occurring problem within a given context in software design. It is not a finished design that can be transformed directly into source or machine code. It is a description or template for how to solve a problem that can be used in many different situations. Design patterns are formalized best practices that the programmer can use to solve common problems when designing an application or system - [https://en.wikipedia.org/wiki/Software_design_pattern wikipedia]"},{"slug":"stafford-beer","title":"Stafford Beer","date":1522559972524,"synopsis":"Stafford Beer (born Anthony Stafford Beer, 25 September 1926 – 23 August 2002) was a British theorist, consultant and professor at the Manchester Business School. He is best known for his work in the fields of operational research and management cybernetics - [https://en.wikipedia.org/wiki/Stafford_Beer wikipedia]"},{"slug":"sustasis-foundation","title":"Sustasis Foundation","date":1523178701670,"synopsis":"The Foundation’s name, Sustasis, is a Greek word that means “to stand together\" as in a collaboration.  The Foundation is a small catalytic organization that seeks to convene other collaborators in strategic ways, and thereby leverage its small resources for maximum effect - [http://www.sustasis.net/ sustasis.net/]"},{"slug":"symbolic-ai","title":"Symbolic AI","date":1507290889492,"synopsis":"When access to digital computers became possible in the middle 1950s, AI research began to explore the possibility that human intelligence could be reduced to symbol manipulation. The research was centered in three institutions: [[Carnegie Mellon University]], [[Stanford]] and [[MIT]], and each one developed its own style of research. [[John Haugeland]] named these approaches to AI \"good old fashioned AI\" or \"[[GOFAI]]\"."},{"slug":"system-dynamics","title":"System dynamics","date":1507632399249,"synopsis":"System dynamics (SD) is an approach to understanding the nonlinear behaviour of complex systems over time using stocks, flows, internal feedback loops, table functions and time delays - [https://en.wikipedia.org/wiki/System_dynamics wikipedia]"},{"slug":"the-humane-representation-of-thought","title":"The Humane Representation of Thought","date":1507632446085,"synopsis":"VIMEO 115154289"},{"slug":"thought-garden-trails","title":"Thought Garden Trails","date":1507545953690,"synopsis":"Here we are interested in trails or narrative journeys through a set of linked [[Ideas, influences and associations]]."},{"slug":"welcome-visitors","title":"Welcome Visitors","date":1523178097876,"synopsis":"Here we gather notes and research regarding on the [[Thought Patterns]], how we might use them, visualise them, and why we do not see a significant body of publicly available work on the subject."},{"slug":"what-is-a-pattern","title":"What is a pattern?","date":1507111948685,"synopsis":"See also [[Design pattern]]"},{"slug":"wiki-as-pattern-language","title":"Wiki as Pattern Language","date":1523183007523,"synopsis":"\"Wiki is pattern language\" is an artical published by [[Ward Cunningham]] and [[Michael Mehaffy]] in 2013 - [http://dl.acm.org/citation.cfm?id=2725707 acm]"}]