[{"slug":"a-note-on-bitcoin","title":"A Note On Bitcoin","date":1492428651186,"synopsis":"All I’ve said until now should help to explain the disruptive potential of blockchain technologies. Its success would mean the obviation of whole payments cartel."},{"slug":"addressing-environmental-impacts","title":"Addressing environmental impacts","date":1497436586851,"synopsis":"Community currencies play an important role in efforts to better value the planet’s finite resources and incentivise more sustainable behaviour. Often working towards the high level objective of moving away from a money system that relies on endless economic growth, there are a number of ways in which currencies can influence"},{"slug":"bank","title":"Bank","date":1449001117122,"synopsis":"This is a contract for a simple distributed bank application. The core logic (what would normally be the server logic) is contained within smart-contract accounts on a blockchain, which is accessed from node.js via a javascript API (eris-contracts.js). It is a typical setup for a distributed [[Eris]] application."},{"slug":"bernard-lietaer","title":"Bernard Lietaer","date":1494459105771,"synopsis":"Bernard Lietaer (born in 1942 in Lauwe, Belgium) is a civil engineer, economist, author and professor. He studies monetary systems and promotes the idea that communities can benefit from creating their own local or complementary currency, which circulate parallel with national currencies - [https://en.wikipedia.org/wiki/Bernard_Lietaer wikipedia]"},{"slug":"bitcoin","title":"Bitcoin","date":1492424943456,"synopsis":"[[Bitcoin]]. The first blockchain application and decentralised digital currency. Many libertarians hoped the new technology would disintermediate the banking system and force a correction of many flaws in the money system."},{"slug":"blockchain","title":"Blockchain","date":1455113172036,"synopsis":"A blockchain is a peer to peer tool that works something like an open ledger. Every participant in a certain network had access to the whole history of every \"transaction\"- whether it be financial as in the case of Bitcoin, or also general information."},{"slug":"ccia-currency","title":"CCIA currency","date":1497436572909,"synopsis":"This symbol shows the six pilot currencies which were part of the CCIA project: Spice Time Credits, Brixton Pound, Makkie, e-Portemonnee, TradeQoin, and SoNantes. Stories and learnings from these currencies in action are included throughout the book; visit www.ccia.eu for more information and links to their websites."},{"slug":"changes-to-the-money","title":"Changes to the Money","date":1457822050918,"synopsis":"Here we list all the [[Money Sites]] we know of in the federation that concentrate mainly on the commons."},{"slug":"changes-to-this-site","title":"Changes to this Site","date":1457693102202,"synopsis":"Below we list recent changes to this site only without also listing changes from the [[Neighbourhood]]:"},{"slug":"clearing","title":"Clearing","date":1492424969048,"synopsis":"[[Clearing]]. The process of cancelling out debts owed between multiple parties. Clearing can be continuous, or it can be a precursor to ‘settlement’ which means paying the outstanding debts with money or something of value."},{"slug":"community","title":"Community","date":1492424982916,"synopsis":"[[Community]]. The members of an exchange."},{"slug":"community-exchanges","title":"Community Exchanges","date":1492357483432,"synopsis":"A community exchange is a group, often with a web site) that facilitates exchanges of work or value between it's members."},{"slug":"countering-inequality-and-social-exclusion","title":"Countering inequality and social exclusion","date":1497436581168,"synopsis":"The networks and relationships of trust within a community form"},{"slug":"credit-commons","title":"Credit Commons","date":1492505130393,"synopsis":"Credit Commons is a proposal by [[Matthew Slater]] to reform the way finance and [[The Commons]]."},{"slug":"currency-value--taxability","title":"Currency Value & Taxability","date":1492428898592,"synopsis":"When money is ‘backed’ that means that the issuer guarantees to exchange it for a commodity at a predetermined price. The money is in effect a warehouse receipt for, say 1 twenty-fifth of an ounce of gold. This has the effect of anchoring the value of the currency to the value of the backing commodity, which inspires confidence where it may otherwise be lacking. Most of the current wave of local currencies are backed by legal tender."},{"slug":"currently-working-on","title":"Currently Working On","date":1457693174031,"synopsis":"Here is a list of [[Recent Changes]] I consider important. View our experiments on the [[Scratch]] page. To clear stuff saved in your browser try [[Local Changes]]."},{"slug":"debt-monetization","title":"Debt monetization","date":1497018427835,"synopsis":"Debt monetization is the financing of government operations by the [[central bank]] - [https://en.wikipedia.org/wiki/Monetization#Debt_monetization wikipedia]"},{"slug":"deficit-spending","title":"Deficit spending","date":1497019386552,"synopsis":"Deficit spending is the amount by which spending exceeds revenue over a particular period of time, also called simply deficit, or budget deficit; the opposite of budget surplus. The term may be applied to the budget of a government, private company, or individual - [https://en.wikipedia.org/wiki/Deficit_spending wikipedia]"},{"slug":"democratising-services-and-organisations","title":"Democratising services and organisations","date":1497436433904,"synopsis":"Currency projects can be used to shift the balance of power within public sector and voluntary organisations, transforming the way their services are designed and delivered."},{"slug":"effects-of-quantitive-easing","title":"Effects of Quantitive Easing","date":1496925654882,"synopsis":"These measures have the effect of depressing interest yields on government bonds and similar investments, making it cheaper for business to raise capital."},{"slug":"exchange","title":"Exchange","date":1492424993604,"synopsis":"[[Exchange]]. A group of people who exchange and keep accounts with a ledger."},{"slug":"fedwiki-tools","title":"Fedwiki Tools","date":1491993332668,"synopsis":"Here we list a few tools that are of particular use in managing and creating [[Fedwiki]] content."},{"slug":"fiat-money","title":"Fiat money","date":1497014146217,"synopsis":"Fiat money is a currency established as money by government regulation or law. The term derives from the Latin fiat (\"let it become\", \"it will become\") used in the sense of an order or decree. It differs from commodity money and representative money. Commodity money is created from a good, often a precious metal such as gold or silver, which has uses other than as a medium of exchange (such a good is called a commodity), while representative money simply represents a claim on such a good - [https://en.wikipedia.org/wiki/Fiat_money wikipedia]"},{"slug":"financial-crisis-without-end","title":"Financial Crisis Without End","date":1492428188396,"synopsis":"Global credit expansion of the magnitude which commenced under Ronald Reagan and Margaret Thatcher and which continues to this day is premised on indefinite economic growth, which is defined as an increase in Gross Domestic Product, or the amount of money changing hands."},{"slug":"government-spending-in-the-united-kingdom","title":"Government spending in the United Kingdom","date":1496925862666,"synopsis":"See [[UK Government Spending]]."},{"slug":"helicopter-money","title":"Helicopter money","date":1497017196058,"synopsis":"Helicopter money is a tool of unconventional monetary policy that has been proposed as an alternative to quantitative easing (QE) when interest rates are close to zero and the economy remains weak or enters recession."},{"slug":"ledger","title":"Ledger","date":1492425119353,"synopsis":"[[Ledger]]. A definitive list of payments between accounts, starting with all accounts on zero."},{"slug":"ledger-money","title":"Ledger Money","date":1492428922322,"synopsis":"We have seen above a kind of virtual money which exists on a ledger as the imbalance between accounts. There is no money, zero, in the ledger, but only account balances going up and down, their total always being zero."},{"slug":"ledgers-and-rails","title":"Ledgers and rails","date":1492428576516,"synopsis":"The coins jangling in our pockets and the paper furled in our wallets, feel to their bearers like a commodity which can be exchanged for other commodities, as if they had value-in-themselves. And in a very practical sense, if not in a legal one, we do own they money in our pockets. But most money is not in the form of cash but in the form of bank deposits, which is something else entirely. As with money, we need to know who has the right to create bank deposits, and who gives value to bank deposits, by what law banks are allowed to subtract them from our"},{"slug":"lets","title":"LETS","date":1497452214175,"synopsis":"[[LETS]] is an acronym for a [[Local exchange trading system]]. A model for community exchange formulated by [[Michael Linton]], which spread mostly through the middle classes in developed countries the late 1980s and 1990s. Characterised by the use of a ledger plus a directory of members’ offers and needs."},{"slug":"level-one-project","title":"Level One Project","date":1458032541963,"synopsis":"The Level One Project is a [[Gates Foundation]] project to create a level playing field for everyone by building one digital financial system in every country around the world."},{"slug":"local-exchange-trading-system","title":"Local Exchange Trading System","date":1492362451110,"synopsis":"A local exchange trading system (also local employment and trading system or local energy transfer system; abbreviated [[LETS]]) is a locally initiated, democratically organised, not-for-profit community enterprise that provides a community information service and records transactions of members exchanging goods and services by using locally created currency."},{"slug":"magic-money","title":"Magic Money","date":1497016824706,"synopsis":"[[Magic Money]] is \"money out of nothing\" - that is money \"backed\" by nothing, simply \"printed\" (electronically or otherwise) by some entity or other. It can be considered a term of abuse for and by those that do not have a proper understanding of how money is actually created."},{"slug":"monopolies-and-blockchains","title":"Monopolies and Blockchains","date":1457694213850,"synopsis":"\"Whoever controls the data centre exercises political and economic control over communications. It’s difficult to see how we can counteract these recentralising tendencies in order to build a common core infrastructure... barriers include the age-old problem of scaling distributed forms of organisation beyond the local\""},{"slug":"mutual-credit","title":"Mutual Credit","date":1492425152255,"synopsis":"[[Mutual Credit]]. Closed circle accounting in which the sum of all account balances is necessarily zero. It implies a money system is like a cell with a border and an inner life. This contrasts with more open systems of money which allow the unit of account itself to be hoarded out of circulation and made scarce."},{"slug":"mutual-credit-economics","title":"Mutual Credit Economics","date":1492429070102,"synopsis":"Using a ledger in this way, as a closed system with accounts extending credit to each other, is sometimes called mutual credit."},{"slug":"mutual-credit-in-the-real-world","title":"Mutual Credit In The Real World","date":1492429116948,"synopsis":"At the post WWII Bretton Woods conference, Keynes proposed that international trade be conducted through a country-to-country mutual credit system called the Bancor. The conference initially agreed the idea was sound and just, but then the USA unilaterally squashed the idea with a dollar/gold standard, then defaulted on their obligations and created the petrodollar system. Today few alternatives are discussed but the idea of going to back to the bancor has been mooted."},{"slug":"payment","title":"Payment","date":1492425190681,"synopsis":"[[Payment]]. Normally this means settling a debt by giving something of value but the meaning becomes blurred when the value of money of questioned or when banks’ promises to pay money are regarded as good as money itself. So payment can simply mean registering a transaction in a ledger."},{"slug":"people-powered-money","title":"People Powered Money","date":1497436754244,"synopsis":"People Powered Money is the result of a project running from 2012-2015, Community Currencies in Action (CCIA). Part-funded by the European Union’s Interreg project, CCIA is a transnational project in the community currency field, bringing together expert partners from across north-west Europe and co-ordinating six pilot currencies in the United Kingdom, Belgium, the Netherlands and France."},{"slug":"peoples-quantitative-easing","title":"People's Quantitative Easing","date":1497016961503,"synopsis":"People's Quantitative Easing (PQE) was a policy announced by Jeremy Corbyn during the 2015 Labour leadership election which would require the Bank of England to create money to finance government investment. It attracted much media coverage, with some calling it \"economically illiterate\", while others defended the policy - [https://en.wikipedia.org/wiki/People%27s_Quantitative_Easing wikipedia]"},{"slug":"popular-responses-to-the-economic-malaise","title":"Popular responses to the economic malaise","date":1492428445631,"synopsis":"From the 19th Century we still have cooperatives and mutual benefit societies, some of which are thriving. The expression ‘solidarity economy’ emerged from South America and has spread to Europe, and it describes that subset of institutions which value things other than profit. In Spain the integral cooperatives are growing."},{"slug":"protocol-cooperativism","title":"Protocol Cooperativism","date":1492423687013,"synopsis":"Since 'political economy' became a subject in the 18th century, the predominant political dichotomy has been framed as labour versus capital. Marx talked about 'control of the means of production' as the essential political power that the workers needed to wrest from the capitalists. A great deal of activism and political theory continues in that vein: Gar Alpowitz work What then must we do? is all about rebuilding worker-owned coops and similar institutions. We have 150 years of history testifying to their effectiveness."},{"slug":"qe-for-the-people","title":"QE for the people","date":1497017022688,"synopsis":"In response to concerns that QE is failing to create sufficient demand, particularly in the Eurozone, a number of economists have called for \"QE for the people\" or [[People's Quantitative Easing]]."},{"slug":"quantitative-easing","title":"Quantitative easing","date":1497016745182,"synopsis":"Quantitative easing (QE) is a monetary policy in which a central bank creates new electronic money in order to buy government bonds or other financial assets to stimulate the economy (i.e., to increase private-sector spending and return inflation to its target) - [https://en.wikipedia.org/wiki/Quantitative_easing wikipedia]"},{"slug":"quantitive-easing","title":"Quantitive Easing","date":1497014069579,"synopsis":"A misspelling of [[Quantitative Easing]]."},{"slug":"rails","title":"Rails","date":1492425247783,"synopsis":"[[Rails]]. A ledger seen as a payment router. Ledgers can be networked together for greater coverage."},{"slug":"resourcing-the-solidarity-economy","title":"Resourcing the solidarity economy","date":1492428508394,"synopsis":"1.3     Resourcing the solidarity economy"},{"slug":"seigniorage","title":"Seigniorage","date":1497014101533,"synopsis":"Seigniorage /ˈseɪnjərɪdʒ/, also spelled seignorage or seigneurage (from Old French seigneuriage \"right of the lord (seigneur) to mint money\"), is the difference between the value of money and the cost to produce and distribute it. The term can be applied in the following ways: - [https://en.wikipedia.org/wiki/Seigniorage wikipedia]"},{"slug":"sikoba","title":"Sikoba","date":1494458507873,"synopsis":"Sikoba is a decentralised money platform based on peer-to-peer IOUs and built on [[blockchain]] technology."},{"slug":"supporting-the-sme-economy","title":"Supporting the SME economy","date":1497436560068,"synopsis":"Many community currencies are designed to counter the dominance of large corporations through supporting more diverse SME economics and educating consumers about the choices they can exercise. Often part of a long term aim to support more jobs or livelihoods in a local area or particular sector, many of these currencies also seek to foster more sustainable business practices. This symbol appears next to currency projects aimed at supporting SME enterprises to these ends through a range of methods - for example by strengthening networks between independen"},{"slug":"sustainable-exchange","title":"Sustainable Exchange","date":1492597327055,"synopsis":"A page with 0 items."},{"slug":"time-bank","title":"Time bank","date":1492427686881,"synopsis":"[[Time bank]]. A local exchange system which uses hours as the unit of account. Formulated by [[Edgar Cahn]], many governments support timebanking as a ‘social inclusion’ mechanism, and there are national associations in USA, UK, Israel, Australia, New Zealand and elsewhere. Many community groups call themselves time banks but have no ties with national organisations."},{"slug":"towards-a-monetary-commons","title":"Towards a monetary commons","date":1492428793568,"synopsis":"Rachel O'Dwyer attempts to define a monetary commons thus:"},{"slug":"uk-government-spending","title":"UK Government Spending","date":1496926438357,"synopsis":"Central government spending in the United Kingdom, also called public expenditure, is the responsibility of the UK government, the Scottish Government, the Welsh Government and the Northern Ireland Executive. In the financial year 2015-16, total government spending was £772 billion - [https://en.wikipedia.org/wiki/Government_spending_in_the_United_Kingdom wikipedia]"},{"slug":"welcome-visitors","title":"Welcome Visitors","date":1497465084924,"synopsis":"Here we engage with the ideas of a [[Credit Commons]], finance, and alternative forms of money to make the commons more functional and productive for all."}]