[{"slug":"changes-to-coding-sites","title":"Changes to Coding Sites","date":1501665231806,"synopsis":"Here we list changes to all the [[Livecode Sites]]"},{"slug":"changes-to-livecode-sites","title":"Changes to Livecode Sites","date":1536156820628,"synopsis":"Here we list all the sites we know of in the federation that concentrate mainly on [[LiveCode Sites]]:"},{"slug":"changes-to-technology-sites","title":"Changes to Technology Sites","date":1519650218174,"synopsis":"Here we list all the sites we know of in the federation that concentrate mainly on technology and coding."},{"slug":"changes-to-this-site","title":"Changes to this Site","date":1501664738680,"synopsis":"Follow  [[Changes to this Site]], or [[Changes to Livecode Sites]], to see what we are [[Currently Working On]]. Use [[Fedwiki Tools]] to author new content."},{"slug":"coding-sites","title":"Coding Sites","date":1501666141489,"synopsis":"Here we list all the [[Coding Sites]] we know of in the federation:"},{"slug":"decentralized-livecode","title":"Decentralized Livecode","date":1521812963151,"synopsis":"I've been working for a while now on a decentralised, serverless version of [[Livecode]]. The aim is to create an agile coding environment for decentralised application development that works with [[platform.earth]]."},{"slug":"dictionary","title":"Dictionary","date":1512234640039,"synopsis":"Here we experiment with different ways of displaying the [[Livecode]] Dictionary."},{"slug":"fedwiki-tools","title":"Fedwiki Tools","date":1536346568620,"synopsis":"Here we list a few tools that are of particular use in managing and creating [[Fedwiki]] content."},{"slug":"laser-socks","title":"Laser Socks","date":1507128825150,"synopsis":"Laser Socks is a game about jumping around and shooting a laser pointer at an opponent's feet. It was fun, ridiculous, and simple to make. In some ways, Laser Socks became one of the highlight demonstrations of what could be done if there was a medium of expression that integrated dynamic computational elements into the physical world. [http://glench.com/LaserSocks/ post]"},{"slug":"livecode","title":"LiveCode","date":1515112088815,"synopsis":"Livecode is an easy to learn, open source, high level language for creating programs and mobile apps for a variety of platforms including Windows, iOS and Android."},{"slug":"livecode-world","title":"Livecode World","date":1501746337095,"synopsis":"[[Livecode World]] is a place to gather resources, documentation, scripts, extensions, and weave these together into an entirely new world in which code, text, and multimedia combine. Welcome to the World of LiveCode!"},{"slug":"prototype","title":"Prototype","date":1509652176187,"synopsis":"A prototype is an early sample, model, or release of a product built to test a concept or process or to act as a thing to be replicated or learned from."},{"slug":"prototyping","title":"Prototyping","date":1509652253718,"synopsis":"A [[prototype]] is an early sample, model, or release of a product built to test a concept or process or to act as a thing to be replicated or learned from."},{"slug":"welcome-visitors","title":"Welcome Visitors","date":1536189696679,"synopsis":"Welcome to a [[Federated Wiki]] site for the [[World of Livecode]], and [[Livecode Documentation]]. Here we write about code and programming in the [[LiveScript]] and [[Livecode Builder]] languages."},{"slug":"world-of-livecode","title":"World of Livecode","date":1501746329227,"synopsis":"[[Livecode World]] is a place to gather resources, documentation, scripts, extensions, and weave these together into an entirely new world in which code, text, and multimedia combine. Welcome to the World of LiveCode!"},{"slug":"livecode-sites","title":"Livecode Sites","date":1536147673847,"synopsis":"These links are used to calculate recent [[Changes to Livecode Sites]]. The Livecode sites are listed on the Welcome Visitors page of:"},{"slug":"livecode-documentation","title":"Livecode Documentation","date":1536154648738,"synopsis":"This site is for [[Livecode]] documentation."},{"slug":"free-culture","title":"Free Culture","date":1536155934777,"synopsis":"The [[free-culture movement]] is a social movement that promotes the freedom to distribute and modify creative works in the form of free content or open content by using the Internet and other forms of media - [https://en.wikipedia.org/wiki/Free-culture_movement wikipedia]"},{"slug":"free-culture-image","title":"Free Culture Image","date":1429352895419,"synopsis":"In order to search for a [[Free Culture]] Image to your page go to [http://images.google.com/advanced_image_search images.google.com]"},{"slug":"free-music-archive","title":"Free Music Archive","date":1456597751831,"synopsis":"The Free Music Archive (FMA) is a precious gem for readers who thrill to"},{"slug":"open-source","title":"Open-source","date":1423598677318,"synopsis":"In production and development, open source as a development model promotes a universal access via a free license to a product's design or blueprint, and universal redistribution of that design or blueprint, including subsequent improvements to it by anyone."},{"slug":"creative-commons","title":"Creative Commons","date":1516036680830,"synopsis":"Creative Commons (CC) is an American non-profit organization devoted to expanding the range of creative works available for others to build upon legally and to share. The organization has released several copyright-licenses known as Creative Commons licenses free of charge to the public - [https://en.wikipedia.org/wiki/Creative_Commons wikipedia]"},{"slug":"gnu-general-public-license","title":"GNU General Public License","date":1536154798663,"synopsis":"The GNU General Public License (GNU GPL or GPL) is a widely used free software license, which guarantees end users the freedom to run, study, share and modify the software. The license was originally written by Richard Stallman of the Free Software Foundation (FSF) for the GNU Project, and grants the recipients of a computer program the rights of the Free Software Definition.  The GPL is a copyleft license, which means that derivative work can only be distributed under the same license terms. This is in distinction to permissive free software licenses, o"},{"slug":"students-for-free-culture","title":"Students for Free Culture","date":1536155909774,"synopsis":"Students for Free Culture, formerly known as FreeCulture.org, is an international student organization working to promote free culture ideals, such as cultural participation and access to information. It was inspired by the work of former Stanford, now Harvard, law professor Lawrence Lessig, who wrote the book Free Culture, and it frequently collaborates with other prominent free culture NGOs, including Creative Commons, the Electronic Frontier Foundation, and Public Knowledge.  Students for Free Culture has over 30 chapters on college campuses around th"},{"slug":"remix-culture","title":"Remix culture","date":1536155947985,"synopsis":"Remix culture, sometimes read-write culture, is a society that allows and encourages derivative works by combining or editing existing materials to produce a new creative work or product. A remix culture would be, by default, permissive of efforts to improve upon, change, integrate, or otherwise remix the work of copyright holders. While a common practice of artists of all domains throughout human history, the growth of exclusive copyright restrictions in the last several decades limits this practice more and more by the legal chilling effect. As reactio"},{"slug":"open-society","title":"Open society","date":1536155967784,"synopsis":"The open society was conceived in 1932 by French philosopher Henri Bergson. The idea was further developed during the Second World War by Austrian-born British philosopher Karl Popper.Bergson describes a closed society as a closed system of law or religion.  It is static, like a closed mind. Bergson suggests that if all traces of civilization were to disappear, the instincts of the closed society for including or excluding others would remain.   In contrast, an open society is dynamic and inclined to moral universalism.Popper saw the open society as part"},{"slug":"regular-expression","title":"Regular expression","date":1536220633737,"synopsis":"A regular expression, [[regex]] or regexp (sometimes called a rational expression) is, in theoretical computer science and formal language theory, a sequence of characters that define a search pattern. Usually this pattern is then used by string searching algorithms for \"find\" or \"find and replace\" operations on strings, or for input validation. - [https://en.wikipedia.org/wiki/Regular_expression wikipedia]"},{"slug":"technology-sites","title":"Technology Sites","date":1536157437087,"synopsis":"A list of sites that document technology related to the technology. There are also a bunch of [[Dead Sites]]."},{"slug":"pcre","title":"PCRE","date":1536157683581,"synopsis":"__Perl Compatible Regular Expressions__ (__PCRE__) is a [[library (computing)]] written in [[C (programming language)]], which implements a [[regular expression]] engine, inspired by the capabilities of the [[Perl]]. [[Philip Hazel]] started writing PCRE in summer 1997. PCRE's syntax is much more powerful and flexible than either of the [[regular expression#POSIX]] flavors and than that of many other regular-expression libraries."},{"slug":"regex","title":"Regex","date":1536162881312,"synopsis":"A [[regular expression]], regex or regexp (sometimes called a rational expression) is, in theoretical computer science and formal language theory, a sequence of characters that define a search pattern. Usually this pattern is then used by string searching algorithms for \"find\" or \"find and replace\" operations on strings, or for input validation. - [https://en.wikipedia.org/wiki/Regular_expression wikipedia]"},{"slug":"regex-examples","title":"Regex examples","date":1536217682578,"synopsis":"A [[regular expression]], [[regex]] or regexp is a sequence of characters that define a search pattern. Usually this pattern is then used by string searching algorithms for \"find\" or \"find and replace\" operations on strings, or for input validation. - [https://en.wikipedia.org/wiki/Regular_expression wikipedia]"},{"slug":"issue","title":"Issue","date":1458147677831,"synopsis":"Here we list issues to do with the [[Himalayan Academy Web Sites]]."}]