[{"slug":"basic-income","title":"Basic income","date":1466959128429,"synopsis":"An unconditional basic income (also called basic income, basic income guarantee, universal basic income, universal demogrant, or citizen's income) is a form of social security system in which all citizens or residents of a country regularly receive an unconditional sum of money, either from a government or some other public institution, in addition to any income received from elsewhere - [https://en.wikipedia.org/wiki/Basic_income wikipedia]"},{"slug":"citizens-economic-council","title":"Citizen’s Economic Council","date":1509885448764,"synopsis":"This is the video economists don’t want you to see! Chang explains why every single person can and SHOULD get their head around basic economics. He pulls back the curtain on the often mystifying language of derivatives and quantitative easing, and explains how easily economic myths and assumptions become gospel. Arm yourself with some facts, and get involved in discussions about the fundamentals that underpin our day-to-day lives."},{"slug":"currently-working-on","title":"Currently Working On","date":1501358139973,"synopsis":"Here we list a few tools that are of particular interest:"},{"slug":"economics-is-for-everyone","title":"Economics is for everyone","date":1509886450228,"synopsis":"This is the [[RSA Animate]] video economists don’t want you to see! Chang explains why every single person can and SHOULD get their head around basic economics."},{"slug":"fedwiki-tools","title":"Fedwiki Tools","date":1521839128259,"synopsis":"Here we list a few tools that are of particular use in managing and creating [[Fedwiki]] content."},{"slug":"impact-investing","title":"Impact investing","date":1512495028152,"synopsis":"Impact investing refers to investments \"made into companies, organizations, and funds with the intention to generate a measurable, beneficial social or environmental impact alongside (or in lieu of) a financial return.\" - [https://en.wikipedia.org/wiki/Impact_investing wikipedia]"},{"slug":"impact-investing-by-individuals","title":"Impact Investing by Individuals","date":1512494914562,"synopsis":"Impact investing historically took place through mechanisms aimed at institutional investors. However, there are ways for individuals to participate in providing early stage or growth funding to such ventures."},{"slug":"institutional-impact-investing","title":"Institutional Impact Investing","date":1512494249448,"synopsis":"Impact investments occur across asset classes and investment amounts. Among the best-known mechanism is private equity or venture capital. \"[[Social venture capital]]\", or \"patient capital\", impact investments are structured similarly to those in the rest of the venture capital community. Investors may take an active role mentoring or leading the growth of the company,[http://www.nasdaq.com/article/wealthy-attracted-to-impact-investing-cm23388 Wealthy Attracted To Impact Investing] similar to the way a venture capital firm assists in the growth of an ear"},{"slug":"islamic-finance","title":"Islamic Finance","date":1506937911037,"synopsis":"Islamic banking or Islamic finance (Arabic: مصرفية إسلامية‎‎) or sharia-compliant finance is banking or financing activity that complies with sharia (Islamic law) and its practical application through the development of Islamic economics."},{"slug":"lottery","title":"Lottery","date":1501321799604,"synopsis":"A lottery is a form of legalized government gambling that involves the drawing of numbers for a prize. Lotteries are outlawed by some governments, while others endorse it to the extent of organizing a national or state lottery. It is common to find some degree of regulation of lottery by governments; the most common regulation is prohibition of sale to minors."},{"slug":"people-powered-money","title":"People Powered Money","date":1515510424266,"synopsis":"People Powered Money is a forthcoming conference that we will be running at various locations around the world on financial systems that are currently operating, or in the process of being created that offer an alternative to mainstream economic thinking."},{"slug":"ponzi-scheme","title":"Ponzi scheme","date":1501358506274,"synopsis":"A Ponzi scheme (; also a Ponzi game) is a fraudulent investment operation where the operator generates returns for older investors through revenue paid by new investors, rather than from legitimate business activities. Operators of Ponzi schemes can be either individuals or corporations, and grab the attention of new investors by offering short-term returns that are either abnormally high or unusually consistent - [https://en.wikipedia.org/wiki/Ponzi_scheme wikipedia]"},{"slug":"rsa-animate","title":"RSA Animate","date":1509887100009,"synopsis":"The RSA Animate series was conceived as an innovative, accessible and unique way of illustrating and sharing the world-changing ideas from the RSA's free public events programme."},{"slug":"scam-coin","title":"Scam Coin","date":1501358454939,"synopsis":"Here we research the history of scam coins and ico's:"},{"slug":"welcome-visitors","title":"Welcome Visitors","date":1522224017764,"synopsis":"[[People Powered Money]] is a conference that we will be running at various locations around the world on financial systems that are currently operating, or in the process of being created that offer an alternative to mainstream economic thinking."}]