[{"slug":"due-diligence","title":"Due diligence","date":1514134302990,"synopsis":"Due diligence is an investigation of a business or person prior to signing a contract, or an act with a certain standard of care - [https://en.wikipedia.org/wiki/Due_diligence wikipedia]"},{"slug":"eco-investing","title":"Eco-investing","date":1514134345537,"synopsis":"Eco-investing or green investing, is a form of socially responsible investing where investments are made in companies that support or provide environmentally friendly products and practices. These companies encourage (and often profit from) new technologies that support the transition from carbon dependence to more sustainable alternatives - [https://en.wikipedia.org/wiki/Eco-investing wikipedia]"},{"slug":"green-economy","title":"Green economy","date":1514134916770,"synopsis":"The green economy is defined as an economy that aims at reducing environmental risks and ecological scarcities, and that aims for sustainable development without degrading the environment - [https://en.wikipedia.org/wiki/Green_economy wikipedia]"},{"slug":"green-investment","title":"Green Investment","date":1514134382586,"synopsis":"[[Eco-investing]] or green investing, is a form of socially responsible investing where investments are made in companies that support or provide environmentally friendly products and practices. These companies encourage (and often profit from) new technologies that support the transition from carbon dependence to more sustainable alternatives - [https://en.wikipedia.org/wiki/Eco-investing wikipedia]"},{"slug":"holochain","title":"Holochain","date":1514134906111,"synopsis":"Holographic storage for distributed applications. A holochain is a validating distributed hash table (DHT) where every node enforces validation rules on data against the signed chains where the data originated - [http://ceptr.org/projects/holochain ceptr.org]"},{"slug":"research-group","title":"Research Group","date":1514134632238,"synopsis":"Research groups are small study groups of people working together and sharing research and learning on a particular topic."},{"slug":"research-group-activity","title":"Research Group Activity","date":1504529643074,"synopsis":"Here we list views of the activity of groups and individual related to the current project. You may want to keep an eye on:"},{"slug":"thought-piece","title":"Thought Piece","date":1514133436178,"synopsis":"Here I'd like to explore the issue of [[long-form writing]] vs [[long-form podcasts]]. What is the mechanism to combine the depth of deliberation these forms enable, with more direct emotionally relevant short-form pieces."},{"slug":"vizzuality","title":"Vizzuality","date":1514134257062,"synopsis":"Vizzuality is a science and technology company focused on data visualization, web-GIS and tool development and committed to working on projects related to conservation, the environment and sustainable development. They have two offices, in Madrid and Cambridge - [https://en.wikipedia.org/wiki/Vizzuality wikipedia]"},{"slug":"welcome-visitors","title":"Welcome Visitors","date":1514147614641,"synopsis":"Here we start writing together about the [[Green Economy]] and [[Due Diligence]] for [[Green Investment]]s."}]