[{"slug":"certified-friendly-photographer","title":"Certified Friendly Photographer","date":1493513295030,"synopsis":"When an organization adds more than one person per week others will quickly lose track of who's who. An organization this size should commission colleagues to fill a public image catalog and keep it up to date with retakes."},{"slug":"change-my-flag","title":"Change My Flag","date":1493213127825,"synopsis":"The [[About Flagmatic Plugin]] offers an assortment of flags that can replace that of the logged-in site."},{"slug":"decentralised-conversation","title":"Decentralised Conversation","date":1499442923014,"synopsis":"Decentralised [[Conversation]] is a conversation which happens between people or groups of people at different geographical locations but not an online only conversation. It can be done synchronously or asynchronously."},{"slug":"fedwiki-tools","title":"Fedwiki Tools","date":1499258461696,"synopsis":"Here we list a few tools that are of particular use in managing and creating [[Fedwiki]] content."},{"slug":"first-photo-of-a-human-being","title":"First Photo of a Human Being","date":1499444314125,"synopsis":"Strange and beautiful. The early photographs needed an exposure time of about seven minutes. So scenes like this, where the streets were teeming with people, would appear deserted. A city of vampires, no one showing in the photographs. Here we see the first photograph of a human being, a person that must have stayed in the same place long enough to be registered."},{"slug":"henry-fox-talbot","title":"Henry Fox Talbot","date":1499444265787,"synopsis":"William Henry Fox Talbot (11 February 1800 – 17 September 1877) was a British scientist, inventor and photography pioneer who invented the salted paper and calotype processes, precursors to photographic processes of the later 19th and 20th centuries."},{"slug":"mobile-camera-integration","title":"Mobile Camera Integration","date":1438339330202,"synopsis":"Mobile devices have amazingly capable still and video cameras, that can be used in a number of ways with [[Federated Wiki]]."},{"slug":"ninas-activity","title":"Nina's Activity","date":1502810381097,"synopsis":"Here we list [[Nina Bumbalkova]]'s writing:"},{"slug":"research-group-activity","title":"Research Group Activity","date":1502810294440,"synopsis":"Here we list views of the activity of groups and individual related to the current project. You may want to keep an eye on:"},{"slug":"welcome-visitors","title":"Welcome Visitors","date":1502810821731,"synopsis":"A research group for [[Snack Productions]]. Here we collect pages about video, film and documentary production."},{"slug":"you-and-camera-move","title":"You and Camera Move","date":1416678248788,"synopsis":"Slumdog Millionaire cinematographer Anthony Dod Mantle offers 10 tips for those entering his profession. This one is about photography. [http://www.bbc.com/news/entertainment-arts-30128725 bbc]"}]