[{"slug":"-a-trip-around-mars---1","title":" A Trip Around Mars - 1","date":1467756862882,"synopsis":"Kevin Fong visits landscapes that inspire scientists and artists to imagine, including volcanoes that dwarf Everest and extreme canyons. Originally broadcast 22 April 2013. - [http://www.bbc.co.uk/programmes/p03cs2mw bbc]"},{"slug":"-a-trip-around-mars---2","title":" A Trip Around Mars - 2","date":1467756967508,"synopsis":"Mountains straight out of Tolkien, catastrophic floods and streams gushing with boiling and freezing water. Kevin Fong tours Mars. Originally broadcast 29 April 2013. - [http://www.bbc.co.uk/programmes/p03cs2zk bbc]"},{"slug":"-kathy-willis","title":" Kathy Willis","date":1467755216479,"synopsis":"\"I'm determined to prove botany is not the 'Cinderella of science'\". That's what Professor Kathy Willis, Director of Science at the Royal Botanic Garden in Kew, told the Independent in 2014. - [http://www.bbc.co.uk/programmes/b06nnqdl bbc]"},{"slug":"20150721","title":"20150721","date":1438807485219,"synopsis":"Here we have an example of a video hosted on [[IPFS]] but embedded in the [[Federation]]. This example uses the publicly available IPFS website."},{"slug":"a-fedwiki-style-sheet","title":"A FedWiki Style Sheet","date":1498643980677,"synopsis":"Here we present for refinement some of the fundamental writing practices for a FedWiki genre. The wiki genre facilitates readers and writers aiming to capture, share, and reuse networked community knowledge."},{"slug":"aaron-swartz","title":"Aaron Swartz","date":1466676788218,"synopsis":"Aaron Hillel Swartz (November 8, 1986 – January 11, 2013) was an American computer programmer, entrepreneur, writer, political organizer, and Internet hacktivist. He was involved in the development of the web feed format RSS and the Markdown publishing format, the organization Creative Commons, the website framework web.py, and the social news site Reddit, in which he became a partner after its merger with his company, Infogami - [https://en.wikipedia.org/wiki/Aaron_Swartz wikipedia]"},{"slug":"aarons-laws","title":"Aaron's Laws","date":1512221797410,"synopsis":"In 2013, Lessig was appointed as the Roy L. Furman Professor of Law and Leadership; his chair lecture was titled \"Aaron's Laws: Law and Justice in a Digital Age.\" - [http://harvardcrcl.org/a-summary-of-laurence-lessigs-chair-lecture-at-harvard-law-school/ harvardcrcl.org]."},{"slug":"about-forking","title":"About Forking","date":1437923412354,"synopsis":"Everything you wanted to know about forking. What is a fork? Why do you need to know? And why is it so beautiful?"},{"slug":"about-home","title":"About Home","date":1524062340241,"synopsis":"Home or a welcome-XXX page is a unique and intuitive concept that we can leverage in wiki."},{"slug":"about-json-plugin","title":"About JSON Plugin","date":1491669637220,"synopsis":"The plugin exposes restful endpoints for reading and writing JSON data that will be stored within the item along with other items on the page. Changes in configuration of the plugin are recorded in the journal but updates to the data itself are recorded elsewhere."},{"slug":"about-popup-plugin","title":"About Popup Plugin","date":1462754333855,"synopsis":"Here we experiment with window to window messaging in order to control from and/or to federated wiki lineups."},{"slug":"about-provenance","title":"About Provenance","date":1414118102433,"synopsis":"Wiki uses domain names as the identity of individuals or organizations in the federation. We are pretty sure of the domain name for sites we contact directly. If we trust that site then we can work back further."},{"slug":"about-time","title":"About Time","date":1475588344314,"synopsis":"Time and therefore change which leads to uncertainty are not built into our programming languages. Indeed nor is it built into much of our philosophy, or common sense modes of thinking.  What would a language look like that builds in the idea of time?"},{"slug":"about-transclusion-plugin","title":"About Transclusion Plugin","date":1523984375615,"synopsis":"A possible exception is the need to transclude content. [[Transclusion]] is not a core feature of federated wiki, however we can transclude paragraphs, sections or entire pages using the [[about-frame-plugin]]."},{"slug":"acid-properties","title":"ACID Properties","date":1438596070276,"synopsis":"ACID is a set of properties that guarantee that database transactions are processed reliably- [http://en.wikipedia.org/wiki/ACID wikipedia]"},{"slug":"add-paragraph-plugin","title":"Add Paragraph Plugin","date":1438439264992,"synopsis":"The [[Add Paragraph Plugin]] is a generic [[REST Plugin]] that enables simple and flexible integration with [[Federation REST Services]] provided by developers for the wider community of users."},{"slug":"affinity-posting","title":"Affinity Posting","date":1437923548480,"synopsis":"On Twitter many retweets come about as a way to express affinity with ideas, not spread information. Retweeting the cone is a way to show that you believe in visualizations, or active learning, or a number of other things beyond boring lecture."},{"slug":"against-https","title":"Against HTTPS","date":1455290087003,"synopsis":"Tim Berners-Lee reflects on the introduction of https as a trigger for more secure communication. The arguments 20 years ago were divided. Simple minded arguments for https everywhere are even more shallow today. [https://www.w3.org/DesignIssues/Security-NotTheS.html w3c]"},{"slug":"age-of-entanglement","title":"Age of Entanglement","date":1457710242683,"synopsis":"As our technological and institutional creations have become more complex, our relationship to them has changed. We now relate to them as we once related to nature. The Enlightenment is Dead, Long Live the Entanglement."},{"slug":"agile-alliance","title":"Agile Alliance","date":1474516398288,"synopsis":"[[Agile Alliance]] is not-for-profit 501(c)(6) trade association devoted to the improvement of business"},{"slug":"agile-bridge","title":"Agile Bridge","date":1105431035000,"synopsis":"I'm writing this on a [[Wiki Wiki Web]] because I hate writing papers and articles. Papers and articles can't be changed, and I keep changing my mind, which is sometimes easier to change than hair-colour. -- [[Cohan Carlos]]"},{"slug":"allan-kaprow","title":"Allan Kaprow","date":1466768532485,"synopsis":"Allan Kaprow (August 23, 1927 – April 5, 2006) was an American painter, assemblagist and a pioneer in establishing the concepts of performance art. He helped to develop the \"Environment\" and \"Happening\" in the late 1950s and 1960s, as well as their theory - [https://en.wikipedia.org/wiki/Allan_Kaprow wikipedia]"},{"slug":"almost-instant-web-sites","title":"Almost Instant Web Sites","date":1426332144899,"synopsis":"Now running web sites involves ftping files to servers, and running complex perl scripts."},{"slug":"alternative-editors","title":"Alternative Editors","date":1438334997169,"synopsis":"There are some strong reasons to consider creating alternative editors for Fedwiki (see above). One of them is the need to translate the experience to mobile, another is the requirement to fit into environments that are problematic for a [[NodeJs]] install."},{"slug":"ambient-computing","title":"Ambient Computing","date":1453132719657,"synopsis":"Ambient computing is a newish phrase without a clear definition. We use it here to refer to  a slower, social form of computation which occurs and is visualised through the participation of network actors."},{"slug":"anatomy-of-a-server","title":"Anatomy of a Server","date":1437493431506,"synopsis":"Here we describe the essential elements that make up a [[Wiki Node Server]]:"},{"slug":"andries-van-dam","title":"Andries van Dam","date":1466755193262,"synopsis":"Andries \"Andy\" van Dam (born 8 December 1938 in Groningen) is a Dutch-born American professor of computer science and former vice-president for research at Brown University in Providence, Rhode Island. Together with Ted Nelson he contributed to the first hypertext system, Hypertext Editing System (HES) in the late 1960s. He co-authored Computer Graphics: Principles and Practice along with J.D. Foley, S.K. Feiner, and John Hughes. He also co-founded the precursor of today's ACM SIGGRAPH conference - [https://en.wikipedia.org/wiki/Andy_Van_Dam wikipedia]"},{"slug":"animals-that-think-functionally","title":"Animals That Think Functionally?","date":1450519310207,"synopsis":"Why do we see and perhaps to a lesser extent think of the world in terms of objects? This question is posed in the light of the rising importance of [[Functional Programming]] of the non-set theory forms of logic that support this paradigm (see [[Homotopy Type Theory]]."},{"slug":"appearin","title":"appear.in","date":1466935114316,"synopsis":"Here we explore the idea of using appear.in, instead of [[Google Hangouts]] for [[Fedwiki Happenings]]. Appear.in is built on top of [[WebRTC]] and web standards so we are able to use CSS and HTML to style where and how the video chat rooms appear in wiki."},{"slug":"aquaponics","title":"Aquaponics","date":1466188578683,"synopsis":"Aquaponics /ˈækwəˈpɒnᵻks/, refers to any system that combines conventional aquaculture (raising aquatic animals such as snails, fish, crayfish or prawns in tanks) with hydroponics (cultivating plants in water) in a symbiotic environment. In normal aquaculture, excretions from the animals being raised can accumulate in the water, increasing toxicity. In an aquaponic system, water from an aquaculture system is fed to a hydroponic system where the by-products are broken down by Nitrifying bacteria into nitrates and nitrites, which are utilized by the plants"},{"slug":"archive","title":"Archive","date":1459337874190,"synopsis":"A simple page..."},{"slug":"archive-everything","title":"Archive Everything","date":1448361841807,"synopsis":"Here we look at how we might archive our digital heritage, starting with pragmatic baby steps, but leading towards the vision of the [[Permanent Web]] and the [[Way Back Machine]]."},{"slug":"arguments-for-alternative-editors","title":"Arguments for Alternative Editors","date":1438335616459,"synopsis":"People have asked me in the past if we could replicate the pedagogy with a simpler, more commercially available tool, such as WordPress, Ghost, or Dokuwiki. There are many people who would consider running a federated wiki style class if it were a WordPress extension."},{"slug":"arguments-for-portability","title":"Arguments for Portability","date":1438335243199,"synopsis":"There is another argument however that I feel is just as pressing, and that is to provide a physical, visible, and more explicit demonstration of the [[Federations Core Goals]] - in particular [[Data Ownership]] and [[Data Portability]]."},{"slug":"as-we-may-think","title":"As We May Think","date":1466754983830,"synopsis":"Links are made by readers not just writers. The major linking is done by readers. Like if you did a search while a person was talking about making links."},{"slug":"assets-in-ipfs","title":"Assets in IPFS","date":1475209485704,"synopsis":"We explore distributing assets via a node on localhost. The strategy is to store postcard sized assets in the json along with full resolution content in ipfs. Double-click will retrieve and display the ipfs version."},{"slug":"attribution-in-a-federated-wiki","title":"Attribution in a Federated Wiki","date":1419004700166,"synopsis":"In conversations about comments and forks, happening participants have expressed frustration with not being able to tell who wrote what when. I put it this way:"},{"slug":"audio-note","title":"Audio Note","date":1466950547009,"synopsis":"We use audio extensively in wiki, both as a process of outlining early stage ideas, and as a means to broadcast, or narrow-cast these ideas by means of audio-podcasting."},{"slug":"audio-notes-in-wiki","title":"Audio Notes in Wiki","date":1466950466583,"synopsis":"Some thoughts about sharing ideas in audio-notes embedded in wiki."},{"slug":"audio-transcription","title":"Audio Transcription","date":1470319833986,"synopsis":"[[Google Cloud Speech API]] enables developers to convert audio to text by applying powerful neural network models in an easy to use API."},{"slug":"audioboom-page-webservice","title":"Audioboom Page Webservice","date":1438565254701,"synopsis":"This is the first example of a number of web services we will create to experiment with extending the range of software contributions people can make to the project through the use of web service to enable a pragmatic form of [[Polyglot Programming]]"},{"slug":"auth0","title":"Auth0","date":1510693514230,"synopsis":"Below are a collection of links imported from [[OneTab]]. You can view these links here - [https://www.one-tab.com/page/n0LoJzNUSv60PNOkmFXwHg one-tab.com]:"},{"slug":"authentication","title":"Authentication","date":1510666315052,"synopsis":"Authentication is the act of confirming the truth of an attribute of a single piece of data claimed true by an entity."},{"slug":"authoring","title":"Authoring","date":1523957359244,"synopsis":"There is no rigid distinction between authoring and reading. In traditional social or wiki fashion the definition is slightly blurred or fuzzy.  That said let's go on and make this distinction."},{"slug":"authoring-graphs-in-wiki","title":"Authoring Graphs In Wiki","date":1464605119358,"synopsis":"Here we look at how wiki can be used to author, or define a network simply be creating wiki links between pages, or by using a special markup within wiki."},{"slug":"authoring-power","title":"Authoring Power","date":1467105806180,"synopsis":"We have the full power of drag and drop authoring, or rich media, images, video and html. We have an IDE and debugger - so we have the ability to explore and publish code. We have a rich open-source cross-platform authoring interface."},{"slug":"authoring-tools","title":"Authoring Tools","date":1524054209856,"synopsis":"We are defining an authoring tool for wiki as something distinct to a [[refactoring tool]]. An authoring tool either brings new information into wiki, creates new wiki-page content rendered by other plugins ([[refactoring tools]])."},{"slug":"authority-from-trail-climbing","title":"Authority from Trail Climbing","date":1510709608204,"synopsis":"We favor mobility of expression over compounding of [[citation]]s. Where history is explicit and explorable few words need be further spent on the subject. We leave it to the reader to seek the source and then judge themselves whether authority has waxed or waned."},{"slug":"authors-of-forked-content","title":"Authors of Forked Content","date":1423998082906,"synopsis":"An author may be very interested for a range of reasons in who has forked there work, or they may not. Both scenarios are important and should be respected. Authors should be in control and not the software."},{"slug":"basic-happening","title":"Basic Happening","date":1440452688539,"synopsis":"A basic Happening, is simply an event that takes part of an evening - say 7pm till 11pm in which the participants meet online to write and research together."},{"slug":"bbc-transport","title":"BBC Transport","date":1468681110329,"synopsis":"This [[Transport]] allows you to create a fedwiki [[ghost page]] from the data displayed on [[BBC Radio]] site or form a BBC radio podccast."},{"slug":"benefits-of-jwts","title":"Benefits of JWT's","date":1502463653357,"synopsis":"There are a number of benefits to using [[Jason Web Tokens]]:"},{"slug":"better-authentication","title":"Better Authentication","date":1464594542469,"synopsis":"Here I collect some links about Paul and Ward's work on improving the way we authenticate to wiki."},{"slug":"better-happenings","title":"Better Happenings","date":1464594599945,"synopsis":"Here we learn from past [[Happening]]s and look to learn from them."},{"slug":"bicycle-bug","title":"Bicycle Bug","date":1427709578198,"synopsis":"A neologism for a type of software or interface bug, that shows itself even to experienced users."},{"slug":"biketown","title":"Biketown","date":1469061070308,"synopsis":"Portland's bike share program launched in July 2016 with 1,000 bikes at 100 stations across downtown and several neighborhoods. [https://www.biketownpdx.com/ site]"},{"slug":"biological-inspiration","title":"Biological Inspiration","date":1447619717359,"synopsis":"We ask, through what thought processes have we guided federated wiki's mechanisms and has that guidance proven sound?"},{"slug":"bittorrent","title":"BitTorrent","date":1466675910521,"synopsis":"BitTorrent is a communications protocol of peer-to-peer file sharing which is used to distribute data over the Internet. BitTorrent is one of the most common protocols for transferring large files, and peer-to-peer networks have been estimated to collectively account for approximately 43% to 70% of all Internet traffic (depending on location) as of February 2009. In November 2004, BitTorrent was responsible for 25% of all Internet traffic. As of February 2013, BitTorrent was responsible for 3.35% of all worldwide bandwidth, more than half of the 6% of to"},{"slug":"block-chain","title":"Block Chain","date":1455113028271,"synopsis":"A block chain is a transaction database shared by all nodes participating in a system. Block chain technology was popularised by the cryptographic currency [[Bitcoin]]."},{"slug":"block-server","title":"Block Server","date":1461351916945,"synopsis":"Block Server or BlockServer is a term that I am using for an HTTP server which interacts with the [[Blockchain]] and / or decentralised protocols such as [[IPFS]]."},{"slug":"bootstrap-4","title":"Bootstrap 4","date":1453225879074,"synopsis":"Bootstrap 4 is a massive undertaking that touches nearly every line of code. Source code for v4 is available in a v4-dev branch on [https://github.com/twbs/bootstrap/tree/v4-dev github]"},{"slug":"born-claimed","title":"Born Claimed","date":1464604443320,"synopsis":"We need and seek to create the ability to create wiki sites for a stranger, that only they can write on. Sites created as invitations to join, are at the present offered on a first-come-first served basis wide open on the public internet. This is not ideal."},{"slug":"bounded-context","title":"Bounded Context","synopsis":"Multiple models are in play on any large project. Yet when code based on distinct models is combined, software becomes buggy, unreliable, and difficult to understand. Communication among team members becomes confused. It is often unclear in what context a model should <i>not</i> be applied."},{"slug":"bret-victor","title":"Bret Victor","date":1507034167557,"synopsis":"Bret Victor worked at Apple (2007-2010) as a member of the “HID Proto” future-interface prototyping team, designing UI concepts for experimental hardware platforms."},{"slug":"bruno-latour","title":"Bruno Latour","date":1470389020098,"synopsis":"Bruno Latour is a philosopher of science and sympathetic critic of [[Deep Ecology]], which he seeks to replace with a [[Political Ecology]]. I sometimes blog about these things over at [http://parliamentofthings.org parliamentofthings.org]."},{"slug":"building-skyscrapers","title":"Building Skyscrapers","date":1466350932391,"synopsis":"How do we build skyscrapers? Should we build skyscrapers? Large networked systems have problems of scale. We should look to natural systems to see alternative paradigms. Evolution has faced viral threats for a long long time."},{"slug":"burak-arikan","title":"Burak Arikan","date":1452424823179,"synopsis":"Burak Arikan is an artist based in New York and Istanbul who works with complex networks. He runs social, economical, and political issues through an abstract machinery, which generates network maps and algorithmic interfaces, results in performances, and renders inherent power relationships visible."},{"slug":"c2-wiki-neighbors","title":"C2 Wiki Neighbors","date":1355957319644,"synopsis":"Hello world You can browse from here to see what individuals are doing to migrate [[Wards Wiki]] to a federation of their own making. Just looking at this page will add their work to to your search neighborhood."},{"slug":"caddy","title":"Caddy","date":1464594330690,"synopsis":"The [[Let's Encrypt]] integration is interesting, not only does the server default to [[HTTPS]], it will fully manage the relevant cryptographic assets for you."},{"slug":"calendar-of-events","title":"Calendar of Events","date":1459349559537,"synopsis":"Each year there are a number of vents around the world that we can loosely connect as having an interest in the themes of art, culture and technology. More specifically we look to find sympathetic people and events that share an interest in the commons, and have an expressed desire to connect to other similar events around the world."},{"slug":"calm-technology","title":"Calm Technology","date":1423936130135,"synopsis":"Brown and Weiser felt that the promise of computing systems was that they might \"simplify complexities, not introduce new ones\". Weiser believed that this would lead to an era of \"calm technology,\" in which technology, rather than panicking us, would help us focus on the things that were really important to us. [http://calmtechnology.com/about/ website]"},{"slug":"can-security-be-beautiful","title":"Can Security be Beautiful","date":1451400212992,"synopsis":"Watching [[Let's Encrypt]] I had to admire the mechanisms but see them as some sort of band-aid over earlier mistakes. Or are our goals themselves misguided?"},{"slug":"can-web-search-engines-index-wikis","title":"Can Web Search Engines Index Wikis","date":1450361023584,"synopsis":"Conclusion: yes, Web search engines can index wikis. [[Google Loves Wiki]]."},{"slug":"cannot-read-property-id-of-null","title":"Cannot read property 'id' of null","date":1458122009940,"synopsis":"I keep losing data since the recent server update. Actually it may have been before that. i have not noticed this before - usually when something goes wrong it is a network connection and the information is stored in local cache."},{"slug":"canonical-version","title":"Canonical Version","date":1449572671482,"synopsis":"In mathematics and computer science, a canonical, normal, or standard form of a mathematical object is a standard way of presenting that object as a mathematical expression - [https://en.wikipedia.org/wiki/Canonical_form wikipedia]"},{"slug":"cap-theorem","title":"CAP theorem","date":1466948355403,"synopsis":"In theoretical computer science, the CAP theorem, also named Brewer's theorem after computer scientist Eric Brewer, states that it is impossible for a distributed computer system to simultaneously provide all three of the following guarantees: - [https://en.wikipedia.org/wiki/Cap_Theorem wikipedia]"},{"slug":"capability-based-security","title":"Capability-based security","date":1510656570075,"synopsis":"Capability-based security is a concept in the design of secure computing systems, one of the existing security models. A capability (known in some systems as a key) is a communicable, unforgeable token of authority. It refers to a value that references an object along with an associated set of access rights - [https://en.wikipedia.org/wiki/Capability-based_security wikipedia]"},{"slug":"capability-url","title":"Capability URL","date":1510693089286,"synopsis":"[[Capability URL]]s grant access to a resource to anyone who has the URL - [https://www.w3.org/TR/capability-urls/ w3.org]"},{"slug":"capitalization-sticks","title":"Capitalization Sticks","date":1419489710433,"synopsis":"Wiki ignores case looking up pages. It finds pages based on a \"slug\" that consists of lower-case and dashes. The page creation logic goes to some effort to discover what capitalization was intended and stores that with the page."},{"slug":"capn-proto","title":"Cap’n Proto","date":1435320490581,"synopsis":"Cap’n Proto is an insanely fast data interchange format and capability-based RPC system. Think JSON, except binary. Or think Protocol Buffers, except faster - [https://capnproto.org/index.html capnproto.org]"},{"slug":"capturing-data","title":"Capturing Data","date":1438334917087,"synopsis":"But there is another aspect of Fedwiki that deserves mention in the context of creating and [[Alternative Editor]], and that is authoring data."},{"slug":"ccc","title":"CCC","date":1450799271602,"synopsis":"The Chaos Communication Congress is an annual conference organized by the Chaos Computer Club. The congress features a variety of lectures and workshops on technical and political issues related to Security, Cryptography, Privacy and online Freedom of Speech - [https://en.wikipedia.org/wiki/Chaos_Communication_Congress wikpedia]"},{"slug":"changes-to-the-future","title":"Changes to the Future","date":1493403448969,"synopsis":"Below we list recent changes from contributors below writing specifically on topics of relevance to the [[Future of the Federation]]:"},{"slug":"changes-to-this-site","title":"Changes to this Site","date":1434532209841,"synopsis":"Below we list recent changes to this site only without also listing changes from the [[Neighbourhood]]:"},{"slug":"changes-to-wards-asia-wiki","title":"Changes to Ward's Asia Wiki","date":1458422665577,"synopsis":"Here we look at [[Changes to Ward's Asia Wiki]]. You might want to also look at [[Wards Recent Activity]]."},{"slug":"chaos-communication-camp","title":"Chaos Communication Camp","date":1434728158862,"synopsis":"The Chaos Communication Camp is an international meeting of hackers that takes place every four years, organized by the [[Chaos Computer Club]] (CCC)."},{"slug":"chaos-radio","title":"Chaos Radio","date":1457616227986,"synopsis":"Just came across this site which relates to the [[CCC]] and as an emaple here is a [[Podcast]] about [[Wikipedia]] (in German):"},{"slug":"charrette","title":"Charrette","date":1469024572695,"synopsis":"A charrette, often Anglicized to charette or charet and sometimes called a design charrette, is an intense period of design or planning activity - [https://en.wikipedia.org/wiki/Charrette wikipedia]"},{"slug":"chatbot","title":"Chatbot","date":1511362198386,"synopsis":"A chatbot (also known as a talkbot, chatterbot, Bot, IM bot, interactive agent, or Artificial Conversational Entity) is a computer program which conducts a conversation via auditory or textual methods. Such programs are often designed to convincingly simulate how a human would behave as a conversational partner, thereby passing the Turing test. Chatbots are typically used in dialog systems for various practical purposes including customer service or information acquisition. Some chatterbots use sophisticated natural language processing systems, but many "},{"slug":"chatham-house-rule","title":"Chatham House Rule","date":1512554749799,"synopsis":"When a meeting, or part thereof, is held under the Chatham House Rule, participants are free to use the information received, but neither the identity nor the affiliation of the speaker(s), nor that of any other participant, may be revealed -"},{"slug":"chunks","title":"Chunks","date":1427826106972,"synopsis":"Originally from psych (Pinkert discusses them) as a way of organizing items in such a way that the multiples form one chunk. The chunk is the one idea per page that can be consequently employed in a larger array. More"},{"slug":"cinder-programming-library","title":"Cinder (programming library)","date":1467107496519,"synopsis":"Cinder is a programming library, designed to give the C++ language advanced visualization abilities. It was released as a public tool in spring 2010 and can be viewed in many ways as an open-source, C++-based alternative to tools like the Java-based Processing library, Microsoft Silverlight or Adobe Flash - [http://libcinder.org libcinder.org]"},{"slug":"circular-layout","title":"Circular Layout","date":1464607708703,"synopsis":"[[Circular Layout]], ranked by out-degree"},{"slug":"citation-action","title":"Citation Action","date":1512233144767,"synopsis":"A citation action, would be the recording of the act of citing another persons work in such a way that that original information could retrieved, and the source followed."},{"slug":"citation-bar","title":"Citation Bar","date":1518880341137,"synopsis":"The \"citation bar\" is a proposal for a new framing of the journal display in wiki."},{"slug":"citogenesis","title":"Citogenesis","date":1464163642898,"synopsis":"A discussion related to [[gossip]] and [[Investigative Journalism]]. Investigative Journalism can be a sport ([http://www.snopes.com/ snopes.org]), but it should be paid."},{"slug":"claims-based-identity","title":"Claims-based identity","date":1510659245426,"synopsis":"Claims-based identity is a common way for applications to acquire the identity information they need about users inside their organization, in other organizations, and on the Internet. It also provides a consistent approach for applications running on-premises or in the cloud. Claims-based identity abstracts the individual elements of identity and access control into two parts: a notion of claims, and the concept of an issuer or an authority - [https://en.wikipedia.org/wiki/Claims-based_identity wikipedia]"},{"slug":"claude-shannon","title":"Claude Shannon","date":1510785004930,"synopsis":"[[23rd St & Forest Ave, Boulder, CO 80304, USA]] - [http://www.openstreetmap.org/#map=17/40.032393/-105.2691607 openstreetmap] Also view on - [https://www.google.co.uk/maps/place/23rd+St+%26+Forest+Ave,+Boulder,+CO+80304,+USA/@40.032393,-105.2691607,17z/data=!3m1!4b1!4m5!3m4!1s0x876bee87fb58461d:0xe9d37fa894d4d97!8m2!3d40.0323889!4d-105.266972 google]"},{"slug":"clicks-and-drops","title":"Clicks and Drops","date":1524052526448,"synopsis":"Here I comment on Wars thoughts on the page [[Contingent Also]]."},{"slug":"clicks-are-not-drops","title":"Clicks are not Drops","date":1523957473242,"synopsis":"In writing in wiki - after a while - you begin to associate meaning and structure with actions. A click opens something - it's sort of like a normal hypertext link on a web site - but a bit funny. You can dig into that."},{"slug":"closure-compiler","title":"Closure Compiler","date":1437513795836,"synopsis":"The Closure Compiler is a tool for making JavaScript download and run faster, at the expense of human readability - [https://en.wikipedia.org/wiki/Google_Closure_Tools wikipedia]"},{"slug":"clustered-layout","title":"Clustered Layout","date":1464607705871,"synopsis":"[[Clustered Layout]]. Organic layout grouped by detected communities, sized by out-degree"},{"slug":"colajs","title":"cola.js","date":1464605687419,"synopsis":"Constraint-Based Layout in the Browser."},{"slug":"collaborative-link","title":"Collaborative Link","date":1473956822144,"synopsis":"The web became more collaborative with wiki's introduction of the [[Internal Link]]. Link names were drawn from a shared space backed up at the time by shared storage. Federated wiki's internal links preserves the shared space but not the shared storage making it the ideal link for the distributed collaborative web."},{"slug":"collaborative-wiki-backend","title":"Collaborative Wiki Backend","date":1449573296245,"synopsis":"At the moment Fedwiki uses [[JSON]] files as a backend. Other backends have been experimented with, and the server can be configured to use these. Here we explore the idea of a universal collaborative backend for wiki."},{"slug":"combine-and-compress-files","title":"Combine and Compress Files","date":1437648421755,"synopsis":"You can use [[gulp]], [[grunt]] or Google's [[Closure Compiler]] - [http://stackoverflow.com/questions/5511989/combine-multiple-javascript-files-into-one-js-file stackoverflow]"},{"slug":"common-law","title":"Common Law","date":1468055739834,"synopsis":"In [[Law, Legislation and Liberty]], [[Friedrich Hayek]] distinguishes two types of law: the law that is consciously created through the political process, which he calls the law of legislation, and the unplanned law that evolves out of the settlement of interpersonal disputes, which he calls the law of liberty."},{"slug":"commons-passport","title":"Commons Passport","date":1466274002849,"synopsis":"A \"commons passport\" is a provocative title for a collaborative research tool for anyone working on the commons. It's a working title."},{"slug":"communicating-with-wiki","title":"Communicating With Wiki","date":1464449366485,"synopsis":"The aim is to have wiki controlled by an external web app (such as a map, or slide presentation), and in turn give wiki the ability to control these external apps."},{"slug":"community-facilitator","title":"Community facilitator","date":1523958514654,"synopsis":"A page with 1 items."},{"slug":"complementary-notice-on-fork","title":"Complementary Notice on Fork","date":1424118290678,"synopsis":"The client could tell a remote server when it forks a page. However we don't want strangers to write on any site (they will find a way to spam). However, a complementary notice could be ignored, counted or recorded. All are useful options at various states of growth."},{"slug":"composing-on-fedwiki-m-c-morgan","title":"Composing on FedWiki (M C Morgan)","date":1456243081304,"synopsis":"In which I start to gather notes for a re-thinking of procedures and patterns for writing using FedWiki. The distributed document network shifts the rhetoric in un-probed ways.  This ain't no Meatball Wiki."},{"slug":"concurrency-computer-science","title":"Concurrency (computer science)","date":1469878262943,"synopsis":"In computer science, concurrency is the decomposability property of a program, algorithm, or problem into order-independent or partially-ordered components or units - [https://en.wikipedia.org/wiki/Concurrency_(computer_science) wikipedia]"},{"slug":"conduit-of-high-fidelity","title":"Conduit of High Fidelity","date":1451613464109,"synopsis":"Words provide a metaphorical conduit for our thought that is marginal at best in practice. We supplement traditional composition with [[Diverse and Personal Context]] so as to provide for a more embodied experience for later and distant readers."},{"slug":"conference-happenings","title":"Conference Happenings","date":1450792716722,"synopsis":"How can we use Fedwiki to transform the way in which we interact and experience conferences? That is the question we explore here."},{"slug":"conference-narratives","title":"Conference Narratives","date":1452418244031,"synopsis":"Conferences are isolated events. They need not be. This year we look to use [[wiki]] to create an inter-conference narrative, where we weave together material from events that take place throughout the year at different locations."},{"slug":"conferences-and-meetups","title":"Conferences and Meetups","date":1498657066136,"synopsis":"A basic Happening, is simply an event that takes part of an evening - say 7pm till 11pm in which the participants meet online to write and research together."},{"slug":"configuration-tools","title":"Configuration Tools","date":1524039775464,"synopsis":"Configuration tools make it easy for a [[Community facilitator]] (system administrator) to configure the environment for their community of writers."},{"slug":"configuring-wiki-security-passportjs","title":"Configuring Wiki-Security-Passportjs","date":1510694052207,"synopsis":"[[Wiki security]] is provided through the [[Passport.js]]. We can consider modifying the code to enable [[JWT]] based security for [[tranporter]]s - [https://github.com/fedwiki/wiki-security-passportjs/blob/6f60d07a3a7a9f6ade7343cf6e29cc0202d7fc1d/server/social.coffee#L372-L388 github]"},{"slug":"congress-everywhere","title":"Congress Everywhere","date":1450803685216,"synopsis":"Hackers all over the world are organizing events to bring the congress closer to home. Congress Everywhere: allows those unable to attend the Congress in Hamburg to celebrate their own Hackcenter experience, watch the streams, participate via twitter or chats, drink Tschunk, cook and have a good time."},{"slug":"consensus-based-writing","title":"Consensus based writing","date":1522738067597,"synopsis":"This is perhaps not the best term. Writing in Wikipedia is not really [[consensus]] based. The social anthropology of process is much more complex."},{"slug":"consensus-decision-making","title":"Consensus decision-making","date":1522737916671,"synopsis":"Consensus decision-making is a group decision-making process in which group members develop, and agree to support a decision in the best interest of the whole. Consensus may be defined professionally as an acceptable resolution, one that can be supported, even if not the \"favourite\" of each individual - [https://en.wikipedia.org/wiki/Consensus_decision-making wikipedia]"},{"slug":"consistency-database-systems","title":"Consistency (database systems)","date":1466948342090,"synopsis":"Consistency in database systems refers to the requirement that any given database transaction must change affected data only in allowed ways. Any data written to the database must be valid according to all defined rules, including constraints, cascades, triggers, and any combination thereof. This does not guarantee correctness of the transaction in all ways the application programmer might have wanted (that is the responsibility of application-level code) but merely that any programming errors cannot result in the violation of any defined rules - [https:"},{"slug":"context-map","title":"Context Map","date":1490102968545,"synopsis":"An individual [[bounded context]] leaves some problems in the absence of a global view. The context of other models may still be vague and in flux."},{"slug":"contingent-also","title":"Contingent Also","date":1523868921385,"synopsis":"We consider how decoding of [[Clicks and Drops]] might be extended to remote services without fundamentally changing the nature of wiki. We suggest this behavior be concentrated in a new plugin called \"Also\"."},{"slug":"contours-of-privilege","title":"Contours of Privilege","date":1453125018842,"synopsis":"We consider the landscape of authentication and authorization we desire when everything we own is computerized."},{"slug":"conversation-clubs","title":"Conversation Clubs","date":1512349683863,"synopsis":"We're generating an index of conversations that links to all copies of that conversation. This opens a new tab where the neighborhood will contain only the sites owning and mentioned on those pages."},{"slug":"conversation-piece","title":"Conversation Piece","date":1452424631483,"synopsis":"[[transmediale]] reboots itself with a new performative and participatory format for its 29th edition. Under the name Conversation Piece, the event creates an intensive space of exchanges, murmurs, and transitions, with dialogues initiated before the event and continued afterwards - [http://transmediale.de/ transmediale.de]"},{"slug":"coordinated-viewing","title":"Coordinated Viewing","date":1464602537554,"synopsis":"We consider what we have and what we might want for coordinating between independent applications. How can a web application [[Talk To Wiki]]? How can wiki, control another application. That is [[How Can Wiki Act?]]"},{"slug":"correct-markdown","title":"Correct Markdown","date":1509457809042,"synopsis":"Markdown collects a handful of internet news group conventions as a counterpoint to the at one time simple but still unattractive html markup. Wiki markdown borrows some of these in order to render styles appropriate to its narrow anti-paper pages. This much it should do well."},{"slug":"cors","title":"CORS","date":1434978920386,"synopsis":"Here we look at how [[Federated Wiki]] uses CORS headers to enable cross-origin resource sharing. We are particularly interested to see how using CORS might allow us to play nicely with other applications on the web."},{"slug":"cosps","title":"COSPs","date":1452416706213,"synopsis":"This page is a first attempt to define Computer-Supported Patterns (COSPs). The proposed structure is based on the following goals:"},{"slug":"course-launch-workflow","title":"Course Launch Workflow","date":1464604566491,"synopsis":"There is yet to be developed a simple and tamper-free mechanism to grant students a place to write in a farm launched for that purpose."},{"slug":"create-new-blank-page","title":"Create New Blank Page","date":1457358532431,"synopsis":"At present this screen is frequently empty. At most it shows available [[Page Template]]s. This is a waste of screen real estate."},{"slug":"create-page-plugin","title":"Create Page Plugin","date":1438561381802,"synopsis":"The [[Create Page Plugin]] is a generic [[REST Plugin]] that enables simple and flexible integration with [[Federation REST Services]] provided by developers for the wider community of users."},{"slug":"creating-presentations-with-fedwiki","title":"Creating Presentations with Fedwiki","date":1470583587857,"synopsis":"Here we take a first look at how we can use the [[Fedwiki Lineup]] to author linear content such as a [[Keynote]] / [[Powerpoint]] style presentation."},{"slug":"creative-commons","title":"Creative Commons","date":1512221934857,"synopsis":"The content in wiki is licensed under a [[free culture]] Creative Commons license -"},{"slug":"creative-commons-citation","title":"Creative Commons Citation","date":1518879897325,"synopsis":"How should we represent a creative commons citation?"},{"slug":"creeping-automation","title":"Creeping Automation","date":1459132011537,"synopsis":"We see innovation emerging here in stages with progressively more purpose-built functions."},{"slug":"crowdfunding","title":"Crowdfunding","date":1466269030954,"synopsis":"Crowdfunding is the practice of funding a project or venture by raising monetary contributions from a large number of people. It is a form of alternative finance, which has emerged outside of the traditional financial system - [https://en.wikipedia.org/wiki/Crowdfunding wikipedia]"},{"slug":"crowdfunding-platforms","title":"Crowdfunding platforms","date":1466269498683,"synopsis":"As of 2012, there were over 450 crowdfunding platforms - [http://www.triplepundit.com/special/rise-of-the-sharing-economy/emerging-next-generation-crowdfunding-platform-roundup/# triplepundit.com]"},{"slug":"crowdfunding-wiki","title":"Crowdfunding Wiki","date":1466270714426,"synopsis":"Here we explore how we might fund the development of [[Fedwiki]] through a [[Crowdfunding]] campaign."},{"slug":"cryptographic-wiki","title":"Cryptographic Wiki","date":1451896543283,"synopsis":"A cryptographic wiki is a wiki built on top of cryptographic principles. It should provide each author with their own public/private key pair, enabling secure digital signatures and cryptography."},{"slug":"currently-working-on","title":"Currently Working On","date":1492361757619,"synopsis":"Here is a list of [[Recent Changes]] I consider important. View our experiments on the [[Scratch]] page. To clear stuff saved in your browser try [[Local Changes]]."},{"slug":"custom-css","title":"Custom CSS","date":1497877060612,"synopsis":"You can set the [[CSS]] for individual wiki sites in a farm by adding a theme folder to the status folder of the site."},{"slug":"cytoscape","title":"Cytoscape","date":1464606092349,"synopsis":"There are some great docs - [http://js.cytoscape.org/#cy.center js.cytoscape.org]"},{"slug":"cytoscapejs","title":"Cytoscape.js","date":1464606106910,"synopsis":"Cytoscape.js is an open-source graph theory (a.k.a. network) library written in JavaScript. You can use Cytoscape.js for graph analysis and visualisation - [http://js.cytoscape.org/ cytoscape.org]"},{"slug":"cytowiki","title":"Cytowiki","date":1465989994253,"synopsis":"Let's explore the idea of creating a wiki for, and about visualisation. Let's make this the best resource on the internet about dynamic visualisation in the browser. Let's use [[literate wiki]] to code and document together in one space."},{"slug":"d3-v4-whats-new","title":"D3 V4 What's New","date":1470583587841,"synopsis":"D3 v3 was one large library. You had to include all of it, even if you didn't need all of it."},{"slug":"daedalus-now-bloom","title":"Daedalus (now Bloom)","date":1475587985268,"synopsis":"Bloom is a programming language for the cloud and other distributed computing systems. BOOM is the research project at UC Berkeley that is developing Bloom, as part of a larger agenda to make it easy to build distributed software systems."},{"slug":"dagre","title":"Dagre","date":1437990459313,"synopsis":"Dagre is a JavaScript library that makes it easy to lay out directed graphs on the client-side - [https://github.com/cpettitt/dagre/wiki github]"},{"slug":"dales-cone-of-retweets","title":"Dale's Cone of Retweets","date":1437922058243,"synopsis":"Dale's Cone of Experience, is an example of how bad (in this case misquoted) infromation can spread unchecked on the conventional internet - [https://en.wikipedia.org/wiki/Edgar_Dale#Cone_of_Experience wikipedai]"},{"slug":"dark-matter","title":"Dark matter","date":1471004197828,"synopsis":"Dark matter is an unidentified type of matter comprising approximately 27% of the mass and energy in the observable universe that is not accounted for by dark energy, baryonic matter (ordinary matter), and neutrinos - [https://en.wikipedia.org/wiki/Dark_matter wikipedia]"},{"slug":"dat","title":"dat","date":1448712788392,"synopsis":"Dat is a version-controlled, decentralized data sync tool designed to improve collaboration between data people and data systems - [https://github.com/maxogden/dat github]"},{"slug":"data-and-javascript","title":"Data and Javascript","date":1438597504250,"synopsis":"Here we gather some links and ideas related to using data in the javascript centred world of the Federation:"},{"slug":"datamining-wiki","title":"Datamining Wiki","date":1465459757678,"synopsis":"Here we look at tools and strategies for extracting valuable information from wiki."},{"slug":"dating-transport","title":"Dating Transport","date":1512349683866,"synopsis":"This [[Transport]] generates and stores named lists of web sites in order to automatically create [[roster]]s for [[Research Groups]].."},{"slug":"david-bovill","title":"David Bovill","date":1489145741299,"synopsis":"On this site I write about [[Livecode]], the projects I am working on and the courses I am teaching."},{"slug":"davids-recent-activity","title":"David's Recent Activity","date":1518880053019,"synopsis":"This page shows all my recent changes across all my sites. You can also see [[All David's Activity]] and the older [[David's Recent Changes]] pages:"},{"slug":"dead-sites","title":"Dead Sites","date":1492018724934,"synopsis":"A list of dead sites whose domain names have lapsed:"},{"slug":"decentralised-events","title":"Decentralised Events","date":1470402763811,"synopsis":"Here we propose an event programme for a series of [[Full Moon Happenings]] (decentralised events) leading up to a major event / conference in [[Spring 2016]]."},{"slug":"decentralised-streaming-media","title":"Decentralised Streaming Media","date":1467104751306,"synopsis":"A significant benefit of P2P decentralised collaboration is the ability for each remote participant to have access to high quality reliable media."},{"slug":"decentralised-web","title":"Decentralised Web","date":1466879342905,"synopsis":"A number of projects – such as [[Ethereum]], [[ZeroNet]] and the [[SAFE Network]]—aspire to create ways to build websites and applications that don’t depend on a single server or company to keep running  - [http://www.wired.com/2016/06/inventors-internet-trying-build-truly-permanent-web/ wired.com]"},{"slug":"decentralized-business","title":"Decentralized Business","date":1466879307241,"synopsis":"Here we can collect some ideas, and projects that explore decentralised structures for financing people and projects through the [[decentralised web]]."},{"slug":"decentralized-web-summit","title":"Decentralized Web Summit","date":1466894245205,"synopsis":"The Decentralised Web Summit (I'll use the bad acronym DeWeb for now), is the realisation of the idea for a summit discussed last year with [[Brewster Kahle]] at [[Chaos Communication Camp]]."},{"slug":"default-transporter","title":"Default Transporter","date":1457723225062,"synopsis":"The proposal here - perhaps only as an interesting short term hack - is to leverage the [[Fedwiki Flag Icon]] on every page as a drag-and-drop destination."},{"slug":"defense-of-capitalized-titles","title":"Defense of Capitalized Titles","date":1419454402563,"synopsis":"Capitalized Titles can be a pain. But there are good reasons for the convention."},{"slug":"deferential-design","title":"Deferential Design","date":1463813741910,"synopsis":"When we design for content and readability first, and put the interactive functionality in the background, or in some way in which it is not visible, or barely visible to the user - we are in simple terms talking of deferential design."},{"slug":"demanding-media","title":"Demanding Media","date":1489679340710,"synopsis":"We consider how to collaborate with large image, audio and video recordings. We look especially for ways that our strength, federation, brings something new to each medium."},{"slug":"designing-society","title":"Designing Society","date":1435827121886,"synopsis":"How can [[Fedwiki]] be used to help design society for the better? Here we explore how [[Writing with Strangers]] can become a foundation of [[Participatory Decision making]] and [[Participatory Design]]."},{"slug":"desktop-wiki","title":"Desktop Wiki","date":1464546890784,"synopsis":"Here I describe the best I can a form of wiki which leverages the full personal expressive power of the desktop, or mobile."},{"slug":"deweb-closing-remarks","title":"DeWeb Closing Remarks","date":1466878160592,"synopsis":"This was an idea for a more catchy abbreviation of Decentralised Web Summit - but it looks and sounds a bit too frivolous."},{"slug":"did-neurons-evolve-twice","title":"Did Neurons Evolve Twice?","date":1450387685897,"synopsis":"The creation of neurons was a remarkable event in animal evolution. These cells can communicate — receiving, transmitting and processing information using a precise chemical and electrical language. Their power derives from the complex network they create. “A single neuron is like the sound of one hand clapping,” Martindale said. “The whole idea is that you put a bunch of them together and they can do things that a few single cells cannot.” - [https://www.quantamagazine.org/20150325-did-neurons-evolve-twice/ quantamagazine.org]"},{"slug":"digital-authentication","title":"Digital authentication","date":1510658189848,"synopsis":"The authentication of information can pose special problems with electronic communication, such as vulnerability to [[man-in-the-middle attack]]s, whereby a third party taps into the communication stream, and poses as each of the two other communicating parties, in order to intercept information from each.  Extra identity factors can be required to authenticate each party's identity."},{"slug":"dil-green","title":"Dil Green","date":1522736740970,"synopsis":"Dil trained and worked as an architect over 30-odd years, but recently have been doing more and more in the digital world."},{"slug":"dimensions-of-wiki","title":"Dimensions of Wiki","date":1524038277621,"synopsis":"A page with 1 items."},{"slug":"directed-acyclic-graph","title":"Directed Acyclic Graph","date":1467041800641,"synopsis":"In mathematics and computer science, a directed acyclic graph (DAG), is a finite directed graph with no directed cycles - [https://en.wikipedia.org/wiki/Directed_Acyclic_Graph wikipedia]"},{"slug":"dissertation-over-discourse","title":"Dissertation Over Discourse","date":1426259384403,"synopsis":"A play on words meaning, of course, that [[Document Mode]] is more important than [[Thread Mode]] but suggesting also to put [[Summaries On Top Discussion Below]]."},{"slug":"distributed-graph-search","title":"Distributed Graph Search","date":1450437481137,"synopsis":"A distributed graph search is a search of graph data formats, where the data is not held in a single location, but is distributed across multiple servers."},{"slug":"distributed-hash-table","title":"Distributed Hash Table","date":1450109639796,"synopsis":"A distributed hash table (DHT) is a class of a decentralized distributed system that provides a lookup service similar to a hash table. Any participating node can efficiently retrieve the value associated with a given key. [https://en.wikipedia.org/wiki/Distributed_hash_table wikipedia]"},{"slug":"distributed-revision-control","title":"Distributed Revision Control","date":1438768775939,"synopsis":"In computer programming, distributed revision control, also known as distributed version control or decentralized version control, allows many software developers to work on a given project without requiring them to share a common network - [https://en.wikipedia.org/wiki/Distributed_revision_control wikipedia]"},{"slug":"distributed-search","title":"Distributed Search","date":1472668294697,"synopsis":"Our scraping experience suggests we should distribute the function across all servers and move slowly enough that site owners can direct the spider's progress."},{"slug":"distributed-wayback-machine","title":"Distributed Wayback Machine","date":1465116011171,"synopsis":"Rather than archiving content on a centralized server, we can use the very process of curating and selecting material of interest into one of archiving this material in a permanent way."},{"slug":"diverse-and-personal-context","title":"Diverse and Personal Context","date":1451615490515,"synopsis":"The personal context is naturally diverse. Not banal, but truly diverse. It is rare that we appreciate the reality of the difference between us."},{"slug":"diversity-toolkit","title":"Diversity Toolkit","date":1470319434278,"synopsis":"Here we make a start and explore some ideas regarding making a new type of toolkit for small or diverse communities - with a particular focus on internationalisation and accessibility needs."},{"slug":"documentary-events","title":"Documentary Events","date":1465035360756,"synopsis":"[[Happenings]] in physical space are more like workshops than they are lectures or passive viewing experiences. We should explore how we can use these events to film more things, and interview and bring more people into the conversation."},{"slug":"domain-specific-language","title":"Domain-specific language","date":1523522249742,"synopsis":"A domain-specific language (DSL) is a computer language specialized to a particular application domain. This is in contrast to a general-purpose language, which is broadly applicable across domains - [https://en.wikipedia.org/wiki/Domain-specific_language wikipedia]"},{"slug":"dont-be-square","title":"Don't be square","date":1450522441043,"synopsis":"The negative connotation of the term has a surprisingly long history. In the parlance of jazz, a square was a person who failed to appreciate the medium, or, more broadly, someone who was out of date or out of touch, hence the saying \"be there or be square\" - [https://en.wikipedia.org/wiki/Square_(slang) wikipedia]"},{"slug":"dont-metaphor-me-in","title":"Don't Metaphor Me In","date":1466755177808,"synopsis":"[[Andy van Dam]]'s Hypertext '87 keynote ended with a discussion of [[Andy's Nine Issues]] deserving of further thought."},{"slug":"dont-notify-me","title":"Don't notify me","date":1510389328303,"synopsis":"Wiki is subtle with regard to notifications. If I want other people to know about my writing or changes to a text - there are no built in mechanisms to do this. I write in silence. Wiki is a peaceful, solipsic medium"},{"slug":"douglas-engelbart","title":"Douglas Engelbart","date":1466676827697,"synopsis":"Douglas Carl Engelbart (January 30, 1925 – July 2, 2013) was an American engineer and inventor, and an early computer and Internet pioneer. He is best known for his work on founding the field of human–computer interaction, particularly while at his Augmentation Research Center Lab in SRI International, which resulted in the invention of the computer mouse, and the development of hypertext, networked computers, and precursors to graphical user interfaces. These were demonstrated at The Mother of All Demos in 1968. Engelbart's Law, the observation that the"},{"slug":"draft---ease-of-use-and-difficult-to-learn","title":"Draft - Ease of Use and Difficult to Learn","date":1444239109081,"synopsis":"draft of work for GPACW 2015  addressing issues of ease of use - intuitive - and its relation to learning and augmentation."},{"slug":"draft-in-local-storage","title":"Draft in Local Storage","date":1497364228154,"synopsis":"We consider how we might make more use of browser local storage for a more reliable and somewhat private authoring experience."},{"slug":"dreamfactory","title":"DreamFactory","date":1501163138085,"synopsis":"DreamFactory automatically generates a comprehensive [[REST API]] for every popular [[SQL]] database, [[NoSQL]] document store, and file storage system - [https://www.dreamfactory.com/features html]."},{"slug":"dsl","title":"DSL","date":1523985287527,"synopsis":"DSL stands for [[domain specific language]]. It is a markup, mini-language, or shorthand syntax that specifies the nature of the displayed content, or the functionality of the item. It's equivalent to a mini-programming language."},{"slug":"dsls-in-javascript","title":"DSLs in Javascript","date":1512399284891,"synopsis":"Below are a collection of links imported from [[OneTab]]. You can view these links here - [https://www.one-tab.com/page/3HgIVm-yTXOtqN8VbdbOjw one-tab.com]:"},{"slug":"dws-closing-remarks","title":"DWS Closing Remarks","date":1466878105207,"synopsis":"I think we should look to teem up with the Decentralised Web Summit Crew, and organise a set of decentralised events as per the discussions we had last year."},{"slug":"dws-keynotes","title":"DWS Keynotes","date":1466878898771,"synopsis":"Here we list the keynote presentations at the [[Decentralized Web Summit]]:"},{"slug":"dws-lightening-talks","title":"DWS Lightening Talks","date":1466878531507,"synopsis":"There were four sessions of lightening talks at the [[Decentralized Web Summit]]. And we list the videos here."},{"slug":"dws-panel-discussions","title":"DWS Panel Discussions","date":1467027357001,"synopsis":"Here we list the panel discussion at the [[Decentralised Web Summit]]:"},{"slug":"e-o-wilson","title":"E. O. Wilson","date":1439111938254,"synopsis":"Known to many as the founding father of socio-biology, E O Wilson is a big hitter in the world of evolutionary theory. But, recently he's criticised what's popularly known as The Selfish Gene theory of evolution that he once worked so hard to promote (and that now underpins the mainstream view on evolution)."},{"slug":"earths-energy-budget","title":"Earth's energy budget","date":1496916709006,"synopsis":"Earth's energy budget accounts for the energy Earth receives from the Sun. Much of this energy is lost when the earth re-radiates it back into outer space, and the rest of the energy is distributed throughout the five components of Earth's climate system. This system is made up of earth's water, ice, atmosphere, rocky crust, and all living things - [https://en.wikipedia.org/wiki/Earth%27s_energy_budget wikipedia]"},{"slug":"ease-of-use","title":"Ease of Use","date":1503040724330,"synopsis":"Here are some notes on ease of use, in wiki and other projects."},{"slug":"echo-transporter","title":"Echo Transporter","date":1492507523551,"synopsis":"This transporter echos the parameters sent to it. Use this to understand what your transporter will have to work with on different computer, browsers, and dropped items."},{"slug":"education-folks","title":"Education Folks","date":1434212609155,"synopsis":"[[Education In Page Title]]"},{"slug":"elinor-ostrom","title":"Elinor Ostrom","date":1447639993718,"synopsis":"Elinor Ostrom (1933 – 2012) was an American political economist whose work was associated with the New Institutional Economics and the resurgence of political economy. In 2009, she shared the Nobel Memorial Prize in Economic Sciences for \"her analysis of economic governance, especially the commons\". [https://en.wikipedia.org/wiki/Elinor_Ostrom wikipedia]"},{"slug":"encrypted-portable-presentations","title":"Encrypted Portable Presentations","date":1459965823852,"synopsis":"A proposal to create a standard format in a single image or [[SVG]] file that uses [[Public Key Cryptography]] to create secure, shared presentations that can be embedded on any public web site, and displayed by standard tools."},{"slug":"end-drag-refactoring","title":"End Drag Refactoring","date":1512063246451,"synopsis":"We continue to suffer under one poor choice I made early in the project: drag refactoring. This was a design goal. I had hoped that a carelessly organized set of pages could be drag and drop refactored into a better design."},{"slug":"enhancing-reference-links","title":"Enhancing Reference Links","date":1458109569241,"synopsis":"The idea here is that we can build on the existing [[About Reference Plugin]] to add extra [[microdata]] to the markup that can be used to expose [[linked data]] or otherwise render the information more usefully."},{"slug":"enjoy-reading","title":"Enjoy Reading","date":1464591931036,"synopsis":"Here I list recent writing of people that I enjoy reading. [[Strange Authors]] are people that I know and respect from their writing - see [[Writing With Strangers]]"},{"slug":"equity-crowdfunding","title":"Equity crowdfunding","date":1466268968857,"synopsis":"Equity crowdfunding is the online offering of private company securities to a group of people for investment. Because equity crowdfunding involves investment into a commercial enterprise, it is often subject to securities and financial regulation. Equity crowdfunding is also referred to as crowdinvesting, investment crowdfunding, or crowd equity - [https://en.wikipedia.org/wiki/Equity_Crowdfunding wikipedia]"},{"slug":"ethereum","title":"Ethereum","date":1464377729809,"synopsis":"Web 3.0 publishing platform. Purpose of Ethereum is to decentralise the Web. Read more on [http://en.wikipedia.org/wiki/ethereum Wikipedia] and [https://forum.ethereum.org Ethereum forum]"},{"slug":"eventual-consistency","title":"Eventual consistency","date":1466948318114,"synopsis":"Eventual consistency is a consistency model used in distributed computing to achieve high availability that informally guarantees that, if no new updates are made to a given data item, eventually all accesses to that item will return the last updated value - [https://en.wikipedia.org/wiki/Eventual_consistency wikipedia]"},{"slug":"expanding-the-role-of-tools","title":"Expanding the Role of Tools","date":1464364954358,"synopsis":"Expanding the Role of Tools in a "},{"slug":"experience-selected","title":"Experience Selected","date":1464543903544,"synopsis":"We explain how our priorities have displaced many givens of usability of the modern web especially on mobile devices. We trust our decisions wise, and temporary."},{"slug":"experiment-with-pinboard","title":"Experiment with Pinboard","date":1475588556232,"synopsis":"On this page, I'm try to get a sense of how to move material from Pinboard to FedWiki."},{"slug":"experimental-interfaces","title":"Experimental Interfaces","date":1424049433342,"synopsis":"Some thoughts on the sort of interfaces that we can experiment with [[Federated Wiki]] data structures."},{"slug":"explore-transport-proxy","title":"Explore Transport Proxy","date":1459634292952,"synopsis":"Can we transport a page that will proxy back to the transporter for more pages?"},{"slug":"exploring-time","title":"Exploring Time","date":1514956390676,"synopsis":"Most popular software libraries for managing time are based on similar models, and JodaTime, a common Java library being incorporated into Java 9, is a good example. It has a fairly good model, and illustrates the tendency for the first good idea to be the last idea."},{"slug":"external-mediawiki-links","title":"External Mediawiki Links","date":1457359503290,"synopsis":"External links use absolute [[URL]]s to link directly to any Web page. These links have the associated CSS class \"external\". External links are in the form:"},{"slug":"extremely-modular-distributed-javascript","title":"Extremely Modular Distributed JavaScript","date":1501991079429,"synopsis":"Ward, this is my new top security video from Mark S Miller aka @erights aka Dr. SES."},{"slug":"fab-academy-visualization","title":"Fab Academy Visualization","date":1436307208965,"synopsis":"A visualization made with python of the 3 people activity on a git hub repository during 19 weeks of Fab Academy in Milan"},{"slug":"factory-image-artifacts","title":"Factory Image Artifacts","date":1433716129400,"synopsis":"Resizing and compression are applied to dropped images larger than 500x300 in both dimensions. Here we study the compression artifacts for a test image from Wikimedia Commons. [http://commons.wikimedia.org/wiki/File:Dry_Falls.jpg image]"},{"slug":"factory-wo-drag-and-drop","title":"Factory w/o Drag and Drop","date":1438563868831,"synopsis":"The drag and drop features of federated wiki fully exploit newer capabilities of the browser and result in excellent flow for expert users on laptops and desktops. In thinking about the [[Basic Data Editor]] one helpful idea is to consider a drag/dropless factory, and what advantages that might provide certain users."},{"slug":"family-resemblance","title":"Family resemblance","date":1467034944653,"synopsis":"Family resemblance (German: Familienähnlichkeit) is a philosophical idea made popular by Ludwig Wittgenstein, with the best known exposition given in his posthumously published book Philosophical Investigations (1953) - [https://en.wikipedia.org/wiki/Family_resemblance wikipedia]"},{"slug":"fast-diffs-of-wikitext","title":"Fast Diffs of Wikitext","date":1449571760053,"synopsis":"Fabian Flöck writes on Wiki-research-l: If anyone is interested in a faster processing of revision differences, you could also adapt the strategy we implemented for [http://f-squared.org/wikiwho wikiwho], which is keeping track of bigger unchanged text chunks with hashes and just diffing the remaining text (usually a relatively small part oft the article)."},{"slug":"fear-of-early-exposure","title":"Fear of Early Exposure","date":1450359981088,"synopsis":"In many fields we are trained from a young age to share only when our thoughts are considered finished enough for public presentation. This starts in school, and continues in our professional lives."},{"slug":"federated-identity","title":"Federated identity","date":1510657504948,"synopsis":"A federated identity in information technology is the means of linking a person's electronic identity and attributes, stored across multiple distinct identity management systems - [https://en.wikipedia.org/wiki/Federated_identity wikipedia]"},{"slug":"federated-lightning-talk","title":"Federated Lightning Talk","date":1427451107199,"synopsis":"The thought here is to go for speed. But speed in the world of [[Asynchronous Writing]] is a new form of slow speed. An evening perhaps."},{"slug":"federated-link-store","title":"Federated Link Store","date":1438376881086,"synopsis":"An early draft proposal to create a web service - Scala anyone - for the Federation, which provides semantic queries and read write access to federated wiki metadata."},{"slug":"federated-wayback-machine","title":"Federated Wayback Machine","date":1438326010837,"synopsis":"A federated-wayback-machine, is a way of archiving all content in the [[Federation]]. JSON from every site would be periodically archived in a decentralised manor."},{"slug":"federated-wiki","title":"Federated Wiki","date":1516718954376,"synopsis":"Federated Wiki sites share pages circulating within a creative commons. Here we take a look at the [[Future of the Federation]], and [[Future of Fedwiki Software]]."},{"slug":"federated-wiki-app","title":"Federated Wiki App","date":1430049279168,"synopsis":"I am working on turning the [[Smallest Federated Wiki]] into an app. The idea is to run a technical course on [[Wiki's]], [[JSON]] and [[Federated Data]]. During the course we will create a desktop and mobile app - for short let's call this [[WikiApp]]."},{"slug":"federated-wiki-design-principles","title":"Federated Wiki Design Principles","date":1414173411719,"synopsis":"We have concentrated on a small number of idealistic principles, beliefs even, while ignoring considerable established practice. Only by such intense focus can we expect to find fresh solutions to persistent problems."},{"slug":"federated-wiki-futures","title":"Federated Wiki Futures","date":1438330356418,"synopsis":"Thoughts on the future of federated wiki."},{"slug":"federated-wiki-on-digital-ocean","title":"Federated Wiki on Digital Ocean","date":1497613599780,"synopsis":"At some point you may want to run your own Federated Wiki site, or perhaps set one up  for friends or a class. We've had good luck installing on Digital Ocean, which currently offers very cheap hosting and a much simpler setup than services such as Amazon Web Services."},{"slug":"federated-writing","title":"Federated Writing","date":1522737684990,"synopsis":"Here we should try to define clearly what federated writing is. So far we have:"},{"slug":"federating-foreign-servers","title":"Federating Foreign Servers","date":1485371526159,"synopsis":"We consider what requests a server must handle in order to participate in wiki's federation. Such a server provides pages without taking responsibility for the client-side javascript conventionally used by federated wiki."},{"slug":"federation-activity","title":"Federation Activity","date":1458117082281,"synopsis":"Where is all the activity in the Federation? How can I view an individuals activity across sites that they own, or view the activity of a group of individuals?"},{"slug":"federation-graph-representation","title":"Federation Graph Representation","date":1464608293911,"synopsis":"Here we look in more detail at how [[graphs in wiki]] can be specified. We look to define a markup, or [[domain specific language]] for authors wishing to create maps or network graphs."},{"slug":"federation-rest-services","title":"Federation REST Services","date":1464603508794,"synopsis":"Members of the Federation provide simple CGI's on a server they own, programmed in whatever language they prefer, which responds at the URL specified within the [[Fedwiki Page Json]]. In this way we create an evolving [[REST API]] for wiki."},{"slug":"federation-search","title":"Federation Search","date":1458422510523,"synopsis":"Here we list sites in the visible federation that have been changed in a recent six hour period. Click » to add these to your neighborhood. See [[Recent Changes]], [http://search.fed.wiki.org:3030/counts.html plot] [http://search.fed.wiki.org:3030/logs log]"},{"slug":"federation-wars","title":"Federation Wars","date":1450360723688,"synopsis":"As the Federation grows, as new members and more content becomes available, the value to others with commercial, or simple ill-intention becomes greater."},{"slug":"fedwiki-authoring-tool","title":"Fedwiki Authoring Tool","date":1448286597791,"synopsis":"Starting to create a simple minimal Fedwiki-page authoring tool."},{"slug":"fedwiki-card-lineup","title":"Fedwiki Card Lineup","date":1448279272853,"synopsis":"How a lineup can be a carousel, can be a circular graph layout of the federation."},{"slug":"fedwiki-chat-client","title":"Fedwiki Chat Client","date":1492099452634,"synopsis":"Here we look at how we might integrate decentralised chat into the Fedwiki interface."},{"slug":"fedwiki-data-item","title":"Fedwiki Data Item","date":1458036931813,"synopsis":"Here we write about [[Data in Fedwiki]]."},{"slug":"fedwiki-destop-app","title":"Fedwiki Destop App","date":1430049248255,"synopsis":"The desktop app would have additional [[Power Authoring Tools]] that would be easily extensible, and plug in to a variety of existing languages and tool chains - yet be useful to beginners wanting to add more advance content to the wiki - things like image maps, and reports."},{"slug":"fedwiki-for-notetaking","title":"FedWiki for Notetaking","date":1432314871015,"synopsis":"All the usual warning apply: can't edit on a tablet - it needs a mouse.  Changing a note name means re-organizing content into a new note."},{"slug":"fedwiki-for-scholarly-work","title":"FedWiki for Scholarly Work","date":1437927172554,"synopsis":"What is scholarly work?"},{"slug":"fedwiki-live-studio","title":"Fedwiki Live Studio","date":1438343176050,"synopsis":"The idea here is to build [[Fedwiki]] and [[IPFS]] into the heart of a running live studio."},{"slug":"fedwiki-livecode-server","title":"Fedwiki Livecode Server","date":1437484998278,"synopsis":"Alongside creating native Android and iOS [[Wiki App]] in [[LiveCode]] we will look to engage a community in creating a test server in [[Livecode]]."},{"slug":"fedwiki-mobile-app","title":"Fedwiki Mobile App","date":1466274263903,"synopsis":"A Fedwiki Mobile App would be a fully portable implementation of wiki, that included a full server as well as the ability to view and create wiki pages."},{"slug":"fedwiki-on-ipfs","title":"Fedwiki on IPFS","date":1450008242137,"synopsis":"The aim is to have [[Fedwiki]] running as a pure Javascript application (no custom server required) and served by IPFS to allow a fully decentralised platform."},{"slug":"fedwiki-plugin-ideas","title":"Fedwiki Plugin Ideas","date":1438370935156,"synopsis":"Here we describe a few ideas for [[Fedwiki Plugins]] we want to work on:"},{"slug":"fedwiki-security","title":"Fedwiki Security","date":1510666405927,"synopsis":"Here we look at issues to do with [[Authentication]] and [[Security]] in Federated Wiki. [[Fedwiki]] currently has a pull-only, one domain-one author philosophy which cuts down on spam."},{"slug":"fedwiki-server","title":"Fedwiki Server","date":1437495026738,"synopsis":"This page is about the current and future of [[Fedwiki]] servers. The current reference implementation in [[Node]] can be found her on [https://github.com/fedwiki/wiki-node-server gitbub]"},{"slug":"fedwiki-server-hosting","title":"Fedwiki Server Hosting","date":1435500019322,"synopsis":"This page is about the current and future of [[Fedwiki]] servers. The current reference implementation in [[Node]] can be found her on [https://github.com/fedwiki/wiki-node-server gitbub]"},{"slug":"fedwiki-server-requirements","title":"Fedwiki Server Requirements","date":1435531165671,"synopsis":"Here we list the minimum requirements for a Fedwiki Server:"},{"slug":"fedwiki-tools","title":"Fedwiki Tools","date":1511705109115,"synopsis":"Here we list a few tools that are of particular use in managing and creating [[Fedwiki]] content. Check [[Recycled pages]] to find delted pages."},{"slug":"feed-plugin","title":"Feed Plugin","date":1450611568524,"synopsis":"An audio note about a proposed Fedwiki Feed Plugin. This would enable blogs, mobile applications and software such as [[Dave Winer]]s"},{"slug":"feel-together","title":"Feel together","date":1522737960530,"synopsis":"This is a fascinating phrase - etymologically the root of the word [[Consensus]]."},{"slug":"festivals-as-happenings","title":"Festivals as happenings","date":1466768248487,"synopsis":"Art and music festivals play a large role in positive and successful happenings. Some of these festivals include [[Burning Man]] and [[Oregon Country Fair]] - [https://en.wikipedia.org/wiki/Happening#Festivals_as_happenings wikipedia]"},{"slug":"filesystem-in-userspace","title":"Filesystem in Userspace","date":1466675811421,"synopsis":"Filesystem in Userspace (FUSE) is a software interface for Unix-like computer operating systems that lets non-privileged users create their own file systems without editing kernel code. This is achieved by running file system code in user space while the FUSE module provides only a \"bridge\" to the actual kernel interfaces - [https://en.wikipedia.org/wiki/Filesystem_In_Userspace wikipedia]"},{"slug":"find-more","title":"Find More","date":1450436872438,"synopsis":"Here we push on an idea that has emerged out of  [[Sorting and Searching]] all of the things on a page. The prototype is the search link in the page footer."},{"slug":"firebase","title":"Firebase","date":1438597462211,"synopsis":"Firebase provides a realtime database and backend as a service.  It is a realtime database which provides an API that allows developers to store and sync data across multiple clients - [https://en.wikipedia.org/wiki/Firebase wikipedia]"},{"slug":"flag-transporter","title":"Flag Transporter","date":1457723225064,"synopsis":"The proposal here - perhaps only as an interesting short term hack - is to leverage the [[Fedwiki Flag Icon]] on every page as a drag-and-drop destination."},{"slug":"flutter-client","title":"Flutter Client","date":1496754033911,"synopsis":"We will explore a federated wiki client written within the flutter framework by google for android and ios. [https://flutter.io/ site]"},{"slug":"fold","title":"FOLD","date":1465480498216,"synopsis":"* [https://fold.cm/read/FOLD/what-is-fold-TiyWEK6C fold.cm]"},{"slug":"footer-item-search","title":"Footer Item Search","date":1512060378423,"synopsis":"Now a bit of terminology: \"Neighborhood search\" is the familiar search in the web page footer. For the now useful searches reached from the wiki page footer we will refer to the various choices as \"footer link search\", \"footer site search\" and \"footer item search\". Each has nice properties. [https://riot.im/app/#/room/#fedwiki:matrix.org/$15120546443979299HUevv:matrix.org chat]"},{"slug":"forage-in-the-federation","title":"Forage in the Federation","date":1458118728084,"synopsis":"To [[forage]] is not the same as [[search]], or [[browse]]. It is not viewing [[recent activity]]. It is rather an art which combines many of these in a way which is unique to the individual - it is a way to [[Hunt For Pages]]."},{"slug":"foraging","title":"Foraging","date":1458909410051,"synopsis":"Foraging is searching for wild food resources. This page is where I log my attempts to find food, or places where I may find food in the future."},{"slug":"forest-inside-your-head","title":"Forest Inside Your Head","date":1464544905605,"synopsis":"In the proliferation of thought and reason that we experience in [[writing with strangers]], we can lose the forest."},{"slug":"fork-action","title":"Fork Action","date":1423998732448,"synopsis":"A fork action, would be the recording of the act of forking in such a way that that information could be used by other parites - such as to notify people."},{"slug":"fork-history","title":"Fork History","date":1429815741879,"synopsis":"So what should happen when two pages that have diverged are merged?"},{"slug":"fork-is-the-new-like","title":"Fork is the New Like","date":1512229151394,"synopsis":"A 'like' is a way of sharing attention with a new work and its author. We consider how federated wiki's 'fork' improves on the 'like' mechanism."},{"slug":"fork-symmetry","title":"Fork Symmetry","date":1437922471967,"synopsis":"Fork symmetry is the idea that when a person forks a page, both parties should be aware of the action. Currently only the person forking a page \"knows\" what they have done. The advantage of the fork/forked unification is that the neighborhood expands in a very generous way."},{"slug":"forking-as-cultural-feature","title":"Forking as (Cultural) Feature","date":1419051533637,"synopsis":"Klint Finley has written about [[Ward Cunningham]]'s work on a federated wiki, linking ideas around Fedwiki to Github, whose strapline is \"Build software better, together\". [http://www.wired.com/2012/07/wiki-inventor/ html]"},{"slug":"forking-is-a-citation","title":"Forking is a Citation","date":1518879901928,"synopsis":"[[Fork is the new like]]. When an author forks a page this is a direct citation. When she modifies it and makes it her own, even completely rewriting the page - this is a [[Creative Commons Citation]]."},{"slug":"forms-and-aggregation","title":"Forms and Aggregation","date":1488256475431,"synopsis":"HTML5 offers a grab bag of features related to form based entry. Here we consider how they might be used for traditional data entry. [https://www.html5rocks.com/en/tutorials/forms/html5forms/ post]"},{"slug":"forms-in-wiki","title":"Forms in Wiki","date":1511950262324,"synopsis":"Here we experiment with [[HTML Form]]s in wiki. We look to hook the HTML plugin into the [[Transporter]] mechanism, such that the [[About HTML Plugin]] takes not of and [[Form Action]] requests, and looks for [[Page JSON]] in the response. If it finds this it renders a [[ghost page]], otherwise it opens an external page if it finds a simple URI, or HTML in the returned JSON."},{"slug":"fountain-markup-language","title":"Fountain (markup language)","date":1455819616870,"synopsis":"Fountain is a free and open-source plain text markup language that makes it possible to write a formatted screenplay in any text editor, on any device, using any software that edits text files - [https://en.wikipedia.org/wiki/Markdown wikipedia]"},{"slug":"framing-wiki","title":"Framing Wiki","date":1464446548389,"synopsis":"It's a bit rough but it's a start. You can see what it looks like here - [http://livecode.world/iframe.html livecode.world/iframe.html ]"},{"slug":"friedrich-hayek","title":"Friedrich Hayek","date":1468055325197,"synopsis":"Friedrich Hayek CH (8 May 1899 – 23 March 1992), born in Austria-Hungary was an Austrian and British economist and philosopher best known for his defence of classical liberalism - [https://en.wikipedia.org/wiki/Friedrich_Hayek wikipedia]"},{"slug":"frighteningly-secure-wiki","title":"Frighteningly Secure Wiki","date":1464165086775,"synopsis":"Wiki is an exploration in sharing. We have got a long way in avoiding spam, and related concerns simply by architecting out many of the usual incentives - see [[Wiki Pull Model]]"},{"slug":"fruit-salad","title":"Fruit Salad","date":1422550395521,"synopsis":"Typographers know too many italic or bold words in one place makes a paragraph hard to read. Colored words are even worse."},{"slug":"full-moon-academy","title":"Full Moon Academy","date":1441055131902,"synopsis":"The Full Moon Academy is a proposal submitted to MozFest, which will take place in London nov 6-8 this year."},{"slug":"full-moon-happenings","title":"Full Moon Happenings","date":1440612865434,"synopsis":"A [[Happening]] is a [[Near-synchronous Event]], taking place at several places during the same time period, in which we code, write, and research together on a single focused topic."},{"slug":"full-screen","title":"Full Screen","date":1512640810416,"synopsis":"[[Fullscreen]] HTML5 boasts of their new api but have hobbled it so as to protect the user from phishing attacks. I've yet to get anything to go fullscreen except standalone demo pages."},{"slug":"fullscreen","title":"Fullscreen","date":1512640800102,"synopsis":"Fullscreen HTML5 boasts of their new api but have hobbled it so as to protect the user from phishing attacks. I've yet to get anything to go fullscreen except standalone demo pages."},{"slug":"fully-decentralised","title":"Fully Decentralised","date":1467107878533,"synopsis":"As with open source code, we aim to create a pure and fully decentralised platform. However we look to layer this with federated services, and a rich range of RESTful gateways to the internet through a components we call [[Transporters]]."},{"slug":"future-of-drag--drop","title":"Future of Drag & Drop","date":1448360339491,"synopsis":"Here we look at how we can and should use drag & drop in Fedwiki."},{"slug":"future-of-federated-sharing","title":"Future of Federated Sharing","date":1438769327041,"synopsis":"It is tempting to think of Fedwiki as a platform - an alternative wiki. It is not. It is essentially a new form of sharing."},{"slug":"future-of-the-decentralised-web","title":"Future Of The Decentralised Web","date":1467115378428,"synopsis":"Here we collect references, research, and out thinking about the future of the decentralised web."},{"slug":"future-of-the-federation","title":"Future of the Federation","date":1489051327477,"synopsis":"Here we collect notes and ideas about how [[The Federation]] should evolve - where it is going. See [[Changes to the Future]]."},{"slug":"future-style","title":"Future Style","date":1448029239248,"synopsis":"Here we discuss design and style directions for [Fedwiki]] in the future:"},{"slug":"garden-patterns-inventory","title":"Garden Patterns Inventory","date":1465160229837,"synopsis":"We duplicate an illustration from Timeless Way of Building using Graph plugins and our graph building workflow."},{"slug":"gardens-meet","title":"Garden's Meet","date":1451160472715,"synopsis":"How would one prepare for a conference workshop if one were asked to provide a position statement in the form of a federated wiki site? How can we develop a style for this form of engagement?"},{"slug":"github-repo","title":"Github Repo","date":1440235285579,"synopsis":"Minimal dots from the ground up. Here we redevelop the technique using fabricated data and step by step"},{"slug":"global-online-database","title":"Global Online Database","date":1457263088371,"synopsis":"A joke that came into my head in the early days of Google as I was working on [[PageRank]] type [[Algorithm]]s for [[Liquid Democracy]] while Google did its thing for [[Search]]."},{"slug":"goals-for-federated-wiki","title":"Goals for Federated Wiki","date":1493403248233,"synopsis":"We share an interest in the continued growth in federated wiki as an important concept and in the open codebase that demonstrates its advantages."},{"slug":"goals-pod-charter","title":"Goals Pod Charter","date":1438329280208,"synopsis":"This pod connects federated wiki developers and administrators so as to coordinate their efforts building out the wiki software and the communities that use it."},{"slug":"god-is-not-a-relational-database","title":"GOD is not a Relational Database","date":1450522668316,"synopsis":"This is a phrase that has been in my head for nearly 20 years. It keeps coming back. I find it amusing, important and true."},{"slug":"good-morning","title":"Good Morning","date":1466600843971,"synopsis":"I woke up at 4:50 this morning with light in the window and birds singing. I'm thinking, June 22 is special, the longest day of the year? Don't want to miss that."},{"slug":"good-regulator","title":"Good regulator","date":1510962384330,"synopsis":"The good regulator is a theorem conceived by Roger C. Conant and W. Ross Ashby that is central to cybernetics. It is stated that \"every good regulator of a system must be a model of that system\". That is, any regulator that is maximally successful and simple must be isomorphic with the system being regulated. This result is obtained by considering the entropy of the variation of the output of the controlled system, and shows that, under very general conditions, that the entropy is minimized when there is a mapping from the states of the system to the sta"},{"slug":"google-hates-wiki","title":"Google Hates Wiki","date":1387461406000,"synopsis":"Google giveth, and Google taketh away."},{"slug":"google-loves-wiki","title":"Google Loves Wiki","date":1352705129000,"synopsis":"<i>August 2008: ISBN Referer</i>"},{"slug":"governance","title":"Governance","date":1448544950275,"synopsis":"Why is it that in so many hierarchical institutions authority is separated from competence? Why do so many such systems continue to exist?"},{"slug":"graph-commons","title":"Graph Commons","date":1452595346603,"synopsis":"Graph Commons is a project by [[Burak Arikan]]. Hew ill be presenting two workshops at the 2016 [[transemdiale]] festival in February."},{"slug":"graph-plugin","title":"Graph Plugin","date":1461522692634,"synopsis":"here we describe the results of creating a new plugin to render interactive graphs in Fedwiki. First et's [[Make a New Plugin]]."},{"slug":"graphing-the-federation","title":"Graphing the Federation","date":1465459082833,"synopsis":"Mission: to create a set of navigable maps to make it much clearer how all the sites fit together and who is working on what."},{"slug":"graphs-in-wiki","title":"Graphs In Wiki","date":1464605130097,"synopsis":"We can author graphs in wiki using our own notation inside a [[About Graph Plugin]]. This is [[work-in-progress]]."},{"slug":"graphs-of-wiki","title":"Graphs of Wiki","date":1466289302022,"synopsis":"A graph of a wiki is a visualisation of links between wiki pages. This is different from using wiki to define graphs."},{"slug":"grep-for-errors","title":"Grep For Errors","date":1466774826734,"synopsis":"We look for pages with server errors recorded in their journal. Drag this page to any site to look there."},{"slug":"grep-workflow","title":"Grep Workflow","date":1458123374706,"synopsis":"Here I describe a suggested [[workflow]] for [[Questioning As You Write]]. It just so happens to use the [[grep]] plugin - which I have not fully got my head around :)"},{"slug":"hacking-federated-wiki","title":"Hacking Federated Wiki","date":1448229142109,"synopsis":"Federated wiki is designed to be a growing, moving, sprawling thing that can outlive any advice that I might give here. But start somewhere we must."},{"slug":"hackteria","title":"Hackteria","date":1457269997143,"synopsis":"Hackteria is a web platform and collection of open source Biological Art projects instigated in February 2009 by Andy Gracie, Marc Dusseiller and Yashas Shetty, after collaboration during the Interactivos?09 Garage Science at Medialab Prado in Madrid - [https://en.wikipedia.org/wiki/Hackteria wikipedia]"},{"slug":"hand-drawn-graphs","title":"Hand Drawn Graphs","date":1455626381772,"synopsis":"Here we examine the utility of hand drawn graphs in concept and wiki navigation and comprehension."},{"slug":"hangout-agenda","title":"Hangout Agenda","date":1459968214240,"synopsis":"Here we look at some [[Topics]], [[Issues]] and [[Questions]] that we look to raise at the [[Weekly Hangout]]."},{"slug":"happening","title":"Happening","date":1470402837630,"synopsis":"A happening is a performance, event or situation meant to be considered art, usually as performance art - [https://en.wikipedia.org/wiki/Happening wikipedia]"},{"slug":"happening-plugin","title":"Happening Plugin","date":1467115229003,"synopsis":"This [[Plugin]] allows you to create a [[WebRTC Chat Room]] and embed this in wiki."},{"slug":"happenings-not-hangouts","title":"Happenings Not Hangouts","date":1467115264522,"synopsis":"Here we look to develop the idea of a traditional [[Google Hangout]] or [[Hangout-on-Air]], into an event which can take place in public space - more akin to the early experience of [[Live Radio]], that what we see today in terms of [[Talking Heads]]."},{"slug":"heterarchy","title":"Heterarchy","date":1446257664409,"synopsis":"A heterarchy is a system of organization where the elements of the organization are unranked (non-hierarchical) or where they possess the potential to be ranked a number of different ways."},{"slug":"hiding-things","title":"Hiding Things","date":1502521935109,"synopsis":"Here we explore various ways of hiding things in wiki - either for aesthetic reasons, or secure communications of text or data."},{"slug":"hierarchical-layout","title":"Hierarchical Layout","date":1464607978490,"synopsis":"Transported image. [http://i.imgur.com/mSW9fmP.jpg source]"},{"slug":"higgins-project","title":"Higgins project","date":1510659028033,"synopsis":"Higgins is an open source project dedicated to giving individuals more control over their personal identity, profile and social network data - [https://en.wikipedia.org/wiki/Higgins_project wikipedia]"},{"slug":"hospitable-hypertext","title":"Hospitable Hypertext","date":1423281651423,"synopsis":"Hospitality is the effort one makes to have those not at home feel at home. On the web, notions of hospitality are inextricably bound up with charity of language, interpretation, and discourse style. While wiki focuses on the needs of writers, it also encourages writers to write in a hospitable way."},{"slug":"hosting","title":"Hosting","date":1491865191073,"synopsis":"A computer with a modern operating system and networking software can host the wiki server. This combination of resources can be found in many places."},{"slug":"hosting-infrastructure","title":"Hosting Infrastructure","date":1435499407384,"synopsis":"THe aim of a future hosting infrastructure for [[Fedwiki Server]] software should separate concerns:"},{"slug":"how-i-shrunk-wiki","title":"How I Shrunk Wiki","date":1497877095439,"synopsis":"Wiki is sometimes too large. So I wandered what it would look like smaller. Here is some CSS that you can use to shrink your wiki."},{"slug":"how-should-we-use-pipes","title":"How Should We Use Pipes?","date":1457714944595,"synopsis":"While it could be possible (and may be desirable) to simply modify the default behavior of [[Internal Wiki Links]], we can also restrict this behavior to a [[New Link Markup]]."},{"slug":"how-svg-panels-work","title":"How SVG Panels Work","date":1462856001403,"synopsis":"Here we brainstorm and discuss how interactive svg panels might work in wiki."},{"slug":"how-systems-fail","title":"How Systems Fail","date":1455402092569,"synopsis":"How Complex Systems Fail"},{"slug":"how-to-install-wiki","title":"How To Install Wiki","date":1467284865902,"synopsis":"We will explain npm basics especially the difference between local and global installs."},{"slug":"how-to-write-questions","title":"How To Write Questions","date":1458123557924,"synopsis":"Here we explore how we can write questions in Fedwiki as we write. How we can do this painlessly, and use the way we write to get answers to our questions in a slow and thoughtful way."},{"slug":"how-we-find-data","title":"How We Find Data","date":1428525579408,"synopsis":"Pages from many sites can find each other when they arrive together in a browser and at that moment connect  data to computations and computations to visualizations. Here we explain how that happens."},{"slug":"html-comment-markup","title":"HTML Comment Markup","date":1497894023870,"synopsis":"Here we use two [[HTML Comment]] lines in order to delineate a section of HTML to be replaced. for instance say we want to replace a title:"},{"slug":"html-form-in-wiki","title":"HTML Form in Wiki","date":1511953761702,"synopsis":"Here we experiment with HTML [[Forms in Wiki]] in wiki. We can combine this wiki functionality with a service like [[LastPass Form Fills]] to store user centric sensitive information in an encrypted way in the users browser cache."},{"slug":"html-image-maps","title":"HTML Image maps","date":1430041222959,"synopsis":"Client-side image maps were introduced in HTML 3.2, and do not require any special logic to be executed on the server (they are fully client-side). They also do not require any JavaScript - [https://en.wikipedia.org/wiki/Image_map wikipedia]"},{"slug":"html-sanitization","title":"HTML Sanitization","date":1461518216043,"synopsis":"The [[HTML Sanitization]] that the [[About HTML Plugin]] performs removes the markup required to provide [[Internal Fedwiki Links]]."},{"slug":"html-substitution-markup","title":"HTML Substitution Markup","date":1497893299405,"synopsis":"We can use this markup within our [[Splash Page Templates]] whenever we need to customise an HTML fragment which is hard or complex to do with [[HTML Comment Markup]]."},{"slug":"html-to-svg","title":"HTML to SVG","date":1510699663043,"synopsis":"Below are a collection of links imported from [[OneTab]]. You can view these links here - [https://www.one-tab.com/page/rbCgH9ABTKmY732eEAWNXA one-tab.com]:"},{"slug":"html5-not-json","title":"HTML5 not JSON","date":1430048224603,"synopsis":"The idea is to change the way [[Fedwiki Pages]] are stored. Currently this is JSON data. The suggestion is that we move to a standard simplified markup that mirrors the current logic but uses [[HTML5]]."},{"slug":"html5-video","title":"HTML5 Video","date":1490371420091,"synopsis":"HTML5 video is intended by its creators to become the new standard way to show video on the web without plugins - [https://en.wikipedia.org/wiki/HTML5_video wikipedia]"},{"slug":"huge-svg-image-maps","title":"Huge SVG Image Maps","date":1461436770484,"synopsis":"This is an interesting bug, that maybe could be put to good use :)"},{"slug":"hyperlocal-server","title":"Hyperlocal Server","date":1437496057736,"synopsis":"On this page we discuss the development of a \"hyperlocal server\" for the [[Federation]]. We imagine a number of bespoke [[Hyperlocal Servers]] coded in different languages. The one we are concentrating here is the [[LiveNode Server]] or more specifically the [[Block Server]]."},{"slug":"hyperlocal-servers","title":"Hyperlocal Servers","date":1437485117247,"synopsis":"A [[Hyperlocal Server]] is term I coined for a local web server that a use may run at home, or in a local business, school, or cafe."},{"slug":"hypermedia-apis-in-html","title":"Hypermedia Apis in HTML","date":1430047993776,"synopsis":"There is currently a major shift sweeping over the software industry. With each passing day the world is becoming more and more API-driven."},{"slug":"identity-provider","title":"Identity provider","date":1510659488805,"synopsis":"An identity provider (abbreviated IdP) is a system entity that creates, maintains, and manages identity information for principals while providing authentication services to relying party applications within a federation or distributed network - [https://en.wikipedia.org/wiki/Identity_provider wikipedia]"},{"slug":"image-assets","title":"Image Assets","date":1475588917031,"synopsis":"We url-encode images dropped on the factory plugin. This captures the sharing dynamics expected of the federation but it doesn't match with current asset practices."},{"slug":"image-drag--drop","title":"Image Drag & Drop","date":1448360272622,"synopsis":"Here we look at the current image drag and drop functionality, demo a tip, and suggest an improvement that would enable direct drag and drop from any image url on a web site."},{"slug":"image-metadata","title":"Image Metadata","date":1462473096998,"synopsis":"Here we look at some tools to add metadata to images."},{"slug":"image-transporter","title":"Image Transporter","date":1449085902174,"synopsis":"This service creates wiki pages with images in several forms without loading image data within the page. Use this for large or detailed images that will be stored remotely."},{"slug":"impermanent-web","title":"Impermanent Web","date":1448029266122,"synopsis":"The impermanent web is the existing world wide web of HTML pages and broken links - where sites come and go, and links to image, videoa and other web pages are forever being broken."},{"slug":"import-quotation-and-reference","title":"Import, Quotation and Reference","date":1518344716811,"synopsis":"We consider how wiki pages relate to other works and how how such information can be composed into a useful historical record. This is one of our [[Top Maintenance Priorities]]."},{"slug":"indie-web-camp","title":"Indie Web Camp","synopsis":"Rather than posting content on many third-party silos of data, we should all begin owning the data we're creating. Publish short status updates on your own domain, and syndicate to Twitter. Publish photos on your own domain, syndicate to Flickr, etc, etc."},{"slug":"information-card","title":"Information Card","date":1510658943763,"synopsis":"Information Cards are personal digital identities that people can use online, and the key component of Identity Metasystem. Visually, each i-card has a card-shaped picture and a card name associated with it that enable people to organize their digital identities and to easily select one they want to use for any given interaction. The Information Card metaphor is implemented by Identity Selectors like Windows CardSpace, [[DigitalMe]] or [[Higgins Identity Selector]] - [https://en.wikipedia.org/wiki/Information_Card wikipedia]"},{"slug":"information-is-a-virus","title":"Information is a Virus","date":1437923853662,"synopsis":"Here we explore various ways in in which information spreads, and how information architectures and conversational routing can affect this spread."},{"slug":"install-nginx-with-lua-support","title":"Install Nginx with LUA Support","date":1461424647470,"synopsis":"The only issue is with that the default install of [[nginx]] with [[homebrew]] does not include [[LUA]] support."},{"slug":"install-node-on-raspberry-pi","title":"Install Node on Raspberry Pi","date":1437992760813,"synopsis":"The following instructions work with the new Raspian from 28th May 2015. These instructions are for node v0.10 and above and assume a fresh install. Solution found on [http://joshondesign.com/2013/10/23/noderpi joshondesign.com]"},{"slug":"installing-openresty-on-osx","title":"Installing OpenResty on OSX","date":1461421851899,"synopsis":"Here are my notes on installing OpenResty locally on OSX. I'm following the instructions over at [https://openresty.org/en/installation.html openresty.org]"},{"slug":"interactive-manual","title":"Interactive Manual","date":1450397778055,"synopsis":"it's a manual which has buttons in it which do stuff and show you what happens."},{"slug":"interface-for-decentralisation","title":"Interface for Decentralisation","date":1448018866241,"synopsis":"What is the nature of the interface we need for decentralised content? How does this differ from the existing internet? These are the questions we explore on this page."},{"slug":"internal-wiki-links","title":"Internal Wiki Links","date":1457362210666,"synopsis":"Simple Wikipedia links (just like [[Fedwiki Internal Links]] are enclosed in doubled square brackets like this:"},{"slug":"internet-landscapes","title":"Internet Landscapes","date":1451856863471,"synopsis":"In Internet Landscapes, Evan Roth with discuss his work as it relates to visualizing, archiving and understanding the Internet and its effects on culture with a focus on the misuse of communication technologies."},{"slug":"internet-of-zombies","title":"Internet of Zombies","date":1459262938324,"synopsis":"Why pop culture’s zombie fixation is really the Internet’s fault."},{"slug":"interplanetary-file-system","title":"InterPlanetary File System","date":1466676011069,"synopsis":"InterPlanetary File System ([[IPFS]]) is a content-addressable, peer-to-peer hypermedia distribution protocol. Nodes in the IPFS network form a distributed file system. IPFS is an open source project developed by Protocol Labs with help from the open source community. It was initially designed by Juan Benet - [https://en.wikipedia.org/wiki/Interplanetary_file_system wikipedia]"},{"slug":"interplanetary-livecode","title":"Interplanetary Livecode","date":1467104554611,"synopsis":"Here we describe how we will make a Livecode based Fedwiki app that runs in a pure decentralised mode on [[IPFS]]."},{"slug":"interwiki-mediawiki-links","title":"Interwiki Mediawiki Links","date":1457362072386,"synopsis":"An interwiki link links to a page on another Wikimedia project website, such as Meta or another language Wikipedia."},{"slug":"ipfs","title":"IPFS","date":1466676041334,"synopsis":"IPFS stands for the [[InterPlanetary File System]]. IPFS is a bold attempt at evolving the Internet's infrastructure."},{"slug":"ipfs-architecture-for-fedwiki","title":"IPFS Architecture for Fedwiki","date":1449658954016,"synopsis":"How we might structure the IPFS \"file system\" to serve Fedwiki pages and integrate this with standalone JavaScript apps."},{"slug":"ipfs-fedwiki-backend","title":"IPFS Fedwiki Backend","date":1448029544636,"synopsis":"Here we discuss how we might structure the [[IPFS]] \"file system\" to serve [[Fedwiki page]]s and integrate this with [[Standalone JavaScript Apps]]."},{"slug":"ipfs-video-streaming","title":"IPFS Video Streaming","date":1467105344055,"synopsis":"Here we examine how we stream video using IPFS."},{"slug":"ipns","title":"IPNS","date":1449659116148,"synopsis":"IPNS stands for the The Inter-Planetary Naming System. ipns is a way to add a small amount of mutability to the permanent immutability that is ipfs. It allows you to store a reference to an ipfs hash under the namespace of your peerID ( hash of your public key ). - [https://github.com/ipfs/examples/tree/master/examples/ipns github]"},{"slug":"issue","title":"Issue","date":1458147677831,"synopsis":"Here we list issues to do with the [[Himalayan Academy Web Sites]]."},{"slug":"issue-for-hangout","title":"Issue for Hangout","date":1458122088403,"synopsis":"Above you can drag and drop an [[Issue]] from a page you are writing, in order to replace the paragraph you wrote with a reference link from here but containing the same content."},{"slug":"issues-for-hangout","title":"Issues for Hangout","date":1458119462932,"synopsis":"A page with 0 items."},{"slug":"issues-writing-with-others","title":"Issues Writing With Others","date":1466752623746,"synopsis":"Here we list some issues and concerns that people have when beginning to write with strangers."},{"slug":"itemscope","title":"itemscope","date":1458003080361,"synopsis":"Nice discussion and link here - [http://stackoverflow.com/questions/4158876/html5-what-is-the-itemscope-attribute-and-what-does-it-do-in-laymans-terms stackoverflow]"},{"slug":"javascript-graph-libraries","title":"Javascript Graph Libraries","date":1455626260566,"synopsis":"Dagre (Directed graph renderer for Javascript) - [https://github.com/cpettitt/dagre github.com]"},{"slug":"javascript-that-replaces-itself","title":"Javascript that replaces itself","date":1467113977702,"synopsis":"is this even possible. What we would like is a static file, served by IPFS and containing javascript, that when loaded using an [[HTTP GET]] request returns json dynamically."},{"slug":"journal-duplication","title":"Journal Duplication","date":1420512453908,"synopsis":"The Journal stores new copies of story items each time they are edited. This presumes items are small and edits touch all parts of them. Not true for caption edits of fat images. But, let's consider the Journal an asset library for story items in the few cases where this is an issue."},{"slug":"journal-pm-ymd-20170401","title":"Journal PM y.m.d. 2017.04.01","date":1491139694424,"synopsis":"I need to learn to use wiki."},{"slug":"journal-rewriting","title":"Journal Rewriting","date":1451603842472,"synopsis":"Here we look at strategies for cleaning, and processing Fedwiki [[Journal]]s."},{"slug":"journeyman","title":"Journeyman","date":1425429794470,"synopsis":"A journeyman (Wandergeselle in German), is an individual who has completed an apprenticeship and is fully educated in a trade or craft, but not yet a master - [https://en.wikipedia.org/wiki/Journeyman wikipedia]"},{"slug":"js-bin","title":"JS Bin","date":1460897642104,"synopsis":"JS Bin is a tool for experimenting with web languages. In particular [[HTML]], [[CSS]] and [[JavaScript]], but JS Bin also supports other languages too (like [[Markdown]], [[Jade]] and [[Sass]])- [http://jsbin.com/help/how-can-i-embed-jsbin jsbin.com]"},{"slug":"json-ld-for-markup","title":"JSON-LD for Markup","date":1458105603277,"synopsis":"Here we experiment with a simple example (below) of embedding [[JSON-LD]] in an HTML item in Fedwiki."},{"slug":"json-schema","title":"JSON Schema","date":1438562856175,"synopsis":"Here we describe the JSON Schema for a [[Wiki Page]], that is the [[Wiki Page JSON]] that [[Fedwiki Page]]s are built out of. You can see this JSON for any particular page by selecting the JSON link at the bottom of the page."},{"slug":"json-web-token","title":"JSON Web Token","date":1510693578675,"synopsis":"JSON Web Token ([[JWT]], pronounced jot) is a relatively new token format used in space-constrained environments such as HTTP Authorization headers. JWT is architected as a method for transferring security claims based between parties - [https://en.wikipedia.org/wiki/JSON_Web_Token wikipedia]"},{"slug":"jwt","title":"JWT","date":1510696589566,"synopsis":"[[JSON Web Token]] (JWT, pronounced jot) is a relatively new token format used in space-constrained environments such as HTTP Authorization headers. JWT is architected as a method for transferring security claims based between parties - [https://en.wikipedia.org/wiki/JSON_Web_Token wikipedia]"},{"slug":"kademlia","title":"Kademlia","date":1450109618083,"synopsis":"[[Kademlia]] is the inspiration for the distributed hash table used as a core component of [[IPFS]]."},{"slug":"kaiten-continuous-experience","title":"Kaiten Continuous Experience","date":1460754084333,"synopsis":"A new (2011) navigation model for web applications that allows you to browse thru one or several applications in a single continuous space. [http://un2k.com/~~kaiten~~/ site]"},{"slug":"kantara-initiative","title":"Kantara Initiative","date":1510658654364,"synopsis":"Kantara Initiative, Inc. is a 501 c(6) non-profit industry consortium and professional trade association dedicated to advancing technical & legal innovation and trust framework operations related to digital identity management and data privacy - [https://en.wikipedia.org/wiki/Kantara_Initiative wikipedia]"},{"slug":"kingsbury-outline","title":"Kingsbury Outline","date":1459614233068,"synopsis":"This outline and pattern language for an overview class on distributed systems fundamentals. [https://github.com/aphyr/distsys-class/blob/master/README.markdown github]"},{"slug":"kino43","title":"Kino43","date":1467140046145,"synopsis":"Kino43 uses film to bring issues related to decentralisation (particularly in the fields of art, education, and new technologies), into a public and open discussion of current socio-political topics - [https://www.facebook.com/PPkino43/timeline Facebook]."},{"slug":"knowledge-commons","title":"Knowledge Commons","date":1466754371998,"synopsis":"[[Elinor Ostrom]], with Oliver Williamson, won the Nobel Prize in Economic Sciences in 2009 because she demonstrated that regular folks like you and I can create and self-govern a commons in a sustainable and equitable manner.[http://www.elinorostrom.com site]"},{"slug":"knowledge-representation","title":"Knowledge Representation","date":1464608396943,"synopsis":"How can we represent knowledge? Here we collect some links:"},{"slug":"ksenya","title":"Ksenya","date":1459771612784,"synopsis":"I'm @j32804 on Twitter, and it is the best way to ping me. My favourite game is [[The Incredible Machine]]. My favourite topics are people's relationship to information and the ways we design and maintain infrastructures. I enjoy chatting about privacy, security and other post-apocalytic stuff."},{"slug":"kuhn-cycle","title":"Kuhn Cycle","date":1451851237849,"synopsis":"Thomas Kuhn's Structure of Scientific Revolutions described the social cycle through which science advances, one stage of which is the paradigm shift for which he is famous."},{"slug":"languages-that-compile-to-javascript","title":"Languages that compile to Javascript","date":1510699590787,"synopsis":"Below are a collection of links imported from [[OneTab]]. You can view these links here - [https://www.one-tab.com/page/TqtX3HkKTLqtmpKFUzPanQ one-tab.com]:"},{"slug":"laptop-server","title":"Laptop Server","date":1431392897772,"synopsis":"Federation makes even tiny wiki sites valuable. To feel this value, make some sites. Experiment. Keep the ones you like. Here I reflect on three years of doing this myself."},{"slug":"lawrence-lessig","title":"Lawrence Lessig","date":1512221846206,"synopsis":"Lester Lawrence \"Larry\" Lessig III (born June 3, 1961) is an American academic, attorney, and political activist. He is the Roy L. Furman Professor of Law at Harvard Law School and the former director of the Edmond J. Safra Center for Ethics at Harvard University."},{"slug":"layered-authentication","title":"Layered Authentication","date":1438275205761,"synopsis":"There are circumstances when having a built-in authentication scheme is not practical. For these we should enable a wiki site to be wrapped in a layer that protects the site."},{"slug":"learn-wiki-by-doing-wiki","title":"Learn Wiki by Doing Wiki","date":1466502311113,"synopsis":"Here we list from experience paths to understanding wiki for the newcomer. Some paths work better than others."},{"slug":"learning-timebank","title":"Learning TimeBank","date":1438597525934,"synopsis":"We use a time based currency: Students are required to pass on their learning in order to earn credits that they can use to take further free courses."},{"slug":"leslie-lamport","title":"Leslie Lamport","date":1466343634047,"synopsis":"Leslie B. Lamport (born February 7, 1941) is an American computer scientist. Lamport is best known for his seminal work in distributed systems and as the initial developer of the document preparation system LaTeX - [https://en.wikipedia.org/wiki/Leslie_lamport wikipedia]"},{"slug":"lessons-from-the-bazaar","title":"Lessons from the Bazaar","date":1523956833418,"synopsis":"Raymond points to 19 \"lessons\" learned from various software development efforts, each describing attributes associated with good practice in open source software development "},{"slug":"lets-encrypt","title":"Let's Encrypt","date":1456767322319,"synopsis":"Let’s Encrypt is a free, automated, and open certificate authority (CA), run for the public’s benefit. Let’s Encrypt is a service provided by the Internet Security Research Group (ISRG). [https://letsencrypt.org Let's Encrypt] [https://letsencrypt.org/isrg/ ISRG]"},{"slug":"lets-talky","title":"Let's Talky","date":1464179999549,"synopsis":"Talky makes"},{"slug":"lets-worry-about-the-train","title":"Let's Worry about the Train","date":1491988082606,"synopsis":"After offhand remarks Bret Victor reflects deeply on the climate problem bearing upon us and the many ways that our technological attention could be better spent. [http://worrydream.com/ClimateChange/ site]"},{"slug":"lineup-links","title":"LineUp Links","date":1492506382110,"synopsis":"Presently [[wiki links]] implement internal links within [[the federation]], using a mechanism we call [[collaborative links]]. Here I outline a proposal to extend this mechanism to enable wiki links to open a number of lineup pages."},{"slug":"lineup-viewer","title":"Lineup Viewer","date":1465673557155,"synopsis":"Here we merge graphs from the lineup into a single graph rendered with Cytoscape. Loading takes a few seconds."},{"slug":"link-logic","title":"Link Logic","date":1473957817084,"synopsis":"The [[collaborative link]] is a significant innovation in hypertext thinking. It provides a mechanism for texts to find each other which is engineered from a social perspective rather than a technical or media perspective. Your link finds pages that make contextual sense, rather than a simple fixed reference which takes you to the same place regardless of context."},{"slug":"link-store","title":"Link Store","date":1438597888264,"synopsis":"Here we look at ways in which links between items, and pages can be usefully stored, aggregated and utilised in the Federation."},{"slug":"link-symmetry","title":"Link Symmetry","date":1438327403628,"synopsis":"A symmetrical link joins two or more places without preference for one over the other. The hypertext link provided by the anchor tag in html is notoriously non-symmetrical. Here we consider alternatives not based on the html anchor."},{"slug":"link-to-neighbors","title":"Link to Neighbors","date":1506939049327,"synopsis":"We consider fine points on the behavior of [[Collaborative Link]] first discussed in chat. [https://matrix.to/#/!ORfrUEFeWFcHAMLFLr:matrix.org/$14966668964452467FFNDZ:matrix.org post]"},{"slug":"linked-custom-search-engine","title":"Linked Custom Search Engine","date":1460207205465,"synopsis":"In a Linked CSE the specification of the search engine is hosted on your website. In a Google Stored CSE the specification is stored at Google."},{"slug":"linked-data","title":"Linked Data","date":1438328946753,"synopsis":"In the Federation linked-data has then benefit of being able to be aggregated form a range of sources in a manor that is logically consistent and can provide sophisticated processing and reasoning."},{"slug":"linked-data-wiki","title":"Linked Data Wiki","date":1427716397353,"synopsis":"So what is the relationship betweed [[Federated Wiki]] and [[Linked Data]]? Is not the merger of these two things the [[Web We Want]]?"},{"slug":"liquid-democracy","title":"Liquid Democracy","date":1427123774080,"synopsis":"Liquid Democracy is a marriage between [[Direct Democracy]], and [[Representative Democracy]]. It aims to create a more flexible and fluid way for people to express their [[Democratic Preference]]."},{"slug":"list-of-plugins","title":"List of Plugins","date":1469229607290,"synopsis":"This server has many plugins installed. Some are experiments old or new. A few provide basic mechanisms. The rest have some purpose explained in the About pages embedded in the plugin."},{"slug":"literate-programming","title":"Literate programming","date":1470583712344,"synopsis":"Literate programming is an approach to programming introduced by Donald Knuth in which a program is given as an explanation of the program logic in a natural language, such as English, interspersed with snippets of macros and traditional source code, from which a compilable source code can be generated - [https://en.wikipedia.org/wiki/Literate_programming wikipedia]"},{"slug":"literate-wiki","title":"Literate Wiki","date":1466187761679,"synopsis":"The basic idea behind [[Literate Wiki]] is for a wiki page to describe and document a software program as well as to extract the code that is described."},{"slug":"live-tv-studios","title":"Live TV Studios","date":1438341506697,"synopsis":"Live streaming does not have to simply be Hangouts on Air, or pointing a webcam at a talking head. We can mix game footage, code, the web, and local content in new forms of mashup.."},{"slug":"livecode","title":"LiveCode","date":1453226005249,"synopsis":"Livecode is an easy to learn, open source, high level language for creating programs and mobile apps for a variety of platforms including Windows, iOS and Android."},{"slug":"livenode-server","title":"LiveNode Server","date":1460900995160,"synopsis":"The aim of this project is to create a [[LiveCode Server]] that interoperates efficiently with [[NodeJS]]."},{"slug":"local-fedwiki-authoring","title":"Local Fedwiki Authoring","date":1458113883071,"synopsis":"There is a lot of potential in local authoring of Fedwiki content. The benefits of this approach include:"},{"slug":"lockdown-password-access","title":"Lockdown Password Access","date":1435672695045,"synopsis":"To improve security you should only allow ssh pass-wordless (key based) authentication, especially for root:"},{"slug":"looking-back-and-looking-forward","title":"Looking back and Looking Forward","date":1423964458888,"synopsis":"Currently, federated wiki is a new sort of browser inside and old sort of browser. So we have this somewhat parasitic approach of building a new sort of web by piggybacking on the old one."},{"slug":"loose-coupling","title":"Loose coupling","date":1466890905622,"synopsis":"In computing and systems design a loosely coupled system is one in which each of its components has, or makes use of, little or no knowledge of the definitions of other separate components. Sub-areas include the coupling of classes, interfaces, data, and services - [https://en.wikipedia.org/wiki/Loose_coupling wikipedia]"},{"slug":"loosely-coupled-architecture","title":"Loosely Coupled Architecture","date":1466892976390,"synopsis":"In a strict sense a loosely coupled architecture is one of encapsulating the functionality of a piece of code (see [[loose coupling]]). Here we explore the idea of loose coupling in a more social sense, and in the context of the [[decentralised web]]."},{"slug":"lost-tools","title":"Lost Tools","date":1464593291824,"synopsis":"A continuously evolving environment means that many interesting tools are created and then forgotten. Here we list some favourites,."},{"slug":"lots-of-data","title":"Lots of Data","date":1458039613713,"synopsis":"Here we take a look at what happens if we put a lot of data on the page."},{"slug":"ludwig-wittgenstein","title":"Ludwig Wittgenstein","date":1467034727079,"synopsis":"Ludwig Josef Johann Wittgenstein ]; 26 April 1889 – 29 April 1951) was an Austrian-British philosopher who worked primarily in logic, the philosophy of mathematics, the philosophy of mind, and the philosophy of language - [https://en.wikipedia.org/wiki/Ludwig_wittgenstein wikipedia]"},{"slug":"make-a-new-plugin","title":"Make a New Plugin","date":1420517275181,"synopsis":"We'll take notes as we make a new plugin. We've made a few so this represents the best approach so far."},{"slug":"making-wiki-translucent","title":"Making Wiki Translucent","date":1464446724469,"synopsis":"We can make wiki translucent, so that the background peeks through. This can be interesting when the background has some meaning - as in the situation where we show a map of contextual links from the current page."},{"slug":"map-of-wiki-pages","title":"Map Of Wiki Pages","date":1464551060736,"synopsis":"Here we take thumbnails of wiki pages, and link them to other pages to create a map (or graph) of wiki pages.."},{"slug":"map-wiki","title":"Map Wiki","date":1467042542187,"synopsis":"Here we explore how we can integrate wiki into a mapping environment - either a [[Geographic Wiki Map]], or a [[Conceptual Wiki Map]]."},{"slug":"maps-and-places","title":"Maps and Places","date":1512312846378,"synopsis":"We've begun some work on the long neglected map plugin. Here we consider how maps might interact with the rest of the lineup, neighborhood and federation."},{"slug":"mars","title":"Mars","date":1489145741301,"synopsis":"Mars is the fourth planet from the Sun and the second-smallest planet in the Solar System, after Mercury. Named after the Roman god of war, it is often referred to as the \"Red Planet\" because the iron oxide prevalent on its surface gives it a reddish appearance. Mars is a terrestrial planet with a thin atmosphere, having surface features reminiscent both of the impact craters of the Moon and the valleys, deserts, and polar ice caps of Earth - [https://en.wikipedia.org/wiki/Mars wikipedia]"},{"slug":"material-design","title":"Material Design","date":1463408899419,"synopsis":"We challenged ourselves to create a visual language for our users that synthesizes the classic principles of good design with the innovation and possibility of technology and science. [https://www.google.com/design/spec/material-design google]"},{"slug":"matrix","title":"Matrix","date":1492090139274,"synopsis":"Matrix is an open standard for interoperable, decentralised, real-time communication over IP. It can be used anywhere you need a standard HTTP API for publishing and subscribing to data whilst tracking the conversation history - [http://matrix.org/docs/guides/faq.html#general matrix.org]"},{"slug":"matrix-authentication","title":"Matrix Authentication","date":1466947642349,"synopsis":"The way [[Matrix]] treats authentication is intereting, and perhaps something we can use in the Federation - [http://matrix.org/docs/spec/client_server/r0.1.0.html#user-interactive-authentication-api matrix.org]"},{"slug":"media-with-an-alabi","title":"Media With An Alabi","date":1451856325975,"synopsis":"A page with 0 items."},{"slug":"media-with-an-alibi","title":"Media With An Alibi","date":1451895456284,"synopsis":"Here we look at an interesting phrase presented in this lecture, and attributed to [[Constant Nieuwenhuys]], in which an external factor or fact gives witness to a publication - not just the whim of an individual."},{"slug":"mediawiki-and-cors","title":"Mediawiki and CORS","date":1434977988533,"synopsis":"[[Mediawiki]] sites such as [[Wikipedia]] look like they are able to work with cross-origin resource sharing ([[CORS]])."},{"slug":"mediawiki-link-syntax","title":"Mediawiki Link Syntax","date":1457362511093,"synopsis":"A [[Wikilink]] (or [[Internal Link]]) links a page to another page within English Wikipedia - [https://en.wikipedia.org/wiki/Help:Link wikipedia]"},{"slug":"mediums-durability","title":"Medium's Durability","date":1466521668228,"synopsis":"We consider what services must be maintained in order for our links into Medium to survive. We use Medium the company as an example for any other service offering persistence for creative works."},{"slug":"meet-by-the-full-moon","title":"Meet by the Full Moon","date":1441740722860,"synopsis":"We've suggested that a world-wide meetup conveign under the full moon. Procession will favor different locations on different months. Here we announce a schedule."},{"slug":"mega-map","title":"Mega Map","date":1464159043557,"synopsis":"We can represent large graphs in many ways. My favourite is the ability to create and cluster large graphs as \"countries\", where the arcs are roads, and the nodes are places or cities."},{"slug":"memex","title":"Memex","date":1466754816864,"synopsis":"The memex (a portmanteau of \"memory\" and \"index\") is the name of the hypothetical proto-hypertext system that Vannevar Bush described in his 1945 The Atlantic Monthly article \"As We May Think\". Bush envisioned the memex as a device in which individuals would compress and store all of their books, records, and communications, \"mechanized so that it may be consulted with exceeding speed and flexibility.\" The memex would provide an \"enlarged intimate supplement to one's memory\". The concept of the memex influenced the development of early hypertext systems "},{"slug":"merkle-tree","title":"Merkle tree","date":1467041777968,"synopsis":"In cryptography and computer science, a hash tree or Merkle tree is a tree in which every non-leaf node is labelled with the hash of the labels or values (in case of leaves) of its child nodes. Hash trees allow efficient and secure verification of the contents of large data structures. Hash trees are a generalization of hash lists and hash chains - [https://en.wikipedia.org/wiki/Merkle_Tree wikipedia]"},{"slug":"methodology-subsets","title":"Methodology Subsets","date":1422837666236,"synopsis":"Agile methods emerged on wiki starting with extreme programming (xp) which was then generalized to include other similar methods under the umbrella agile. We include pairing, testing an refactoring as methodological innovations. See [[Recent Changes]]"},{"slug":"methods-of-certification","title":"Methods of certification","date":1511962119466,"synopsis":"Broadly speaking, there have traditionally been three approaches to getting this trust: certificate authorities (CAs), web of trust (WoT), and simple public key infrastructure (SPKI)."},{"slug":"microdata","title":"Microdata","date":1458002953820,"synopsis":"Microdata is an HTML specification used to nest metadata within existing content on web pages - [https://en.wikipedia.org/wiki/Microdata_(HTML) wikipedia]"},{"slug":"microdata-in-fedwiki","title":"Microdata In Fedwiki","date":1460031312926,"synopsis":"I've been experimenting a little with the use of [[Microdata In Fedwiki]]. This page is about my thoughts and progress in this area."},{"slug":"micropub","title":"Micropub","date":1501225554327,"synopsis":"We'll accept posts here from Micropub clients. First we will piggyback on the RSS plugin but ultimately probably make an IndieWeb plugin that enables multiple microformats."},{"slug":"microservices","title":"Microservices","date":1510673640830,"synopsis":"A [[microservice]] is an architectural style, in which complex applications are composed of small, independent processes communicating with each other using language-agnostic APIs - [https://en.wikipedia.org/wiki/Microservices wikipedia]"},{"slug":"mike-caulfield","title":"Mike Caulfield","date":1466754885388,"synopsis":"I've worked in educational technology since the 1990s. I'm currently exploring applications of federated wiki to education. Most of my day is spent helping faculty integrate technology into teaching as Washington State University Vancouver as the Director of Blended and Networked Learning."},{"slug":"minimum-specs-for-entry-level-editor","title":"Minimum Specs for Entry Level Editor","date":1438335292537,"synopsis":"We hear repeatedly that fedwiki is confusing to beginners. One solution might be a simple entry-level editor (or [[Basic Data Editor]]). Can we take that response seriously while not destroying the larger vision? This is personal take on what a minimum functional theme would have to have."},{"slug":"mixed-content","title":"Mixed Content","date":1495816475450,"synopsis":"Wiki extends its twenty year old namesake by providing an unbounded complement of markups of which only a few offer specific syntax for formatting text. The remaining markups configure plugins to show or do work we usually associate with applications."},{"slug":"mobile-app-for-interviews","title":"Mobile app for interviews","date":1470404211422,"synopsis":"Here we describe the creation of a simple mobile app for Fedwiki that enables the user to use a microphone to record audio interviews, and then enables the user to publish this audio to Fedwiki together with an image, short text and geolocated photograph."},{"slug":"mobile-camera-integration","title":"Mobile Camera Integration","date":1438339330202,"synopsis":"Mobile devices have amazingly capable still and video cameras, that can be used in a number of ways with [[Federated Wiki]]."},{"slug":"mobile-fedwiki-server","title":"Mobile Fedwiki Server","date":1438338846473,"synopsis":"A mobile-fedwiki-server would run on your mobile phone, or tablet, and allow you to serve out Fedwiki pages to people that share you immediate vicinity (on the same wifi (LAN address), or in range of your [[Fedwiki Tethering]]"},{"slug":"mobile-first","title":"Mobile First","date":1438338191680,"synopsis":"Early on we decided that the [[Viral Academy]] would plan it's technical strategy by emphasising mobile, and in particular off-line mobile access first."},{"slug":"mobile-gestures-for-wiki","title":"Mobile Gestures For Wiki","date":1467449182163,"synopsis":"The mobile gestures should be defined properly following this grid (those are examples of UX specs, open to discussion of course)."},{"slug":"mobile-version","title":"Mobile Version","date":1489501955366,"synopsis":"We wonder, why does wiki suck on mobile and what has to be done to fix it?"},{"slug":"mobile-wiki","title":"Mobile Wiki","date":1466273349022,"synopsis":"[[Mobile Wiki]] would allow you to record your thoughts, discoveries and investigations, but consciously as a way to [[Contribute To The Commons]]."},{"slug":"modular-authentication","title":"Modular Authentication","date":1438274728508,"synopsis":"With wiki sites being owned by individuals there is only a single question that concerns us, \"Are you the site owner?\""},{"slug":"moving-off-hangouts","title":"Moving Off Hangouts","date":1467115412394,"synopsis":"Talking to [[Ksenya]] this morning about how we want to do the [[Upcoming Podcasts]], we agreed that it is time to move off [[Google Hangouts]]."},{"slug":"mozilla-persona","title":"Mozilla Persona","date":1455572171319,"synopsis":"Mozilla Persona is a decentralized authentication system for the web based on the open [[BrowserID Protocol]] prototyped by Mozilla - [http://en.wikipedia.org/wiki/Mozilla_Persona wikipedia]"},{"slug":"mozilla-science-lab","title":"Mozilla Science Lab","date":1458846176594,"synopsis":"Join our next project call, Thursday, March 24th at 12pm ET, to learn how you can get involved in open source and open science! Each month, we celebrate new contributors, hear updates on our Collaborate projects, and share tips on working openly and collaboratively on research software."},{"slug":"multiple-local-servers","title":"Multiple Local Servers","date":1437648309320,"synopsis":"In the world of [[Fedwiki]] it is not uncommon to run and own multiple local, and public web servers."},{"slug":"multitenancy","title":"Multitenancy","date":1522758340351,"synopsis":"The term \"software multitenancy\" refers to a software architecture in which a single instance of software runs on a server and serves multiple tenants. A tenant is a group of users who share a common access with specific privileges to the software instance. With a multitenant architecture, a software application is designed to provide every tenant a dedicated share of the instance - including its data, configuration, user management, tenant individual functionality and non-functional properties. Multitenancy contrasts with multi-instance architectures, w"},{"slug":"multiway-trees","title":"Multiway Trees","date":1450060768077,"synopsis":"Tree structures lend themselves to external searching, if we choose an appropriate representation for grouped nodes. From Knuth volume 3, section 6.2.4."},{"slug":"mumble-pi","title":"Mumble Pi","date":1438341320991,"synopsis":"This is a Raspberry Pi solution that we can make to create a mini streaming audio server based sn [[Raspberry Pi]]."},{"slug":"my-fork-loses-you","title":"My Fork Loses You","date":1466753575090,"synopsis":"When I write with you and fork you page, you may take the time (if notified) to find me and fork my changes back, or otherwise follow what I write by linking to me."},{"slug":"nameless-wiki","title":"Nameless Wiki","date":1418139171652,"synopsis":"This federation of wiki pages chooses to not depend on [[DNS]] but rather trusts that content of value will flow faster than physical addresses are lost. Here the page name rules."},{"slug":"native-crypto","title":"Native Crypto","date":1467108042027,"synopsis":"Every client has built in access to [[Public Key Cryptography]]. IPFS automatically generates a public / private key pair."},{"slug":"neighborhood","title":"Neighborhood","date":1466333619315,"synopsis":"The neighborhood is the list of sites seen while browsing within one tab. The site's flags are shown in the footer."},{"slug":"neo4j","title":"Neo4J","date":1472668277362,"synopsis":"Neo4j is an open-source graph database implemented in Java and accessible from software written in other languages using the Cypher query language through a transactional HTTP endpoint. [https://en.wikipedia.org/wiki/Neo4j wikipedia] [http://neo4j.com/ site]"},{"slug":"netention","title":"Netention","date":1434960493218,"synopsis":"Netention is SEMANTIC GROUPWARE that automatically organizes a community of peoples' realities - [https://github.com/automenta/netjs/blob/master/doc/README.technical.md github]"},{"slug":"network-visualisation","title":"Network Visualisation","date":1466289686584,"synopsis":"He we list a few pages and sites about graph and network visualisation as it relates to [[FedWiki]]."},{"slug":"new-plugins","title":"New Plugins","date":1518347528293,"synopsis":"Here we list and explain the use of new plugins installed on the [[Atopia Server]]:"},{"slug":"new-site-starter-kit","title":"New Site Starter Kit","date":1449436796507,"synopsis":"Just came across a page called New Site Starter Kit here.  The page itself wasn't there."},{"slug":"nginx","title":"Nginx","date":1461423951963,"synopsis":"It's straightforwards to install Nginx on OSX with [[bre]] - [http://www.parisnakitakejser.com/homebrew-install-nginx-and-php-fpm-on-mac-os-x/ parisnakitakejser.com]"},{"slug":"nodejs-and-livecode","title":"NodeJS and LiveCode","date":1460900341774,"synopsis":"If you prefer light-weight server + the expressive power of [[LiveScript]], you may build your own server using [[Node.js]] and [[Express.js]] together with the SimpleCGI \"Middleware\", which forwards CGI requests to [[LiveCode Server]] - [http://www.rozek.mobi/LiveCode_Server/Node.js/index_scr_en.html rozek.mobi]"},{"slug":"normality","title":"Normality","date":1450017023744,"synopsis":"Normality is an important concept that we consider both profoundly important and dangerous to the nature of the [[Commons]]."},{"slug":"note","title":"Note","date":1465986262934,"synopsis":"Here we list notes for this site:"},{"slug":"npm-package-distribution-tags","title":"NPM: package distribution tags","date":1459898354910,"synopsis":"How to make use of npm's package distribution tags to create cgannels just like Google Chrome's [https://medium.com/greenkeeper-blog/one-simple-trick-for-javascript-package-maintainers-to-avoid-breaking-their-user-s-software-and-to-6edf06dc5617#.9wu79omsu blog]"},{"slug":"old-to-new-left-to-right","title":"Old to New, Left to Right","date":1419443421112,"synopsis":"In a list of things, the newer things should be on the right. Just like writing."},{"slug":"open-junta","title":"Open Junta","date":1459195863315,"synopsis":"I'm thinking of adding some sort of junta mechanism to federated wiki in the style of the os replacement mechanism on the xerox alto."},{"slug":"open-membership-in-a-club","title":"Open Membership in a Club","date":1502996304128,"synopsis":"I'm thinking about a new plugin, Club, that would be a Roster that anyone can join. [https://riot.im/app/#/room/#fedwiki:matrix.org/$1497016284842413CFLsy:matrix.org matrix]"},{"slug":"openframeworks","title":"OpenFrameworks","date":1467107105665,"synopsis":"openFrameworks is an open source toolkit designed for \"creative coding\". OpenFrameworks is written in C++ and built on top of OpenGL. It runs on Microsoft Windows, OS X, Linux, iOS, Android and Emscripten - [https://en.wikipedia.org/wiki/Openframeworks wikipedia]"},{"slug":"openresty","title":"OpenResty","date":1461406776937,"synopsis":"OpenResty is a full-fledged web platform by integrating the standard [[Nginx]] core, [[LuaJIT]], many carefully written [[Lua]] libraries, lots of high quality 3rd-party Nginx modules, and most of their external dependencies- [https://openresty.org/en/ openresty.org]"},{"slug":"openstreetmap","title":"OpenStreetMap","date":1466250484927,"synopsis":"OpenStreetMap (OSM) is a collaborative project to create a free editable map of the world. Two major driving forces behind the establishment and growth of OSM have been restrictions on use or availability of map information across much of the world and the advent of inexpensive portable satellite navigation devices. OSM is considered a prominent example of volunteered geographic information - [https://en.wikipedia.org/wiki/Openstreetmap wikipedia]"},{"slug":"opinionated-wiki","title":"Opinionated Wiki","date":1433870300947,"synopsis":""},{"slug":"organic-layout","title":"Organic Layout","date":1464606963046,"synopsis":"Transported image. [http://i.imgur.com/C4EkxPx.jpg source]"},{"slug":"origin-server","title":"Origin Server","date":1437492864837,"synopsis":"The server that delivers the client-side javascript that starts you browsing the federated wiki is called the Origin Server. It's special."},{"slug":"orphaned-implementations","title":"Orphaned Implementations","date":1438326017753,"synopsis":"With advances there is the risk that some implementation will be left behind, and if there is not an active developer community become orphaned."},{"slug":"orphans","title":"Orphans","date":1491139435254,"synopsis":"\"Unready links\" are links that refer to pages that have not yet been published as fit for the readers to see. (All pages with no content would be automatically included in this category.)"},{"slug":"oscedays","title":"OSCEdays","date":1433625541364,"synopsis":"A global distributed event (JUNE 11th – 15th, 2015), exploring the [[Open Source]] and the [[Circular Economy]] - [https://oscedays.org/ oscedays.org]"},{"slug":"other-mediawikis","title":"Other MediaWikis","date":1457268097168,"synopsis":"[[Mediawiki]] is a popular wiki. Running it has it's problems, but here we list examples of wiki's that use Mediawiki software other than xx.wikipedia.org:"},{"slug":"p2p-code-signing","title":"P2P Code Signing","date":1464162755703,"synopsis":"I can find very very little on this. Multi-party key signing ([[multisig]]) seems mainly to be discussed in the context of [[blockchain]] and in particular [[bitcoin]]."},{"slug":"p2p-foundation","title":"P2P Foundation","date":1457267971740,"synopsis":"P2P Foundation: The Foundation for Peer to Peer Alternatives is an organization with the aim of studying the impact of peer to peer technology and thought on society. It was founded by Michel Bauwens - [https://en.wikipedia.org/wiki/P2P_Foundation wikipedia]"},{"slug":"page-editor","title":"Page Editor","date":1418948848278,"synopsis":"This multiple function module observes and applies edits to pages already in the lineup. Refresh sets this up. First in the [[Three Layer Store]] the editor insulates lower layers from knowledge of the dom."},{"slug":"page-origin-store","title":"Page Origin Store","date":1411271627428,"synopsis":"This instantiated module performs storage operations such as get, put, update and sitemap. Ajax to origin provide our primary exemplar for an abstract interface."},{"slug":"page-revision","title":"Page Revision","date":1512223205763,"synopsis":"A wiki page revision, is the time stamped display of a previous revision of a page that is displayed when a user clicks on a journal entry."},{"slug":"pagerank","title":"PageRank","date":1457263318518,"synopsis":"PageRank is an algorithm used by Google Search to rank websites in their search engine results. PageRank was named after Larry Page, one of the founders of Google. PageRank is a way of measuring the importance of website pages. According to Google: - [https://en.wikipedia.org/wiki/PageRank wikipedia]"},{"slug":"panel-plugin","title":"Panel Plugin","date":1462856081746,"synopsis":"Here we discuss how we might built robust, graphically rich interactive controls in wiki. The idea we start with is that we can use [[svg]] to make rich interactive \"panels\" to \"control things\"."},{"slug":"parasitic-conference","title":"Parasitic Conference","date":1470405553714,"synopsis":"A parasitic conference is a conference that takes place, feeds off, and is dependent on an existing conference. It is in a sense a popup conference that can take place at informal venues, or be structured as part of an existing conference in which participants discuss the topics and themes taking place in the host conference."},{"slug":"passport","title":"Passport","date":1458827531564,"synopsis":"Simple, unobtrusive authentication for Node.js - [http://passportjs.org/ passportjs.org]"},{"slug":"passportjs","title":"Passport.js","date":1502462519665,"synopsis":"Passport is authentication middleware for Node.js. Extremely flexible and modular, Passport can be unobtrusively dropped in to any Express-based web application. A comprehensive set of strategies support authentication using a username and password, Facebook, Twitter, and more -"},{"slug":"paul-graham-computer-programmer","title":"Paul Graham (computer programmer)","date":1469120506704,"synopsis":"Paul Graham (born 13 November 1964) is an English computer scientist, venture capitalist, and essayist. He is known for his work on Lisp, for co-founding Viaweb (which eventually became Yahoo! Store), and for co-founding the Y Combinator seed capital firm. He is the author of some programming books, such as: On Lisp (1993), ANSI Common Lisp (1995), and Hackers & Painters (2004) - [https://en.wikipedia.org/wiki/Paul_Graham_(computer_programmer) wikipedia]"},{"slug":"pauls-recent-activity","title":"Paul's Recent Activity","date":1464590974695,"synopsis":"Here we list Paul's recent activity as he updates his site list:"},{"slug":"permanent-archive","title":"Permanent Archive","date":1518368010154,"synopsis":"The permanent archive is the immutable aspect of the [[permanent wiki]]. The aim is to create a publishing medium for wiki. It is designed to store immutable assets such as images, video and audio together with standard single page sites, and  finalise json data."},{"slug":"permanent-web","title":"Permanent Web","date":1466863114677,"synopsis":"What is the permanent web? Why is it important? Here we have an initial discussion of the permanent web, and how we can start creating it with a mixture of existing technologies."},{"slug":"personalization","title":"Personalization","date":1440235945142,"synopsis":"Let's lead new site owners to a personalization page where they can configure a new site within bounds that preserve the federated wiki look and feel."},{"slug":"piped-links","title":"Piped Links","date":1457362494282,"synopsis":"Wikipedia (and other [[Mediawiki]]s), allow you to use a [[vertical bar]] \"|\" (or \"pipe\" symbol to create a link while labelling it with a different name on the original page."},{"slug":"pki","title":"PKI","date":1511961986102,"synopsis":"A [[public key infrastructure]] (PKI) is a set of roles, policies, and procedures needed to create, manage, distribute, use, store, and revoke [[digital certificate]]s and manage public-key encryption - [https://en.wikipedia.org/wiki/Public_key_infrastructure wikipedia]"},{"slug":"plugins-are-king","title":"Plugins Are King","date":1440258705059,"synopsis":"is the future of the [[Federation]] about [[Plugins]]? As we make the server more an more minimal, and the client branches into various speciality clients - what are we left with?"},{"slug":"pluto-image-of-the-year","title":"Pluto, Image of the Year","date":1467588875282,"synopsis":"Wikimedia users were invited to vote for their favorite images featured on Commons (FP) during the year 2015, to produce a single Picture of the Year. [https://commons.wikimedia.org/wiki/Commons:Picture_of_the_Year/2015 wikipedia]"},{"slug":"podcasting-requirements","title":"Podcasting Requirements","date":1466893133455,"synopsis":"What do we want from a podcasting environment in Federated Wiki? Here we outline the basic minimal feature we need, and a direction to move towards in the coming months."},{"slug":"polar-dinos","title":"Polar Dinos","date":1437924596306,"synopsis":"Dinosaurs once dominated the world — but they spent their first 30 million years stranded on its geographic fringes. Large dinosaurs flourished near the poles, but only a few small ones, no larger than ostriches, managed to gain a foothold in the hotter low latitudes. [http://www.nature.com/news/extreme-climate-change-slowed-dinosaurs-rise-1.17728 nature]"},{"slug":"polyglot-computing","title":"Polyglot (computing)","date":1467107661760,"synopsis":"In computing, a polyglot is a computer program or script written in a valid form of multiple programming languages, which performs the same operations or output independent of the programming language used to compile or interpret it - [https://en.wikipedia.org/wiki/Polyglot_(computing) wikipedia]"},{"slug":"polyglot-programming","title":"Polyglot programming","date":1467107765586,"synopsis":"We can write in any language. We can wrap low level code. We can call REST services anywhere on the internet, written in any language. We can create a community of programmers, that create code in the language of their choice."},{"slug":"polyglot-virtual-machines","title":"Polyglot Virtual Machines","date":1450387941571,"synopsis":"It’s by now a cliché that JS has become the assembly language of the Web. Rather, JS is one syntax for a portable and safe machine language, let’s say. Today I’m pleased to announce that cross-browser work has begun on WebAssembly, a new intermediate representation for safe code on the Web - [https://brendaneich.com/ brendaneich.com]"},{"slug":"polyglot-webservice-hosting","title":"Polyglot Webservice Hosting","date":1438352510420,"synopsis":"A proposal to create hosting infrastructure that we give to students to code restful Web services in any programming language."},{"slug":"portable-linked-profiles","title":"Portable Linked Profiles","date":1426508315282,"synopsis":"Portable Linked Profiles enable individual entities to own their own [[Linked data]] profiles in a standardised way that facilitates matching and searching of skills and services - [https://github.com/hackers4peace/plp-docs github]."},{"slug":"portable-wiki-server","title":"Portable Wiki Server","date":1438338795768,"synopsis":"A portable-wiki-server, is more than just a [[Hyperlocal Server]] for Fedwiki. It is an application designed to fit in your hand, and enable you to share your data with people in close proximity to you."},{"slug":"power-of-fork","title":"Power of Fork","date":1509194056527,"synopsis":"In politics there is little understanding of the importance and relevance of the concept of \"forking\" that originates in the world of software development."},{"slug":"presentation-tools","title":"Presentation Tools","date":1523985383305,"synopsis":"Presentation tools help us render and display wiki-json to the reader."},{"slug":"presentations-in-fedwiki","title":"Presentations In Fedwiki","date":1470404399754,"synopsis":"Here we take a look at how we can make presentations in Fedwiki."},{"slug":"pretty-microdata-examples","title":"Pretty Microdata Examples","date":1458105064286,"synopsis":"Here are some [[Pretty Microdata Examples]]:"},{"slug":"pretty-wiki","title":"Pretty Wiki","date":1512321826342,"synopsis":"Pretty wiki is a minimal rendering of wiki, without the wobble, or clutter of the journal. It is a deferential design of wiki that emphasises reading - a way to publish content from [http://livecode.world/pretty_wiki.html wiki]"},{"slug":"private-pods","title":"Private Pods","date":1512480453602,"synopsis":"Imagine influential authors writing freely together in private with the understanding that they are free to remake any part of their collective work as their own citing only the pod, not the individual authors who once shared in private. How would this work?"},{"slug":"project-xanadu","title":"Project Xanadu","date":1457716594652,"synopsis":"Project Xanadu is a much-misunderstood initiative to create a different kind of computer world based on a different kind of electronic document. The computer world is not just technicality and razzle-dazzle.  It is a continual war over software politics and paradigms.  OpenXanadu continues with ideas which are still radical."},{"slug":"protip-chrome-extension","title":"ProTip Chrome Extension","date":1429821163874,"synopsis":"ProTip is a peer to peer tipping for the web. It is implemented as a [[Chrome Extension]]."},{"slug":"protip-fedwiki-plugin","title":"ProTip Fedwiki Plugin","date":1429981609224,"synopsis":"An author can add the ProTip Fedwiki Plugin to a page if they would like a viewer to make voluntary contributions towards the content they provide."},{"slug":"protip-plugin","title":"ProTip Plugin","date":1429830915280,"synopsis":"A [[ProTip Fedwiki Plugin]] would take the features of the [[ProTip Chrome Extension]], and provide them as a [[Fedwiki Plugin]]."},{"slug":"protip-timer-plugin","title":"ProTip Timer Plugin","date":1429830591208,"synopsis":"The ProTip Timer Plugin logs the time spent viewing pages around the federation. The information is incrementally stored in a local database - let's call it a [[Time Account]] - which the client stores in its [[HTML5 Local Storage]], and is not therefore revealed to the server."},{"slug":"provenance-at-creation","title":"Provenance at Creation","date":1518879908809,"synopsis":"Wiki pages created from other sources by mechanical means should have a journal that starts with a Create action describing the source, means and results of the conversion."},{"slug":"provenance-page","title":"Provenance Page","date":1518879888796,"synopsis":"Here we propose interspersing an new page display when a user interacts with the [[Citation Bar]]."},{"slug":"pruning-history","title":"Pruning History","date":1451603953995,"synopsis":"How should we prune, rewrite, or otherwise process page histories? here we discuss different ideas about merging, archiving or otherwise shaping page histories for fun or profit."},{"slug":"pseudonymity","title":"Pseudonymity","date":1467103909360,"synopsis":"Pseudonymity, a word derived from pseudonym, meaning 'false name', is a state of disguised identity."},{"slug":"pseudonymous","title":"Pseudonymous","date":1467102800803,"synopsis":"Pseudonymity, a word derived from pseudonym, meaning 'false name', is a state of disguised identity."},{"slug":"pubic-happening","title":"Pubic Happening","date":1470402872357,"synopsis":"A public [[Happening]] is an event that takes place in a public venue, theatre, café, Hackspace, conference or social venue. It is designed to be of value to a public audience that may observe or otherwise take part in the event."},{"slug":"public-key-cryptography","title":"Public-key cryptography","date":1467108099010,"synopsis":"Public-key cryptography, or asymmetric cryptography, is any cryptographic system that uses pairs of keys: public keys that may be disseminated widely paired with private keys which are known only to the owner. There are two functions that can be achieved: using a public key to authenticate that a message originated with a holder of the paired private key; or encrypting a message with a public key to ensure that only the holder of the paired private key can decrypt it - [https://en.wikipedia.org/wiki/Public_Key_Cryptography wikipedia]"},{"slug":"public-key-infrastructure","title":"Public key infrastructure","date":1511961860017,"synopsis":"A public key infrastructure ([[PKI]]) is a set of roles, policies, and procedures needed to create, manage, distribute, use, store, and revoke [[digital certificate]]s and manage public-key encryption - [https://en.wikipedia.org/wiki/Public_key_infrastructure wikipedia]"},{"slug":"public-side-of-wiki","title":"Public Side of Wiki","date":1512735853725,"synopsis":"Wiki is by nature public. Wiki, you might think is all about sharing freely, and loving the limelight, praising the openess. But this is not so. Wiki has a private side."},{"slug":"publish-button","title":"Publish Button","date":1491143861720,"synopsis":"We can use a [[Wiki Form]] and link it to a [[Transporter]] in order to create an effective [[Publish Button]] for wiki."},{"slug":"publish-wiki-content","title":"Publish Wiki Content","date":1512215943963,"synopsis":"Wiki currently has no [[Read Only Wiki]] mode. A wiki is always editable in some sense or other - even when you do no own the wiki. This makes it problematic to share the content created in wiki to other users."},{"slug":"publishing-wiki","title":"Publishing Wiki","date":1491139312306,"synopsis":"Wiki is great for writing. It is a tool to organise and interweave our thoughts.Let's make it beautiful to publish content in new ways."},{"slug":"qna-markup","title":"QnA Markup","date":1511362064676,"synopsis":"[http://www.qnamarkup.org QnA Markup website]"},{"slug":"question","title":"Question","date":1459943778365,"synopsis":"Here we list questions for this site:"},{"slug":"question-for-hangout","title":"Question for Hangout:","date":1458121395706,"synopsis":"For instance, how do I restrict the search above to pages that have reference links to the [[Question]] wiki page?"},{"slug":"question-with-screencast","title":"Question with screencast","date":1419018468477,"synopsis":"Here are the questions that I wouldn't have asked Ward if I was not wasting my life on dumb films. Screencast is faster than writing [http://screencast.com/t/BsDzxY7j jing]"},{"slug":"questioning-as-you-write","title":"Questioning As You Write","date":1458123587243,"synopsis":"A page with 1 items."},{"slug":"questions-add-paragraph-plugin","title":"Questions: Add Paragraph Plugin","date":1438436717275,"synopsis":"Here are some questions regarding the implementation:"},{"slug":"radical-discourse","title":"Radical Discourse","date":1433874897718,"synopsis":"What we might have given up in [[Rethinking ThreadMode]] and [[Rethinking DocumentMode]] we regain in Radical Discourse. The idea is that when dissertation pages are linked up, constellated, we create the larger, multi-voiced discourse."},{"slug":"react-and-bootstrap","title":"React and Bootstrap","date":1465991226370,"synopsis":"How well do these play together? Here we explore some online references."},{"slug":"reactjs","title":"ReactJS","date":1465991033490,"synopsis":"React (sometimes styled React.js or ReactJS) is an open-source JavaScript library providing a view for data rendered as HTML."},{"slug":"read-only-wiki","title":"Read Only Wiki","date":1491140008904,"synopsis":"Here we look at progress towards a version of wiki that is clean, and easy to read - a read-only wiki."},{"slug":"reading-mode-navigation","title":"Reading Mode Navigation","date":1464099645168,"synopsis":"in [[Reading Mode]] for [[Book Content]], we aim to keep interaction to a minimum."},{"slug":"recent-writing","title":"Recent Writing","date":1464591444799,"synopsis":"Here I list  the recent work of strangers that I am currently writing with:"},{"slug":"reconcile-speech-with-measured-reality","title":"Reconcile Speech with Measured Reality","date":1451655320377,"synopsis":"Speech is not writing.  It is at best an immediate expression of soul. At worst a fumbling attempt to impress. We say things we do not mean. And fail to say what we really care about."},{"slug":"redefining-flag-clicks","title":"Redefining Flag Clicks","date":1524061897437,"synopsis":"At present clicking on a page flag reloads the site, either displaying only the welcome-visitors page if the reader clicked on the welcome-visitors flag, or both the welcome-visitors page and the wiki-page whose flag was clicked on, should the reader click on a different page-flag in a lineup."},{"slug":"redirecting-welcome-visitors","title":"Redirecting Welcome Visitors","date":1497892919144,"synopsis":"Wiki has a number of [[Wiki Options]] that you can call from the command-line. We are able to redirect the [[Welcome Visitors]] page using the equivalent of the following:"},{"slug":"refactoring-tools","title":"Refactoring Tools","date":1523985642171,"synopsis":"This is the current domain of [[wiki-plugins]]. Without these plugins the reader cannot view the content appropriately, and the author cannot refactor this content when it is within wiki."},{"slug":"reference-link","title":"Reference Link","date":1465115933577,"synopsis":"A [[reference]] or reference link is a direct link to a specific resource on a specific site. It also has an editable field to describe the resource."},{"slug":"registration-workflows","title":"Registration Workflows","date":1509847991350,"synopsis":"Here we think through how one could host a wiki farm for themselves and friends without opening hosting for the world. [https://riot.im/app/#/room/#fedwiki:matrix.org/$15098118261302156xrASH:matrix.org riot]"},{"slug":"remotestoragejs","title":"remoteStorage.js","date":1434960114234,"synopsis":"remoteStorage.js is an open protocol for per-user storage using [[Webfinger]] + [[OAuth]] + [[CORS]] + [[REST]] - [https://github.com/remotestorage/remotestorage.js github.com]"},{"slug":"replace-me-plugin","title":"Replace Me Plugin","date":1438370981450,"synopsis":"A related plugin or future interface enhancement would be to allow double clicking of the paragraph to reveal an HTML form specified by the HTML added when the plugin was configured."},{"slug":"reporting-issues","title":"Reporting Issues","date":1492500594932,"synopsis":"We can flag an issue in Fedwiki site using an item appropriately marked up or copied from the [[Issue]] page."},{"slug":"rest-api","title":"REST API","date":1464603466648,"synopsis":"A REST API is an [[API]] that provides it's interface through [[REST]]. Here we list a number of services and projects that help you develop and maintain a robust [[REST API]]."},{"slug":"rest-authentication","title":"REST Authentication","date":1438365052580,"synopsis":"Here we outline some provisional notes on authenticating [[RESTful Web Service]]'s in Fedwiki."},{"slug":"rest-plugin","title":"REST Plugin","date":1471685365190,"synopsis":"The REST Plugin should expose the limited ability to access the page that the plugin sits on using standard REST HTTP calls for both read and write."},{"slug":"rest-plugin-configuration","title":"REST Plugin Configuration","date":1438370096942,"synopsis":"A site-owner is able to double-click and edit the text of the plugin - providing a URL to a [[RESTful]] Web Service, and optionally some data to POST."},{"slug":"restful","title":"RESTful","date":1435396173546,"synopsis":"A RESTful web service, is a [[Web Service]] that conforms to Representational State Transfer ([[REST]]) practices."},{"slug":"restful-fedwiki-server","title":"RESTful Fedwiki Server","date":1435495308479,"synopsis":"Here we make a start to document the creation of a minimal [[Fedwiki Server]] that provides a minimal but fully specified [[REST API]] for both existing clients and future mobile clients."},{"slug":"restful-security","title":"RESTful Security","date":1493381558247,"synopsis":"As RESTful Web Services work with HTTP URL Paths, it is very important to safeguard a RESTful Web Service in the same manner as a website is secured - [https://www.tutorialspoint.com/restful/restful_security.htm tutorialspoint.com]"},{"slug":"revealjs","title":"reveal.js","date":1459433443764,"synopsis":"A framework for easily creating beautiful presentations using HTML."},{"slug":"rewards-based-crowdfunding","title":"Rewards-based Crowdfunding","date":1466270498005,"synopsis":"Reward-based crowdfunding has been used for a wide range of purposes, including motion picture promotion ([http://www.indiatimes.com/bollywood/crowd-funding-an-emerging-trend-in-bollywood-15652.html indiatimes.com/]), [[free software]] development, inventions development, scientific research ([http://blog.scienceexchange.com/2012/05/crowdfunding-as-the-future-of-science-funding/ scienceexchange.com]) and civic projects ([http://www.academia.edu/3415172/Crowdfunding_and_Civic_Society_in_Europe_A_Profitable_Partnership academia.edu])."},{"slug":"robert-cailliau","title":"Robert Cailliau","date":1466676799236,"synopsis":"Robert Cailliau (born 26 January 1947) is a Belgian informatics engineer and computer scientist. Cailliau helped Tim Berners-Lee develop the World Wide Web and organized the first International World Wide Web Conference at CERN in 1994 - [https://en.wikipedia.org/wiki/Robert_Cailliau wikipedia]"},{"slug":"roster","title":"Roster","date":1423961325775,"synopsis":"The original thought was that people would find each other by browsing. This would form a neighborhood of convenience. (Imagine roaming the halls during a conference break.)"},{"slug":"roster-clubs","title":"Roster Clubs","date":1512349636579,"synopsis":"Read the roster from a google spreadsheet instead of from a roster in wiki. [http://fed.wiki.org/report.html report] [https://gist.github.com/WardCunningham/91e994bdb749a52ece7d gist]"},{"slug":"rosters","title":"Rosters","date":1435282720574,"synopsis":"A roster is any list of sites assembled for the purpose of sharing. We describe common mechanisms for assembling and managing rosters."},{"slug":"rss-feeds","title":"RSS Feeds","date":1467753914941,"synopsis":"RSS Feeds represent a good source of content for wiki - especially in cases where there is no API. Here we gather some information regarding useful feeds:"},{"slug":"safe-and-familiar-welcome","title":"Safe and Familiar Welcome","date":1512305634926,"synopsis":"We could provide an \"index.html\" style template in the server that would present a more familiar welcome page before easing visitors into the new world of federated wiki."},{"slug":"sandbox","title":"Sandbox","date":1448712698843,"synopsis":"[[Day Template]]"},{"slug":"scaling-svg-images","title":"Scaling SVG Images","date":1463812700155,"synopsis":"SVG images are not like raster images - they can scale to any size. this means the way scaling works is different."},{"slug":"script-writing","title":"Script Writing","date":1455579760477,"synopsis":"Here we look at using Fedwiki for script writing. We are looking to create an open source platform for script writing and film production based around [[FedWiki]]."},{"slug":"search-box-enhancement","title":"Search Box Enhancement","date":1503059470922,"synopsis":"Here we propose a simple enhancement to how the current search-box works."},{"slug":"search-engines","title":"Search Engines","date":1450361056043,"synopsis":"This year, for the first time, we have enough activity in the federation to make scraping a sound search strategy."},{"slug":"search-findings","title":"Search Findings","date":1449085073384,"synopsis":"Search records new activity found with each scrape of the visible federation. In addition to the web application, these records are available as downloadable files, a trancludable roster and a search api."},{"slug":"search-index","title":"Search Index","date":1457359295890,"synopsis":"We consider how we might index and query multiple sites within a distributed search database routinely hosted in federated wiki page server/editors."},{"slug":"search-index-downloads","title":"Search Index Downloads","date":1448225614169,"synopsis":"We make available the search index as downloadable files in several formats including json objects designed for network graphing."},{"slug":"search-research","title":"Search Research","date":1460207457719,"synopsis":"Here we take a look at options for searching the federation and individual Fedwiki sites."},{"slug":"search-thoughts","title":"Search Thoughts","date":1449571447797,"synopsis":"This page is some initial thoughts and experiments with searching the Federated Wiki sites."},{"slug":"search-transport","title":"Search Transport","date":1512313659757,"synopsis":"The [[Search Transport]] searches for useful things in and related to the federation. This is [[work in progress]]."},{"slug":"searching-is-not-reading","title":"Searching is not Reading","date":1449571496527,"synopsis":"A concept at the heart of [[Hypertext]] is [[Browsing]] - that is a concept of readability, not simply accessing information. It is interesting to note how far back to the origins of [[Hypertext]] theory this idea goes."},{"slug":"secret-email-api","title":"Secret Email API","date":1441928572018,"synopsis":"Secret email posting is well known in the world of blogging. The user defines an email address, usually unguessable, that receives new posts and publishes them according a parsing scheme. Usually the title of the email becomes the title of the page, and the body as the body of the post."},{"slug":"secure-automata","title":"Secure Automata","date":1510925337418,"synopsis":"Language-theoretic security (LangSec) is a design and programming philosophy that"},{"slug":"secure-scuttlebutt","title":"Secure Scuttlebutt","date":1509847757545,"synopsis":"Scuttlebutt is a decent(ralised) secure gossip platform. Historically, sea-slang for gossip - a scuttlebutt is basically a watercooler on a ship."},{"slug":"security","title":"Security","date":1438329016381,"synopsis":"A site can be owned, or not. If it is owned we ask two simple questions \"Who Are You?\" and \"Are You The Site Owner?\". The separation of these two questions is important, as we will see."},{"slug":"security-token-service","title":"Security token service","date":1510659287681,"synopsis":"Security token service (STS) is a cross-platform open standard core component of the OASIS group's WS-Trust web services single sign-on infrastructure framework specification.cf. Within that claims-based identity framework, a secure token service is responsible for issuing, validating, renewing and cancelling security tokens. The tokens issued by security token services can then be used to identify the holder of the token to services that adhere to the WS-Trust standard. Security token service provides the same functionality as OpenID, but unlike OpenID "},{"slug":"selective-key-injection","title":"Selective Key Injection","date":1510582980602,"synopsis":"We consider how a transporter could provide services to site owners within one farm but not others. We assume an administrator with privileged access to both transporter and farm and suitable protection from man-in-the-middle attacks at all levels."},{"slug":"self-reference-and-negation","title":"Self-reference and Negation","date":1475587413602,"synopsis":"τ-chain (pronounced tau-chain) is a decentralized peer-to-peer network having three unified faces: Rules, Proofs, and Computer Programs, allowing a generalization of virtually any centralized or decentralized P2P network, together with many new abilities, as we present on this note - [http://tauchain.org/tauchain.pdf pdf]"},{"slug":"sensitive-information-in-wiki","title":"Sensitive Information in Wiki","date":1511961513132,"synopsis":"We can use browser extensions like [[LastPass]] to associate encrypted personal information with wiki using an [[HTML Form in Wiki]]."},{"slug":"serverless-microservices","title":"Serverless Microservices","date":1449070145677,"synopsis":"Using microservices on AWS. Is this to wiki's advantage? Can we exploit it without becoming it? See [[Computational Habitat]]"},{"slug":"serving-static-content","title":"Serving Static Content","date":1435501113773,"synopsis":"Batch scripts can convert static content into federated wiki compatible json and serve it with apache."},{"slug":"set-up-your-ssh-keys","title":"Set up Your SSH Keys","date":1435672367610,"synopsis":"The next step in securing your server is to set up public key authentication for your new user. Setting this up will increase the security of your server by requiring a private SSH key to log in."},{"slug":"shared-data-plugin","title":"Shared Data Plugin","date":1438597685060,"synopsis":"Some initial thoughts on how can we introduce a simple shared data model across Fedwiki installations:"},{"slug":"shared-thinking-tool","title":"Shared Thinking Tool","date":1491139881468,"synopsis":"Wiki's strength is as a tool for shared thinking in which the focus is on the development of your own personal experience and understanding, but to do this with the support and collaboration of other minds."},{"slug":"shared-vision","title":"Shared Vision","date":1490565556301,"synopsis":"[[Distribution]] and [[Federation]] are the key elements of a [[flat society]]."},{"slug":"shared-wikis","title":"Shared Wikis","date":1449435399197,"synopsis":"Important point of the Federated Wiki is that people don't have to agree. They can fork each other's pages to their own wiki, and if they disagree on something they can change them. If they do agree they can reference each other. If they just agree with one paragraph they can take this paragraph onto their page, without any additional hassle of referencing the origin, because it is automatically referenced."},{"slug":"sharing-data","title":"Sharing Data","date":1438334461084,"synopsis":"Sharing is not the sole preserve of a web site. There are many things you may want to share with your neighbours that you do not want to publish on a public web site."},{"slug":"shell-power","title":"Shell Power","date":1467107547507,"synopsis":"Traditional web applications are sandboxed, and unable to leverage the vast array of fast low level code available on the command line. We can securely access this and make ti available in an easy to understand and open way to the author."},{"slug":"shell-privilege","title":"Shell Privilege","date":1464159451264,"synopsis":"How can I share the power I have over my digital work? I test this by considering what controls I must apply to make the Shell plugin safe for distribution."},{"slug":"shift-clicking-in-fedwiki","title":"Shift Clicking in Fedwiki","date":1451151331608,"synopsis":"A suggestion regarding shift-clicking external links in Fedwiki to call an appropriate transporter for the external site, and creat a ghost page."},{"slug":"simpledb","title":"SimpleDB","date":1438597488105,"synopsis":"[[SimpleDB]] is a [[NoSQL]] service provided by Amazon which has an interesting free tier model that could prove of use to the federation - [https://en.wikipedia.org/wiki/Amazon_SimpleDB wikipedia]"},{"slug":"single-page-apps-and-wiki","title":"Single Page Apps And Wiki","date":1466891166639,"synopsis":"The idea here is to treat wiki as the glue between an ecosystem of loosely coupled single page apps. [[Loose coupling]] enables us to combine in more robust ways code and functionality from multiple sources. It also makes it far easier, to maintain this code base in a decentralised manner."},{"slug":"single-sign-on","title":"Single sign-on","date":1510657585921,"synopsis":"Single sign-on ([[SSO]]) is a property of access control of multiple related, yet independent, software systems With this property, a user logs in with a single ID and password to gain access to a connected system or systems without using different usernames or passwords, or in some configurations seamlessly sign on at each system. - [https://en.wikipedia.org/wiki/Single_sign-on wikipedia]"},{"slug":"site-network-diagram","title":"Site Network Diagram","date":1444489716649,"synopsis":"One large diagram shows all visible sites with arcs connect sites that share some reference to each other. Find a link to the full diagram in the caption below."},{"slug":"site-of-sites-map","title":"Site of Sites Map","date":1434960252780,"synopsis":"Mission: to create a set of navigable maps to make it much clearer how all the sites fit together and who is working on what."},{"slug":"sitemap","title":"Sitemap","date":1452601508209,"synopsis":"The [[Sitemap]] protocol format consists of XML tags. All data values in a Sitemap must be entity-escaped. The file itself must be UTF-8 encoded - [http://www.sitemaps.org/protocol.html sitemaps.org]"},{"slug":"sitemap-scrape-statistics","title":"Sitemap Scrape Statistics","date":1448403887749,"synopsis":"We collect various counts while scraping sitemaps and report them as a text file. Here we plot the most recent counts available."},{"slug":"sitepage-metadata","title":"Site/Page Metadata","date":1438328935470,"synopsis":"Site metadata can usefully be added to the status folder as a plain text file."},{"slug":"sites","title":"Sites","date":1458114903133,"synopsis":"Pages with titles that end in \"Sites\" are usually a list of references to Fedwiki Sites that can be used to create [[Rosters]]."},{"slug":"small-again-wiki","title":"Small Again Wiki","date":1460326396138,"synopsis":"We describe a server-side read-only federated wiki implementation written in ruby serving html and json but no javascript. The code helps us understand how this federation works. [https://github.com/WardCunningham/small-again-wiki/blob/ffe3c3ca2147b34da70ca401bc6b5456e0999ed5/server.rb github]"},{"slug":"smartphone-use","title":"Smartphone Use","date":1425225721205,"synopsis":"When comparing overall screen time however, the smartphone still has some catching up to do to match the allure of longer established technologies like television."},{"slug":"snapshots","title":"Snapshots","date":1465114205617,"synopsis":"Taking a snapshot is the process of embedding content from the existing internet (the [[Impermanent Web]]) into [[The Federation]]."},{"slug":"social-bookmarking","title":"Social bookmarking","date":1472292404759,"synopsis":"Here we look at how we can do social bookmarking in wiki."},{"slug":"soft-forking-groups","title":"Soft-forking Groups","date":1417971495838,"synopsis":"In Shirky's 2003 post \"A Group Is Its [[Own Worst Enemy]]\", he intuits that one solution to having social software that scales is \"soft-forking groups\": groups with fuzzy edges, centered around individual relations."},{"slug":"software-development-path","title":"Software Development Path","date":1453227035445,"synopsis":"We look to build publications that follow a non-classical architecture. The publications are closer to the original multimedia and CDROM applications than they are web sites. We look to develop an integration of multimedia technology and P2P communication through the new decentralised technologies that are now emerging."},{"slug":"solve-for-initial-conditions","title":"Solve for Initial Conditions","date":1477507413773,"synopsis":"The g9 library will adjust algorithmic drawings such that any element can be moved. When someone interacts with the graphics, for example by trying to drag an element to a new position, g9 optimizes over the space of possible values for your data to find a set of values that comes closest to creating the change. [http://omrelli.ug/g9/gallery/ post]"},{"slug":"soundcloud-plugin","title":"SoundCloud Plugin","date":1438368621082,"synopsis":"The SoundCloud plugin enables an author to add a SoundCloud widget to their site."},{"slug":"splash-image-comments","title":"Splash Image Comments","date":1497898012966,"synopsis":"Some times you want to include an image reference as a variable. A neat way to do this is to add a specially formatted [[HTML Comment]] to the image tag in a wiki page HTML item."},{"slug":"splash-markup","title":"Splash Markup","date":1497876084392,"synopsis":"Here we explore the markup we wish to use for [[Splash Page Creation]]."},{"slug":"splash-page-creation","title":"Splash Page Creation","date":1511547777003,"synopsis":"We can create a single-page web site from wiki (a [[Splash Page]]) by combining an [[HTML Wiki Template]] with structured information from wiki. Here we explore the basics of how we might do this."},{"slug":"splash-reference-links","title":"Splash Reference Links","date":1497897239082,"synopsis":"and the first image determines the URL for:"},{"slug":"splash-template-variables","title":"Splash Template Variables","date":1497898760295,"synopsis":"Sometimes you need more control that a whole section of HTML. You need to be able to replace an element of javascript or HTML - for this you need to create a [[Splash Template Variables]]."},{"slug":"sso","title":"SSO","date":1510657614258,"synopsis":"[[Single sign-on]] (SSO) is a property of access control of multiple related, yet independent, software systems With this property, a user logs in with a single ID and password to gain access to a connected system or systems without using different usernames or passwords, or in some configurations seamlessly sign on at each system. - [https://en.wikipedia.org/wiki/Single_sign-on wikipedia]"},{"slug":"star-trek","title":"Star Trek","date":1459340436341,"synopsis":"Star Trek is an American science fiction entertainment franchise created by Gene Roddenberry and owned by CBS (TV series) and Paramount Pictures (Film Rights) - [https://en.wikipedia.org/wiki/Star_trek wikipedia]"},{"slug":"star-trek-cultural-impact","title":"Star Trek: cultural impact","date":1459340361967,"synopsis":"The ''Star Trek'' media franchise is a multibillion-dollar industry, owned by CBS. Gene Roddenberry sold ''Star Trek'' to [[NBC]] as a classic adventure drama; he pitched the show as \"''Wagon Train'' to the Stars\" and as [[Horatio Hornblower]]  - [https://en.wikipedia.org/wiki/Star_trek#Cultural_impact wikipedia]"},{"slug":"strange-authors","title":"Strange Authors","date":1466753516649,"synopsis":"[[Strange Authors]] are people that I know and respect from their writing - see [[Writing With Strangers]]"},{"slug":"strange-changes","title":"Strange Changes","date":1466754159018,"synopsis":"Here we follow changes to the writings of [[strange authors]] as we find them in [[the federation]]."},{"slug":"strangers","title":"Strangers","date":1466753410306,"synopsis":"A **stranger** is a term we use for someone we write with. We may not know this person, they may have vies that are different and indeed the opposite of our own, we may not even agree (in an active sense) to be writing with them. But if they are in our [[neighbourhood]] and they write on a page with the same title as my own - then i will notice them."},{"slug":"strangler-pattern","title":"Strangler Pattern","date":1492087353327,"synopsis":"An alternative route is to gradually create a new system around the edges of the old, letting it grow slowly over several years until the old system is strangled. Doing this sounds hard, but increasingly I think it's one of those things that isn't tried enough. In particular I've noticed a couple of basic strategies that work well. The fundamental strategy is EventInterception, which can be used to gradually move functionality to the strangler and to enable AssetCapture - [https://www.martinfowler.com/bliki/StranglerApplication.html martinfowler.com]"},{"slug":"style","title":"Style","date":1448878921755,"synopsis":"Style is a manner of doing or presenting things. In this page I will list some styles of representing the information that I like. In this content digital information."},{"slug":"suggestion","title":"Suggestion","date":1512062955497,"synopsis":"Here we list suggestions and recommendations for his site:"},{"slug":"surveillance-capitalism","title":"Surveillance Capitalism","date":1457973107717,"synopsis":"Governmental control is nothing compared to what Google is up to. The company is creating a wholly new genus of capitalism, a systemic coherent new logic of accumulation we should call surveillance capitalism. Is there nothing we can do? Shoshana Zuboff. [http://www.faz.net/aktuell/feuilleton/debatten/the-digital-debate/shoshana-zuboff-secrets-of-surveillance-capitalism-14103616.html?printPagedArticle=true post]"},{"slug":"svg","title":"SVG","date":1496916761324,"synopsis":"Scalable Vector Graphics (SVG) is an XML-based vector image format for two-dimensional graphics with support for interactivity and animation - [https://en.wikipedia.org/wiki/Scalable_Vector_Graphics#Functionality wikipedia]"},{"slug":"svg-drop-events","title":"SVG Drop Events","date":1512567485882,"synopsis":"Below are a collection of links imported from [[OneTab]]. You can view these links here - [https://www.one-tab.com/page/3IKa8zDnRfCAP7nfZDltzg one-tab.com]:"},{"slug":"svg-image-map","title":"SVG Image Map","date":1496917828026,"synopsis":"We can now embed interactive [[svg]]s in wiki."},{"slug":"svg-in-img-tag","title":"SVG in IMG Tag","date":1461490174480,"synopsis":"We've made progress manipulating svg with jquery, particularly getting it to parse svg from javascript strings."},{"slug":"svg-links","title":"SVG Links","date":1510410090542,"synopsis":"We can also drag and drop svg files onto the image tag."},{"slug":"svg-plugin","title":"SVG Plugin","date":1461491796417,"synopsis":"A page with 1 items."},{"slug":"syntactic-sugar","title":"Syntactic sugar","date":1523956712617,"synopsis":"In computer science, syntactic sugar is syntax within a programming language that is designed to make things easier to read or to express. It makes the language \"sweeter\" for human use: things can be expressed more clearly, more concisely, or in an alternative style that some may prefer. - [https://en.wikipedia.org/wiki/Syntactic_sugar wikipedia]"},{"slug":"systemic-debt","title":"Systemic Debt","date":1457017424937,"synopsis":"Machine Learning: The High Interest Credit Card of Technical Debt. [http://research.google.com/pubs/pub43146.html ref] [http://static.googleusercontent.com/media/research.google.com/en//pubs/archive/43146.pdf pdf]"},{"slug":"talk-to-wiki","title":"Talk To Wiki","date":1464603572718,"synopsis":"Here we explore how external applications can talk to, that is send messages, and otherwise interact or control wiki."},{"slug":"tangled-plugin","title":"Tangled Plugin","date":1448741025227,"synopsis":"The tangled-plugin is a plugin that help weave the [[tangled web]]. It is an authoring tool for [[Federation REST Services]]."},{"slug":"tangled-web","title":"Tangled Web","date":1448740971233,"synopsis":"The tangled-web is the combination of several ideas into a single unified way of authoring which includes code and annotation (text, video, audio etc) in a single environment."},{"slug":"task","title":"Task","date":1459943277259,"synopsis":"Here I list tasks and my personal To Do's:"},{"slug":"tau-chain","title":"Tau Chain","date":1475588036035,"synopsis":"τ-chain (pronounced tau-chain) is a decentralized peer-to-peer network having three unified faces: Rules, Proofs, and Computer Programs, allowing a generalization of virtually any centralized or decentralized P2P network, together with many new abilities, as we present on this note - [http://tauchain.org/tauchain.pdf pdf]"},{"slug":"ted-nelson","title":"Ted Nelson","date":1457716312495,"synopsis":"Theodor Holm \"Ted\" Nelson (born June 17, 1937) is an American pioneer of information technology, philosopher, and sociologist. He coined the terms hypertext and hypermedia in 1963 and published them in 1965. Nelson coined the terms transclusion, virtuality, and intertwingularity (in Literary Machines}  - [https://en.wikipedia.org/wiki/Ted_Nelson wikipedia]"},{"slug":"test-wikpedia-image-import","title":"Test Wikpedia Image Import","date":1454085911991,"synopsis":"Here is a selection of images from Wikipedia ready to import."},{"slug":"testing-map-enhancements","title":"Testing Map Enhancements","date":1467051490086,"synopsis":"We're working on a better markup and some interesting item to item communication."},{"slug":"testing-slide-plugin","title":"Testing Slide Plugin","date":1512640777816,"synopsis":"This is our first step into presentation software in wiki."},{"slug":"the-block-server-is-not-a-server","title":"The Block Server is not a server","date":1438375545344,"synopsis":"This is a brief description of the Block Server, its functions, what it is and what it isn't."},{"slug":"the-cathedral-and-the-bazaar","title":"The Cathedral and the Bazaar","date":1523956885650,"synopsis":"The Cathedral and the Bazaar: Musings on Linux and Open Source by an Accidental Revolutionary is an essay, and later a book, by Eric S. Raymond on software engineering methods, based on his observations of the Linux kernel development process and his experiences managing an open source project, fetchmail - [https://en.wikipedia.org/wiki/The_Cathedral_and_the_Bazaar wikipedia]"},{"slug":"the-eve-of-abstraction","title":"The Eve of Abstraction","date":1475587792637,"synopsis":"How might programming language design break free from its long history of shuffling syntax around disturbingly similar semantics? Here are two folks reporting the related steps they have made on their escape. [http://early.witheve.com/ site]"},{"slug":"the-federation","title":"The Federation","date":1465197141849,"synopsis":"Here we describe the The Federation. We should use this term wisely. It describes quite clearly the social aspects of this project, while also pointing gently towards [[Star Trek]] and the future of the [[Decentralised Web]]."},{"slug":"the-hypertext-garden","title":"The Hypertext Garden","date":1466754634210,"synopsis":"The original vision of hypertext was textual and timeless. When [[Vannevar Bush]] and [[Ted Nelson]] imagined hypertext, they imagined a conversation between documents, data, and other media, not individual banter. Importantly, additions to the conversation were not conceived of as replies, but as *extensions* of a large static but continuously evolving network of knowledge, one that allowed many different paths."},{"slug":"the-permanent-federation","title":"The Permanent Federation","date":1466755790382,"synopsis":"Thoughts on the future architecture of a permanent internet archive, and how we can start in small incremental steps."},{"slug":"the-power-of-drag-and-drop","title":"The Power Of Drag And Drop","date":1451907161344,"synopsis":"[[Drag-and-Drop]] is familiar and natural to most users. However it surprises most of us the first time we use Fedwiki, as we are asked to use it in unexpected ways."},{"slug":"the-witcher-3-wild-hunt","title":"The Witcher 3: Wild Hunt","date":1472989191613,"synopsis":"The Witcher 3: Wild Hunt is an open world action role-playing video game developed by CD Projekt RED. Announced in February 2013, it was released worldwide for Microsoft Windows, PlayStation 4, and Xbox One on 19 May 2015. The game is the third in the series, preceded by The Witcher and The Witcher 2: Assassins of Kings, which are based on the series of fantasy novels by Polish author Andrzej Sapkowski - [https://en.wikipedia.org/wiki/The_Witcher_3:_Wild_Hunt wikipedia]"},{"slug":"things-we-dont-want-to-lose","title":"Things we don't want to lose","date":1437724325840,"synopsis":"There are some fundamental properties of Federated Wiki. Some of these are built in, as part of the software, others are more of a convention."},{"slug":"thinking-of-presentations","title":"Thinking of Presentations","date":1459699663581,"synopsis":"What plugins would we need to make and perform presentations with federated wiki?"},{"slug":"this-wiki-is-too-long","title":"This Wiki Is Too Long","date":1464607417472,"synopsis":"We write our ideas in wiki as a way to explore the topics. Invoking [[Benjamin Franklin]]: \"I have already made this paper too long, for which I must crave pardon, not having now time to make it shorter.\""},{"slug":"thomas-more","title":"Thomas More","date":1464595870020,"synopsis":"On 6 July 1535 [[Thomas More]] was executed for treason. In 1516 (19 years earlier) he published Utopia. These acts were not unrelated."},{"slug":"three-layer-storage","title":"Three Layer Storage","date":1428870650559,"synopsis":"I have improved some code paths in pageHandler but there are many opportunities for simplification remaining. I have worked slowly here because many cases have order sensitivities due to the compounding of function."},{"slug":"tim-berners-lee","title":"Tim Berners-Lee","date":1466676782208,"synopsis":"Sir Timothy John Berners-Lee OM KBE FRS FREng FRSA FBCS (born 8 June 1955), also known as TimBL, is an English computer scientist, best known as the inventor of the World Wide Web. He made a proposal for an information management system in March 1989, and he implemented the first successful communication between a Hypertext Transfer Protocol (HTTP) client and server via the Internet sometime around mid-November of that same year - [https://en.wikipedia.org/wiki/Tim_Berners_Lee wikipedia]"},{"slug":"time-account","title":"Time Account","date":1429982014940,"synopsis":"A time-account is a personal ledger which tracks time spend and time received by a member of the federation."},{"slug":"time-zone-problems","title":"Time Zone Problems","date":1518344803109,"synopsis":"Time seems really straightforward and turns out not to be."},{"slug":"titan-graph-database","title":"Titan Graph Database","date":1472669303295,"synopsis":"Titan is a scalable [[graph database]] optimized for storing and querying graphs containing hundreds of billions of vertices and edges distributed across a multi-machine cluster. Titan is a transactional database that can support thousands of concurrent users executing complex graph traversals in real time - [http://titan.thinkaurelius.com/ thinkaurelius.com]"},{"slug":"titles--variables","title":"Titles = Variables","date":1497897714621,"synopsis":"The trick here is that a wiki page section - headed by a markup-styled \"title\" provides the content for a variable with the same \"name\" as the title."},{"slug":"tools","title":"Tools","date":1523958992156,"synopsis":"Tools are things we use as authors. [[Authoring]] is the act of using tools to make something. When the thing is made we can discard the tool."},{"slug":"tools-of-change","title":"Tools of Change","date":1491832773093,"synopsis":"Henrik Kniberg describes complex and confusing causal relationships with disarmingly simple drawings. Now he joins other graphic innovators in explaining climate change and our own obligations to address it."},{"slug":"top-maintenance-priorities","title":"Top Maintenance Priorities","date":1512313144392,"synopsis":"We expect the various features of wiki to work in support of common workflows. We've endured inconvenience in cases where these features are incomplete or unreliable."},{"slug":"top-sites-scraped","title":"Top Sites Scraped","date":1428525456536,"synopsis":"We've scraped 500 sites accessible from one happening #2 site. From these we have tallied counts of pages, items, actions and other pages cited."},{"slug":"topic","title":"Topic","date":1465986259238,"synopsis":"Here we list topics relevant to this site:"},{"slug":"topic-maps","title":"Topic Maps","date":1470589163793,"synopsis":"Topic Maps is a standard for the representation and interchange of knowledge, with an emphasis on the findability of information. Topic maps were originally developed in the late 1990s as a way to represent back-of-the-book index structures so that multiple indexes from different sources could be merged. However, the developers quickly realized that with a little additional generalization, they could create a meta-model with potentially far wider application. The ISO standard is formally known as ISO/IEC 13250:2003 - [https://en.wikipedia.org/wiki/Topic_"},{"slug":"topical-engines","title":"Topical Engines","date":1460207594469,"synopsis":"Topical search engine is an engine that focuses on a particular topic. It covers a part of the whole Web rather than a particular website - this is possible because Google Custom Search allows you to include multiple websites in the same engine. This article discusses some of the interesting techniques for building and maintaining such engines - [https://developers.google.com/custom-search/docs/topical developers.google.com]"},{"slug":"touch-support","title":"Touch Support","date":1448892740419,"synopsis":"Browsing with touch is awkward at best. Editing is nearly impossible. We've adopted some compatibility plugin that trades one set of confusions for another. We have to take touch events into our own hands."},{"slug":"transcluded-hypertext","title":"Transcluded Hypertext","date":1457715900091,"synopsis":"In computer science, transclusion is the inclusion of part or all of an electronic document into one or more other documents by hypertext reference - [https://en.wikipedia.org/wiki/Transclusion wikipedia]"},{"slug":"transclusion","title":"Transclusion","date":1523983936192,"synopsis":"In computer science, transclusion is the inclusion of part or all of an electronic document into one or more other documents by hypertext reference. Transclusion is usually performed when the referencing document is displayed, and is normally automatic and transparent to the end user. The result of transclusion is a single integrated document made of parts assembled on the fly from separate sources, possibly stored on different computers in disparate places. - [https://en.wikipedia.org/wiki/Transclusion wikipedia]"},{"slug":"transient-identity","title":"Transient Identity","date":1438183575495,"synopsis":"I'm trying to imagine the use case @opn is exploring. I think it works like this:"},{"slug":"transmediale","title":"Transmediale","date":1452424752151,"synopsis":"Annual film festival held in Berlin, Germany. The 29th edition of transmediale takes place from 2 to 7 February 2016 at House of World Cultures in Berlin."},{"slug":"transport-again","title":"Transport Again","date":1512114913366,"synopsis":"The current [[Transport Again]] functionality is broken. The aim of this function was to provide a mechanism with which wiki could interact with a [[transporter]] to refresh content or fetch further services that the transporter may provide."},{"slug":"transport-forms","title":"Transport Forms","date":1461532395649,"synopsis":"We've borrowed most of the transporter logic and added it to one special case of the Html plugin: submitting forms."},{"slug":"transport-infrastructure","title":"Transport Infrastructure","date":1451526015557,"synopsis":"We imagine how a component like we see in Transporters could become a casual ecosystem of open computational behavior."},{"slug":"transport-plugin","title":"Transport Plugin","date":1450971469026,"synopsis":"This plugin provides interactive access to remote services that can read content you drop and create from it useful pages that appear ready to be saved or used at one's discretion. [https://github.com/WardCunningham/wiki-plugin-transport github]"},{"slug":"transport-proxy-json","title":"Transport-proxy JSON","date":1524059466289,"synopsis":"Here we can define the json-schema for mapping dropped urls to microservice api endpoint...."},{"slug":"transporter","title":"Transporter","date":1501658773948,"synopsis":"A [[Transporter]] is a web service that provides services to the Federation. Using the [[Transporter Plugin]] you can call these services simply by dragging and drooping a URL from an external site, or another [[Fedwiki]] site, in order to import of perform some other manipulation of the sites content."},{"slug":"transporter-links","title":"Transporter Links","date":1457714969270,"synopsis":"This new proposal aims to facilitate the integration of [[Transporter]] functionality into the core [[Fedwiki]] text markup by introducing a new concept: extensible tranporter links."},{"slug":"transporter-tools","title":"Transporter Tools","date":1460907708558,"synopsis":"There should be a \"Tools\" link at the bottom of every page replacing or possibly in addition to the current [[search]] tool link provided."},{"slug":"transporting-hypertext","title":"Transporting Hypertext","date":1461532371950,"synopsis":"We ask, how might we merge the interface features of the Transport plugin with persistent foreign servers that could support continued on-demand transclusions of large hypertexts."},{"slug":"travelers-and-nodes","title":"Travelers and Nodes","date":1518363192388,"synopsis":"@ is a programming paradigm in which code is executed as a [[Traveler]] traverse a graph of [[Computational nodes]]."},{"slug":"trivial-graph-format","title":"Trivial Graph Format","date":1464608109243,"synopsis":"Trivial Graph Format (TGF) is a simple text-based file format for describing graphs - [https://en.wikipedia.org/wiki/Trivial_Graph_Format wikipedia]"},{"slug":"trust-in-plugins","title":"Trust in Plugins","date":1440258696135,"synopsis":"We need to trust our plugins. Search is one such example, whether is be baked into a server farm, or made available through a plugin."},{"slug":"truth","title":"Truth","date":1439114093310,"synopsis":"He we collect the truth, or some aspects of it:"},{"slug":"truth-in-code","title":"Truth in Code","date":1439107473397,"synopsis":"Truth is an important concept in code and logic. It's history of implementation however is unreasonably amusing. So much so that I think these \"facts\" need checking."},{"slug":"tufte-css","title":"Tufte CSS","date":1440518630301,"synopsis":"A beautiful CSS template for text based on the work of Edward Tufte. [http://www.daveliepmann.com/tufte-css/ web] [https://github.com/daveliepmann/tufte-css github]"},{"slug":"turing-completeness","title":"Turing completeness","date":1523956784884,"synopsis":"In computability theory, a system of data-manipulation rules is said to be Turing complete or computationally universal if it can be used to simulate any Turing machine. The concept is named after English mathematician and computer scientist Alan Turing. A classic example is lambda calculus. - [https://en.wikipedia.org/wiki/Turing_completeness wikipedia]"},{"slug":"two-sides-of-wiki","title":"Two sides of wiki","date":1522758636454,"synopsis":"I was provoked into writing this following  discussion with [[Dil Green]] about writing in [[Fedwiki]]. His complaint I thought was a bit unfair, but as with any such encounter, it is important to dig deep and not react with easy defensiveness."},{"slug":"types-of-authentication","title":"Types of authentication","date":1510658010449,"synopsis":"The most frequent types of authentication available in use for authenticating online users differ in the level of security provided by combining factors from the one or more of the three categories of factors for authentication:"},{"slug":"ubiquitous-language","title":"Ubiquitous Language","synopsis":"To create a supple, knowledge-rich design calls for a versatile, shared team language, and a lively experimentation with language that seldom happens on software projects."},{"slug":"ugh-css","title":"Ugh CSS","date":1475243951443,"synopsis":"Cascading style sheets promised to separate style from content based on a limited and dated understanding of both. Here we collect the near draconian measures modern development employs to live with it since no alternative exists."},{"slug":"uniform-resource-identifier","title":"Uniform Resource Identifier","date":1467101919023,"synopsis":"Such identification enables interaction with representations of the resource over a network, typically the World Wide Web, using specific protocols."},{"slug":"united-federation-of-planets","title":"United Federation of Planets","date":1459347152428,"synopsis":"The United Federation of Planets, abbreviated as UFP and usually referred to as \"the Federation\", is a fictional interstellar federal republic composed of planetary sovereignties depicted in the fictional [[Star Trek]] science fiction franchise."},{"slug":"universal-drag-and-drop","title":"Universal Drag-and-Drop","date":1524059586288,"synopsis":"Universal drag-and-drop describes a proposed change to wiki-client behaviour enabling urls to be dropped anywhere on a wiki web-page, and not just the transporter concerned."},{"slug":"until-now","title":"Until Now","date":1464545913438,"synopsis":"What is \"until now\"? It cannot be now, as i wrote it a while back. And it changes."},{"slug":"upcoming-podcasts","title":"Upcoming Podcasts","date":1467115304692,"synopsis":"On this page we look to organise a series of live events in which we record short podcasts about [[Federated Wiki]] and the [[Future Of The Decentralised Web]]."},{"slug":"uri","title":"URI","date":1467100613352,"synopsis":"In information technology, a Uniform Resource Identifier (URI) is a string of characters used to identify a resource - [https://en.wikipedia.org/wiki/Uniform_resource_identifier wikipedia]"},{"slug":"uri-references","title":"URI references","date":1467101647584,"synopsis":"A URI reference may take the form of a full URI, the scheme-specific portion of a full URI, a trailing component of a full URI, or the empty string - [https://en.wikipedia.org/wiki/Uniform_resource_identifier#URI_references wikipedia]"},{"slug":"url","title":"URL","date":1467100798598,"synopsis":"A Uniform Resource Locator (URL), commonly informally termed a web address (which term is not defined identically) is a reference to a web resource that specifies its location on a computer network and a mechanism for retrieving it - [https://en.wikipedia.org/wiki/Url wikipedia]"},{"slug":"urls-not-idempotent","title":"URLs not Idempotent","date":1507294246336,"synopsis":"Here we look at the pros and cons of making links in wiki [[idempotent]] - that is consistent."},{"slug":"urn","title":"URN","date":1467100884792,"synopsis":"In computing, a Uniform Resource Name (URN) is the historical name for a Uniform Resource Identifier (URI) that uses the urn scheme. A URI is a string of characters used to identify a name of a web resource. Such identification enables interaction with representations of the web resource over a network, typically the World Wide Web, using specific protocols - [https://en.wikipedia.org/wiki/Urn wikipedia]"},{"slug":"using-microdata-fedwiki","title":"Using Microdata Fedwiki","date":1458106286750,"synopsis":"I've been experimenting a little with the use of [[Microdata In Fedwiki]]. This page is about my thoughts and progress in this area."},{"slug":"using-the-data-plugin","title":"Using the Data Plugin","date":1458118883419,"synopsis":"Here we test using some data stored with the [[About Data Plugin]]."},{"slug":"using-webgl","title":"Using WebGL","date":1510697094949,"synopsis":"Below are a collection of links imported from [[OneTab]]. You can view these links here - [https://www.one-tab.com/page/Y4apmXAHT-GSU9TO_Wg5UQ one-tab.com]:"},{"slug":"vannevar-bush","title":"Vannevar Bush","date":1466754804863,"synopsis":"Vannevar Bush (March 11, 1890 – June 28, 1974) was an American engineer, inventor and science administrator, who during World War II headed the U.S. Office of Scientific Research and Development, through which almost all wartime military R&D was carried out, including initiation and early administration of the Manhattan Project - [https://en.wikipedia.org/wiki/Vannevar_Bush wikipedia]"},{"slug":"visual-clutter","title":"Visual Clutter","date":1523957486076,"synopsis":"Wiki is strong as a reading environment when it is free of visual clutter. The Bazaar of ideas is beautiful in the mind, but there is another beauty for the eye in the Cathedral."},{"slug":"visualising-the-federation","title":"Visualising the Federation","date":1464605513983,"synopsis":"Here we look at how we might visualise the [[Federation]], and explore using [[Cytoscape]] to achieve a scaleable ability to visualise the network of links and in particular [[Network of Forks]] relevant to a particular writing context."},{"slug":"visualization-is-coming-of-age","title":"Visualization Is Coming Of Age","date":1471694952036,"synopsis":"It has not really been possible until very recently to represent large interactive graphs visually, and especially not on the web."},{"slug":"visualizing-high-order-graphs","title":"Visualizing High-Order Graphs","date":1450431920689,"synopsis":"How might we draw meaningful diagrams of wiki that don't turn quickly into a fuzzball of links?"},{"slug":"vorlonjs","title":"Vorlon.JS","date":1460894979420,"synopsis":"Here we ask how can we include [[Wiki Javascript]] - that is how can we create an education environment to teach people [[Javascript]] within Fedwiki?"},{"slug":"walking-charrette","title":"Walking Charrette","date":1469024012791,"synopsis":"The proposal is that we organise a series of events, supported by a from of writing and research that uses wiki, but is based on the physical act of walking and discussing ideas of relevance the the physical location of the walk."},{"slug":"wanderbuch","title":"Wanderbuch","date":1465981112141,"synopsis":"A [[Journeyman]] would be required to keep a journal or [[Wanderbuch]]. This would often serve as both passport and a resumé - [http://www.peterspioneers.com/wanderbuch.htm peterspioneers.com]"},{"slug":"ward-cunningham","title":"Ward Cunningham","date":1448019998467,"synopsis":"I have lots of ambition for federated wiki which I have explored at times and deferred to more mundane needs other times. Here I can describe ideas without declaring them as accepted direction."},{"slug":"wards-recent-activity","title":"Ward's Recent Activity","date":1512349156683,"synopsis":"The question here is how would I go about creating a page of Wards recent activity across all his sites?"},{"slug":"wards-sites","title":"Wards Sites","date":1512348513720,"synopsis":"Here is a list of sites Ward writes on. I use this list to view [[Ward's Recent Activity]]."},{"slug":"web-archive-format","title":"Web Archive Format","date":1497698727314,"synopsis":"What format should we save our data, and code in the Federation? We look for the following properties and qualities for any solution we choose:"},{"slug":"web-components","title":"Web Components","date":1510699537905,"synopsis":"Web Components are a set of features currently being added by the W3C to the HTML and DOM specifications that allow for the creation of reusable widgets or components in web documents and web applications."},{"slug":"web-messaging","title":"Web Messaging","date":1464448374210,"synopsis":"Web Messaging or cross-document messaging, is an API introduced in the WHATWG HTML5 draft specification, allowing documents to communicate with one another across different origins, or source domains - [https://en.wikipedia.org/wiki/Web_Messaging wikipedia]"},{"slug":"webgl","title":"WebGL","date":1510698111831,"synopsis":"WebGL (Web Graphics Library) is a JavaScript API for rendering interactive 2D and 3D graphics within any compatible web browser without the use of plug-ins - [https://en.wikipedia.org/wiki/WebGL wikipedia]"},{"slug":"webgl-examples","title":"WebGL Examples","date":1510697230090,"synopsis":"Here we list some WebGL examples that play well in a modern browser:"},{"slug":"webgl-frameworks","title":"WebGL Frameworks","date":1510697133393,"synopsis":"Below are a collection of links imported from [[OneTab]]. You can view these links here - [https://www.one-tab.com/page/mnqrmK_LTMmcNA-h5X4URw one-tab.com]:"},{"slug":"webgl-plugin","title":"WebGL Plugin","date":1512232581461,"synopsis":"[[WebGL]] is fantastic. Here we ask how we could include this technology in wiki."},{"slug":"webgl-video-textures","title":"WebGL video textures","date":1510697986941,"synopsis":"You can play video, even stream video as a texture to 3D objects in [[WebGL]] using javascript."},{"slug":"webrtc","title":"WebRTC","date":1466942783917,"synopsis":"WebRTC (Web Real-Time Communication) is an API definition drafted by the World Wide Web Consortium (W3C) that supports browser-to-browser applications for voice calling, video chat, and P2P file sharing without the need of either internal or external plugins - [https://en.wikipedia.org/wiki/Webrtc wikipedia]"},{"slug":"webrtc-book-reader-demo","title":"WebRTC Book Reader Demo","date":1464179923212,"synopsis":"An old example of using [[webrtc]] within a mobile device for book reading."},{"slug":"weekend-happening","title":"Weekend Happening","date":1440453560886,"synopsis":"A weekend Happening starts on a Friday evening, and continues through the weekend until Sunday evening. It is similar in duration and form to a Hackathon. Variations in timing and structure are of course entirely possible, it is really up to the group taking part in the event."},{"slug":"welcome-authors","title":"Welcome Authors","date":1524059411129,"synopsis":"It should be noted that \"forking a transporter page\" does not fork the microservice in this instance. it merely alters the server side configuration to point appropriate urls dropped onto wiki to a remote federation microservice."},{"slug":"welcome-visitors","title":"Welcome Visitors","date":1518887309391,"synopsis":"Welcome to my [[wiki]]. Here I write informal notes about my thoughts and work. My name is [[David Bovill]], and here you can see all [[David's Recent Activity]]."},{"slug":"what-about-the-federated-wiki","title":"What about The Federated Wiki?","date":1466866982832,"synopsis":"Here we start to organise a series of [[podcasts]] introducing federated wiki, why we like to write in it, it's relevance to the [[Decentralised Web]]?"},{"slug":"when-their-time-is-right","title":"When Their Time Is Right","date":1470584190133,"synopsis":"Much of what lives and survives is about timing, not essence. How do we care for ideas who's timing is wrong? How do we judge the right time for an idea?"},{"slug":"where-memes-flourish","title":"Where Memes Flourish","date":1512228475918,"synopsis":"A page with 1 items."},{"slug":"why-we-write-with-wiki","title":"Why We Write With Wiki","date":1466752554396,"synopsis":"An amusing amount of \"w's in this title. Here we explore why people write in [[Wikipedia]] and in more general the motivations for writing in the new wiki we seek to create for [[The Decentralised, Permanent Web]]."},{"slug":"wiki","title":"Wiki","date":1466862122875,"synopsis":"A wiki is a website that provides collaborative modification of its content and structure directly from the web browser. In a typical wiki, text is written using a simplified markup language (known as \"wiki markup\"), and often edited with the help of a rich-text editor - [https://en.wikipedia.org/wiki/Wiki wikipedia]"},{"slug":"wiki-admin","title":"Wiki Admin","date":1504802561572,"synopsis":"An administrator is identified by the --admin parameter when starting wiki. The admin value would depend on how individuals are identified by the security module in use."},{"slug":"wiki-as-git","title":"Wiki as Git","date":1463940814819,"synopsis":"Here we explore the idea of [[the federation]] as one big [[Git Repository]]. Exploring this notion can help us structure the knowledge represented in wiki, as well as plan for alternative architectures such as [[IPFS]]."},{"slug":"wiki-as-platform","title":"Wiki as Platform","date":1468680746568,"synopsis":"I am a continual proponent of the wiki style, where structure in the work emerges unmanaged by assumptions of programmers. This is the exact opposite of the sinister \"algorithm\" that now rules popular social software. I've now pushed this style into a computational realm where collaborators can do computing as well as talk about the computing they do. Every result ends up a story."},{"slug":"wiki-as-politics","title":"Wiki As Politics","date":1468680632262,"synopsis":"We consider how we can make wiki a better platform by resisting guidance based on what we want people to do. Better to offer mechanisms close to the natural capabilities of computers and networks. Then let minds make of it what they will."},{"slug":"wiki-at-32c3","title":"Wiki at 32C3","date":1451160428619,"synopsis":"Here we look at how we might organise an online discussion at [[#32C3]] using Fedwiki to discuss and interlink videos, audio interviews, and online researchers in a way that respects the individuality of each."},{"slug":"wiki-bash","title":"Wiki Bash","date":1464177925945,"synopsis":"Let us define a new shell scripting language in wiki. One which combines the [[man page]], the raw power and flexibility of unix [[shell]] commands, with the social features of wiki."},{"slug":"wiki-code-runner","title":"Wiki Code Runner","date":1066532022000,"synopsis":"A hypothetical link to a remote server here could interpret [[Anti Comment]] code in wiki pages to  produce output as a gif or jpeg. "},{"slug":"wiki-configuration","title":"Wiki Configuration","date":1464425328736,"synopsis":"It is possible to configure a wiki on a per-site basis using a configuration fie."},{"slug":"wiki-domain","title":"Wiki Domain","date":1510668160810,"synopsis":"The \"Wiki Domain\" is a concept added as part of Wiki@0.10 as part of providing a practical use of [[OAuth]] security."},{"slug":"wiki-farm-security","title":"Wiki Farm Security","date":1426724443300,"synopsis":"A loose discussion of [[Wiki Farm]] security. A more technical discussion may well evolve over at [https://github.com/fedwiki/wiki-node-server/issues/97#issuecomment-74984127 GitHub]."},{"slug":"wiki-feeds","title":"Wiki Feeds","date":1450661230266,"synopsis":"here we look at various ways we can keep people in touch with Fedwiki activity - even if they do not own a Fedwiki site."},{"slug":"wiki-form","title":"Wiki Form","date":1491142647816,"synopsis":"It is easy to create forms in wiki by using the built-in [[HTML Plugin]]."},{"slug":"wiki-hoa-notes-411","title":"Wiki HOA Notes 4/11","date":1523471742952,"synopsis":"Federated wiki dev/user video conference starts in 15 minutes."},{"slug":"wiki-hooks","title":"Wiki Hooks","date":1512304511977,"synopsis":"[[Wiki Hooks]] are a proposed addition to wiki, which would enable [[transporters]] and built in wiki events (such as forking) to call external web services."},{"slug":"wiki-identity-provider","title":"Wiki Identity Provider","date":1510659530525,"synopsis":"Here we explore what ti would take to provide an [[Identity Provider]] for the [[federation]]."},{"slug":"wiki-is-political","title":"Wiki is political","date":1523873705242,"synopsis":"A key design feature of wiki is the ability to read and write in the same place. You may need to switch modes (as with Mediawiki), or double-click to edit (as with federated wiki) - but reading and writing and kept as closely integrated as possible."},{"slug":"wiki-javascript","title":"Wiki Javascript","date":1460897154627,"synopsis":"The idea here is to include within Fedwiki a Javascript debugging and code editing tool. This would enable linking of a new [[Javascript Dictionary]], [[Personal Code Documentation]] and a modern development environment."},{"slug":"wiki-links-in-html","title":"Wiki Links in HTML","date":1458850054037,"synopsis":"There are a number of reasons why we need to be able to create normal [[internal wiki-links]] in plain [[HTML]]."},{"slug":"wiki-map","title":"Wiki Map","date":1467317295568,"synopsis":"A wiki-map is a conceptual map of wiki structure. This could be rendered by cytoscape."},{"slug":"wiki-messaging","title":"Wiki Messaging","date":1462855768948,"synopsis":"Wiki messaging is the ability of one wiki page to send messages, indeed open up two-way communication to to other wiki pages, or entirely separate web sites or web applications."},{"slug":"wiki-namespace","title":"Wiki Namespace","date":1467035859462,"synopsis":"Here we ask what is special about wiki in terms of names and naming. We also look to the future and technologies that may preserve or reinforce these values."},{"slug":"wiki-node-server","title":"Wiki Node Server","date":1437495026736,"synopsis":"Federated wiki node.js server as a npm module (referred to as [[wiki-node-server]]) - [https://github.com/fedwiki/wiki-node-server/blob/5869e11954da3f79056ee440244a66558b233494/lib/server.coffee github]."},{"slug":"wiki-on-ipfs","title":"Wiki on IPFS","date":1468924557965,"synopsis":"We imagine how wiki client code might maintain its permanent state in IPFS. We suggest an integration with the journal as currently implemented to create [[Fedwiki on IPFS]]."},{"slug":"wiki-options","title":"Wiki Options","date":1497877312015,"synopsis":"Here we look at wiki's command line options. You can obtain basic description of these options using:"},{"slug":"wiki-page","title":"Wiki Page","date":1511704145553,"synopsis":"A [[Federated Wiki Page]], or [[Fedwiki Page]] is a mobile-phone sized column of authored hypertext, that can be displayed side-by-dide in a [[Fedwiki Lineup]] to form a dynamically constructed [[Web Page]]."},{"slug":"wiki-page-json","title":"Wiki Page JSON","date":1438563289032,"synopsis":"We use this term to describe the JSON returned when a new wiki-page is fetched from the server."},{"slug":"wiki-page-metadata","title":"Wiki Page Metadata","date":1450970714053,"synopsis":"I'm unable to reliably search for pages created by a [[Transporter]]. We need to add some more [[Metadata]] fields to the [[wiki-page-json]] to enable this."},{"slug":"wiki-publications","title":"Wiki Publications","date":1476538423838,"synopsis":"Here we look at how we might create a decentralised publication based on wiki."},{"slug":"wiki-pull-model","title":"Wiki Pull Model","date":1464159743629,"synopsis":"In wiki we pull changes. No notifications, no writing comments, or editing someone else's content - that would invite seekers of attention."},{"slug":"wiki-search","title":"Wiki Search","date":1512314622407,"synopsis":"Here we take a look at options for searching the federation and individual Fedwiki sites."},{"slug":"wiki-server","title":"wiki-server","date":1437494884340,"synopsis":"The [[Wiki Server]] is the integrated project on Github, and referred to simply as \"wiki\" with [[npm]], which integrates all the individual [[Plugins]] and the [[wiki-node-server]] component to create a functioning [[Fedwiki Server]]."},{"slug":"wiki-truth","title":"Wiki Truth","date":1439109530834,"synopsis":"Federated wiki is proud to host multiple points of view. However, it must maintain mechanisms to be \"less wrong\" as it progresses else it will become a pool of stagnant and putrid misinformation. The relentless retracing of reason justified by uncontested observation seems our best hope."},{"slug":"wiki-web-panel","title":"Wiki Web Panel","date":1512231849398,"synopsis":"# Alternative"},{"slug":"wikiapp-motivations","title":"WikiApp Motivations","date":1430049310802,"synopsis":"I think in a perfect world we'd have desktop versions and tablet versions that had nothing to do with Firefox or Chrome, and that didn't suffer from their limitations and fragility."},{"slug":"wikidata-for-research","title":"Wikidata for Research","date":1417798227066,"synopsis":"... we plan to draft a proposal that aims at establishing Wikidata as a central hub for linked open research data more generally, so that it can facilitate fruitful interactions at scale between professional research institutions and citizen science and knowledge initiatives. We plan to draft this proposal in public – you can join us and help develop it via a dedicated page on Wikidata. [http://blog.wikimedia.de/2014/12/05/wikidata-for-research-a-grant-proposal-that-anyone-can-edit/ post]"},{"slug":"wikimedia-commons","title":"Wikimedia Commons","date":1489679255605,"synopsis":"Wikimedia Commons (or simply Commons) is an online repository of free-use images, sound, and other media files. It is a project of the Wikimedia Foundation - [https://en.wikipedia.org/wiki/Wikimedia_Commons wikipedia]"},{"slug":"wikimention","title":"Wikimention","date":1433582081150,"synopsis":"Previously we have contemplated the need for [[complementary notice on fork]]. Here, I start to think through how such a mechanism might work. I draw inspiration from [https://indiewebcamp.com/webmention Webmention]."},{"slug":"wikipedia","title":"Wikipedia","date":1457722900929,"synopsis":"Wikipedia is a free-access, free-content Internet encyclopedia, supported and hosted by the non-profit Wikimedia Foundation - [https://en.wikipedia.org/wiki/Wikipedia wikipedia]"},{"slug":"wikipedia-links","title":"Wikipedia Links","date":1457715063341,"synopsis":"I propose here a change or addition to Fedwiki to make the integration with [[Wikipedia]] (and [[Other MediaWikis]]), more seamless."},{"slug":"wikipedia-readers","title":"Wikipedia Readers","date":1458401452301,"synopsis":"Characterizing Wikipedia Reader Behaviour. [https://meta.wikimedia.org/wiki/Research:Characterizing_Wikipedia_Reader_Behaviour wikipedia]"},{"slug":"wikiright","title":"WikiRight","date":1449105150416,"synopsis":"WikiRight is a play on the word Copyright. It doesn't make much sense. But I chose it to name a time stamping system."},{"slug":"wikis-partners","title":"Wiki's Partners","date":1465210827784,"synopsis":"Here we look at how wiki can play well with other projects."},{"slug":"windowpostmessage","title":"Window.postMessage","date":1464448033383,"synopsis":"The window.postMessage method safely enables cross-origin communication - [https://developer.mozilla.org/en-US/docs/Web/API/Window/postMessage developer.mozilla.org]"},{"slug":"wirecast","title":"Wirecast","date":1466942262456,"synopsis":"Wirecast is a commercial project that allows you to create powerful and flexible live streaming shows with multiple camera inputs."},{"slug":"wirecast-based-studio","title":"Wirecast Based Studio","date":1437672697614,"synopsis":"The [[Wirecast]] studio utilises [[Thunderbolt 2]] based computer hardware, and [[HDMI]] and high quality USB based cameras."},{"slug":"wochenklausur","title":"WochenKlausur","date":1512563081982,"synopsis":"Since 1993 and on invitation from different art institutions, the artist group [[WochenKlausur]] develops concrete proposals aimed at small, but nevertheless effective improvements to socio-political deficiencies."},{"slug":"work-in-progress","title":"Work in Progress","date":1462755123716,"synopsis":"These are projects we've actually started coding. Sometimes they turn out to have dependencies we hadn't anticipated which makes them linger on."},{"slug":"working-openly","title":"Working Openly","date":1491139617088,"synopsis":"He we examine the issues regarding writing and working openly in wiki. Wiki does not require us to work openly as we can run a private server on our laptop or home machine. However wiki does encourage us to do so, and the more of us that take up the offer the better the experience for every writer"},{"slug":"world-caf","title":"World Café","date":1440520523657,"synopsis":"Small groups of four or five participants sit around a table and discuss an open-ended question for a structured amount of time."},{"slug":"writing-for-a-cause","title":"Writing For A Cause","date":1465035465891,"synopsis":"Let's find a mission. A mission that appeals to Fedwiki writers. Let' choose out target invite some writers, and publish the results."},{"slug":"writing-with-strangers","title":"Writing with Strangers","date":1429806208111,"synopsis":"Writing in the presence of rampant forking calls into question [[What it Means to Write]] and how to do it well."},{"slug":"writing-with-strangers-at-32c3","title":"Writing with Strangers at 32C3","date":1451160126729,"synopsis":"Some thoughts on how we might organise 3 Hangouts and Fedwiki writing sessions at 32C3 - on the 27-29th December at 6pm GMT each evening of the event."},{"slug":"writing-with-wikipedia","title":"Writing With Wikipedia","date":1466862710674,"synopsis":"Here we explore how we may write using [[Wikipedia]] not simply as a source and a reference, but as a creative asset in the authoring of new ideas."},{"slug":"xanadu","title":"Xanadu","date":1424535097193,"synopsis":"See [[Project Xanadu]] for [[Ted Nelson]]'s vision and implemantation of a hypertext system."},{"slug":"xanadu-project","title":"Xanadu Project","date":1417176387000,"synopsis":"<b>Newsflash!</b> There is a working demo of Xanadu [http://xanadu.com/ xanadu.com]"},{"slug":"xiki","title":"Xiki","date":1466187872378,"synopsis":"Xiki runs in your text editor, so everything is editable text. Type commands anywhere. Edit the output. (Vs. typing commands at the bottom, and read-only output.) Intermix menus, headings, bullet points, wherever you want. Xiki == executable wiki - [http://xiki.org/ xiki.org]"},{"slug":"zero-steps-to-claim","title":"Zero-Steps to Claim","date":1453128317443,"synopsis":"A new site could be \"born claimed\". The server could generate a suitable credential and share it with the first visitor's browser. This initiates the \"claim\" process. Let's call this the zero-steps to claim solution. We here consider how it could then be supplemented with more traditional account management and login mechanisms."}]