[{"slug":"art","title":"Art","date":1509639837668,"synopsis":"Art is hard to define. It is easier to define negatively than it is positively. I don't feel that art is distinct in any essential way from other forms of creative work, whether it is product design, science or mathematics."},{"slug":"ascii-art","title":"ASCII Art","date":1523706781556,"synopsis":"ASCII art is a graphic design technique that uses computers for presentation and consists of pictures pieced together from the 95 printable (from a total of 128) characters defined by the [[ASCII]] Standard and [[ASCII]] compliant character sets with proprietary extended characters - [https://en.wikipedia.org/wiki/ASCII_art wikipedia]"},{"slug":"basics-of-ascii-art","title":"Basics of ASCII Art","date":1411059944188,"synopsis":"ASCII art is a form of art which uses characters as its basic unit of construction. It is an extension of [[Typewriter Art]], which appeared shortly after the invention of the typewriter."},{"slug":"burak-arikan","title":"Burak Arikan","date":1452424823179,"synopsis":"Burak Arikan is an artist based in New York and Istanbul who works with complex networks. He runs social, economical, and political issues through an abstract machinery, which generates network maps and algorithmic interfaces, results in performances, and renders inherent power relationships visible."},{"slug":"fedwiki-tools","title":"Fedwiki Tools","date":1449105067435,"synopsis":"Here we list a few tools that are of particular use in managing and creating [[Fedwiki]] content."},{"slug":"inkscape-tracing","title":"Inkscape Tracing","date":1523526521006,"synopsis":"Here we look at how we can trace hand-drawn images to create useful elements for participatory design based software and storytelling."},{"slug":"nerd-boy","title":"Nerd Boy","date":1523706956313,"synopsis":"The Adventures of Nerd Boy, or just [[Nerd Boy]] is an ASCII comic by Joaquim Gândara between 6 August 2001 and 17 July 2007, consisting of 600 strips- [http://www.nerd-boy.net/nerdboypak.php nerd-boy.net]"},{"slug":"paul-smiths-typewriter-art","title":"Paul Smith's Typewriter Art","date":1523706789083,"synopsis":"Paul Smith, the Typewriter artist. Originally aired March-April of 1976 on KOIN-TV in Portland Oregon. See [[Typewriter Art]]."},{"slug":"typewriter-art","title":"Typewriter Art","date":1523704476661,"synopsis":"Typewriter art predates ASCII Art, and anticipates many of its techniques. See [[Basics of ASCII Art]]."},{"slug":"typewriter-emojis","title":"Typewriter Emojis","date":1421266826182,"synopsis":"\"This page from the October 1948 issue of Popular Mechanics, shows some old school typewriter art, also known as ASCII design. These hat-wearing owls don't have any particular meaning, but they are fun.\" - [http://www.vox.com/2015/1/14/7537103/typewriter-emoji html]"},{"slug":"welcome-visitors","title":"Welcome Visitors","date":1523700421306,"synopsis":"Here we write and research about [[Art]], drawing, graphic, design and video techniques that we find interesting. The [[Outlandish Academy]] is a P2P framework for creating online and offline learning experiences."}]