[{"slug":"alexandria","title":"Alexandria","date":1502439102343,"synopsis":"The Ancient Library of Alexandria is a perfect, and tragic, example of the problem with centralization. Today’s information architecture is similarly vulnerable because the it’s hub and spoke network relies on centralized hubs to store and distribute information. Decentralized technology eliminates central points of failure - [http://www.alexandria.io/learn/#learn1 alexandria.io]"},{"slug":"autonomy","title":"Autonomy","date":1431510430069,"synopsis":"Autonomy (from αὐτο- auto- \"self\" and νόμος nomos, \"law\", hence when combined understood to mean:"},{"slug":"bank","title":"Bank","date":1449001117122,"synopsis":"This is a contract for a simple distributed bank application. The core logic (what would normally be the server logic) is contained within smart-contract accounts on a blockchain, which is accessed from node.js via a javascript API (eris-contracts.js). It is a typical setup for a distributed [[Eris]] application."},{"slug":"bardapp","title":"BarDapp","date":1480170570877,"synopsis":"BarDapp is a fun, physical and direct example of using decentralised technologies to capture an alternative value system in a way that can scale. We can turn free beer into free software."},{"slug":"bitcoin","title":"Bitcoin","date":1429275291334,"synopsis":"Bitcoin uses peer-to-peer technology to operate with no central authority or banks; managing transactions and the issuing of bitcoins is carried out collectively by the network."},{"slug":"bitcoin-and-the-blockchain","title":"Bitcoin and the Blockchain","date":1429284224368,"synopsis":"For many people [[Bitcoin]] is the [[Blockchain]]. However is more accurate to see [[Bitcoin]] as a specific use of blockchain technology."},{"slug":"bitcoin-bar","title":"Bitcoin Bar","date":1457516458782,"synopsis":"Here we think through how you would set up a bar or venue that only runs on [[bitcoin]]."},{"slug":"bitcoin-faucet","title":"Bitcoin faucet","date":1457699121527,"synopsis":"Bitcoin faucets are a reward system, in the form of a website or app, that dispenses rewards in the form of a satoshi, which is a hundredth of a millionth BTC, for visitors to claim in exchange for completing a captcha or task as described by the website - [https://en.wikipedia.org/wiki/Bitcoin_faucet wikipedia]"},{"slug":"bitcoin-full-node","title":"Bitcoin Full Node","date":1459949361179,"synopsis":"The aim of this exercise was to see if I could build a a Bitcoin Full node for less than £100."},{"slug":"bitcoin-payment-gateway-api","title":"Bitcoin Payment Gateway API","date":1438007516834,"synopsis":"Here we list a few useful APIs for automating transferring Bitcoin in and out of other currencies."},{"slug":"block-chain","title":"Block Chain","date":1455113138613,"synopsis":"A block chain is a transaction database shared by all nodes participating in a system. Block chain technology was popularised by the cryptographic currency [[Bitcoin]]."},{"slug":"block-chain-projects","title":"Block Chain Projects","date":1438345571952,"synopsis":"Here I collect some examples of projects using [[Block Chain Technology]]."},{"slug":"block-chain-technology","title":"Block Chain Technology","date":1448912377818,"synopsis":"More frequently spelled as one word - blockchain is a mechanism for trustless publication, validation and processing of instructions from simple (currency) to advanced ([[Cryptographic Contracts]]). Most well known application of Blockchain technology is [[Bitcoin]] and associated with financial transactions."},{"slug":"blockchain","title":"Blockchain","date":1529141762343,"synopsis":"A blockchain is a peer to peer tool that works something like an open ledger. Every participant in a certain network had access to the whole history of every \"transaction\"- whether it be financial as in the case of Bitcoin, or also general information."},{"slug":"blockchain-politics","title":"Blockchain Politics","date":1522495043440,"synopsis":"Here we research the belated, but increasingly important emphasis on democracy, law, and decision making that leverages [[blockchain]], [[distributed ledger]]s and [[decentralised technology]]."},{"slug":"blockchains","title":"Blockchains","date":1438346299631,"synopsis":"However the block chain can be used for more than a simple ledger. You can store code ([[Smart Contract]]s) in the blockchain."},{"slug":"brest-france","title":"Brest, France","date":1502463214036,"synopsis":"Brest is a city in the Finistère département in Brittany in northwestern France. Located in a sheltered position not far from the western tip of the Breton peninsula, and the western extremity of metropolitan France, Brest is an important harbour and the second French military port after Toulon - [https://en.wikipedia.org/wiki/Brest,_France wikipedia]"},{"slug":"building-skyscrapers","title":"Building Skyscrapers","date":1466351558469,"synopsis":"How do we build skyscrapers? Should we build skyscrapers? Large networked systems have problems of scale. We should look to natural systems to see alternative paradigms. Evolution has faced viral threats for a long long time."},{"slug":"byzantine-fault-tolerance","title":"Byzantine fault tolerance","date":1466345025102,"synopsis":"In fault-tolerant computer systems, and in particular distributed computing systems, Byzantine fault tolerance is the characteristic of a system that tolerates the class of failures known as the Byzantine Generals' Problem, which is a generalized version of the Two Generals' Problem - for which there is an unsolvability proof - [https://en.wikipedia.org/wiki/Byzantine_fault_tolerance wikipedia]"},{"slug":"capabilities-based-computer-security","title":"Capabilities-based Computer Security","date":1515004816364,"synopsis":"Norm Hardy gave the Keynote at OCAP 17 [http://clive.tries.fed.wiki/view/ocap2017-norm-hardy-keynote page]"},{"slug":"ceptr","title":"CEPTR","date":1503342550399,"synopsis":"Ceptr is one of those audacious, world-changing projects which can't be summarized into a shiny catch-phrase, but here are some anyway - [http://ceptr.org/ ceptr.org]"},{"slug":"changes-to-crypto-sites","title":"Changes to Crypto Sites","date":1521629086250,"synopsis":"This page shows [[Recent Changes]] across all [[Crypto Academy Sites]]."},{"slug":"changes-to-this-site","title":"Changes to this Site","date":1434641767059,"synopsis":"Below we list recent changes to this site only without also listing changes from the [[Neighbourhood]]:"},{"slug":"chaos-communication-congress","title":"Chaos Communication Congress","date":1455964662444,"synopsis":"The Chaos Communication [[Congress]], is an annual conference organised by the [[Chaos Computer Club]]  ([[CCC]]). The congress features a variety of lectures and workshops on technical and political issues related to [[Security]], [[Cryptography]], [[Privacy]] and [[Online Freedom of Speech]] - [https://en.wikipedia.org/wiki/Chaos_Communication_Congress wikpedia]"},{"slug":"chinas-social-rating-system","title":"China's Social Rating System","date":1514376198071,"synopsis":"The [[Social Credit System]] is a proposed Chinese government initiative for developing a national reputation system. It has been reported to be intended to assign a \"social credit\" rating to every citizen based on government data regarding their economic and social status.  It works as a mass surveillance tool and uses the big data analysis technology. In addition, it is also meant to rate businesses operating on the Chinese market - [https://en.wikipedia.org/wiki/Social_Credit_System wikipedia]"},{"slug":"chris-before-coffee","title":"Chris Before Coffee","date":1457970516473,"synopsis":"If you enjoy this episode please donate in bitcoins: 13U4gmroMmFwHAwd2Sukn4fE2WvHG6hP8e"},{"slug":"chris-ellis","title":"Chris Ellis","date":1457720533267,"synopsis":"Chris refers to himself as a a possibilitarian and entrepreneurial journalist, currency choice advocate and Bitcoin enthusiast."},{"slug":"circuit","title":"Circuit","date":1431464712641,"synopsis":"As [[Secure Mltiparty Computation]] cannot handle “if” statements and conditional looping, a [[Turing Complete]] piece of code (programme) cannot be used. the more limited version of software that is possible is termed a \"circuit\"."},{"slug":"codius","title":"Codius","date":1450794175556,"synopsis":"Codius is a smart contracts protocol built by decentralized payment network provider Ripple Labs. While one of a few projects aimed at bringing smart contracts to market, proponents of the project argue that the platform could prove to be the scalable solution smart contracts need."},{"slug":"congress","title":"Congress","date":1455964337736,"synopsis":"The [[Chaos Communication Congress]], is an annual conference organized by the Chaos Computer Club  ([[CCC]]). The congress features a variety of lectures and workshops on technical and political issues related to Security, Cryptography, Privacy and online Freedom of Speech - [https://en.wikipedia.org/wiki/Chaos_Communication_Congress wikpedia]"},{"slug":"consensus-computer-science","title":"Consensus (computer science)","date":1466345209229,"synopsis":"A fundamental problem in distributed computing and multi-agent systems is to achieve overall system reliability in the presence of a number of faulty processes. This often requires processes to agree on some data value that is needed during computation. Examples of applications of consensus include whether to commit a transaction to a database, agreeing on the identity of a leader, state machine replication, and atomic broadcasts. The real world applications include clock synchronization, PageRank, opinion formation, power smart grids, state estimation, "},{"slug":"consensys","title":"ConsenSys","date":1466355823424,"synopsis":"ConsenSys is a blockchain technology company founded by Joseph Lubin - [https://en.wikipedia.org/wiki/Consensys wikipedia]"},{"slug":"counterparty","title":"Counterparty","date":1438345648221,"synopsis":"Emerging in 2014 as the arguable market leader of the crypto 2.0 movement, Counterparty saw an increasing number of 2.0 products and services leverage its protocol, forged a partnership with Overstock and traded barbs with rival Ethereum -  [http://counterparty.io/ counterparty.io]"},{"slug":"crypto-academy","title":"Crypto Academy","date":1504449553999,"synopsis":"This site is a community site for individuals interested in sharing, teaching and educating the wider community about [[Cryptography]], [[Blockchains]] and [[Public Key Infrastructure]]."},{"slug":"crypto-academy-activity","title":"Crypto Academy Activity","date":1457725277506,"synopsis":"This page shows [[Recent Changes]] across all [[Crypto Academy Sites]]."},{"slug":"crypto-academy-sites","title":"Crypto Academy Sites","date":1521629115883,"synopsis":"A list of crypto-related [[Federated Wiki]] sites. Check [[Recent Changes]] and [[Changes to Crypto Sites]] to see what we are [[Currently Working On]]."},{"slug":"crypto-artifacts","title":"Crypto-artifacts","date":1512665913781,"synopsis":"Here we research about [[Collectibles]], cryptoartifacts, and the [[Origins of Money]]."},{"slug":"cryptographic-contracts","title":"Cryptographic Contracts","date":1449192382661,"synopsis":"Examples of Smart Contracts written in [[Solidity]]:"},{"slug":"cryptoparty","title":"CryptoParty","date":1431670364989,"synopsis":"CryptoParty is a grassroots global endeavour to introduce the basics of practical cryptography such as the Tor anonymity network, key signing parties, disk encryption and virtual private networks to the general public - [https://en.wikipedia.org/wiki/CryptoParty wikipedia]"},{"slug":"currently-working-on","title":"Currently Working On","date":1459949239703,"synopsis":"Use this page to see what I am currently working on, or to start to write new pages. From here you can see:"},{"slug":"cyber-risk-foresight","title":"Cyber Risk Foresight","date":1514215023804,"synopsis":"Cyber, Nano, and AGI Risks: Decentralized Approaches to Reducing Risks, by Duettmann, Peterson, Miller.  [https://research.google.com/pubs/pub46290.html page]"},{"slug":"dao","title":"DAO","date":1470588556682,"synopsis":"DAO stands for Decentralised Autonomous Organisation. A DAO is an entity that lives on the internet and exists autonomously, but also heavily relies on hiring individuals to perform certain tasks that the automaton itself cannot do - [https://blog.ethereum.org/2014/05/06/daos-dacs-das-and-more-an-incomplete-terminology-guide/ ethereum.org]"},{"slug":"dao-private-keys","title":"DAO Private Keys","date":1439118228408,"synopsis":"If a [[DAO]] is going to be able to interact with other parties it needs to be able to sign transactions - that is it needs a private key."},{"slug":"dapp","title":"DApp","date":1450794312970,"synopsis":"DApp stands for \"distributed app\" - an acronym for a form of software application that communicates with other applications without a centralised server."},{"slug":"decentralised-technologies","title":"Decentralised technologies","date":1480168192671,"synopsis":"Scaling alternative value systems using centralised technologies is an oxymoron."},{"slug":"demystifying-bitcoin","title":"Demystifying Bitcoin","date":1511964673005,"synopsis":"Here we collect media that tries to present cryptography and blockchain technology in an easy to understand manner:"},{"slug":"distributed-contracts","title":"Distributed Contracts","date":1424695539222,"synopsis":"A distributed contract is a method to form agreements with people via the block chain."},{"slug":"distributed-ledger","title":"Distributed ledger","date":1525336732263,"synopsis":"A distributed ledger is a consensus of replicated, shared, and synchronized digital data geographically spread across multiple sites, countries, or institutions. There is no central administrator or centralized data storage. - [https://en.wikipedia.org/wiki/Distributed_ledger wikipedia]"},{"slug":"double-ratchet-algorithm","title":"Double Ratchet Algorithm","date":1466976388936,"synopsis":"In cryptography, the Double Ratchet Algorithm (previously referred to as the Axolotl Ratchet) is a key management algorithm that was developed by Trevor Perrin and [[Moxie Marlinspike]] in 2013."},{"slug":"dumb-contracts","title":"Dumb Contracts","date":1466355206624,"synopsis":"Nice article over on - [https://medium.com/@therealopenbazaar/the-case-for-dumb-contracts-6308aa5b757#.gbn0utewn medium] I store it here for future writing purposes."},{"slug":"ecdsa-signature","title":"ECDSA Signature","date":1438007293188,"synopsis":"[[Elliptic Curve]] Digital Signature Algorithm (ECSDA) is a cryptographic algorithm used by [[Bitcoin]] to ensure funds can only be spent by their rightful owners - [https://en.bitcoin.it/wiki/Elliptic_Curve_Digital_Signature_Algorithm bitcoin.it]"},{"slug":"enric-duran","title":"Enric Duran","date":1494931918304,"synopsis":"[[Faircoin]] is a cryptocurrency whose name refers to economic justice and fair trade, and that corresponds to the values that Duran has always advocated. An activist who went public after defrauding the banks between 2006 and 2008 for around 492,000 euros in loans. He claimed that he wanted to refurbish his apartment or buy a car, had payroll and other false documents and even created shell companies to support his scam."},{"slug":"ether-camp-hackathon","title":"Ether Camp Hackathon","date":1449086212776,"synopsis":"Ether Camp Hackathon is an online hackathon organised by [http://cointelegraph.com/news/115775/ethers-hacker-about-vulnerability-of-blockchain-bitcoin-and-ethereum Roman] which took place Dec 1st - 5th 2015."},{"slug":"ethereum","title":"Ethereum","date":1464377729809,"synopsis":"Web 3.0 publishing platform. Purpose of Ethereum is to decentralise the Web. Read more on [http://en.wikipedia.org/wiki/ethereum Wikipedia] and [https://forum.ethereum.org Ethereum forum]"},{"slug":"ethereum-blockchain","title":"Ethereum blockchain","date":1449086662577,"synopsis":"The [[Ethereum]] blockchain can be described as a [[Blockchain]] with a built-in programming language, or as a consensus-based globally executed virtual machine."},{"slug":"ethereum-on-raspberry-pi","title":"Ethereum on Raspberry Pi","date":1449177656925,"synopsis":"Raspberry Pi instructions  - [https://github.com/ethereum/wiki/wiki/Raspberry-Pi-instructions here]"},{"slug":"factom","title":"Factom","date":1425305172142,"synopsis":"Another sometimes divisive unlaunched project, Factom is one of a few notable projects seeking to build a data layer on top of bitcoin that could help businesses better manage everything from title records to legal apps. With its white paper introduced in November, the project is expected to move forward with development in 2015."},{"slug":"fair-coin","title":"Fair coin","date":1494931622868,"synopsis":"Fair coin is not [[FairCoin]]."},{"slug":"faircoin","title":"FairCoin","date":1496656702781,"synopsis":"Proof-of-Cooperation does not implement any mining or minting functionality, which are both competitive systems. Instead, certified validation nodes (in short CVNs) cooperate to secure the network. Proof-of-Cooperation will be introduced with FairCoin2 in 2017, whilst keeping all balances from the old FairCoin1 network - [https://fair-coin.org/en/ecological-blockchain-consensus fair-coin.org]"},{"slug":"fedwiki-tools","title":"Fedwiki Tools","date":1521207241473,"synopsis":"Here we list a few tools that are of particular use in managing and creating [[Fedwiki]] content."},{"slug":"filecoin","title":"Filecoin","date":1501587847552,"synopsis":"[[Filecoin]] is the sister protocol of [[IPFS]]. While neither protocol depends on each other, they are perfectly complementary. IPFS handles high performance distribution of objects; Filecoin handles incentivising the world to backup/seed objects."},{"slug":"film-oracle","title":"Film Oracle","date":1455125495662,"synopsis":"Here we describe the physicality, and software architecture of a [[Micro-server]] that we have developed for the purpose of supporting decentralised film production."},{"slug":"fork-software-development","title":"Fork (software development)","date":1466682746795,"synopsis":"In software engineering, a project fork happens when developers take a copy of source code from one software package and start independent development on it, creating a distinct and separate piece of software. The term often implies not merely a development branch, but a split in the developer community, a form of schism - [https://en.wikipedia.org/wiki/Fork_(software_development) wikipedia]"},{"slug":"freedom-coop","title":"Freedom COOP","date":1494933089824,"synopsis":"Legal version of [[FairCoop]] - [https://freedomcoop.eu/ freedomcoop.eu]"},{"slug":"gems","title":"Gems","date":1438345682194,"synopsis":"Decentralised social messenger [http://getgems.org/ Gems] became one of the most buzzed-about bitcoin startups of 2014, raising more than $500,000 in its ongoing [[Crowdsale]]."},{"slug":"giveth","title":"Giveth","date":1521630276648,"synopsis":"Learn more about Giveth and the Giveth Future of Giving DApp: - http://giveth.io/"},{"slug":"hash-chain","title":"Hash Chain","date":1449087052087,"synopsis":"A hash chain is the successive application of a cryptographic hash function to a piece of data. In computer security, a hash chain is a method to produce many one-time keys from a single key or password. For non-repudiation a hash function can be applied successively to additional pieces of data in order to record the chronology of data's existence."},{"slug":"heat-haze","title":"Heat Haze","date":1455126654029,"synopsis":"I think it should be blie"},{"slug":"history-of-money","title":"History of money","date":1512665967199,"synopsis":"The history of money concerns the development of means of carrying out transactions involving a medium of exchange. Money is any clearly identifiable object of value that is generally accepted as payment for goods and services and repayment of debts within a market or which is legal tender within a country - [https://en.wikipedia.org/wiki/History_of_money wikipedia]"},{"slug":"holochain","title":"Holochain","date":1512753052550,"synopsis":"Holographic storage for distributed applications. A holochain is a validating distributed hash table (DHT) where every node enforces validation rules on data against the signed chains where the data originated - [http://ceptr.org/projects/holochain ceptr.org]"},{"slug":"hyperledger","title":"Hyperledger","date":1519432828785,"synopsis":"Hyperledger (or the Hyperledger project) is an umbrella project of open source blockchains and related tools, started in December 2015 by the Linux Foundation, to support the collaborative development of blockchain-based distributed ledgers - [https://en.wikipedia.org/wiki/Hyperledger wikipedia]"},{"slug":"hyperledger-indy","title":"Hyperledger Indy","date":1519434040103,"synopsis":"Indy is a [[Hyperledger]] project for supporting independent identity on distributed ledgers. It provides tools, libraries, and reusable components for providing digital identities rooted on blockchains or other distributed ledgers. Contributed by the [[Sovrin Foundation]] - [https://github.com/hyperledger/indy-node/blob/master/getting-started.md github]"},{"slug":"icotopia","title":"Icotopia","date":1502439755569,"synopsis":"Icotopia is a project to tell the story of ICO's, and provide tools to make understanding them and comparing them easier."},{"slug":"identity","title":"Identity","date":1449087570443,"synopsis":"This will be a collection of audio notes on the topic of idenity. Some subtopics below:"},{"slug":"immutability","title":"Immutability","date":1529141028718,"synopsis":"Here we explore immutability as it refers to [[blockchain]] or distributed ledger technology."},{"slug":"is-faireness-a-bug","title":"Is Faireness A Bug?","date":1466352446251,"synopsis":"The title may not make sense, but it's catchy. Here we look at the issue od [[Decidability]] and human action - which may be a better title."},{"slug":"islamic-finance","title":"Islamic Finance","date":1506937911037,"synopsis":"Islamic banking or Islamic finance (Arabic: مصرفية إسلامية‎‎) or sharia-compliant finance is banking or financing activity that complies with sharia (Islamic law) and its practical application through the development of Islamic economics."},{"slug":"joseph-lubin-entrepreneur","title":"Joseph Lubin (entrepreneur)","date":1466355496243,"synopsis":"Joseph Lubin is an American entrepreneur. He has founded or co-founded several companies including the Swiss-based Ethereum, a decentralized publishing platform, and is founder of ConsenSys, a Brooklyn-based software-production studio - [https://en.wikipedia.org/wiki/Joseph_lubin_(entrepreneur) wikipedia]"},{"slug":"kademlia","title":"Kademlia","date":1522998445301,"synopsis":"[[Kademlia]] is the inspiration for the distributed hash table used as a core component of [[IPFS]]."},{"slug":"keys-under-doormats","title":"Keys Under Doormats","date":1436366931193,"synopsis":"On mandating insecurity by requiring government access to all data and communications by the distinguished committee of computer scientists,"},{"slug":"ksenya","title":"Ksenya","date":1425144780114,"synopsis":"I maintain a part of [[Crypto Academy]] Federated Wiki which covers Basics of Blockchain Technology and its role in society through practical examples. It's purpose to popularise technology and principles of decentralised consensus. I am a contributor to [https://www.youtube.com/user/WorldCryptoNetwork World Crypto Network] podcast."},{"slug":"leslie-lamport","title":"Leslie Lamport","date":1466344202083,"synopsis":"Leslie B. Lamport (born February 7, 1941) is an American computer scientist. Lamport is best known for his seminal work in distributed systems and as the initial developer of the document preparation system LaTeX - [https://en.wikipedia.org/wiki/Leslie_lamport wikipedia]"},{"slug":"light-client","title":"Light Client","date":1427660294476,"synopsis":"In [[Ethereum]], a light client can be viewed as a client that downloads block headers by default, and verifies only a small portion of what needs to be verified, using a distributed hash table as a database for trie nodes in place of its local hard drive."},{"slug":"merkle-tree","title":"Merkle tree","date":1522998365011,"synopsis":"In cryptography and computer science, a hash tree or Merkle tree is a tree in which every non-leaf node is labelled with the hash of the labels of its children nodes. Hash trees are useful because they allow efficient and secure verification of the contents of large data structures. Hash trees are a generalization of hash lists and [[Hash Chain]]s  - [https://en.wikipedia.org/wiki/Merkle_Tree wikipedia]"},{"slug":"methods-of-certification","title":"Methods of certification","date":1511962119466,"synopsis":"Broadly speaking, there have traditionally been three approaches to getting this trust: certificate authorities (CAs), web of trust (WoT), and simple public key infrastructure (SPKI)."},{"slug":"micro-server","title":"Micro-server","date":1455125476858,"synopsis":"Its a very small server"},{"slug":"miners-and-governance","title":"Miners and Governance","date":1529142264670,"synopsis":"Developers, startups, miners ... all have played a role in bitcoin's technical debates. But if you've been following, you may have noticed the attention being paid to whether miners are \"signaling\" for various proposals."},{"slug":"mnet","title":"Mnet","date":1427660535946,"synopsis":"Mnet is a distributed file store - [https://web.archive.org/web/20120204081148/http://mnetproject.org/faq archive.org]"},{"slug":"multisigs-cant-secure-dao-keys","title":"Multisigs Can't Secure DAO Keys","date":1433066616041,"synopsis":"The short answer is that DAO's can't use multisigs for general purpose signing - they can use multisigs for signing [[Bitcoin Payments]], but not for signing any other content (such as a contract)."},{"slug":"namecoin","title":"NameCoin","date":1427644307920,"synopsis":"Namecoin is a fork of Bitcoin, used for Securely record and transfer arbitrary names (keys)."},{"slug":"neighbourhoods","title":"Neighbourhoods","date":1427625594325,"synopsis":"A list of people involved in the [[Teaching Machines]] Happening."},{"slug":"nicolas-bourbaki","title":"Nicolas Bourbaki","date":1529138609108,"synopsis":"Nicolas Bourbaki is the collective pseudonym under which a group of 20th-century mathematicians, with the aim of reformulating mathematics on an extremely abstract and formal but self-contained basis, wrote a series of books beginning in 1935. With the goal of grounding all of mathematics on set theory, the group strove for rigour and generality. Their work led to the discovery of several concepts and terminologies still used, and influenced modern branches of mathematics. - [https://en.wikipedia.org/wiki/Nicolas_Bourbaki wikipedia]"},{"slug":"nomic","title":"Nomic","date":1463756862130,"synopsis":"Nomic is a game created in 1982 by philosopher Peter Suber in which the rules of the game include mechanisms for the players to change those rules, usually beginning through a system of democratic voting - [https://en.wikipedia.org/wiki/Nomic wikipedia]"},{"slug":"open-auction-contract","title":"Open Auction Contract","date":1448992631819,"synopsis":"The general idea of the following simple auction contract is that everyone can send their bids during a bidding period. The bids already include sending money / ether in order to bind the bidders to their bid. If the highest bid is raised, the previously highest bidder gets her money back. After the end of the bidding period, the contract has to be called manually for the beneficiary to receive his money - contracts cannot activate themselves - [https://ethereum.github.io/solidity//docs/blind-auction/ Blind Auction and Open Auction on GitHub]"},{"slug":"open-whisper-systems","title":"Open Whisper Systems","date":1466976036882,"synopsis":"At Open WhisperSystems, we've been working on improving our encrypted asynchronous chat protocol for TextSecure."},{"slug":"opreturn","title":"OP_RETURN","date":1449418010773,"synopsis":"The 0.9.0 release of Bitcoin Core added a new standard transaction type granting access to a previously disallowed script function, OP_RETURN. This function accepts a user-defined sequence of up to 40 bytes. When a transaction containing a challenge script with an OP_RETURN function is mined into a block, the accompanying byte sequence enters the block chain."},{"slug":"oracle","title":"Oracle","date":1454932650985,"synopsis":"An oracle, in the blockchain sense, is a third party which sends to your on-chain smart contract some specific data your smart contract code cannot fetch by itself. As the oracle is a centralized party, you shouldn’t take its response for granted."},{"slug":"oraclize","title":"Oraclize","date":1454932497571,"synopsis":"Oraclize is a service by which you can have some bitcoin transactions take place based on the occurrence of some verifiable real-life event  - [https://www.oraclize.it/home/features oraclize.it]"},{"slug":"origins-of-money","title":"Origins of Money","date":1512657391777,"synopsis":"Here we explore the [[history of money]]."},{"slug":"paper-wallet","title":"Paper Wallet","date":1457700330204,"synopsis":"Bitcoin address keys may be printed on paper and used to store bitcoins offline. Compared with \"hot wallets\"—those that are connected to the Internet—these non-digital offline paper wallets are considered a \"cold storage\" mechanism better suited for safekeeping bitcoins. It is safe to use only if the prints the paper themselves. Bitcoins from a \"cold storage\" record obtained from a second party as a gift or payment should be immediately transferred to a safer account because the private key could have been copied."},{"slug":"paranoia","title":"Paranoia","date":1466672036625,"synopsis":"Paranoia is a thought process believed to be heavily influenced by anxiety or fear, often to the point of delusion and irrationality. Paranoid thinking typically includes persecutory, or beliefs of conspiracy concerning a perceived threat towards oneself (e.g. \"Everyone is out to get me\"). Paranoia is distinct from phobias, which also involve irrational fear, but usually no blame. Making false accusations and the general distrust of others also frequently accompany paranoia. For example, an incident most people would view as an accident or coincidence, a"},{"slug":"paranoia-and-the-blockchain","title":"Paranoia And The Blockchain","date":1466672029519,"synopsis":"Here we explore the mindset of individuals and in particular experts in the area of cryptography and the blockchain. We ask if the tendency towards paranoia is merited, or a characteristic of the individuals involved."},{"slug":"parity","title":"Parity","date":1521632597653,"synopsis":"The fastest and most secure way of interacting with the Ethereum blockchain. Our client powers much of the infrastructure of the public Ethereum network and is used by companies and users alike - [https://www.parity.io/ parity.io]"},{"slug":"parity-bridge","title":"Parity Bridge","date":1521630556477,"synopsis":"Below are a collection of links imported from [[OneTab]]. You can view these links here - [https://www.one-tab.com/page/pugvUJD7SryRImJ5os7chg one-tab.com]:"},{"slug":"paxos","title":"Paxos","date":1466347007579,"synopsis":"Here we write about [[Paxos (computer science)]] and not the lovely Greek Island - although there is a connection (see below)."},{"slug":"paxos-computer-science","title":"Paxos (computer science)","date":1466346712652,"synopsis":"[[Paxos]] is a family of protocols for solving consensus in a network of unreliable processors. Consensus is the process of agreeing on one result among a group of participants. This problem becomes difficult when the participants or their communication medium may experience failures - [https://en.wikipedia.org/wiki/Paxos_(computer_science) wikipedia]"},{"slug":"payment-service-providers","title":"Payment Service Providers","date":1466958892461,"synopsis":"The [[Bank of England]]  will finally allow non-bank ‘payment service providers’ (PSPs) to hold accounts at the Bank of England , so that they can compete with existing banks to provide current (checking) accounts - [http://positivemoney.org/2016/06/bank-of-england-uk-banks-to-lose-their-status-as-gatekeepers-to-the-payment-system/ positivemoney.org]"},{"slug":"pepecash","title":"PepeCash","date":1512654637562,"synopsis":"[[PepeCash]] is a card just like the other cards on this directory, except it is a lot more liquid. About 700 million Pepe Cash are in circulation at the moment."},{"slug":"philip-saunders","title":"Philip Saunders","date":1425198316851,"synopsis":"My name is [[Philip Saunders]]. I am a civic entrepreneur and writer from Wexford in Ireland. I am currently doing a [[Viral Academy Residency]] where I am working on creating a course on cryptography."},{"slug":"pki","title":"PKI","date":1511961986102,"synopsis":"A [[public key infrastructure]] (PKI) is a set of roles, policies, and procedures needed to create, manage, distribute, use, store, and revoke [[digital certificate]]s and manage public-key encryption - [https://en.wikipedia.org/wiki/Public_key_infrastructure wikipedia]"},{"slug":"plantoid","title":"Plantoid","date":1431369113006,"synopsis":"A plantoid is a hypothetical robot or synthetic organism designed to look, act and grow like a plant."},{"slug":"poa-network","title":"POA Network","date":1521632600850,"synopsis":"POA Network is the first [[Ethereum]]-based public network with [[Proof of Authority]] consensus, reached by independent validators - [https://github.com/poanetwork/wiki wiki]"},{"slug":"polkadot","title":"Polkadot","date":1508256510263,"synopsis":"Present-day blockchain architectures all suffer from a number of issues not least practical means of extensi- bility and scalability - [https://polkadot.io/ polkadot.io]"},{"slug":"private-key","title":"Private Key","date":1438005179354,"synopsis":"A [[Private Key]] is a secret number, known only to the person that generated it."},{"slug":"proof-of-authority","title":"Proof-of-authority","date":1521632534024,"synopsis":"Proof-of-authority (PoA) is an algorithm used with blockchains that delivers comparatively fast transactions through a consensus mechanism based on identity as a stake - [https://en.wikipedia.org/wiki/Proof-of-authority wikipedia]"},{"slug":"proof-of-burn","title":"Proof of Burn","date":1457811469583,"synopsis":"Proof of burn is a method for distributed consensus and an alternative to [[Proof of Work]] and [[Proof of Stake]]. It can also be used for bootstrapping one cryptocurrency off of another - [https://en.bitcoin.it/wiki/Proof_of_burn bitcoin.it]"},{"slug":"proof-of-greed","title":"Proof of Greed","date":1454404785614,"synopsis":"Bitcoin is powered by greed, and it is ok. Miners maintain the network not out of altruism, they maintain it because they get their tokens. Bitcoin is powered and secured by greed. That's how the proof of work works."},{"slug":"proof-of-stake","title":"Proof of Stake","date":1457811949949,"synopsis":"In the case of cryptocurrency Proof-of-stake is a method of securing a network and achieving distributed consensus through requesting users to show ownership of a certain amount of currency."},{"slug":"proof-of-work","title":"Proof of Work","date":1457811769615,"synopsis":"A proof-of-work (POW) system (or [[Protocol]], or [[Function]]) is an economic measure to deter [[Denial of Service Attack]]s and other service abuses such as [[Spam]] on a network by requiring some work from the service requester, usually meaning processing time by a computer."},{"slug":"protip","title":"ProTip","date":1449106015785,"synopsis":"ProTip is a peer to peer tipping for the web released under GNU General Public License. Earlier this year I took part in crowdfunding campaign to make this project happen. So far there is a [https://github.com/Leo-ajc/ProTip chrome extension developed by Leo] that you can try out. Currently [[Chris Ellis]] is running a [[NotJustMadeinChina]] campaign to provide more resources to develop a faucet feature and other things."},{"slug":"protip-chrome-extension","title":"ProTip Chrome Extension","date":1445966387520,"synopsis":"ProTip is a peer to peer tipping for the web. It is implemented as a [[Chrome Extension]]."},{"slug":"public-key","title":"Public Key","date":1438005217583,"synopsis":"[[Public Key]]: A number that corresponds to a private key, but does not need to be kept secret. A public key can be calculated from a private key, but not vice versa."},{"slug":"public-key-cryptography","title":"Public-key cryptography","date":1467108099010,"synopsis":"Public-key cryptography, or asymmetric cryptography, is any cryptographic system that uses pairs of keys: public keys that may be disseminated widely paired with private keys which are known only to the owner. There are two functions that can be achieved: using a public key to authenticate that a message originated with a holder of the paired private key; or encrypting a message with a public key to ensure that only the holder of the paired private key can decrypt it - [https://en.wikipedia.org/wiki/Public_Key_Cryptography wikipedia]"},{"slug":"public-key-infrastructure","title":"Public key infrastructure","date":1511961860017,"synopsis":"A public key infrastructure ([[PKI]]) is a set of roles, policies, and procedures needed to create, manage, distribute, use, store, and revoke [[digital certificate]]s and manage public-key encryption - [https://en.wikipedia.org/wiki/Public_key_infrastructure wikipedia]"},{"slug":"resources-events-agents-accounting-model","title":"Resources, events, agents (accounting model)","date":1494932991694,"synopsis":"Resources, events, agents ([[REA]]) is a model of how an accounting system can be re-engineered for the computer age. REA was originally proposed in 1982 by William E. McCarthy as a generalized accounting model, and contained the concepts of resources, events and agents (McCarthy 1982) - [https://en.wikipedia.org/wiki/Resources,_events,_agents_(accounting_model) wikipedia]"},{"slug":"ripple","title":"Ripple","date":1449098876141,"synopsis":"[https://ripple.com/ Ripple] is a trust-less transfer technology based on a network of servers that enables trading in different currencies. It is released under the [[ISC license]]. I uses it's own currency [[XRP]]. For more information see [https://github.com/ripple Ripple on GitHub]."},{"slug":"rtgs","title":"RTGS","date":1466958739630,"synopsis":"The computer system that holds and manages the accounts at the Bank of England."},{"slug":"safe-remote-purchase","title":"Safe Remote Purchase","date":1448996346657,"synopsis":"contract Purchase"},{"slug":"scalingnow","title":"ScalingNOW","date":1521630474095,"synopsis":"ScalingNOW! interview #1 with Björn & Max from Parity Technologies: https://youtu.be/aWvzQMorof0"},{"slug":"scene-1","title":"Scene 1","date":1455126635572,"synopsis":"We should probably ask someone for directions?"},{"slug":"schnorr-signature","title":"Schnorr signature","date":1494930667222,"synopsis":"In cryptography, a Schnorr signature is a digital signature produced by the Schnorr signature algorithm. Its security is based on the intractability of certain discrete logarithm problems. The Schnorr signature is considered the simplest digital signature scheme to be provably secure in a random oracle model. It is efficient and generates short signatures. It was covered by U.S. Patent 4,995,082 which expired in February 2008 - [https://en.wikipedia.org/wiki/Schnorr_signature wikipedia]"},{"slug":"scratch","title":"Scratch","date":1459948669619,"synopsis":"A page with 1 items."},{"slug":"secure-multiparty-computation","title":"Secure Multiparty Computation","date":1439073204702,"synopsis":"In secure multiparty computation, the inputs to a [[Circuit]] are split up using an algorithm called [[Shamir’s Secret Sharing]], and a piece of the information is given to each participant."},{"slug":"secure-scuttlebutt","title":"Secure Scuttlebutt","date":1509845808954,"synopsis":"Scuttlebutt is a decent(ralised) secure gossip platform. Historically, sea-slang for gossip - a scuttlebutt is basically a watercooler on a ship."},{"slug":"security-in-wiki-farms","title":"Security in Wiki Farms","date":1439637632818,"synopsis":"Some text <b>bold</b>"},{"slug":"shared-secret-computation","title":"Shared, Secret Computation","date":1463063131292,"synopsis":"Enigma: Decentralized Computation Platform with"},{"slug":"signal-software","title":"Signal (software)","date":1466976414624,"synopsis":"Signal is a free and open-source encrypted voice calling and instant messaging application for Android and iOS. It uses end-to-end encryption to secure all communications to other Signal users. Signal can be used to send and receive encrypted instant messages, group messages, attachments and media messages. Users can independently verify the identity of their messaging correspondents by comparing key fingerprints out-of-band. During calls, users can check the integrity of the data channel by checking if two words match on both ends of the call. A Chrome "},{"slug":"signature","title":"Signature","date":1438006980225,"synopsis":"A [[Digital Signature]] is a number that proves that a signing operation took place."},{"slug":"smart-contracts","title":"Smart Contracts","date":1511964437893,"synopsis":"The idea of smart contracts goes way back to 1994. Term coined by cryptogrpher Nick Szabo, a widely credited with laying the groundwork for bitcoin. At core, these automated contracts work like any other computer program's if-then statements. They just happen to be doing it in a way that interacts with real-world assets. When a pre-programmed condition is triggered, the smart contract executes the corresponding contractual clause. ([http://www.fastcolabs.com/3035723/app-economy/smart-contracts-could-be-cryptocurrencys-killer-app from FastCoLabs])"},{"slug":"social-credit-system","title":"Social Credit System","date":1514376307291,"synopsis":"The Social Credit System is a proposed Chinese government initiative for developing a national reputation system. It has been reported to be intended to assign a \"social credit\" rating to every citizen based on government data regarding their economic and social status.  It works as a mass surveillance tool and uses the big data analysis technology. In addition, it is also meant to rate businesses operating on the Chinese market - [https://en.wikipedia.org/wiki/Social_Credit_System wikipedia]"},{"slug":"solid-programmers","title":"Solid Programmers","date":1514567375975,"synopsis":"I often draw symbols like these in 2d with circles, squares, trapezoids shaded in gradient gray."},{"slug":"solidity","title":"Solidity","date":1449196990060,"synopsis":"The Solidity Contract-Oriented Programming Language"},{"slug":"solidity-notary-contract","title":"Solidity Notary Contract","date":1449197431883,"synopsis":"Very basic contract for a notary (timestamping system) written as a design suggestion by [https://github.com/Ryanmtate Ryanmtate]"},{"slug":"solidity-proof-of-existence","title":"Solidity Proof of Existence","date":1449181575280,"synopsis":"NoterEth, pronounced \"Notaryth\", is a prototype notary and \"Proof of Existence\" DAPP. By submitting hashes of documents you can proof on a later date that you were privileged to certain information at a point in history. The transfer of documents can enable other contracts to allow certain access based on who owns a hash - [https://github.com/maran/notareth GitHub]"},{"slug":"some-consensus-protocols","title":"Some consensus protocols","date":1466345238854,"synopsis":"An example of a polynomial time binary consensus protocol that tolerates Byzantine failures is the Phase King algorithm [http://www.springerlink.com/content/gx21355767268411/ Cloture Votes: n/4-resilient Distributed Consensus in t + 1 rounds] by Garay and Berman. The algorithm solves consensus in a synchronous message passing model with ''n'' processes and up to ''f'' failures, provided ''n'' > 4''f'' - [https://en.wikipedia.org/wiki/Consensus_(computer_science)#Some_consensus_protocols wikipedia]"},{"slug":"sovrin","title":"Sovrin","date":1519434332879,"synopsis":"The [[Sovrin Foundation]] is a private-sector, international non-profit that was established to govern the world’s first [[Self-sovereign Identity Network]]."},{"slug":"spv-client","title":"SPV Client","date":1427659675100,"synopsis":"So what is an SPV Client? - [http://bitcoin.stackexchange.com/questions/4649/what-is-an-spv-client stackexchange.com]"},{"slug":"sybil-attack","title":"Sybil attack","date":1457706338445,"synopsis":"The Sybil attack in computer security is an attack wherein a reputation system is subverted by forging identities in peer-to-peer networks - [https://en.wikipedia.org/wiki/Sybil_attack wikipedia]"},{"slug":"tau-chain","title":"Tau Chain","date":1470588502924,"synopsis":"τ-chain (pronounced tau-chain) is a decentralized peer-to-peer network having three unified faces: Rules, Proofs, and Computer Programs, allowing a generalization of virtually any centralized or decentralized P2P network, together with many new abilities, as we present on this note - [http://tauchain.org/tauchain.pdf pdf]"},{"slug":"tezos","title":"Tezos","date":1502439443114,"synopsis":"Tezos, a generic and self-amending crypto-ledger."},{"slug":"the-dao-hack","title":"The DAO Hack","date":1470588674246,"synopsis":"Ethereum suffered a hack of the biggest [[DAO]] created so far, which points to the nature of the problem of how to secure decentralised contracts in general - [http://www.theregister.co.uk/2016/06/17/digital_currency_ethereum/ theregister.co.uk]"},{"slug":"the-nature-evolution-of-money","title":"The Nature Evolution of Money","date":1424724217055,"synopsis":"Moderator Marc Hochstein, American Banker, in discussion with Susan Athey, Professor of Economics, Stanford, John Clippinger, MIT Media Lab and ID3, and David Schwartz, Chief Cryptographer, Ripple Labs"},{"slug":"the-part-time-parliament","title":"The Part Time Parliament","date":1466347146026,"synopsis":"This is a funny, but important story for science and anyone interested noth in how academic pubishing works, and how we might improve it."},{"slug":"the-promise-of-the-blockchain","title":"The promise of the blockchain","date":1450621451908,"synopsis":"<div align=center><img src=\"\" width=428></div>"},{"slug":"timestamping-stuff","title":"Timestamping Stuff","date":1450794640734,"synopsis":"I decided that next time I hear something I like from someone I will timestamp it on [http://eternitywall.it/ Eternity Wall] or other blockchain timestamping service."},{"slug":"tomer-kantor","title":"Tomer Kantor","date":1521630527401,"synopsis":"YOUTUBE yQGQXy0RIIo"},{"slug":"violence-and-paranoia","title":"Violence and paranoia","date":1466672085246,"synopsis":"It has generally been agreed upon that individuals with paranoid delusions will have the tendency to take action based on their beliefs. More research is needed on the particular types of actions that are pursued based on paranoid delusions. Some researchers have made attempts to distinguish the different variations of actions brought on as a result of delusions. Wessely et al. (1993) did just this by studying individuals with delusions of which more than half had reportedly taken action or behaved as a result of these delusions. However, the overall act"},{"slug":"viral-academy-residency","title":"Viral Academy Residency","date":1425201486956,"synopsis":"The [[Viral Academy]] residency programme is a new form of residency exchange, which takes ideeas from [[Couch Surfing]], and from [[Time Banking]] to create a sustainable form of knowledge transfer without any money changing hands."},{"slug":"vitalik-buterin","title":"Vitalik Buterin","date":1466672147474,"synopsis":"Vitalik Buterin (Russian Language Виталик Бутерин) is a programmer & writer. He is primarily known as a co-founder of Ethereum, and as a co-founder of [[Bitcoin]] Magazine. In 2014, Buterin won the World Technology Award for the co-creation and invention of Ethereum - [https://en.wikipedia.org/wiki/Vitalik_buterin wikipedia]"},{"slug":"voting-contract","title":"Voting Contract","date":1448992461096,"synopsis":"The following contract is quite complex, but showcases a lot of Solidity’s features. It implements a voting contract. Of course, the main problems of electronic voting is how to assign voting rights to the correct persons and how to prevent manipulation - [https://ethereum.github.io/solidity//docs/voting/ github.io]"},{"slug":"web3-package","title":"Web3 Package","date":1448996773352,"synopsis":"This page is about [[Ethereum]] compatible JavaScript API which implements the Generic JSON RPC spec. It's available on npm as a node module, for bower and component as an embeddable js and as a meteor.js package."},{"slug":"welcome-visitors","title":"Welcome Visitors","date":1529142203224,"synopsis":"Welcome to this site for the [[Crypto Academy]]. Our aim is to broaden the open understanding of [[cryptography]], and [[privacy]] to as large an audience as possible."},{"slug":"what-is-blockchain","title":"What is Blockchain","date":1429283436676,"synopsis":"From [https://blog.ethereum.org/2015/04/13/visions-part-1-the-value-of-blockchain-technology/ Vitalik Buterin's blog]"},{"slug":"world-citizen-workshops","title":"World Citizen Workshops","date":1434820242903,"synopsis":"Blockchain ID is an experimental project started by [https://twitter.com/MrChrisEllis Chris Ellis]"},{"slug":"world-citizenship-project","title":"World Citizenship Project","date":1511970776167,"synopsis":"The aim here is to create a flexible decentralised identity which combine elements of [[Blockchain ID]], [[WebID]] and [[Portable Linked Profile]]s."}]