[{"slug":"404-error-controller","title":"404 Error Controller","date":1459792744166,"synopsis":"You can write your own custom [[404 Error]] controller, or simply rely on the [[404Override route]] route."},{"slug":"active-record-library","title":"Active Record Library","date":1459765158583,"synopsis":"revIgniter uses a modified version of the [[Active record pattern]]. This pattern allows information to be retrieved, inserted, and updated in your database with minimal scripting. In some cases only one or two lines of code are necessary to perform a database action."},{"slug":"active-record-pattern","title":"Active record pattern","date":1459764961446,"synopsis":"In software engineering, the active record pattern is an architectural pattern found in software that stores in-memory object data in relational databases. It was named by [[Martin Fowler]] in his 2003 book Patterns of Enterprise Application Architecture."},{"slug":"codeigniter","title":"CodeIgniter","date":1459764513767,"synopsis":"CodeIgniter is an open-source software rapid development web framework, for use in building dynamic web sites with PHP - [https://en.wikipedia.org/wiki/Codeigniter wikipedia]"},{"slug":"commonlc","title":"Common.lc","date":1459795120936,"synopsis":"This stack can be found at:"},{"slug":"controllers","title":"Controllers","date":1498213451302,"synopsis":"A Controller is simply a library file that is named in a way that can be associated with a URI."},{"slug":"corner-cases-and-exceptions","title":"Corner cases and exceptions","date":1459816125140,"synopsis":"The behavior of same-origin checks and related mechanisms is not well-defined in a number of [[corner case]]s such as for pseudo-protocols that do not have a clearly defined host name or port associated with their URLs (file: ([[file URI scheme]]), data: ([[data URI scheme]]), etc.)  - [https://en.wikipedia.org/wiki/Same_Origin_policy#Corner_cases_and_exceptions wikipedia]"},{"slug":"cors","title":"CORS","date":1459816668202,"synopsis":"[[Cross-origin resource sharing]] (CORS) is a mechanism that allows restricted resources on a web page to be requested from another domain outside the domain from which the resource originated - [https://en.wikipedia.org/wiki/Cross-origin_resource_sharing wikipedia]"},{"slug":"creating-a-view","title":"Creating a View","date":1459809545963,"synopsis":"Using your text editor, create a file called blogview.lc, and put this in it:"},{"slug":"cross-document-messaging","title":"Cross-document messaging","date":1459816344641,"synopsis":"Web Messaging or cross-document messaging, is an API introduced in the WHATWG HTML5 draft specification, allowing documents to communicate with one another across different origins, or source domains. Prior to HTML5, web browsers disallowed cross-site scripting, to protect against security attacks. This practice barred communication between non-hostile pages as well, making document interaction of any kind difficult. Cross-document messaging allows scripts to interact across these boundaries, while providing a rudimentary level of security - [https://en."},{"slug":"cross-origin-resource-sharing","title":"Cross-origin resource sharing","date":1459816675635,"synopsis":"Cross-origin resource sharing ([[CORS]]) is a mechanism that allows restricted resources (e.g. fonts) on a web page to be requested from another domain outside the domain from which the resource originated - [https://en.wikipedia.org/wiki/Cross_Origin_Resource_Sharing wikipedia]"},{"slug":"cross-site-request-forgery","title":"Cross-site request forgery","date":1459816335014,"synopsis":"Cross-site request forgery, also known as one-click attack or session riding and abbreviated as CSRF (sometimes pronounced sea-surf) or XSRF, is a type of malicious exploit of a website where unauthorized commands are transmitted from a user that the website trusts. Unlike cross-site scripting (XSS), which exploits the trust a user has for a particular site, CSRF exploits the trust that a site is in a user's browser - [https://en.wikipedia.org/wiki/Cross_Site_Request_Forgery wikipedia]"},{"slug":"cross-site-scripting","title":"Cross-site scripting","date":1459816299977,"synopsis":"Cross-site scripting (XSS) is a type of computer security vulnerability typically found in web applications. XSS enables attackers to inject client-side scripts into web pages viewed by other users. A cross-site scripting vulnerability may be used by attackers to bypass access controls such as the same-origin policy. Cross-site scripting carried out on websites accounted for roughly 84% of all security vulnerabilities documented by Symantec as of 2007. Their effect may range from a petty nuisance to a significant security risk, depending on the sensitivi"},{"slug":"currently-working-on","title":"Currently Working On","date":1428639698992,"synopsis":"Use this page to see what I am currently working on, or to start to write new pages. From here you can see:"},{"slug":"defining-a-default-controller","title":"Defining a Default Controller","date":1459807243019,"synopsis":"revIgniter can be told to load a default controller when a URI is not present, as will be the case when only your site root URL is requested. To specify a default controller, open your application/config/routes.lc file and set this variable:"},{"slug":"document-root","title":"Document Root","date":1498309509901,"synopsis":"This directive sets the directory from which httpd will serve files. Unless matched by a directive like Alias, the server appends the path from the requested URL to the document root to make the path to the document."},{"slug":"dynamic-data-in-views","title":"Dynamic Data in Views","date":1459818692062,"synopsis":"Data in the global array variable [[gData]] is merged with the view. Here is an example using the gData array:"},{"slug":"error404lc","title":"error404.lc","date":1459793497580,"synopsis":"This controller produces the [[Default 404 Error Page]]."},{"slug":"fedwiki-tools","title":"Fedwiki Tools","date":1449105067435,"synopsis":"Here we list a few tools that are of particular use in managing and creating [[Fedwiki]] content."},{"slug":"galleria","title":"Galleria","date":1459892857999,"synopsis":"Galleria is a JavaScript image gallery framework that simplifies the process of creating beautiful image galleries for the web and mobile devices  - [http://galleria.io/ galleria.io]"},{"slug":"galleria-plugin","title":"Galleria Plugin","date":1459892855981,"synopsis":"The [[Galleria Plugin]] file contains functions which assist in generating JavaScript code for Galleria, a JavaScript image gallery framework made by Aino - [http://galleria.io/ galleria.io]"},{"slug":"gdata","title":"gData","date":1459818756680,"synopsis":"Data in the global array variable [[gData]] is merged with the view. Here is an example using the gData array:"},{"slug":"handlers","title":"Handlers","date":1459807944012,"synopsis":"In the above example the handler name is index(). The \"index\" handler is always loaded by default if the second segment of the URI is empty."},{"slug":"hello-world","title":"Hello World!","date":1498212495182,"synopsis":"Let's create a simple controller so you can see it in action. Using your text editor, create a file called blog.lc, and put the following code in it:"},{"slug":"html-table-library","title":"HTML Table Library","date":1458060439592,"synopsis":"The Table Library provides handlers that enable you to auto-generate HTML tables from arrays or database result sets. You can find in a file called Table.lc in the [[revIgnitor Distribution]]."},{"slug":"important","title":"Important","date":1459975749570,"synopsis":"Here we list a number of important considerations."},{"slug":"issue","title":"Issue","date":1458147677831,"synopsis":"Here we list issues to do with the [[Himalayan Academy Web Sites]]."},{"slug":"json-in-post-data","title":"JSON in Post Data","date":1459873554498,"synopsis":"To post JSON send:"},{"slug":"json-rpc","title":"JSON-RPC","date":1459816897297,"synopsis":"JSON-RPC is a remote procedure call protocol encoded in JSON. It is a very simple protocol (and very similar to [[XML-RPC]]), defining only a handful of data types and commands. JSON-RPC allows for notifications (data sent to the server that does not require a response) and for multiple calls to be sent to the server which may be answered out of order - [https://en.wikipedia.org/wiki/Json_Rpc wikipedia]"},{"slug":"libhtmltable","title":"lib_HtmlTable","date":1459869833198,"synopsis":"Need to document this library"},{"slug":"livecode-arrays-in-post-data","title":"LiveCode Arrays in Post Data","date":1459873427679,"synopsis":"You can send LiveCode arrays to revIgniter using [[POST]]. For this to work the following headers must be sent along with the POST data:  [http://revigniter.com/userGuide/libraries/input.html revigniter.com]"},{"slug":"livecode-server-on-digitalocean","title":"Livecode Server on DigitalOcean","date":1435489266925,"synopsis":"The following instructions are thanks to Mike Bonner and describe how to get [[Livecode Server]] running on [[DigitalOcean]]:"},{"slug":"loading-a-view","title":"Loading a View","date":1459811702015,"synopsis":"To load a particular view file you will use the following function:"},{"slug":"loading-multiple-views","title":"Loading multiple views","date":1459811086148,"synopsis":"revIgniter will intelligently handle multiple calls to rigLoadView() from within a controller. If more than one call happens they will be appended together."},{"slug":"nested-views","title":"Nested Views","date":1459811718479,"synopsis":"Multiple views can be loaded sequentially by the controller or, as stated above, nested like in the following sample:"},{"slug":"note","title":"Note","date":1498213043142,"synopsis":"Here we list notes for this site:"},{"slug":"organizing-controllers-into-sub-folders","title":"Organizing Controllers into Sub-folders","date":1498213237620,"synopsis":"If you are building a large application you might find it convenient to organize your controllers into sub-folders. revIgniter permits you to do this."},{"slug":"output-library","title":"Output Library","date":1459809112287,"synopsis":"The Output Library is a small library with one main function: To send the finalized web page to the requesting browser. It is also responsible for caching your web pages, if you use that feature."},{"slug":"passing-uri-segments","title":"Passing URI Segments","date":1459975841334,"synopsis":"If your URI contains more than two segments you can retrieve them using the [[rigFetchSegment]]() function."},{"slug":"private-handlers","title":"Private Handlers","date":1459807674207,"synopsis":"In some cases you may want certain handlers hidden from public access. To make a handler private, simply add an underscore as the name prefix and it will not be served via a URL request."},{"slug":"processing-output","title":"Processing Output","date":1459810842686,"synopsis":"revIgniter has an output library that takes care of sending your final rendered data to the web browser automatically. More information on this can be found in the [[Views]] and [[Output Library]] pages."},{"slug":"querytojson-plugin","title":"QueryToJSON Plugin","date":1459815404232,"synopsis":"The QueryToJSON Plugin file contains a function for converting database query result arrays to the JSON format."},{"slug":"question","title":"Question","date":1458121150657,"synopsis":"Here we list questions that we would like to explore further for the [[Himalayan Academy Web Sites]]."},{"slug":"regular-expressions","title":"Regular Expressions","date":1459796329407,"synopsis":"Here we describe how yo can use regular expressions in revIgniter [[URI Routing]]."},{"slug":"relaxing-the-same-origin-policy","title":"Relaxing the same-origin policy","date":1459816039657,"synopsis":"In some circumstances the same-origin policy is too restrictive, posing problems for large websites that use multiple [[subdomain]]s. Here are some techniques for relaxing it: - [https://en.wikipedia.org/wiki/Same_Origin_policy#Relaxing_the_same-origin_policy wikipedia]"},{"slug":"remapping-handler-calls","title":"Remapping Handler Calls","date":1459807761144,"synopsis":"As noted above, the second segment of the URI typically determines which handler in the controller gets called."},{"slug":"reserved-handler-names","title":"Reserved Handler Names","date":1459807135784,"synopsis":"Since your controller script will extend the main application controller you must be careful not to name your handlers identically to the ones used by that library."},{"slug":"reserved-routes","title":"Reserved Routes","date":1459792772319,"synopsis":"There are three reserved routes: one each for the [[defaultController]], the [[404Override]], and the [[scaffoldingTrigger]]."},{"slug":"returning-views-as-data","title":"Returning Views as Data","date":1459815583678,"synopsis":"There is a second optional parameter which lets you change the behavior of the function so that it returns data as a string rather than sending it to your browser."},{"slug":"revigniter","title":"revIgniter","date":1460494700476,"synopsis":"revIgniter is a toolkit for people who develop web projects using [[LiveCode]].revIgniter is modelled on [[CodeIgniter]] - [http://revigniter.com/userGuide/index.html revigniter.com]"},{"slug":"rigdbjoin","title":"rigDbJoin","date":1459806979609,"synopsis":"A page with 1 items."},{"slug":"rigdbselect","title":"rigDbSelect","date":1459765139580,"synopsis":"Permits you to write the SELECT portion of your query:"},{"slug":"rigenableprofiler","title":"rigEnableProfiler","date":1459809038080,"synopsis":"The rigEnableProfiler command permits you to enable/disable the Profiler, which will display benchmark and other data at the bottom of your pages for debugging and optimization purposes."},{"slug":"rigfetchsegment","title":"rigFetchSegment","date":1459975931386,"synopsis":"A page with 1 items."},{"slug":"riggetfilenames","title":"rigGetFileNames","date":1459903693065,"synopsis":"Reads the specified directory and builds an array containing the filenames. Any sub-folders contained within the specified path are read as well if desired."},{"slug":"riggetoutput","title":"rigGetOutput","date":1459808666011,"synopsis":"The rigGetOutput function permits you to manually retrieve any output that has been sent for storage in the output library."},{"slug":"rigoutputcache","title":"rigOutputCache","date":1459818382951,"synopsis":"The revIgniter [[output library]] also controls caching. For more information, please see the [[Web Page Caching]] page."},{"slug":"rigsetheader","title":"rigSetHeader","date":1459808825582,"synopsis":"The rigSetHeader command permits you to manually set server headers, which the output library will send for you when outputting the final rendered display."},{"slug":"rigsetoutput","title":"rigSetOutput","date":1459808685622,"synopsis":"The rigSetOutput command permits you to manually set the final output string."},{"slug":"rigshow404","title":"rigShow404","date":1459794439957,"synopsis":"This command is similar to the [[rigShowError]] command. However, instead of the standard error template it displays [[404 error]]s."},{"slug":"routeslc","title":"routes.lc","date":1459795918421,"synopsis":"Routing rules are defined in your routes.lc file:"},{"slug":"same-origin-policy","title":"Same-origin policy","date":1459816547327,"synopsis":"In computing, the same-origin policy is an important concept in the web application security model. Under the policy, a web browser permits scripts contained in a first web page to access data in a second web page, but only if both web pages have the same origin. An origin is defined as a combination of URI scheme, hostname, and port number. This policy prevents a malicious script on one page from obtaining access to sensitive data on another web page through that page's Document Object Model - [https://en.wikipedia.org/wiki/Same_Origin_policy wikipedia]"},{"slug":"security-concerns","title":"Security Concerns","date":1459816024873,"synopsis":"The main reason to have this restriction is because without the same-origin policy there would be a security risk  - [https://en.wikipedia.org/wiki/Same_Origin_policy#Security_Concerns wikipedia]"},{"slug":"serverreturnjson","title":"server_ReturnJson","date":1459816952687,"synopsis":"The following handler returns a [[JSON-RPC]] result together with [[CORS]] headers."},{"slug":"storing-views-within-sub-folders","title":"Storing Views within Sub-folders","date":1459810100314,"synopsis":"Your view files can also be stored within sub-folders if you prefer that type of organization. When doing so you will need to include the folder name loading the view."},{"slug":"suggestion","title":"Suggestion","date":1458123119325,"synopsis":"Here we list suggestions and recommendations for the [[Himalayan Academy Web Sites]]."},{"slug":"task","title":"Task","date":1459862790894,"synopsis":"Here we list tasks and to do's for the [[Himalayan Academy Projects]]."},{"slug":"uri-routing","title":"URI Routing","date":1459796367075,"synopsis":"Typically there is a one-to-one relationship between a URL string and its corresponding controller/handler. The segments in a URI normally follow this pattern:"},{"slug":"using-livecode-in-view-files","title":"Using LiveCode in View Files","date":1459859183955,"synopsis":"The data array in [[gData]] is not limited to simple variables. You can use multiple items or multi dimensional arrays, which can be looped to generate multiple rows."},{"slug":"views","title":"Views","date":1459815079237,"synopsis":"A view is simply a web page, or a page fragment, like a header, footer, sidebar, etc. In fact, views can flexibly be embedded within other views (within other views, etc., etc.) if you need this type of hierarchy."},{"slug":"web-page-caching","title":"Web Page Caching","date":1459818337258,"synopsis":"revIgniter lets you cache your pages in order to achieve maximum performance."},{"slug":"welcome-visitors","title":"Welcome Visitors","date":1497988761912,"synopsis":"Welcome to a [[Federated Wiki]] site for [[revIgniter]]. Follow [[Changes to this Site]] or [[Changes to Coding Sites]] to find out what we are [[Currently Working On]]."},{"slug":"wildcards","title":"Wildcards","date":1459796285839,"synopsis":"Here we describe how yo can use wildcards in revIgniter [[URI Routing]]."},{"slug":"workarounds","title":"Workarounds","date":1459816221391,"synopsis":"To enable developers to, in a controlled manner, circumvent the same-origin policy, a number of \"hacks\" such as using the [[fragment identifier]] or the [[window.name]] property have been used to pass data between documents residing in different domains  - [https://en.wikipedia.org/wiki/Same_Origin_policy#Workarounds wikipedia]"}]