[{"slug":"holo-casa-01","title":"Holo Casa 01","date":1522714801486,"synopsis":"Here we record meetings. Our aim is to provide a mechanism for not simply recording minutes, but also for building the commons on the research and ideas discussed in the meeting, and establishing a clear process that helps to [[Turn talk into action]]."},{"slug":"holohouse","title":"Holohouse","date":1522634405845,"synopsis":"A network of coliving and coworking houses with purposes, behaving like co-ops, where you earn in crypto."},{"slug":"julio-monteiro","title":"Julio Monteiro","date":1522688152541,"synopsis":"A page about Julio Monteiro"},{"slug":"kosmos-currency","title":"Kosmos currency","date":1522635564599,"synopsis":"<b>Kosmos</b> (KOS) is the Holohouse network main currency, representing equity of shared ownership of each house/co-op. It's a mutual currency backed by the houses fiat money Reserves. It can be made value-stable if the network spends KOS and Reserve in a responsible and synchronized way."},{"slug":"kudos-currency","title":"Kudos currency","date":1522636633039,"synopsis":"Kudos(KUD) is the reputation mutual currency of the [[Holohouse]] network. Everyone that has an account can issue <b>Feedbacks</b> to another account. This creates a \"credit limit\" that indicated the total KUD an account can hold. The actual KUD can be used to get personal perks, employing the network resources in a transparent way."},{"slug":"liquid-wiki","title":"Liquid Wiki","date":1521753887341,"synopsis":"A key sprint aim of the [[Holo Sprintathon]] week will be to implement a version of Federated Wiki on [[Holo]], which has been christened [[Liquid Wiki]]."},{"slug":"organic-governance","title":"Organic Governance","date":1522678262608,"synopsis":"Consensus building is not agile, takes a lot of time and generates lots of garbage and heartbreak. I am much more confortable with the use of \"Consent\" from Sociocracy/Holacracy, are you familiar with them?"},{"slug":"voz-activity","title":"Voz Activity","date":1522688664019,"synopsis":"View all activity from [[Voz Sites]] listed in the roster below:"},{"slug":"welcome-visitors","title":"Welcome Visitors","date":1522688478236,"synopsis":"This is Julio Monteiro's [[Federated Wiki]] site."}]