[{"slug":"auth0","title":"Auth0","date":1510693514230,"synopsis":"Below are a collection of links imported from [[OneTab]]. You can view these links here - [https://www.one-tab.com/page/n0LoJzNUSv60PNOkmFXwHg one-tab.com]:"},{"slug":"byzantine-fault-tolerance","title":"Byzantine fault tolerance","date":1466345025102,"synopsis":"In fault-tolerant computer systems, and in particular distributed computing systems, Byzantine fault tolerance is the characteristic of a system that tolerates the class of failures known as the Byzantine Generals' Problem, which is a generalized version of the Two Generals' Problem - for which there is an unsolvability proof - [https://en.wikipedia.org/wiki/Byzantine_fault_tolerance wikipedia]"},{"slug":"capability-url","title":"Capability URL","date":1510693089286,"synopsis":"[[Capability URL]]s grant access to a resource to anyone who has the URL - [https://www.w3.org/TR/capability-urls/ w3.org]"},{"slug":"changes-to-crypto-sites","title":"Changes to Crypto Sites","date":1457725287994,"synopsis":"This page shows [[Recent Changes]] across all [[Crypto Academy Sites]]."},{"slug":"chris-ellis","title":"Chris Ellis","date":1511974895128,"synopsis":"Chris refers to himself as a a possibilitarian and entrepreneurial journalist, currency choice advocate and Bitcoin enthusiast."},{"slug":"claims-based-identity","title":"Claims-based identity","date":1510659245426,"synopsis":"Claims-based identity is a common way for applications to acquire the identity information they need about users inside their organization, in other organizations, and on the Internet. It also provides a consistent approach for applications running on-premises or in the cloud. Claims-based identity abstracts the individual elements of identity and access control into two parts: a notion of claims, and the concept of an issuer or an authority - [https://en.wikipedia.org/wiki/Claims-based_identity wikipedia]"},{"slug":"cryptographic-contracts","title":"Cryptographic Contracts","date":1449192382661,"synopsis":"Examples of Smart Contracts written in [[Solidity]]:"},{"slug":"deip-identity","title":"DEIP Identity","date":1527590878216,"synopsis":"Each identity has attributes:"},{"slug":"digital-authentication","title":"Digital authentication","date":1510658189848,"synopsis":"The authentication of information can pose special problems with electronic communication, such as vulnerability to [[man-in-the-middle attack]]s, whereby a third party taps into the communication stream, and poses as each of the two other communicating parties, in order to intercept information from each.  Extra identity factors can be required to authenticate each party's identity."},{"slug":"discoverable-but-not-obvious","title":"Discoverable but not Obvious","date":1419052811489,"synopsis":"Identity and citation has to be discoverable -- that's part of the deal, the BY in the CC-BY-SA. But it does not follow that citation should be obvious. In fact, there are many reasons to to background citation."},{"slug":"distributed-contracts","title":"Distributed Contracts","date":1424695539222,"synopsis":"A distributed contract is a method to form agreements with people via the block chain."},{"slug":"distributed-ledger","title":"Distributed ledger","date":1518895856672,"synopsis":"Distributed ledgers introduce a revolutionary new capability: non-trusting entities can securely share and trust a database outside their firewalls, without any intermediary or central authority."},{"slug":"diverse-and-personal-context","title":"Diverse and Personal Context","date":1451615490515,"synopsis":"The personal context is naturally diverse. Not banal, but truly diverse. It is rare that we appreciate the reality of the difference between us."},{"slug":"domain-specific-legal-language","title":"Domain Specific Legal Language","date":1511973002676,"synopsis":"[[Liquid Law]] is a [[Domain Specific Legal Language]], that enables the easy and flexible creation of the [[Terms of Reference]] of a legally defined entity to participate in the political process."},{"slug":"federated-identity","title":"Federated identity","date":1510657504948,"synopsis":"A federated identity in information technology is the means of linking a person's electronic identity and attributes, stored across multiple distinct identity management systems - [https://en.wikipedia.org/wiki/Federated_identity wikipedia]"},{"slug":"fedwiki-security","title":"Fedwiki Security","date":1510666405927,"synopsis":"Here we look at issues to do with [[Authentication]] and [[Security]] in Federated Wiki. [[Fedwiki]] currently has a pull-only, one domain-one author philosophy which cuts down on spam."},{"slug":"fedwiki-tools","title":"Fedwiki Tools","date":1511705109115,"synopsis":"Here we list a few tools that are of particular use in managing and creating [[Fedwiki]] content. Check [[Recycled pages]] to find delted pages."},{"slug":"frighteningly-secure-wiki","title":"Frighteningly Secure Wiki","date":1464165086775,"synopsis":"Wiki is an exploration in sharing. We have got a long way in avoiding spam, and related concerns simply by architecting out many of the usual incentives - see [[Wiki Pull Model]]"},{"slug":"higgins-project","title":"Higgins project","date":1510659028033,"synopsis":"Higgins is an open source project dedicated to giving individuals more control over their personal identity, profile and social network data - [https://en.wikipedia.org/wiki/Higgins_project wikipedia]"},{"slug":"identity","title":"Identity","date":1518885283360,"synopsis":"This will be a collection of audio notes on the topic of idenity. Some subtopics below:"},{"slug":"identity-and-provenance","title":"Identity and Provenance","date":1419023873418,"synopsis":"A page with 10 items."},{"slug":"identity-and-provenance-talk-page","title":"Identity and Provenance Talk Page","date":1419008094995,"synopsis":"[[Mike Caulfield]]: Jon, I like this experiment. Of course we'll end up with many different talk pages with 90% overlap, but I think that's OK. I tend to think of conversation here as being like Twitter where it's fine if you see only a portion of the conversation. Forking will always allow you to see what an individual is responding to on a page, which is the main thing."},{"slug":"identity-attributes","title":"Identity attributes","date":1518894819857,"synopsis":"In [[Sovrin]] all identity information is separated into individual [[Identity attributes]], such as birth date, first name, street, pseudonyms, frequent flier numbers, etc."},{"slug":"identity-provider","title":"Identity provider","date":1510659488805,"synopsis":"An identity provider (abbreviated IdP) is a system entity that creates, maintains, and manages identity information for principals while providing authentication services to relying party applications within a federation or distributed network - [https://en.wikipedia.org/wiki/Identity_provider wikipedia]"},{"slug":"imagine-wiki-contracts","title":"Imagine Wiki Contracts","date":1511974780653,"synopsis":"A [[smart contract]] is a set of commitments that are defined in digital form, including the agreement on how contract participants shall fulfill these commitments."},{"slug":"information-card","title":"Information Card","date":1510658943763,"synopsis":"Information Cards are personal digital identities that people can use online, and the key component of Identity Metasystem. Visually, each i-card has a card-shaped picture and a card name associated with it that enable people to organize their digital identities and to easily select one they want to use for any given interaction. The Information Card metaphor is implemented by Identity Selectors like Windows CardSpace, [[DigitalMe]] or [[Higgins Identity Selector]] - [https://en.wikipedia.org/wiki/Information_Card wikipedia]"},{"slug":"json-web-token","title":"JSON Web Token","date":1518885102290,"synopsis":"JSON Web Token (JWT, pronounced jot) is a relatively new token format used in space-constrained environments such as HTTP Authorization headers. JWT is architected as a method for transferring security claims based between parties - [https://en.wikipedia.org/wiki/JSON_Web_Token wikipedia]"},{"slug":"kantara-initiative","title":"Kantara Initiative","date":1510658654364,"synopsis":"Kantara Initiative, Inc. is a 501 c(6) non-profit industry consortium and professional trade association dedicated to advancing technical & legal innovation and trust framework operations related to digital identity management and data privacy - [https://en.wikipedia.org/wiki/Kantara_Initiative wikipedia]"},{"slug":"legal-guardian","title":"Legal guardian","date":1518887080201,"synopsis":"A legal guardian is a person who has the legal authority (and the corresponding duty) to care for the personal and property interests of another person, called a ward. Guardians are typically used in three situations: guardianship for an incapacitated senior (due to old age or infirmity), guardianship for a minor, and guardianship for developmentally disabled adults - [https://en.wikipedia.org/wiki/Legal_guardian wikipedia]"},{"slug":"new-legal-language","title":"New Legal Language","date":1433511805134,"synopsis":"At The Eth Dev Con in 2014, Ethereum was compared to a New Legal Language. Not in a sense that Ethereum platform uses new programming languages such as Serpent and [[Solidity]], but in a sense that the transactions (or contracts) can be used to express value in completely different value systems."},{"slug":"permissioned-blockchain","title":"Permissioned blockchain","date":1518898419846,"synopsis":"A permissioned blockchain restricts the actors who can contribute to the consensus of the system state. In a permissioned blockchain, only a restricted set of users have the rights to validate the block transactions. A permissioned blockchain may also restrict access to approved actors who can create smart contracts."},{"slug":"permissionless-blockchain","title":"Permissionless blockchain","date":1518898435653,"synopsis":"With a permissionless blockchain anyone can join the network, participate in the process of block verification to create consensus and also create smart contracts. A good example of permissionless blockchain is the [[Bitcoin]] and [[Ethereum]] blockchains, where any user can join the network and start mining."},{"slug":"plenum","title":"Plenum","date":1518895325897,"synopsis":"Plenum achieves [[Byzantine fault tolerance]], making [[Sovrin]] robust and highly tamper-resistant. Plenum also leverages advanced elliptic-curve cryptography, digitally signing and encrypting every message, end-to-end, and is more secure than current SSL/TLS protocols."},{"slug":"portable-linked-profile","title":"Portable Linked Profile","date":1432832210305,"synopsis":"Tired of registering on dozens of different web services having to type the same information repeatedly?"},{"slug":"public-key-infrastructure","title":"Public key infrastructure","date":1511961860017,"synopsis":"A public key infrastructure ([[PKI]]) is a set of roles, policies, and procedures needed to create, manage, distribute, use, store, and revoke [[digital certificate]]s and manage public-key encryption - [https://en.wikipedia.org/wiki/Public_key_infrastructure wikipedia]"},{"slug":"security-token-service","title":"Security token service","date":1510659287681,"synopsis":"Security token service (STS) is a cross-platform open standard core component of the OASIS group's WS-Trust web services single sign-on infrastructure framework specification.cf. Within that claims-based identity framework, a secure token service is responsible for issuing, validating, renewing and cancelling security tokens. The tokens issued by security token services can then be used to identify the holder of the token to services that adhere to the WS-Trust standard. Security token service provides the same functionality as OpenID, but unlike OpenID "},{"slug":"self-sovereign-identity-network","title":"Self-sovereign Identity Network","date":1518885202110,"synopsis":"Here we explore what it would take to provide an [[Identity Provider]] for the [[federation]]."},{"slug":"signature-plugin","title":"Signature Plugin","date":1511938516595,"synopsis":"We will try out the plugin here."},{"slug":"single-sign-on","title":"Single sign-on","date":1510657585921,"synopsis":"Single sign-on ([[SSO]]) is a property of access control of multiple related, yet independent, software systems With this property, a user logs in with a single ID and password to gain access to a connected system or systems without using different usernames or passwords, or in some configurations seamlessly sign on at each system. - [https://en.wikipedia.org/wiki/Single_sign-on wikipedia]"},{"slug":"solidity","title":"Solidity","date":1511973426993,"synopsis":"The Solidity Contract-Oriented Programming Language"},{"slug":"solidity-notary-contract","title":"Solidity Notary Contract","date":1449197431883,"synopsis":"Very basic contract for a notary (timestamping system) written as a design suggestion by [https://github.com/Ryanmtate Ryanmtate]"},{"slug":"sovrin","title":"Sovrin","date":1518898659428,"synopsis":"The [[Sovrin Foundation]] is a private-sector, international non-profit that was established to govern the world’s first [[Self-sovereign Identity Network]]."},{"slug":"sovrin-foundation","title":"Sovrin Foundation","date":1510695697232,"synopsis":"The [[Sovrin Foundation]] is a private-sector, international non-profit that was established to govern the world’s first self-sovereign identity (SSI) network."},{"slug":"sovrin-trust-framework","title":"Sovrin Trust Framework","date":1518886947469,"synopsis":"The Trust Framework lays out the purpose of [[Sovrin]] as providing a global public utility for self-sovereign identity that adheres to a set of thirteen principles2:"},{"slug":"sovrin-white-paper","title":"Sovrin White Paper","date":1518886619756,"synopsis":"The following is taken from -"},{"slug":"uport","title":"uPort","date":1518885696902,"synopsis":"uPort gives users direct control of their identity, and developers direct control of how this identity system is integrated. Self-sovereign identity requires an entire ecosystem, so supporting the community building it with us is our #1 priority - [https://www.uport.me/about/  uport.me]"},{"slug":"web-of-trust","title":"Web of trust","date":1518886957947,"synopsis":"In cryptography, a web of trust is a concept used in PGP, GnuPG, and other OpenPGP-compatible systems to establish the authenticity of the binding between a public key and its owner. Its decentralized trust model is an alternative to the centralized trust model of a public key infrastructure (PKI), which relies exclusively on a certificate authority (or a hierarchy of such). As with computer networks, there are many independent webs of trust, and any user (through their identity certificate) can be a part of, and a link between, multiple webs - [https://"},{"slug":"welcome-visitors","title":"Welcome Visitors","date":1518883298673,"synopsis":"Welcome to this [[research project]] about [[Identity]], where we gather notes and research for [[Thought Garden]]."},{"slug":"wiki-identity-provider","title":"Wiki Identity Provider","date":1511963939211,"synopsis":"Here we explore what it would take to provide an [[Identity Provider]] for the [[federation]]."},{"slug":"wikiright","title":"WikiRight","date":1449105150416,"synopsis":"WikiRight is a play on the word Copyright. It doesn't make much sense. But I chose it to name a time stamping system."},{"slug":"world-citizen-workshops","title":"World Citizen Workshops","date":1434820242903,"synopsis":"Blockchain ID is an experimental project started by [https://twitter.com/MrChrisEllis Chris Ellis]"},{"slug":"world-citizenship","title":"World Citizenship","date":1511978350844,"synopsis":"The aim here is to create a flexible decentralised identity which combine elements of [[Blockchain ID]], [[WebID]] and [[Portable Linked Profile]]s."},{"slug":"world-citizenship-project","title":"World Citizenship Project","date":1511974878805,"synopsis":"The goal of this project is to learn and layout a simple process for anyone in the world to create their own Private Passport Service that can be used to validate and prove the existence of other persons using nothing but available tools - [https://github.com/MrChrisJ/World-Citizenship github]"}]