[{"slug":"-tomorrows-world---bbc-radio","title":" Tomorrow’s World - BBC Radio","date":1518879141255,"synopsis":"All around the world, governments are increasingly looking at control of the internet. - [http://www.bbc.co.uk/programmes/p05y10x8 bbc]"},{"slug":"aarons-laws","title":"Aaron's Laws","date":1457794480889,"synopsis":"In 2013, Lessig was appointed as the Roy L. Furman Professor of Law and Leadership; his chair lecture was titled \"Aaron's Laws: Law and Justice in a Digital Age.\" - [http://harvardcrcl.org/a-summary-of-laurence-lessigs-chair-lecture-at-harvard-law-school/ harvardcrcl.org]."},{"slug":"algorithmic-entities","title":"Algorithmic Entities","date":1519757392236,"synopsis":"This Article argues that algorithmic entities (legal entities that have no human controllers, also know as [[DAO]]'s or [[DCO]]'s), greatly exacerbate the threat of artificial intelligence - [https://papers.ssrn.com/sol3/papers.cfm?abstract_id=2954173 ssrn.com]"},{"slug":"algorithmic-entity","title":"Algorithmic Entity","date":1519630387297,"synopsis":"A legal entity is anyone or anything the law recognizes as a legal actor."},{"slug":"artificial-intelligence","title":"Artificial intelligence","date":1519635802479,"synopsis":"Artificial intelligence (AI, also machine intelligence, MI) is intelligence demonstrated by machines, in contrast to the natural intelligence (NI) displayed by humans and other animals. In computer science AI research is defined as the study of \"intelligent agents\": any device that perceives its environment and takes actions that maximize its chance of successfully achieving its goals. Colloquially, the term \"artificial intelligence\" is applied when a machine mimics \"cognitive\" functions that humans associate with other human minds, such as \"learning\" an"},{"slug":"askemos","title":"Askemos","date":1519641526531,"synopsis":"| Ricardian contracts are described as a reification of a Askemos class. || Jörg Wittenberger"},{"slug":"barclays-smart-contract-templates","title":"Barclays' Smart Contract Templates","date":1519641553677,"synopsis":"| Ricardian contracts are described as foundational to \"an agreement whose execution is both automatable and enforceable.\"<br>Further details in Smart Contract Templates: foundations, design landscape and research directions  || Dr Lee Braine"},{"slug":"bullshido","title":"Bullshido","date":1494361728772,"synopsis":"Bullshido is the art of fighting bullshit. Now more than ever we need this. We deserve it to ourselves and our own sense of self-respect, to stand up for the good stuff, the real stuff, and show zero tolerance to BS."},{"slug":"changes-to-the-commons","title":"Changes to the Commons","date":1519638683842,"synopsis":"Commons Sites"},{"slug":"changes-to-this-site","title":"Changes to this Site","date":1434641767059,"synopsis":"Below we list recent changes to this site only without also listing changes from the [[Neighbourhood]]:"},{"slug":"common-land","title":"Common land","date":1457624017655,"synopsis":"Common land is land owned collectively by a number of persons, or by one person, but over which other people have certain traditional rights, such as to allow their livestock to graze upon it, to collect firewood, or to cut turf for fuel - [https://en.wikipedia.org/wiki/Common_land wikipedia]"},{"slug":"common-law","title":"Common law","date":1519637672139,"synopsis":"Common law (also known as judicial precedent or judge-made law, or case law) is that body of law derived from judicial decisions of courts and similar tribunals. The defining characteristic of “common law” is that it arises as precedent. In cases where the parties disagree on what the law is, a common law court looks to past precedential decisions of relevant courts, and synthesizes the principles of those past cases as applicable to the current facts. If a similar dispute has been resolved in the past, the court is usually bound to follow the reasoning "},{"slug":"common-law-algorithm","title":"Common Law Algorithm","date":1519638920618,"synopsis":"The idea here is that we can integrate [[Common Law]] as standardly practiced with an [[Agile Development]] Path which leads to an evolving legally binding software algorithm."},{"slug":"commons-councils","title":"Commons Councils","date":1457614292877,"synopsis":"Some commons are managed by Boards of Conservators ([[Conservators]]) for the wider public benefit."},{"slug":"controls-on-development","title":"Controls on Development","date":1457614068252,"synopsis":"Development of common land is strictly controlled. The government states that common land should be open and accessible to the public, and the law restricts the kind of works that can be carried out on commons."},{"slug":"conversations-across-space","title":"Conversations Across Space","date":1519638296056,"synopsis":"We understand what a conversation is, how it can be conducted. We value good quality conversations that are respectful, in which each party deepens their learning and understanding. Yet we have little idea how to conduct such conversations across space."},{"slug":"copyright-proponents","title":"Copyright proponents","date":1515517555390,"synopsis":"Vocal criticism against the free-culture movement comes from copyright proponents."},{"slug":"copyright-reduction","title":"Copyright Reduction","date":1457783555695,"synopsis":"Stallman has regularly given a talk entitled \"Copyright vs. Community\" where he reviews the state of DRM and names many of the products and corporations which he boycotts."},{"slug":"creative-commons","title":"Creative Commons","date":1516036680830,"synopsis":"Creative Commons (CC) is an American non-profit organization devoted to expanding the range of creative works available for others to build upon legally and to share. The organization has released several copyright-licenses known as Creative Commons licenses free of charge to the public - [https://en.wikipedia.org/wiki/Creative_Commons wikipedia]"},{"slug":"cryptographic-contracts","title":"Cryptographic Contracts","date":1449192382661,"synopsis":"Examples of Smart Contracts written in [[Solidity]]:"},{"slug":"currently-working-on","title":"Currently Working On","date":1457712991166,"synopsis":"Here is a list of [[Recent Changes]] I consider important. View our experiments on the [[Scratch]] page. To clear stuff saved in your browser try [[Local Changes]]."},{"slug":"cyborg-corporations","title":"Cyborg Corporations","date":1519399962832,"synopsis":"Tim O’Reilly says, like an AI gone rogue, somebody planted the idea that shareholder value was the right algorithm, the right thing to be optimizing for. But this wasn’t the way companies acted before. We can plant a different idea. That’s what this political process is about. [https://www.wired.com/story/tim-oreilly-algorithms-have-already-gone-rogue wired]"},{"slug":"dao","title":"DAO","date":1519629399838,"synopsis":"A DAO or [[decentralized autonomous organization]], is an [[algorithmic entity]] that acts in the world much as a legal entity acts, except that it is able to do so without the normal constraints of law, but rather simply by the way the code manages incentives and decisions (cryptocurrencies and votes for instance)."},{"slug":"dao-jurisdiction","title":"DAO Jurisdiction","date":1519633449262,"synopsis":"See - [https://poseidon01.ssrn.com/delivery.php?ID=757114096124124124086089001010095023030092050084043069014030074120089118098115064110018011103047026000040100119122088006126117045037034011050080083094065100089075089043020082071113072006012106017113086069125028089029110111123005071075074002125124001&EXT=pdf pdf]"},{"slug":"decentralized-autonomous-organization","title":"Decentralized autonomous organization","date":1519629487869,"synopsis":"A decentralized autonomous organization ([[DAO]]), sometimes labeled a decentralized autonomous corporation (DAC), is an organization that is run through rules encoded as computer programs called smart contracts. A DAO's financial transaction record and program rules are maintained on a blockchain. The precise legal status of this type of business organization is unclear - [https://en.wikipedia.org/wiki/Decentralized_autonomous_organization wikipedia]"},{"slug":"distributed-contracts","title":"Distributed Contracts","date":1424695539222,"synopsis":"A distributed contract is a method to form agreements with people via the block chain."},{"slug":"entity-law","title":"Entity Law","date":1519636776899,"synopsis":"See - [https://poseidon01.ssrn.com/delivery.php?ID=757114096124124124086089001010095023030092050084043069014030074120089118098115064110018011103047026000040100119122088006126117045037034011050080083094065100089075089043020082071113072006012106017113086069125028089029110111123005071075074002125124001&EXT=pdf pdf]"},{"slug":"eris-legal-markup-elm","title":"Eris Legal Markup (ELM)","date":1424902714232,"synopsis":"Eris Legal Markup is part of Eris' legal compliance strategy: a language and process which allows smart contracts to be legally binding."},{"slug":"ethereum","title":"Ethereum","date":1519629541135,"synopsis":"Ethereum is an open-source, public, blockchain-based distributed computing platform featuring smart contract (scripting) functionality. It provides a decentralized Turing-complete virtual machine, the Ethereum Virtual Machine ([[EVM]]), which can execute scripts using an international network of public nodes."},{"slug":"fencing","title":"Fencing","date":1457624093989,"synopsis":"The act of transferring resources from the commons to purely private ownership is known as ''[[enclosure]]'', or (especially in formal use, and in place names) ''Inclosure''. The [[Inclosure Acts]] were a series of private Acts of Parliament, mainly from about 1750 to 1850, which enclosed large areas of common, especially the arable and haymeadow land and the better pasture land."},{"slug":"free-culture-movement","title":"Free-culture movement","date":1515517567829,"synopsis":"The free-culture movement is a social movement that promotes the freedom to distribute and modify creative works in the form of free content or open content by using the Internet and other forms of media - [https://en.wikipedia.org/wiki/Free-culture_movement wikipedia]"},{"slug":"gnu-general-public-license","title":"GNU General Public License","date":1457782290243,"synopsis":"The GNU General Public License (GNU GPL or GPL) is a widely used free software license, which guarantees end users the freedoms to run, study, share (copy), and modify the software - [https://en.wikipedia.org/wiki/GNU_General_Public_License wikipedia]"},{"slug":"gnu-project","title":"GNU Project","date":1457782852223,"synopsis":"Stallman announced the plan for the [[GNU operating system]] in September 1983 on several [[ARPANET]] mailing lists and [[USENET]].<ref name=\"newunix\"/>"},{"slug":"gplv1","title":"GPLv1","date":1457781982912,"synopsis":"Version 1 of the [[GNU General Public License]] (GPLv1) released on 25 February 1989, prevented what were then the two main ways that software distributors restricted the freedoms that define free software."},{"slug":"gplv2","title":"GPLv2","date":1457782286600,"synopsis":"Version 2 of the [[GNU General Public License]] (GPLv2) was released in June 1991. According to Richard Stallman, the major change in [[GPLv2]] was the [[Liberty or Death]] clause, as he calls it in Section 7."},{"slug":"gplv3","title":"GPLv3","date":1457784616486,"synopsis":"The GPLv3 is the third version of the [[GNU General Public License]]. It comes in two flavours the plain GPLv3 and the [[AGPL]] (Affero GPL). Both licenses were officially released on 29 June 2007 - [http://www.gnu.org/licenses/quick-guide-gplv3.en.html gnu.org]"},{"slug":"intelligence","title":"Intelligence","date":1519630588541,"synopsis":"Intelligence is the ability to acquire and apply knowledge and skills."},{"slug":"law-of-common-land","title":"Law of Common Land","date":1457614822491,"synopsis":"The legal position concerning common land has been confused, but recent legislation has sought to remedy this and remove the legal uncertainties so that commons can be better used and protected."},{"slug":"law-of-the-commons","title":"Law of the Commons","date":1457786849214,"synopsis":"This site is about legal aspects of the [[commons]]."},{"slug":"legal-changes","title":"Legal Changes","date":1519638752164,"synopsis":"Here we list [[Recent Changes]] to [[Legal Sites]]:"},{"slug":"legal-sites","title":"Legal sites","date":1519638662497,"synopsis":"Here we list a number of sites and resources about law. This page helps us track [[Legal Changes]]:"},{"slug":"liquid-law","title":"Liquid Law","date":1511973527276,"synopsis":"[[Liquid Law]] is a [[Domain Specific Legal Language]], that enables the easy and flexible creation of the [[Terms of Reference]] of a legally defined entity to participate in the political process."},{"slug":"live-contracts","title":"Live Contracts","date":1519641619893,"synopsis":"|LegalThings"},{"slug":"microorgs","title":"MicroOrgs","date":1519558477433,"synopsis":"Here we define what we mean by a MicroOrg or \"micro org\". A MicroOrg is a legal organisation that runs a [[microservice]]."},{"slug":"monax","title":"Monax","date":1519641501071,"synopsis":"Monax Industries Limited, known as Monax, is a blockchain and smart contract software technology company founded in 2014. Incorporated as Eris Industries and previously known as Eris, the company changed its name to Monax in October 2016. The firm has offices in London, Berlin, and Connecticut - [https://en.wikipedia.org/wiki/Monax wikipedia]"},{"slug":"nick-szabo","title":"Nick Szabo","date":1519639400800,"synopsis":"Nick Szabo is a computer scientist, legal scholar and cryptographer known for his research in digital contracts and digital currency. He graduated from the University of Washington in 1989 with a degree in computer science. He holds an honorary professorship at the Universidad Francisco Marroquín - [https://en.wikipedia.org/wiki/Nick_Szabo wikipedia]"},{"slug":"oneclick-orgs","title":"OneClick Orgs","date":1519559921144,"synopsis":""},{"slug":"oneclickorgs","title":"OneClickOrgs","date":1519559870187,"synopsis":"One Click Orgs is a social enterprise based in London that provides a range of innovative platforms for democratic membership organisations - [http://www.oneclickorgs.com/ oneclickorgs.com]"},{"slug":"open-content","title":"Open content","date":1515517598262,"synopsis":"Open content is a neologism coined by David Wiley in 1998 which describes a creative work that others can copy or modify freely, without asking for permission. The term evokes the related concept of open-source software. Such content is said to be under an open licence - [https://en.wikipedia.org/wiki/Open_content wikipedia]"},{"slug":"open-source-license","title":"Open-source license","date":1515516320376,"synopsis":"An open-source license is a type of license for computer software and other products that allows the source code, blueprint or design to be used, modified and/or shared under defined terms and conditions - [https://en.wikipedia.org/wiki/Open-source_license wikipedia]"},{"slug":"open-transactions","title":"Open Transactions","date":1519641312143,"synopsis":"\"Open-Transactions implements financial instruments as Ricardian Contracts, which are contracts that can be understood by humans as well as manipulated by software.\" - Chris Odom"},{"slug":"openbazaar","title":"OpenBazaar","date":1519641413272,"synopsis":"OpenBazaar is an open source project developing a protocol for e-commerce transactions in a fully decentralized marketplace. It uses cryptocurrencies as medium of exchange and was inspired by a hackathon project called DarkMarket - [https://en.wikipedia.org/wiki/OpenBazaar wikipedia]"},{"slug":"r3-cev","title":"R3 CEV","date":1519641593771,"synopsis":"([[R3 (company)]])'s Corda"},{"slug":"regulating-algorithmic-entities","title":"Regulating Algorithmic Entities","date":1519634009234,"synopsis":"Essentially four changes in the law would be needed to prevent AEs from existing or control AEs if they existed."},{"slug":"ricardian-contract","title":"Ricardian contract","date":1519641716719,"synopsis":"The Ricardian contract is a method of recording a document as a contract at law, and linking it securely to other systems, such as accounting, for the contract as an issuance of value. It is robust through use of identification by cryptographic hash function, transparent through use of readable text for legal prose and efficient through markup language to extract essential information - [https://en.wikipedia.org/wiki/Ricardian_contract wikipedia]"},{"slug":"ricardian-contract-tools","title":"Ricardian contract tools","date":1519641670927,"synopsis":"There are several explicit extant implementations of the [[Ricardian contract]] design pattern and there are some projects which do so implicitly and others which are heading in that direction."},{"slug":"ricardian-vs-smart-contract","title":"Ricardian vs Smart Contract","date":1519641039195,"synopsis":"[[Smart contract]]s are an abstract concept relating to the automated performance of an already agreed contract, whereas the [[Ricardian contract]] is a design pattern to capture the intent of the agreement of the parties, before its performance - [https://en.wikipedia.org/wiki/Ricardian_contract#Relationship_to_Smart_Contracts wikipedia]"},{"slug":"richard-stallman","title":"Richard Stallman","date":1457782634456,"synopsis":"Richard Stallman (born March 16, 1953), often known by his initials, rms, is a software freedom activist and computer programmer. He campaigns for software to be distributed in a manner such that its users receive the freedoms to use, study, distribute and modify that software - [https://en.wikipedia.org/wiki/Richard_Stallman wikipedia]"},{"slug":"rights-of-common","title":"Rights of Common","date":1457610858198,"synopsis":"COMMON. or right of common, English law. An encorporeal hereditament, which consists in a profit which a man has in the lands of another. 12 S. & R. 32; 10 Wend. R. 647; 11 John. R. 498; 2 Bouv. Inst. 1640, et seq - [http://legal-dictionary.thefreedictionary.com/right+of+common thefreedictionary]"},{"slug":"risk-of-autonomous-entities","title":"Risk of Autonomous Entities","date":1519642077630,"synopsis":"Ward pointed me at a recent article regarding [[algorithmic entities]]. It's the first academic paper i've read on the subject specifically. It's important in terms of raising the issue of the relationship between [[artificial intelligence]], law, and [[smart contracts]]."},{"slug":"risk-to-humanity","title":"Risk To Humanity","date":1519632833639,"synopsis":"The following is taken from Lynn M. LoPucki [[Algorithmic Entities]] - [https://papers.ssrn.com/sol3/papers.cfm?abstract_id=2954173 papers.ssrn.com]"},{"slug":"roadways","title":"Roadways","date":1457614492132,"synopsis":"Commons are often crossed by unfenced public roads, and this leads to another problem on modern pasture commons where grazing survives (or is to be reintroduced)."},{"slug":"rootstrikers","title":"Rootstrikers","date":1457797314583,"synopsis":"Rootstrikers is a self-described nonpartisan grassroots activist organization run by Demand Progress and created by Harvard Law School professor [[Lawrence Lessig]] and political activist Joe Trippi, for the purpose of fighting political corruption in the United States and reducing the role of [[Special Interest Money In Elections]] - [https://en.wikipedia.org/wiki/Rootstrikers wikipedia]"},{"slug":"scotland","title":"Scotland","date":1457623695845,"synopsis":"Commoning has probably existed in Scotland for over a millennium."},{"slug":"smart-contract","title":"Smart contract","date":1519641945243,"synopsis":"A smart contract is a computer protocol intended to digitally facilitate, verify, or enforce the negotiation or performance of a contract. Smart contracts allow the performance of credible transactions without third parties. These transactions are trackable and irreversible. Smart contracts were first proposed by Nick Szabo, who coined the term, in 1994 - [https://en.wikipedia.org/wiki/Smart_contract wikipedia]"},{"slug":"smart-contracts","title":"Smart Contracts","date":1519641912938,"synopsis":"The idea of smart contracts goes way back to 1994. Term coined by cryptographer [[Nick Szabo]], a widely credited with laying the groundwork for bitcoin."},{"slug":"sweden-and-finland","title":"Sweden and Finland","date":1457623969033,"synopsis":"A \"partition unit\" is a [[corporation]] that owns common land. In this case, the land is not state-owned or in joint-ownership under a trust, but is owned by a definite partition unit, a legal [[partnership]] whose partners are the participating individual landowners."},{"slug":"united-states","title":"United States","date":1457623858069,"synopsis":"Common land, an English development, was used in many former British colonies, for example in Ireland and the United States."},{"slug":"welcome-visitors","title":"Welcome Visitors","date":1519753566555,"synopsis":"Here we write about the [[Law of the Commons]]. The focus of the site is on the law in [[England and Wales]], but we link to information about other jurisdictions as we become aware of how they worlk."}]