[{"slug":"decentralised","title":"Decentralised","date":1511712164711,"synopsis":"[[Decentralization]] is the process of distributing or dispersing functions, powers, people or things away from a central location or authority - [https://en.wikipedia.org/wiki/Decentralization wikipedia]"},{"slug":"decentralization","title":"Decentralization","date":1511712149470,"synopsis":"Decentralization is the process of distributing or dispersing functions, powers, people or things away from a central location or authority - [https://en.wikipedia.org/wiki/Decentralization wikipedia]"},{"slug":"deliberation","title":"Deliberation","date":1511785292140,"synopsis":"Deliberation is a process of thoughtfully weighing options, usually prior to voting. Deliberation emphasizes the use of logic and reason as opposed to power-struggle, creativity, or dialog. Group decisions are generally made after deliberation through a vote or consensus of those involved - [https://en.wikipedia.org/wiki/Deliberation wikipedia]"},{"slug":"fedwiki-tools","title":"Fedwiki Tools","date":1511705109115,"synopsis":"Here we list a few tools that are of particular use in managing and creating [[Fedwiki]] content. Check [[Recycled pages]] to find delted pages."},{"slug":"shimer-college","title":"Shimer College","date":1511785268246,"synopsis":"Shimer College (pronounced  ( listen) SHY-mər) was an American Great Books college located initially in Mount Carroll, then Waukegan and finally Chicago, Illinois. Founded in 1853 as the Mt. Carroll Seminary in Mount Carroll, Illinois, the school became affiliated with the University of Chicago and was renamed the Frances Shimer Academy in 1896. It was renamed Shimer College in 1950, when it began offering a four-year curriculum based on the Hutchins Plan of the University of Chicago. Although the University of Chicago parted with Shimer (and the Hutchin"},{"slug":"shimer-college-core-program","title":"Shimer College Core Program","date":1511785379970,"synopsis":"The core curriculum of Shimer College is a sequence of 16 required courses humanities, social sciences, natural sciences, and interdisciplinary studies. \"Basic Studies\" courses are generally taken during the first two years, and \"Advanced Studies\" during the final two years. The \"Advanced Integrative Studies\" courses, numbered are taken in the final year - [https://en.wikipedia.org/wiki/Shimer_College_Core_Program wikipedia]"},{"slug":"welcome-visitors","title":"Welcome Visitors","date":1512038248888,"synopsis":"Here we gather notes and research regarding [[Deliberation]] and argument in a hybrid,"}]