[{"slug":"apparatus","title":"Apparatus","date":1518368115302,"synopsis":"I admire Apparatus which was brought to my attention by Bret Victor, whom I also admire.  Been thinking about how I might connect apparatus to wiki. [https://aprt.us site]"},{"slug":"bret-victor","title":"Bret Victor","date":1518342231615,"synopsis":"Bret Victor is an interface designer, computer scientist, and electrical engineer known for his talks on the future of technology. He currently works as a researcher at Dynamicland - [https://en.wikipedia.org/wiki/Bret_Victor wikipedia]"},{"slug":"bret-victor-quotes","title":"Bret Victor Quotes","date":1518342806863,"synopsis":"Here are some quotes from [[Bret Victor]]:"},{"slug":"bret-victor-the-future-of-programming","title":"Bret Victor The Future of Programming","date":1518342231612,"synopsis":"\"The most dangerous thought you can have as a creative person is to think you know what you're doing.\" Presented at Dropbox's DBX conference on July 9, 2013...- [https://www.youtube.com/watch?v=8pTEmbeENF4 youtube.com]"},{"slug":"c-sharp-programming-language","title":"C Sharp (programming language)","date":1512638833055,"synopsis":"[[C#]] (pronounced as see sharp) is a multi-paradigm programming language encompassing strong typing, imperative, declarative, functional, generic, object-oriented (class-based), and component-oriented programming disciplines."},{"slug":"changes-to-this-site","title":"Changes to this Site","date":1434532209841,"synopsis":"Below we list recent changes to this site only without also listing changes from the [[Neighbourhood]]:"},{"slug":"cinder-programming-library","title":"Cinder (programming library)","date":1520501310989,"synopsis":"Cinder is a programming library, designed to give the C++ language advanced visualization abilities. It was released as a public tool in spring 2010 and can be viewed in many ways as an open-source, C++-based alternative to tools like the Java-based Processing library, Microsoft Silverlight or Adobe Flash - [http://libcinder.org libcinder.org]"},{"slug":"d3","title":"D3","date":1518341365646,"synopsis":"[[D3.js]] (or just D3 for [[Data-Driven Documents]]) is a JavaScript library for producing dynamic, interactive data visualizations in web browsers - [https://en.wikipedia.org/wiki/D3.js wikipedia]"},{"slug":"d3js","title":"D3.js","date":1518341553030,"synopsis":"D3.js (or just [[D3]] for [[Data-Driven Documents]]) is a JavaScript library for producing dynamic, interactive data visualizations in web browsers. It makes use of the widely implemented SVG, HTML5, and CSS standards. It is the successor to the earlier Protovis framework - [https://en.wikipedia.org/wiki/D3.js wikipedia]"},{"slug":"dynamic-conversation","title":"Dynamic Conversation","date":1420604200856,"synopsis":"Conversation becoming an improvised real-time simulation for exploring models of thought."},{"slug":"emscripten","title":"Emscripten","date":1438245082599,"synopsis":"[[Emscripten]] is a source-to-source compiler ([[Transpiler]]), that transforms [[LLVM]] bytecode, typically created by compiling from C or C++, to JavaScript. It produces a subset of [[JavaScript]] known as [[asm.js]] - [https://en.wikipedia.org/wiki/Emscripten wikipedia]"},{"slug":"fedwiki-tools","title":"Fedwiki Tools","date":1511705109115,"synopsis":"Here we list a few tools that are of particular use in managing and creating [[Fedwiki]] content. Check [[Recycled pages]] to find delted pages."},{"slug":"future-of-programming","title":"Future of Programming","date":1475588227371,"synopsis":"Here we collect notes and ideas on the future directions of programming and creating software."},{"slug":"learning-games-and-simulations","title":"Learning Games and Simulations","date":1424003273818,"synopsis":"The ability to track games and simulations is becoming ever more important in [[EdTech]]."},{"slug":"lets-worry-about-the-train","title":"Let's Worry about the Train","date":1491988082606,"synopsis":"After offhand remarks Bret Victor reflects deeply on the climate problem bearing upon us and the many ways that our technological attention could be better spent. [http://worrydream.com/ClimateChange/ site]"},{"slug":"mike-bostock","title":"Mike Bostock","date":1518287107706,"synopsis":"Michael \"Mike\" Bostock is an American computer scientist and data-visualisation specialist. He is noted as one of the key developers of [[D3.js]]. He was also involved in the preceding Protovis framework - [https://en.wikipedia.org/wiki/Mike_Bostock wikipedia]"},{"slug":"new-front-matter-to-science","title":"New Front Matter to Science","date":1449421844643,"synopsis":"Wikipedia as the Front Matter to All Research. A brown bag talk on scholarly citations on Wikipedia with Geoffrey Bilder (CrossRef) and Dario Taraborelli (Wikimedia Foundation)."},{"slug":"observable","title":"Observable","date":1518340441667,"synopsis":"Observable is a new way to write interactive [[simulation]]s in the browser. It looks like a pragmatic, powerful and simple way to implement many of the ideas of [[Bret Victor]] today in a modern web app."},{"slug":"openframeworks","title":"OpenFrameworks","date":1467107105665,"synopsis":"openFrameworks is an open source toolkit designed for \"creative coding\". OpenFrameworks is written in C++ and built on top of OpenGL. It runs on Microsoft Windows, OS X, Linux, iOS, Android and Emscripten - [https://en.wikipedia.org/wiki/Openframeworks wikipedia]"},{"slug":"p5js","title":"p5.js","date":1512650852680,"synopsis":"p5.js looks like an excellent framework and community to work with for building [[simulation]]s into wiki."},{"slug":"permanent-web","title":"Permanent Web","date":1514382010011,"synopsis":"What is the permanent web? Why is it important? Here we have an initial discussion of the permanent web, and how we can start creating it with a mixture of existing technologies."},{"slug":"personal-dynamic-media","title":"Personal Dynamic Media","date":1422911020985,"synopsis":"A term coined by [[Alan Kay]] to describe a way of using computers.  In Early History Of Smalltalk, Alan Kay explains how after seeing Seymour Papert's work with [[Logo Language]] he grew to see personal computing less as a \"personal dynamic vehicle\" and more as a \"personal dynamic medium\".  Instead of the computer being primarily used for its capacity to perform computation, what if it were used as a medium for communication?  Not just as a way for people to send each other text, or pictures, or sound, but as a way to send each other active, \"live\" simu"},{"slug":"polyglot-virtual-machines","title":"Polyglot Virtual Machines","date":1518341875843,"synopsis":"It’s by now a cliché that JS has become the assembly language of the Web. Rather, JS is one syntax for a portable and safe machine language, let’s say. Today I’m pleased to announce that cross-browser work has begun on [[WebAssembly]], a new intermediate representation for safe code on the Web - [https://brendaneich.com/ brendaneich.com]"},{"slug":"processing","title":"Processing","date":1512645590803,"synopsis":"[[Processing (programming language)]] is an open source computer programming language and integrated development environment ([[IDE]]) built for the electronic arts, new media art, and visual design communities with the purpose of teaching the fundamentals of computer programming in a visual context, and to serve as the foundation for electronic sketchbooks - [https://en.wikipedia.org/wiki/Processing_(programming_language) wikipedia]"},{"slug":"processing-programming-language","title":"Processing (programming language)","date":1512645575189,"synopsis":"The project was initiated in 2001 by Casey Reas and Benjamin Fry, both formerly of the Aesthetics and Computation Group at the MIT Media Lab. In 2012, they started the Processing Foundation along with Daniel Shiffman, who joined as a third project lead. Johanna Hedva joined the Foundation in 2014 as Director of Advocacy."},{"slug":"research-activity","title":"Research Activity","date":1512496409447,"synopsis":"On this page you can find [[research groups]] that are working on topics related to the current [[domain]]:"},{"slug":"roleplay-simulation","title":"Roleplay simulation","date":1507038769295,"synopsis":"Roleplay simulation is an experiential learning method in which either amateur or professional roleplayers (also called interactors) improvise with learners as part of a simulated scenario. Roleplay is designed primarily to build first-person experience in a safe and supportive environment. Roleplay is widely acknowledged as a powerful technique across multiple avenues of training and education - [https://en.wikipedia.org/wiki/Roleplay_simulation wikipedia]"},{"slug":"shell-power","title":"Shell Power","date":1520501288802,"synopsis":"Traditional web applications are sandboxed, and unable to leverage the vast array of fast low level code available on the command line. We can securely access this and make ti available in an easy to understand and open way to the author."},{"slug":"simulated-reality","title":"Simulated reality","date":1507109747487,"synopsis":"Simulated reality is the hypothesis that reality could be simulated — for example by computer simulation — to a degree indistinguishable from \"true\" reality. It could contain conscious minds which may or may not be fully aware that they are living inside a simulation. This is quite different from the current, technologically achievable concept of virtual reality. Virtual reality is easily distinguished from the experience of actuality; participants are never in doubt about the nature of what they experience. Simulated reality, by contrast, would be hard "},{"slug":"simulation","title":"Simulation","date":1520501389904,"synopsis":"Simulation is the imitation of the operation of a real-world process or system over time.  We look here at how we might create and include robust simulations in the [[permanent web]]."},{"slug":"sowing-apparatus","title":"Sowing Apparatus","date":1513090626335,"synopsis":"How to connect [[Apparatus]] and wiki?  I find myself stalled in this question.  Here, I write to think as a first tiny step.  Can I build some momentum?"},{"slug":"spatialos","title":"SpatialOS","date":1512638424532,"synopsis":"SpatialOS is an interesting platform with which to consider developing massively scaleable simulations (such as earth or [[Environmental Simulation]]s) that can be developed with tools such as [[Unity 3D]]."},{"slug":"the-humane-representation-of-thought","title":"The Humane Representation of Thought","date":1518342806861,"synopsis":"New representations of thought — written language, mathematical notation, information graphics, etc — have been responsible for some of the most significant leaps in the progress of civilization, by expanding humanity’s collectively-thinkable territory."},{"slug":"time-zone-problems","title":"Time Zone Problems","date":1517029633060,"synopsis":"Time seems really straightforward and turns out not to be."},{"slug":"unity-3d","title":"Unity 3D","date":1512638721431,"synopsis":"The [[Unity (game engine)]] is a cross-platform game engine developed by Unity Technologies, which is primarily used to develop video games and simulations for computers, consoles and mobile devices - [https://unity3d.com/ unity3d.com]"},{"slug":"vega","title":"Vega","date":1455630838022,"synopsis":"Vega is a visualization grammar, a declarative format for creating, saving and sharing interactive visualization designs."},{"slug":"vizzuality","title":"Vizzuality","date":1512495817616,"synopsis":"Below are a collection of links imported from [[OneTab]]. You can view these links here - [https://www.one-tab.com/page/SmFuJZL1T7us_LcI40NA5w one-tab.com]:"},{"slug":"wavefront-obj-file","title":"Wavefront .obj file","date":1512496546455,"synopsis":"OBJ (or .OBJ) is a geometry definition file format first developed by Wavefront Technologies for its Advanced Visualizer animation package. The file format is open and has been adopted by other 3D graphics application vendors - [https://en.wikipedia.org/wiki/Wavefront_.obj_file wikipedia]"},{"slug":"web-components","title":"Web Components","date":1514381985287,"synopsis":"Web Components are a set of features currently being added by the W3C to the HTML and DOM specifications that allow for the creation of reusable widgets or components in web documents and web applications."},{"slug":"web-components-vs-frameworks","title":"Web Components vs Frameworks","date":1514313274237,"synopsis":"Below are a collection of links imported from [[OneTab]]. You can view these links here - [https://www.one-tab.com/page/sJEbpK7qRvWhv8C7iVC-4w one-tab.com]:"},{"slug":"webassembly","title":"WebAssembly","date":1514381958119,"synopsis":"WebAssembly is a new type of code that can be run in modern web browsers — it is a low-level assembly-like language with a compact binary format that runs with near-native performance and provides languages such as C/C++ with a compilation target so that they can run on the web. It is also designed to run alongside JavaScript, allowing both to work together - [https://developer.mozilla.org/en-US/docs/WebAssembly developer.mozilla.org]"},{"slug":"webflow","title":"Webflow","date":1514208341544,"synopsis":"Webflow is a hosted static site design solution that combines the ability to collaborate on pure modern HTML5 [[responsive web design]] with the ability to download the resultant CSS, HTML5 and Javascript for hosting on your own [[static site]]s."},{"slug":"welcome-visitors","title":"Welcome Visitors","date":1525938627559,"synopsis":"Here we gather notes and research regarding the role of [[simulation]] in [[Thought Garden]] and [[Open Think Tank]]s."}]