[{"slug":"292--speech-bubbles-understanding-comics-with-scott-mccloud","title":"292- Speech Bubbles: Understanding Comics with Scott McCloud","date":1516990273312,"synopsis":"Cartoonist and theorist Scott McCloud has been making and thinking about comics for decades."},{"slug":"changes-to-this-site","title":"Changes to this Site","date":1434532209841,"synopsis":"Below we list recent changes to this site only without also listing changes from the [[Neighbourhood]]:"},{"slug":"contemporary-satire","title":"Contemporary satire","date":1509892713469,"synopsis":"Contemporary popular usage of the term \"satire\" is often very imprecise. While satire often uses [[caricature]] and [[parody]], by no means are all uses of these or other humorous devices, satiric. Refer to the careful definition of satire that heads this article."},{"slug":"fedwiki-tools","title":"Fedwiki Tools","date":1449105067435,"synopsis":"Here we list a few tools that are of particular use in managing and creating [[Fedwiki]] content."},{"slug":"humour","title":"Humour","date":1509832908158,"synopsis":"Humour (British English) or humor (American English) is the tendency of particular cognitive experiences to provoke laughter and provide amusement - [https://en.wikipedia.org/wiki/Humour wikipedia]"},{"slug":"i-am-the-machine","title":"I Am The Machine","date":1471522455386,"synopsis":"Here we gather some media and stories about man and machine."},{"slug":"kashchenism","title":"Kashchenism","date":1498196994700,"synopsis":"Kaschenism is a specific style of conversation in forums, blogs, Fido echos, etc. used by some people in Russian FidoNet and Internet. Its main feature is provocativeness and mockery while being formally polite."},{"slug":"osama-bin-laden","title":"Osama bin Laden","date":1509833099748,"synopsis":"Osama bin Laden (March 10, 1957 – May 2, 2011) was the founder of al-Qaeda, the organisation that was responsible for the September 11 attacks on the United States, along with numerous other mass-casualty attacks worldwide. He was a Saudi Arabian, a member of the wealthy bin Laden family, and an ethnic Yemeni Kindite - [https://en.wikipedia.org/wiki/Osama_bin_Laden wikipedia]"},{"slug":"satire","title":"Satire","date":1510757434129,"synopsis":"Satire is a genre of literature, and sometimes graphic and performing arts, in which vices, follies, abuses, and shortcomings are held up to ridicule, ideally with the intent of shaming individuals, corporations, government, or society itself into improvement - [https://en.wikipedia.org/wiki/Satire wikipedia]"},{"slug":"the-satire-paradox","title":"The Satire Paradox","date":1509894329118,"synopsis":"In the political turmoil of the mid-1990s Britain, a brilliant young comic named [[Harry Enfield]] set out to satirize the ideology and politics of Prime Minister Margaret Thatcher."},{"slug":"thought-piece","title":"Thought Piece","date":1513882807326,"synopsis":"Here I'd like to explore the issue of [[long-form writing]] vs [[long-form podcasts]]. What is the mechanism to combine the depth of deliberation these forms enable, with more direct emotionally relevant short-form pieces."},{"slug":"welcome-visitors","title":"Welcome Visitors","date":1513882142274,"synopsis":"Here we gather notes and research regarding the role of comedy and [[humour]] in the way humans convene."}]