[{"slug":"a-fedwiki-room-of-whispers","title":"A FedWiki room of whispers","date":1489688385595,"synopsis":"In any computer history museum, there’s a lot of talks about how to access a media from a decade ago. Is it enough to emulate a machine that doesn’t exist anymore ? Emulators and simulators, we have plenty of. Is there any way to cause any media to be persistent, else than doing a lot and a lot of copies, and keeping track of all those copies ?"},{"slug":"advanced-wiki-nature","title":"Advanced Wiki Nature","date":1519756658815,"synopsis":"The 1995 wiki was recognizably different. Authors collaborating there called this wiki nature. In 2011 we set out to make a work environment that was recognizably wiki but equipped to do data processing. Now we ask, how is that turning out?"},{"slug":"alexandria","title":"Alexandria","date":1497296731498,"synopsis":"The Ancient Library of Alexandria is a perfect, and tragic, example of the problem with centralization. Today’s information architecture is similarly vulnerable because the it’s hub and spoke network relies on centralized hubs to store and distribute information. Decentralized technology eliminates central points of failure - [http://www.alexandria.io/learn/#learn1 alexandria.io]"},{"slug":"alternatives-to-a-foundation","title":"Alternatives to a Foundation","date":1533156945354,"synopsis":"Here we look at alternatives to starting a foundation:"},{"slug":"anthropological-archive","title":"Anthropological Archive","date":1518366097143,"synopsis":"An [[archive]] can be considered as a store of artefacts, whether digital or physical, but here we look to describe something more organic, more \"present\" and evolving in terms of structure, and more psychosocial in terms of content."},{"slug":"anthropology","title":"Anthropology","date":1468758488053,"synopsis":"Anthropology is the study of various aspects of humans within societies of the past and present. Social anthropology and cultural anthropology study the norms and values of societies. Linguistic anthropology studies how language affects social life. Biological or physical anthropology studies the biological development of humans - [https://en.wikipedia.org/wiki/Anthropology wikipedia]"},{"slug":"archive","title":"Archive","date":1512346264277,"synopsis":"An archive is an accumulation of historical records or the physical place they are located. Archives contain primary source documents that have accumulated over the course of an individual or organization's lifetime, and are kept to show the function of that person or organization."},{"slug":"archive-everything","title":"Archive Everything","date":1512346542421,"synopsis":"Here we look at how we might [[archive]] our digital heritage, starting with pragmatic baby steps, but leading towards the vision of the [[Permanent Web]] and the [[Way Back Machine]]."},{"slug":"archive-it","title":"Archive-It","date":1512302779019,"synopsis":"Created in early 2006, [[Archive-It]] is a web archiving subscription service that allows institutions and individuals to build and preserve collections of digital content and create digital archives -"},{"slug":"archived-wiki","title":"Archived Wiki","date":1523443833213,"synopsis":"Here we look at various approached to archiving wiki content. Sites come and go. People lose interest, or let them domains lapse for one reason or other. When this happens we lose this content from the federation - save for those pages you have forked for yourself to your own site."},{"slug":"archivist-manifesto","title":"Archivist Manifesto","date":1533492814893,"synopsis":"There appears to be no publicly available text for thsi manifesto?"},{"slug":"argument-map","title":"Argument map","date":1471262644122,"synopsis":"In informal logic and philosophy, an argument map or argument diagram is a visual representation of the structure of an argument - [https://en.wikipedia.org/wiki/Argument_map wikipedia]"},{"slug":"assets-in-ipfs","title":"Assets in IPFS","date":1502542746242,"synopsis":"We explore distributing assets via a node on localhost. The strategy is to store postcard sized assets in the json along with full resolution content in ipfs. Double-click will retrieve and display the ipfs version."},{"slug":"beyond-the-grave","title":"Beyond the grave","date":1490974969400,"synopsis":"To get things started, Jad ris fascinated by the first paragraph of an article by Mary Roach, in which she makes a bold claim about a daring attempt to provide proof that there is life after death."},{"slug":"bookland","title":"Bookland","date":1496676436679,"synopsis":"[[Bookland]] is a good example of how the automatic clustering and then mapping of relationships can have real significance."},{"slug":"brewster-kahle","title":"Brewster Kahle","date":1512298936812,"synopsis":"Brewster Kahle ( KAYL; born October 22, 1960) is an American computer engineer, Internet entrepreneur, internet activist, advocate of universal access to all knowledge, and digital librarian. Brewster founded the Internet Archive, the Internet Archive Federal Credit Union and Alexa. In 2012 he was inducted into the Internet Hall of Fame for his accomplishments - [https://en.wikipedia.org/wiki/Brewster_Kahle wikipedia]"},{"slug":"browser-based-federation","title":"Browser-based Federation","date":1523465369210,"synopsis":"Pure javascript in the browser, combined with [[CORS]] headers, enables federation of content and services leveraging only the browser."},{"slug":"changes-to-the-future","title":"Changes to the Future","date":1462469434666,"synopsis":"Below we list recent changes from contributors below writing specifically on topics of relevance to the [[Future of the Federation]]:"},{"slug":"changes-to-this-site","title":"Changes to this Site","date":1434532209841,"synopsis":"Below we list recent changes to this site only without also listing changes from the [[Neighbourhood]]:"},{"slug":"chorus-of-voices","title":"Chorus of Voices","date":1489699365142,"synopsis":"Four distinct concerns surface when designing federated wiki based information communities. We identify each and suggest forces that must be resolved before creative collaboration will take place."},{"slug":"client-side-javascript","title":"Client-side Javascript","date":1523452742684,"synopsis":"When writing client-side JavaScript for web sites or applications, you won't go very far before you start to use APIs (which stands for \"Application Programming Interfaces,\" in case you were wondering). They're interfaces for manipulating different aspects of the browser and operating system the site is running on, or even data from other web sites or services. In this module, we will explore what APIs are, and how to use some of the most common APIs you'll come across often in your development work - [https://developer.mozilla.org/en-US/docs/Learn/JavaS"},{"slug":"climate-change-archive","title":"Climate Change Archive","date":1512302363234,"synopsis":"[[Archive-It]] has an existing project to archive environmental work, and a recent call  for community documentation strategy to create a [[Climate Change Archive]]."},{"slug":"collaborative-link","title":"Collaborative Link","date":1494861633502,"synopsis":"The web became more collaborative with wiki's introduction of the [[Internal Link]]. Link names were drawn from a shared space backed up at the time by shared storage. Federated wiki's internal links preserves the shared space but not the shared storage making it the ideal link for the distributed collaborative web."},{"slug":"content","title":"Content","date":1512213285862,"synopsis":"A page with 0 items."},{"slug":"content-overflow","title":"Content Overflow","date":1447639569800,"synopsis":"Joel Spolsky compares the evolution and propagation of content rules on Stack Overflow and Wikipedia in a talk he titled How to Have Nice Things."},{"slug":"conversational-space","title":"Conversational Space","date":1453205784823,"synopsis":"Here we describe the architecture of conversation, in a system or design perspective, not as a singular temporal event but as a network process that occurs across time and space."},{"slug":"copyleft-and-data","title":"Copyleft and Data","date":1475078637966,"synopsis":"Databases are a very poor fit for any licensing scheme, like copyleft, that is intended to encourage use by the entire world but also wants to place requirements on that use. This is because of broken legal systems and the way data is used. Projects considering copyleft, or even mere attribution, for data, should consider other approaches instead. [http://lu.is/blog/2016/09/12/copyleft-and-data-database-law-as-poor-platform/ post]"},{"slug":"cost-of-a-foundation","title":"Cost of a Foundation","date":1533156967952,"synopsis":"The Council on Foundations has developed three basic examples to help you decide whether you can afford paid staff. The scenarios below roughly demonstrate the relationship between asset amounts, grant distribution, and staffing expenses."},{"slug":"dat-vs-ssbc","title":"Dat vs ssbc","date":1510488820250,"synopsis":"This page is about the difeernces between ssbc and dat:"},{"slug":"decentralised-media-commons","title":"Decentralised Media Commons","date":1502550713381,"synopsis":"The Decentralised Media Archive aims to fulfil the same function as [[Wikimedia Commons]] but for the decentralised or permanent web."},{"slug":"decentralised-protocols","title":"Decentralised protocols","date":1523465393680,"synopsis":"Here we review the rapidly expanding ecosystem of decentralised protocols that we can build with. We can use these protocols to create architectures that are p2p or federated, but that do not rely on conventional centralised servers."},{"slug":"decentralised-web","title":"Decentralised Web","date":1466879342905,"synopsis":"A number of projects – such as [[Ethereum]], [[ZeroNet]] and the [[SAFE Network]]—aspire to create ways to build websites and applications that don’t depend on a single server or company to keep running  - [http://www.wired.com/2016/06/inventors-internet-trying-build-truly-permanent-web/ wired.com]"},{"slug":"decentralization","title":"Decentralization","date":1523463389480,"synopsis":"Below are a collection of links imported from [[OneTab]]. You can view these links here - [https://www.one-tab.com/page/zIVVqEU9RNmC3BrJbC7PmA one-tab.com]:"},{"slug":"decentralized-technology","title":"Decentralized Technology","date":1523463885111,"synopsis":"In recent times there has been a lot of interest in building decentralised technologies for the web. historically there have been many such attempts, but the newer technology stacks, thanks in no small part to the perceived success of [[blockchain]] technology, looks particulalry promissing."},{"slug":"decentralized-web-summit","title":"Decentralized Web Summit","date":1466894245205,"synopsis":"The Decentralised Web Summit (I'll use the bad acronym DeWeb for now), is the realisation of the idea for a summit discussed last year with [[Brewster Kahle]] at [[Chaos Communication Camp]]."},{"slug":"decision-making-space","title":"Decision Making Space","date":1491732734008,"synopsis":"A page with 1 items."},{"slug":"demanding-media","title":"Demanding Media","date":1489679340710,"synopsis":"We consider how to collaborate with large image, audio and video recordings. We look especially for ways that our strength, federation, brings something new to each medium."},{"slug":"demographic-data","title":"Demographic Data","date":1509704528778,"synopsis":"Demographic data refers to data that is statistically socio-economic in nature such as population, race, income, education and employment, which represent specific geographic locations and are often associated with time."},{"slug":"demography","title":"Demography","date":1509704461711,"synopsis":"Demography is the statistical study of populations, especially human beings. As a very general science, it can analyze any kind of dynamic living population, i.e., one that changes over time or space (see population dynamics) - [https://en.wikipedia.org/wiki/Demography wikipedia]"},{"slug":"digital-preservation-coalition","title":"Digital Preservation Coalition","date":1512399411870,"synopsis":"Below are a collection of links imported from [[OneTab]]. You can view these links here - [https://www.one-tab.com/page/QdnCqeQHQRWxAj5MF6YJuw one-tab.com]:"},{"slug":"dissertation-over-discourse","title":"Dissertation Over Discourse","date":1426259384403,"synopsis":"A play on words meaning, of course, that [[Document Mode]] is more important than [[Thread Mode]] but suggesting also to put [[Summaries On Top Discussion Below]]."},{"slug":"distributed-assets","title":"Distributed Assets","date":1511696275413,"synopsis":"We'd like to share large files with the same semantics as wiki pages. We can assume that they are too large to pass through the browser's GET and PUT as synchronous operations."},{"slug":"dkr","title":"DKR","date":1519757250272,"synopsis":"A dynamic knowledge repository is a living, breathing, rapidly evolving repository of all the stuff accumulating moment to moment throughout the life of a project or pursuit - [http://www.dougengelbart.org/about/dkrs.html dougengelbart.org]"},{"slug":"dna-hard-drives","title":"DNA Hard Drives","date":1512243350870,"synopsis":"This talk at the [[World Economic Forum]] explores long term archiving of information using DNA. These [[DNA Hard Drives]] are very compact, and reliable - but recording information onto them remains expensive."},{"slug":"documentary-research-archive","title":"Documentary Research Archive","date":1496588090506,"synopsis":"While researching a subject for a documentary or podcast we inevitably create an archive."},{"slug":"drawing-graphs-as-maps","title":"Drawing Graphs as Maps","date":1496676561923,"synopsis":"The visualisation of complex multidimensional relationships as geographic maps is a powerful way to combine notions of clustering and topological relationships in an intuitive and playful way."},{"slug":"dreamfactory","title":"DreamFactory","date":1517411475370,"synopsis":"Here we look at installing DreamFactory on [[DigitalOcean]] servers. Essentially the main purpose of DreamFactory is to make it easy to provide and manage a [[REST Gateway]] that can act as a proxy to a wide range of [[microservices]]."},{"slug":"dreamfactory-ipfs-service","title":"DreamFactory IPFS Service","date":1502992536734,"synopsis":"The aim here is to have the [[IPFS Daemon]] running on a [[docker]] and serving files from a cloud based data container, using [[DreamFactory]] to wrap this as a service which we can use in apps and manage authentication tokens for."},{"slug":"dreamfactory-wiki","title":"DreamFactory Wiki","date":1503088482614,"synopsis":"So the idea here is to see if we can get [[DreamFactory]] to fulfil the basic [[Fedwiki Server Requirements]], which essentially means serving json files, a favicon and a sitemap via HTTP GET."},{"slug":"dreamfactory-wiki-assets","title":"Dreamfactory Wiki Assets","date":1502543350082,"synopsis":"Here we explore how we will organise media assets in wiki to create our own [[decentralised media commons]] on"},{"slug":"dynamic-knowledge-repository","title":"Dynamic Knowledge Repository","date":1519757202105,"synopsis":"Most people think of a repository as being a static archive of published documents. A dynamic knowledge repository is a living, breathing, rapidly evolving repository of all the stuff accumulating moment to moment throughout the life of a project or pursuit. [http://www.dougengelbart.org/about/dkrs.html page]"},{"slug":"egranary-digital-library","title":"EGranary Digital Library","date":1512346735234,"synopsis":"An [[EGranary Digital Library]] caches educational resources via a local area network in order to reduce connectivity costs in Internet-scarce areas. Most eGranary subscribers do not have an Internet connection, but those who do can open resources up to 5,000 times faster from the eGranary Digital Library - [https://en.m.wikipedia.org/wiki/EGranary_Digital_Library wikipedia]"},{"slug":"emotional-dictionary","title":"Emotional Dictionary","date":1496588005479,"synopsis":"The Emotional Dictionary was a project I started with artist [[Dilek Winchester]] some time around 2001, to create a visual and multimedia dictionary of emotions."},{"slug":"ethical-design-manifesto","title":"Ethical Design Manifesto","date":1491389025730,"synopsis":"The Ethical Design manifesto was written by [[Aral Balkan]] and the Ind.ie team. I am proposing working with this as a guiding principle for the people facing published surface of the [[Anthropological Archive]] and [[Permanent Wiki]]."},{"slug":"evolutionary-language","title":"Evolutionary Language","date":1509727428874,"synopsis":"Here I should start to write and record ideas about what constitutes and \"evolutionary language\" as distinct from other forms of language."},{"slug":"feast","title":"FEAST","date":1489688332296,"synopsis":"[[FEAST]] is a global decentralised conference and music festival, connected by radio. It is a celebration of local culture, with communities connected globally through conversation, sound and music."},{"slug":"feast-activity","title":"FEAST Activity","date":1490975614985,"synopsis":"This form of writing and co-creation that we explore is new. It is an unusual and new way to collaborate, one which encourages us to share our early thoughts as we see them pass from hand to hand. This process we have called before [[Writing With Strangers]]."},{"slug":"federated-architecture","title":"Federated architecture","date":1523462090831,"synopsis":"Federated architecture (FA) is a pattern in enterprise architecture that allows interoperability and information sharing between semi-autonomous de-centrally organized lines of business (LOBs), information technology systems and applications.Architecture areas of concern Organisational architecture"},{"slug":"federated-servers","title":"Federated servers","date":1523465377616,"synopsis":"Federated servers are a tried and tested basis for decentralised cooperation on the internet. Email is the classic example of such a federated architecture. Federated wiki reinvents this federation in a minimal way for web sites. Each minimal wiki-server provides an entry point into the federation, while maintaining only the smallest possible code base, relying instead on [[browser-based federation]] to work it's magic."},{"slug":"federated-wayback-machine","title":"Federated Wayback Machine","date":1502380650312,"synopsis":"A federated-wayback-machine, is a way of archiving all content in the [[Federation]]. JSON from every site would be periodically archived in a decentralised manor."},{"slug":"federation-at-risk","title":"Federation at Risk","date":1512841136761,"synopsis":"We consider the risks of building federated wiki or anything else permanent on something as fragile as information."},{"slug":"fedwiki-media-archive","title":"Fedwiki Media Archive","date":1512346635070,"synopsis":"The aim is to create a decentralised media archive for Fedwiki. This project relates to the [[Permanent Wiki]] project and the aim to create a new [[Microservice Wiki Server]]."},{"slug":"fedwiki-tools","title":"Fedwiki Tools","date":1523477599939,"synopsis":"Here we list a few tools that are of particular use in managing and creating [[Fedwiki]] content. For a full list of transporters navigate to the site below:"},{"slug":"first-photo-of-a-human-being","title":"First Photo of a Human Being","date":1499444314125,"synopsis":"Strange and beautiful. The early photographs needed an exposure time of about seven minutes. So scenes like this, where the streets were teeming with people, would appear deserted. A city of vampires, no one showing in the photographs. Here we see the first photograph of a human being, a person that must have stayed in the same place long enough to be registered."},{"slug":"fork-is-the-new-like","title":"Fork is the New Like","date":1418312729789,"synopsis":"A 'like' is a way of sharing attention with a new work and its author. We consider how federated wiki's 'fork' improves on the 'like' mechanism."},{"slug":"free-knowledge-ecosystem","title":"Free Knowledge Ecosystem","date":1509030935210,"synopsis":"By 2030, Wikimedia will become the essential infrastructure of the ecosystem of free knowledge, and anyone who shares our vision will be able to join us."},{"slug":"future-library","title":"Future Library","date":1453238884617,"synopsis":"Here we begin to describe a [[Library]] project that utilises decentralisation and Fedwiki to create [[Reading And Research Groups]] around real world content."},{"slug":"garden-metaphor","title":"Garden Metaphor","date":1493474888678,"synopsis":"The concept of the [[permanent wiki]] differs from a traditionally organised [[archive]] in that we seek to structure it with a [[garden metaphor]]."},{"slug":"gmap-algorithm","title":"GMap Algorithm","date":1426024628476,"synopsis":"GMap is an algorithm for visualizing graphs as maps. GMap (see also [[GvMap Algorithm]]), is a practical tool for visualizing relational data with geographic-like maps. It aims to capture the underlying structural information, clustering, and neighborhoods of complex data  - [http://www.graphviz.org/Documentation/GHK09.pdf pdf]"},{"slug":"gvmap-algorithm","title":"GvMap Algorithm","date":1426026447772,"synopsis":"GvMap is an algorithm for visualizing graphs as maps. It is part of the [[Graphviz]] library, and was originally called the [[GMap Algorithm]]."},{"slug":"how-deleuzian-concepts-travel","title":"How Deleuzian Concepts Travel","date":1420640243527,"synopsis":"John Rajchman in his book The Deleuze Connections explains how Deleuzian concepts travel:"},{"slug":"how-to-start-a-foundation","title":"How To Start A Foundation","date":1533156958175,"synopsis":"If you want to make a difference in the world in a big way, and you have the money to do it, you might consider starting a private foundation."},{"slug":"i-know-you","title":"I Know You","date":1492327839102,"synopsis":"A chapter in which we make the argument that only deep knowledge based on real [[Factual]] (anthropological) knowledge recorded and transcribed on an anthropological archive (the [[permanent wiki]]), can truly be a basis for knowledge."},{"slug":"idempotence","title":"Idempotence","date":1507308652649,"synopsis":"Idempotence (UK: ; US:  EYE-dəm-POH-təns) is the property of certain operations in mathematics and computer science that they can be applied multiple times without changing the result beyond the initial application. The concept of idempotence arises in a number of places in abstract algebra (in particular, in the theory of projectors and closure operators) and functional programming (in which it is connected to the property of referential transparency) - [https://en.wikipedia.org/wiki/Idempotence wikipedia]"},{"slug":"identity","title":"Identity","date":1497876721042,"synopsis":"Join us in building an open source decentralized identity ecosystem for people, organizations, apps, and devices."},{"slug":"image-assets","title":"Image Assets","date":1511696141256,"synopsis":"We url-encode images dropped on the factory plugin. This captures the sharing dynamics expected of the federation but it doesn't match with current asset practices."},{"slug":"immutable-data","title":"Immutable Data","date":1509704859343,"synopsis":"In object-oriented and functional programming, an [[immutable object]] is an object whose state cannot be modified after it is created."},{"slug":"immutable-object","title":"Immutable object","date":1493479689377,"synopsis":"In object-oriented and functional programming, an immutable object (unchangeable object) is an object whose state cannot be modified after it is created. This is in contrast to a mutable object (changeable object), which can be modified after it is created. In some cases, an object is considered immutable even if some internally used attributes change but the object's state appears to be unchanging from an external point of view. For example, an object that uses memoization to cache the results of expensive computations could still be considered an immut"},{"slug":"incremental-paragraphs","title":"Incremental Paragraphs","date":1420512381493,"synopsis":"A complete thought is more important than a complete sentence. Write to be read in progress. Expect your work to be consumed and discarded before it is finished."},{"slug":"index-of-transporters","title":"Index of Transporters","date":1523461131150,"synopsis":"Here we list important and complex transporters that you may wish to use in more detail than is available through the [[Imagine Transport]]:"},{"slug":"internet-archive","title":"Internet Archive","date":1512298600568,"synopsis":"The Internet Archive is a San Francisco–based nonprofit digital library with the stated mission of \"universal access to all knowledge.\" It provides free public access to collections of digitized materials, including websites, software applications/games, music, movies/videos, moving images, and nearly three million public-domain books. As of October 2016, its collection topped 15 petabytes. In addition to its archiving function, the Archive is an activist organization, advocating for a free and open Internet - [https://en.wikipedia.org/wiki/Internet_Arch"},{"slug":"internet-physics","title":"Internet Physics","date":1492361122303,"synopsis":"Born into the world of space travel and atomic energy it would have been easy to have not noticed two inventions that provide the foundation of our modern world: the laser and the transistor. Eagle and Trinity were spectacular then but now out of reach. Whereas fiber optics and integrated circuits manufactured in phenomenal volume every day touch us far more directly."},{"slug":"interplanetary-file-system","title":"InterPlanetary File System","date":1493402383523,"synopsis":"InterPlanetary File System ([[IPFS]]) is a content-addressable, peer-to-peer hypermedia distribution protocol. Nodes in the IPFS network form a distributed file system. IPFS is an open source project developed by Protocol Labs with help from the open source community. It was initially designed by Juan Benet - [https://en.wikipedia.org/wiki/Interplanetary_file_system wikipedia]"},{"slug":"interwiki-links","title":"Interwiki Links","date":1507292994032,"synopsis":"The wiki-farm scenario I describe could be achieved by manipulating the [[wiki sitemap]] to add interwiki link semantics. I cannot picture this fully without understanding the current [[link logic]], but I expect that it would alter this logic slightly in order to enable interwiki links to be followed if they are contained within a site map."},{"slug":"ipfs","title":"IPFS","date":1474103395161,"synopsis":"IPFS stands for the [[InterPlanetary File System]]. IPFS is a bold attempt at evolving the Internet's infrastructure."},{"slug":"json-pipeline","title":"JSON Pipeline","date":1523465400114,"synopsis":"Both @ (maybe we should call this [[Travelr]]) and the federation as a whole can be considered to be a set of loosely coupled services that consume and produce json. See [[JSON Schema]]."},{"slug":"json-schema","title":"JSON Schema","date":1438562856175,"synopsis":"Here we describe the JSON Schema for a [[Wiki Page]], that is the [[Wiki Page JSON]] that [[Fedwiki Page]]s are built out of. You can see this JSON for any particular page by selecting the JSON link at the bottom of the page."},{"slug":"keep-safe","title":"Keep Safe","date":1498814076960,"synopsis":"We hope you will be collecting the best pages we have to offer and making some of your own to share. We especially want these pages to be something you keep forever. Now let's talk about how that is going to happen."},{"slug":"kenya-national-archives","title":"Kenya National Archives","date":1468653952670,"synopsis":"Kenya National Archives and Documentation Services (KNADS) is situated at the edge of the central business district in downtown Nairobi along Moi Avenue next to Ambassadeur Hotel - [https://en.wikipedia.org/wiki/Kenya_National_Archives wikipedia]"},{"slug":"legacy-and-immortality","title":"Legacy and Immortality","date":1533157801244,"synopsis":"The aim here is to work on a project that create a sustainable archive of cultural and personal conversations and oral histories."},{"slug":"libramatic","title":"Libramatic","date":1512346787757,"synopsis":"Libramatic is a cloud-based library management service provider based in Dublin, Ireland - [https://en.m.wikipedia.org/wiki/Libramatic wikipedia]"},{"slug":"library-of-alexandria","title":"Library of Alexandria","date":1533492846318,"synopsis":"the largest library of the ancient world, located in Alexandria, Egypt"},{"slug":"libre-map-project","title":"Libre Map Project","date":1512297357939,"synopsis":"The Libre Map Project is an online collection of all digital USGS 1:24K scale topographic maps (as well as various other GIS data) covering the United States, available as a free download - [https://en.wikipedia.org/wiki/Libre_Map_Project wikipedia]"},{"slug":"lifeafter","title":"LifeAfter","date":1490976425451,"synopsis":"LifeAfter is a serial fiction podcast from the producers "},{"slug":"link-logic","title":"Link Logic","date":1507293288510,"synopsis":"The [[collaborative link]] is a significant innovation in hypertext thinking. It provides a mechanism for texts to find each other which is engineered from a social perspective rather than a technical or media perspective. Your link finds pages that make contextual sense, rather than a simple fixed reference which takes you to the same place regardless of context."},{"slug":"link-to-neighbors","title":"Link to Neighbors","date":1507217333894,"synopsis":"We consider fine points on the behavior of [[Collaborative Link]] first discussed in chat. [https://matrix.to/#/!ORfrUEFeWFcHAMLFLr:matrix.org/$14966668964452467FFNDZ:matrix.org post]"},{"slug":"linked-data","title":"Linked Data","date":1438328946753,"synopsis":"In the Federation linked-data has then benefit of being able to be aggregated form a range of sources in a manor that is logically consistent and can provide sophisticated processing and reasoning."},{"slug":"machinima-archive","title":"Machinima archive","date":1512297168127,"synopsis":"One of the sub-collections of the Internet Archive's Video Archive is the Machinima Archive. This small section hosts many [[Machinima]] videos (see [[Machinima: Virtual Filmmaking]]). [[Machinima]] is a digital artform in which [[computer games]], [[game engines]] or software engine are used in a sandbox mode like mode to create motion pictures, recreate plays or even publish presentations/keynotes. The archive collects a range of [[Machinima]] films from internet publishers such as Rooster Teeth ([[Rooster Teeth Productions]]) and [[Machinima.com]] as "},{"slug":"mars","title":"Mars","date":1489691727602,"synopsis":"Mars is the fourth planet from the Sun and the second-smallest planet in the Solar System, after Mercury. Named after the Roman god of war, it is often referred to as the \"Red Planet\" because the iron oxide prevalent on its surface gives it a reddish appearance. Mars is a terrestrial planet with a thin atmosphere, having surface features reminiscent both of the impact craters of the Moon and the valleys, deserts, and polar ice caps of Earth - [https://en.wikipedia.org/wiki/Mars wikipedia]"},{"slug":"medium","title":"Medium","date":1510172523403,"synopsis":"Medium is an online publishing platform developed by Evan Williams, and launched in August 2012. It is owned by A Medium Corporation. The platform is an example of social journalism, having a hybrid collection of amateur and professional people and publications, or exclusive blogs or publishers on Medium, and is regularly regarded as a blog host - [https://en.wikipedia.org/wiki/Medium_(website) wikipedia]"},{"slug":"medium-website","title":"Medium (website)","date":1510227060691,"synopsis":"Williams developed Medium as a way to publish writings and documents longer than Twitter's 140-character maximum."},{"slug":"mediums-durability","title":"Medium's Durability","date":1510172339072,"synopsis":"We consider what services must be maintained in order for our links into [[Medium]] to survive. We use Medium the company as an example for any other service offering persistence for creative works."},{"slug":"memetic-writing","title":"Memetic Writing","date":1490202667327,"synopsis":"How do you write differently to capture an idea in a way that it can travel, move, and recombine with other ideas? Here we look at what elements we might combine and technically how we might structure this \"writing\"."},{"slug":"memory-of-the-world","title":"Memory of the World","date":1451325154045,"synopsis":"Public Library is the synergy of two efforts. First, it makes the case for the institution of [[Public Library]] and its principle of universal access to knowledge. Second, it is an exploration and development of distributed internet infrastructure for amateur librarians - [https://events.ccc.de/congress/2015/Fahrplan/events/7279.html events.ccc.de]"},{"slug":"mike-caulfield","title":"Mike Caulfield","date":1523444828081,"synopsis":"Mike Caulfield is director of blended and networked learning at Washington State University Vancouver."},{"slug":"moving-image-collection","title":"Moving image collection","date":1512297103293,"synopsis":"The Internet Archive holds a collection of approximately 3,863 feature films.[https://archive.org/search.php?query=collection%3Afeature_films&sort=-%2Fadditional%2Fitem%2Fdownloads Internet Archive Search: Collection: Feature Films] Additionally, the Internet Archive's Moving Image collection includes: [[newsreel]]s, classic [[cartoon]]s, pro- and anti-war [[propaganda]], The Video Cellar Collection, Skip Elsheimer's \"A.V. Geeks\" collection, early television, and ephemeral material from [[Prelinger Archives]], such as [[advertising]], educational, and in"},{"slug":"nasa-images","title":"NASA Images","date":1512297226729,"synopsis":"The NASA Images archive was created through a Space Act Agreement between the Internet Archive and [[NASA]] to bring public access to NASA's image, video, and audio collections in a single, searchable resource. The IA NASA Images team worked closely with all of the NASA centers to keep adding to the ever-growing collection.[http://nasaimages.org/ NASA Images] The nasaimages.org site launched in July 2008 and had more than 100,000 items online at the end of its hosting in 2012."},{"slug":"norvig-on-data","title":"Norvig on Data","date":1427059163570,"synopsis":"Peter Norvig, et al. \"The Unreasonable Effectiveness of Data\" in IEEE Intelligent Systems (2011) [http://static.googleusercontent.com/media/research.google.com/en/us/pubs/archive/35179.pdf pdf]"},{"slug":"offer-to-the-dkr-implemeters","title":"Offer to the DKR Implemeters","date":1519106777643,"synopsis":"I've offered to combine work I've done and presented in the context of [[Explore DDD 2017]] to the Doug@50 implementers."},{"slug":"one-hour-wikipedia","title":"One Hour Wikipedia","date":1508148812842,"synopsis":"Channeling both Chomsky and Norvig I routinely consult Wikipedia by reading it in its entirety to answer questions no one had thought to pose."},{"slug":"open-data","title":"Open data","date":1509703436559,"synopsis":"Open data is the idea that some data should be freely available to everyone to use and republish as they wish, without restrictions from copyright, patents or other mechanisms of control - [https://en.wikipedia.org/wiki/Open_data wikipedia]"},{"slug":"open-science","title":"Open Science","date":1426176245613,"synopsis":"Open science is the movement to make scientific research, data and dissemination accessible to all levels of an inquiring society, amateur or professional."},{"slug":"open-simulation-archive","title":"Open Simulation Archive","date":1426181466857,"synopsis":"[[Open Simulation Archive]] is an open archive of 3D science models and simulations. This ‚Äúbiomedical 3D warehouse‚Äù would be the science equivalent to Google Warehouse."},{"slug":"outernet","title":"Outernet","date":1512346742621,"synopsis":"Outernet's goal is to provide free access to content from the web through geostationary and Low Earth Orbit satellites, made available effectively to all parts of the world - [https://en.wikipedia.org/wiki/Outernet wikipedia]"},{"slug":"pages-as-public-spaces","title":"Pages as Public Spaces","date":1475589338018,"synopsis":"What I'm trying to do here is to create a rhetorical situation what will help writers get themselves organized and help them create content that can be better built on than we've seen before. The idea of Pages as Public Spaces may or may not work."},{"slug":"palestre","title":"Palestre","date":1496591491517,"synopsis":"Here Collective work about political politics and forms of action"},{"slug":"pandoc","title":"pandoc","date":1512244517364,"synopsis":"Pandoc is an open-source document converter, widely used as a writing tool (especially by scholars) and as a basis for publishing workflows - [https://en.wikipedia.org/wiki/Pandoc wikipedia]"},{"slug":"patent-pool","title":"Patent pool","date":1533322634618,"synopsis":"In patent law, a patent pool is a consortium of at least two companies agreeing to cross-license patents relating to a particular technology. The creation of a patent pool can save patentees and licensees time and money, and, in case of blocking patents, it may also be the only reasonable method for making the invention available to the public. Competition law issues are usually important when a large consortium is formed. - [https://en.wikipedia.org/wiki/Patent_pool wikipedia]"},{"slug":"permanent-activity","title":"Permanent Activity","date":1512399824740,"synopsis":"Here we display all the activity in chronological order (most recent first) for the [[Permanent Web Sites]] below:"},{"slug":"permanent-archive","title":"Permanent Archive","date":1518366273122,"synopsis":"The permanent archive is the immutable aspect of the [[permanent wiki]]. The aim is to create a publishing medium for wiki. It is designed to store immutable assets such as images, video and audio together with standard single page sites, and  finalise json data."},{"slug":"permanent-web","title":"Permanent Web","date":1466863114677,"synopsis":"What is the permanent web? Why is it important? Here we have an initial discussion of the permanent web, and how we can start creating it with a mixture of existing technologies."},{"slug":"permanent-web-activity","title":"Permanent Web Activity","date":1502633612346,"synopsis":"View all activity from [[Permanent Web Sites]] listed in the roster below:"},{"slug":"permanent-web-sites","title":"Permanent Web Sites","date":1512399988758,"synopsis":"Here we list current sites related to [[Permanent Wiki]] and [[Archives]]. See [[Permanent Activity]] for a chronological view of all contributions."},{"slug":"permanent-wiki","title":"Permanent Wiki","date":1512466043729,"synopsis":"The permanent wiki is a project to create a new form of internet publishing that balances the dynamic [[Fluid Nature of Wiki]] with the immutable permanence of the [[Permanent Web]]."},{"slug":"permanent-wiki-folder-structure","title":"Permanent Wiki Folder Structure","date":1503086167186,"synopsis":"A page entitled \"Cats\" is serving a file \"cats.json\" that is constructed out of atomic paragraphs. The file and folder structure can then be a series of IPFS link lists to assemblages of paragraph level items all within a global folder with an IPFS path of the form:"},{"slug":"personatron","title":"Personatron","date":1413864246258,"synopsis":"This command line script simulates users conducting business of one form or another through an instrumented website."},{"slug":"pheromone-of-salvation","title":"Pheromone of Salvation","date":1439111650447,"synopsis":"Mathematical models of natural selection have evolved in the decades I've been reading science, especially models of altruistic behavior as will be required if we are to leave a habitable planet to our grandchildren. What would have to be true of wiki if it were to be important in this cause?"},{"slug":"pigny","title":"Pigny","date":1496580281702,"synopsis":"Pigny is a commune in the Cher department in the Centre region of France - [https://en.wikipedia.org/wiki/Pigny wikipedia]"},{"slug":"project-alexandria","title":"Project Alexandria","date":1512346620444,"synopsis":"[[Project Alexandria]] use [[IPFS]], and [[FileCoin]] as a token layer enabling cryptographic proof of sharing."},{"slug":"read-only-wiki","title":"Read Only Wiki","date":1491140037808,"synopsis":"Here we look at progress towards a version of wiki that is clean, and easy to read - a read-only wiki."},{"slug":"recent-activity","title":"Recent Activity","date":1512213757093,"synopsis":"Here we list views of the activity of groups and individual related to the current project. You may want to keep an eye on:"},{"slug":"reclaiming-servers","title":"Reclaiming Servers","date":1523465384092,"synopsis":"There are several ways of using [[decentralized technology]] to create [[the federation]]. The first and current way that has been prototyped in [[federated wiki]] is to place all the logic in [[client-side javascript]]. Let's call that technique [[browser-based federation]]. The second technique is to federate the servers. We need a new software stack for servers if they are to contribute to the federation."},{"slug":"research-activity","title":"Research Activity","date":1512554033337,"synopsis":"On this page you can find [[research groups]] that are working on topics related to the current [[domain]]:"},{"slug":"research-group-activity","title":"Research Group Activity","date":1512213985276,"synopsis":"This page has been renamed to make it simpler to understand and link into a text that you write. It has been renamed to [[Recent Activity]], the idea being that it is from this page that you can easily dig down into the activities of distinct [[research group]]s in the area of interest to the current site."},{"slug":"research-writing","title":"Research Writing","date":1489700189774,"synopsis":"Research writing is writing that uses evidence (from journals, books, magazines, the Internet, experts, etc.) to persuade or inform an audience about a particular point."},{"slug":"safe-beyond","title":"Safe Beyond","date":1490975346802,"synopsis":"At SafeBeyond we recognize that everyone’s life story is unique and constantly affected by change. That’s why we have created the world’s most advanced ongoing legacy management service - [https://www.safebeyond.com/ safebeyond.com]"},{"slug":"social-chromatography","title":"Social Chromatography","date":1455020717322,"synopsis":"We expect some pages to be more mobile in the federation than others. With statistically significant flows between neighborhoods we will have the opportunity to separate ideas from their carriers based on affinities that we need not know in advance."},{"slug":"the-federation","title":"The Federation","date":1523465171863,"synopsis":"Here we describe the The Federation. We should use this term wisely. It describes quite clearly the social aspects of this project, while also pointing gently towards [[Star Trek]] and the future of the [[Decentralised Web]]."},{"slug":"the-garden-and-the-stream","title":"The Garden and the Stream","date":1443628241987,"synopsis":"A decade and a half ago a set of innovators mapped Usenet and mailing list culture onto the hypertext environment of the web. Many good things resulted, but the cracks in this approach are beginning to show. We propose that an older and alternate approach to conversation, here named The Garden, is required to balance the useful energy of the endless stream of self-assertion we find ourselves in."},{"slug":"the-hypertext-garden","title":"The Hypertext Garden","date":1466754634210,"synopsis":"The original vision of hypertext was textual and timeless. When [[Vannevar Bush]] and [[Ted Nelson]] imagined hypertext, they imagined a conversation between documents, data, and other media, not individual banter. Importantly, additions to the conversation were not conceived of as replies, but as *extensions* of a large static but continuously evolving network of knowledge, one that allowed many different paths."},{"slug":"the-memex","title":"The Memex","date":1489520621094,"synopsis":"Imagined by [[Vannevar Bush]] in [http://www.theatlantic.com/magazine/archive/1945/07/as-we-may-think/303881/ \"As We May Think,\"] in 1945, the memex is a desk-sized scholar workstation containing a microfilm library. Text and images are displayed on two screens, and can be annotated by hand. Most importantly, texts and images can be linked, so that bringing up a text on one screen brings up a linked text on the other. These links can be organized into trails, and the trails shared with others."},{"slug":"the-permanent-federation","title":"The Permanent Federation","date":1466755790382,"synopsis":"Thoughts on the future architecture of a permanent internet archive, and how we can start in small incremental steps."},{"slug":"thought-garden-project-activity","title":"Thought Garden Project Activity","date":1502633753621,"synopsis":"View all activity from the [[Thought Garden Projects]] roster below:"},{"slug":"thought-soup","title":"Thought Soup","date":1420295843598,"synopsis":"We reflect on this happening using the metaphorical model of soup as in primordial soup or even stone soup."},{"slug":"three-layers-of-federation","title":"Three layers of federation","date":1523465359301,"synopsis":"[[The Federation]] can be viewed as an interlocking set of layers that support decentralisation and federation."},{"slug":"topic-maps","title":"Topic Maps","date":1470995202915,"synopsis":"Topic Maps is a standard for the representation and interchange of knowledge, with an emphasis on the findability of information - [https://en.wikipedia.org/wiki/Topic_Maps wikipedia]"},{"slug":"two-sides-of-wiki","title":"Two sides of wiki","date":1522758636454,"synopsis":"I was provoked into writing this following  discussion with [[Dil Green]] about writing in [[Fedwiki]]. His complaint I thought was a bit unfair, but as with any such encounter, it is important to dig deep and not react with easy defensiveness."},{"slug":"urls-not-idempotent","title":"URLs not Idempotent","date":1507294246336,"synopsis":"Here we look at the pros and cons of making links in wiki [[idempotent]] - that is consistent."},{"slug":"user-mode-preeminence","title":"User-mode Preeminence","date":1506939586750,"synopsis":"At the moment Fedwiki is constructed in the interest of the writer, we may even say the advanced writer. Let's call this mode of experience the [[Author Mode]]."},{"slug":"versions-of-media-assets","title":"Versions of Media Assets","date":1518366124357,"synopsis":"Media of any sort (including text and json files), may be available in several formats. This is particularly relevant to media assets such as images of differing resolutions, or videos encoded with different codecs."},{"slug":"vufind","title":"VuFind","date":1512346792562,"synopsis":"VuFind, (not to be confused with Vufind.com a computer vision and interest graph API company), is an open source library search engine that allows users to search and browse beyond the resources of a traditional OPAC. Developed by Villanova University, version 1.0 was released in July 2010 after two years in beta - [https://en.wikipedia.org/wiki/VuFind wikipedia]"},{"slug":"wayback-machine","title":"Wayback Machine","date":1512297795127,"synopsis":"The Wayback Machine is a digital archive of the World Wide Web and other information on the Internet created by the Internet Archive, a nonprofit organization, based in San Francisco, California, United States - [https://en.wikipedia.org/wiki/Wayback_Machine wikipedia]"},{"slug":"web-archive-format","title":"Web Archive Format","date":1497698727314,"synopsis":"What format should we save our data, and code in the Federation? We look for the following properties and qualities for any solution we choose:"},{"slug":"web-archiving","title":"Web archiving","date":1512298156542,"synopsis":"The Internet Archive has capitalized on the popular use of the term \"WABAC Machine ([[WABAC machine]])\" from a segment of the old Rocky and Bullwinkle ([[Rocky and Bullwinkle Show]]) cartoon, and uses the name \"Wayback Machine\" for its service that allows archives of the World Wide Web to be searched and accessed."},{"slug":"welcome-visitors","title":"Welcome Visitors","date":1523465185584,"synopsis":"This site aspires to be a [[Permanent Wiki]]. Here we [[Research]] and [[Write Together]] about the [[permanent web]] and how we may realise such a creature."},{"slug":"wiki-as-flat-json-database","title":"Wiki as flat json database","date":1522853293918,"synopsis":"There is some interest in creating static HTML from a wiki.  Here is a pure javascript proof-of-concept."},{"slug":"wiki-hooks","title":"Wiki Hooks","date":1512304303050,"synopsis":"Wiki hooks are a proposed addition to wiki, which would enable [[transporters]] and built in wiki actions (such as forking) to call external web services."},{"slug":"wikimedia-commons","title":"Wikimedia Commons","date":1489679255605,"synopsis":"Wikimedia Commons (or simply Commons) is an online repository of free-use images, sound, and other media files. It is a project of the Wikimedia Foundation - [https://en.wikipedia.org/wiki/Wikimedia_Commons wikipedia]"},{"slug":"writing-with-strangers","title":"Writing with Strangers","date":1429804097374,"synopsis":"Writing in the presence of rampant forking calls into question [[What it Means to Write]] and how to do it well."}]