[{"slug":"can-web-search-engines-index-wikis","title":"Can Web Search Engines Index Wikis","date":1450361023584,"synopsis":"Conclusion: yes, Web search engines can index wikis. [[Google Loves Wiki]]."},{"slug":"changes-to-this-site","title":"Changes to this Site","date":1434532209841,"synopsis":"Below we list recent changes to this site only without also listing changes from the [[Neighbourhood]]:"},{"slug":"demystifying-seo","title":"Demystifying SEO","date":1422460491177,"synopsis":"Demystifying SEO with experiments."},{"slug":"distributed-graph-search","title":"Distributed Graph Search","date":1450437481137,"synopsis":"A distributed graph search is a search of graph data formats, where the data is not held in a single location, but is distributed across multiple servers."},{"slug":"distributed-hash-table","title":"Distributed Hash Table","date":1450109639796,"synopsis":"A distributed hash table (DHT) is a class of a decentralized distributed system that provides a lookup service similar to a hash table. Any participating node can efficiently retrieve the value associated with a given key. [https://en.wikipedia.org/wiki/Distributed_hash_table wikipedia]"},{"slug":"distributed-search","title":"Distributed Search","date":1472668294697,"synopsis":"Our scraping experience suggests we should distribute the function across all servers and move slowly enough that site owners can direct the spider's progress."},{"slug":"federation-search","title":"Federation Search","date":1458422510523,"synopsis":"Here we list sites in the visible federation that have been changed in a recent six hour period. Click » to add these to your neighborhood. See [[Recent Changes]], [http://search.fed.wiki.org:3030/counts.html plot] [http://search.fed.wiki.org:3030/logs log]"},{"slug":"fedwiki-tools","title":"Fedwiki Tools","date":1502534642551,"synopsis":"Here we list a few tools that are of particular use in managing and creating [[Fedwiki]] content."},{"slug":"filter-bubble","title":"Filter bubble","date":1470048224058,"synopsis":"A filter bubble is a result of a personalized search in which a website algorithm selectively guesses what information a user would like to see based on information about the user (such as location, past click behavior and search history) and, as a result, users become separated from information that disagrees with their viewpoints, effectively isolating them in their own cultural or ideological bubbles. Prime examples are Google Personalized Search results and Facebook's personalized news stream. The term was coined by internet activist Eli Pariser in h"},{"slug":"find-more","title":"Find More","date":1450436872438,"synopsis":"Here we push on an idea that has emerged out of  [[Sorting and Searching]] all of the things on a page. The prototype is the search link in the page footer."},{"slug":"forage-in-the-federation","title":"Forage in the Federation","date":1458118728084,"synopsis":"To [[forage]] is not the same as [[search]], or [[browse]]. It is not viewing [[recent activity]]. It is rather an art which combines many of these in a way which is unique to the individual - it is a way to [[Hunt For Pages]]."},{"slug":"foraging","title":"Foraging","date":1489240046735,"synopsis":"Foraging is searching for wild food resources. This page is where I log my attempts to find food, or places where I may find food in the future."},{"slug":"google-custom-search","title":"Google Custom Search","date":1503061651581,"synopsis":"Google Custom Search is a platform provided by Google that allows web developers to feature specialized information in web searches, refine and categorize queries and create customized search engines, based on Google Search."},{"slug":"graph-database","title":"Graph database","date":1503048933739,"synopsis":"In computing, a graph database is a database that uses graph structures for semantic queries with nodes, edges and properties to represent and store data - [https://en.wikipedia.org/wiki/Graph_Database wikipedia]"},{"slug":"graph-database-research","title":"Graph Database Research","date":1499445398039,"synopsis":"Here we look at how wiki can be used to author, or define a network simply be creating wiki links between pages, or by using a special markup within wiki."},{"slug":"idea-mining","title":"Idea Mining","date":1498778347195,"synopsis":"In \"Idea Mining\" we ask students to extract generalizable ideas, patterns, or data from research they complete, media they watch, or experiments they perform."},{"slug":"incremental-title-search","title":"Incremental Title Search","date":1348091848025,"synopsis":"We'd like to have a search field in the system bar at the bottom of the page. From [https://github.com/WardCunningham/Smallest-Federated-Wiki/issues/70 issue 70]."},{"slug":"linked-custom-search-engine","title":"Linked Custom Search Engine","date":1460207205465,"synopsis":"In a Linked CSE the specification of the search engine is hosted on your website. In a Google Stored CSE the specification is stored at Google."},{"slug":"mdfind","title":"mdfind","date":1471633529341,"synopsis":"mdfind is the built in command line tool that utilises the [[spotlight]] search engine on [[macOS]]. Every Spotlight query is an AND search by default. It is surprisingly powerful."},{"slug":"mendeley","title":"Mendeley","date":1459375190593,"synopsis":"Mendeley is a desktop and web program for managing and sharing research papers, discovering research data and collaborating online. It combines Mendeley Desktop, a PDF and reference management application (available for Windows, OS X and Linux) and Mendeley for Android and iOS, with Mendeley Web, an online social network for researchers - [https://en.wikipedia.org/wiki/Mendeley wikipedia]"},{"slug":"mendeley-suggest","title":"Mendeley Suggest","date":1493305148004,"synopsis":"On our new “Suggest” page you’ll be getting improved article suggestions, driven by four different recommendation algorithms to support different scientific needs: popular, trending, and, relevant to all or recent documents in your library. [http://blog.mendeley.com/academic-features/new-research-features-on-mendeley-com/ post]"},{"slug":"multiway-trees","title":"Multiway Trees","date":1450060768077,"synopsis":"Tree structures lend themselves to external searching, if we choose an appropriate representation for grouped nodes. From Knuth volume 3, section 6.2.4."},{"slug":"portable-linked-profiles","title":"Portable Linked Profiles","date":1426508315282,"synopsis":"Portable Linked Profiles enable individual entities to own their own [[Linked data]] profiles in a standardised way that facilitates matching and searching of skills and services - [https://github.com/hackers4peace/plp-docs github]."},{"slug":"prioritize-search-results","title":"Prioritize Search Results","date":1348091201584,"synopsis":"We'd like to filter and order search results so that we are more likely to find what we need."},{"slug":"saved-search-result","title":"Saved Search Result","date":1491487934091,"synopsis":"We want to render search results in something that looks like a roster except that each flag links to a specific title."},{"slug":"search-box-enhancement","title":"Search Box Enhancement","date":1503060462617,"synopsis":"Here we propose a simple enhancement to how the current search-box works."},{"slug":"search-engines","title":"Search Engines","date":1450361056043,"synopsis":"This year, for the first time, we have enough activity in the federation to make scraping a sound search strategy."},{"slug":"search-findings","title":"Search Findings","date":1449085073384,"synopsis":"Search records new activity found with each scrape of the visible federation. In addition to the web application, these records are available as downloadable files, a trancludable roster and a search api."},{"slug":"search-index","title":"Search Index","date":1457359295890,"synopsis":"We consider how we might index and query multiple sites within a distributed search database routinely hosted in federated wiki page server/editors."},{"slug":"search-index-downloads","title":"Search Index Downloads","date":1448225614169,"synopsis":"We make available the search index as downloadable files in several formats including json objects designed for network graphing."},{"slug":"search-optimized","title":"Search Optimized","date":1474673763852,"synopsis":"I've been writing here long enough to find myself searching for pages I'd written years ago. It is getting easier because I've adopted techniques that make the hunt more effective."},{"slug":"search-plugin","title":"Search Plugin","date":1449084300901,"synopsis":"The search plugin contains a query as its text, performs that query on emit, and reports results in page as flags ordered by the titles that have them."},{"slug":"search-research","title":"Search Research","date":1503059954245,"synopsis":"Here we take a look at options for searching the federation and individual Fedwiki sites."},{"slug":"search-sites","title":"Search Sites","date":1488038428589,"synopsis":"Search looks at the title and first paragraph of all pages in your [[Neighborhood]]. As you browse the federation more sites are added to your neighborhood so search can find more pages."},{"slug":"search-thoughts","title":"Search Thoughts","date":1449571447797,"synopsis":"This page is some initial thoughts and experiments with searching the Federated Wiki sites."},{"slug":"searching-is-not-reading","title":"Searching is not Reading","date":1503060556304,"synopsis":"A concept at the heart of [[Hypertext]] is [[Browsing]] - that is a concept of readability, not simply accessing information. It is interesting to note how far back to the origins of [[Hypertext]] theory this idea goes."},{"slug":"sitemap","title":"Sitemap","date":1452601508209,"synopsis":"The [[Sitemap]] protocol format consists of XML tags. All data values in a Sitemap must be entity-escaped. The file itself must be UTF-8 encoded - [http://www.sitemaps.org/protocol.html sitemaps.org]"},{"slug":"sitemap-scrape-improvements","title":"Sitemap Scrape Improvements","date":1452456277654,"synopsis":"The [[Ruby Sitemap Scrape]] provides the first full text search of the visible federation. We've learned a lot by building this ourselves from grep-like utilities. Here we list todos that have surfaced and been completed."},{"slug":"sorting-and-searching","title":"Sorting and Searching","date":1438233625866,"synopsis":"We have many kinds of things and they can move about. How will we ever find them, make sense of them, see what is missing, wonder at our accomplishment?"},{"slug":"speed-read","title":"Speed Read","date":1446399700275,"synopsis":"Like search, speed read provides an alternate view of a neighborhood. Unlike search, speed read does not assume you are looking for something in particular."},{"slug":"spotlight","title":"Spotlight","date":1471633369794,"synopsis":"Spotlight is a system-wide desktop search feature of Apple's OS X and iOS operating systems - [https://en.wikipedia.org/wiki/Spotlight_(software) wikipedia]"},{"slug":"testing-search-discovery","title":"Testing Search Discovery","date":1492107355360,"synopsis":"Will the scraper find this site? I hope so."},{"slug":"title-search","title":"Title Search","date":1420515443545,"synopsis":"We want to search titles in the vicinity of where we've been reading. Kudos Pete Hodgson for getting this started."},{"slug":"topical-engines","title":"Topical Engines","date":1460207594469,"synopsis":"Topical search engine is an engine that focuses on a particular topic. It covers a part of the whole Web rather than a particular website - this is possible because Google Custom Search allows you to include multiple websites in the same engine. This article discusses some of the interesting techniques for building and maintaining such engines - [https://developers.google.com/custom-search/docs/topical developers.google.com]"},{"slug":"welcome-visitors","title":"Welcome Visitors","date":1503060178513,"synopsis":"Welcome to this [[Federated Wiki]] site about the future of [[The Federation]], and other things I [[enjoy reading]]."},{"slug":"wiki-custom-search-engine","title":"Wiki Custom Search Engine","date":1491769434946,"synopsis":"The [[Wiki Custom Search Engine]] is a [[Topical Search Engine]] created using a Google [[Custom Search Engine]] - [https://cse.google.com/cse/publicurl?cx=004437460006508948617:xrqa9sithze cse.google.com]"},{"slug":"without-a-king","title":"Without a King?","date":1474300236049,"synopsis":"This radiolab.org podcast becomes a discussion of how to freeze search results or any other generated output of lasting value."},{"slug":"zotero","title":"Zotero","date":1459375178516,"synopsis":"Zotero /zoʊˈtɛroʊ/ is free and open-source reference management software to manage bibliographic data and related research materials (such as PDF files). Notable features include web browser integration, online syncing, generation of in-text citations, footnotes and bibliographies, as well as integration with the word processors Microsoft Word, LibreOffice, OpenOffice.org Writer and NeoOffice. It is produced by the Center for History and New Media at George Mason University (GMU) - [https://en.wikipedia.org/wiki/Zotero wikipedia]"}]