[{"slug":"changes-to-this-site","title":"Changes to this Site","date":1434532209841,"synopsis":"Below we list recent changes to this site only without also listing changes from the [[Neighbourhood]]:"},{"slug":"emilia-tognacchini","title":"Emilia Tognacchini","date":1489749073931,"synopsis":"Born in [[Quito]], now lives in London"},{"slug":"emotional-dictionary","title":"Emotional Dictionary","date":1489699604905,"synopsis":"The idea here is to curate a [[radio conference]] on emotions, or emotional health. Can we look at mental health from a positive perspective? Can we explore the diversity of reactions to emotional situations? Let's collect some ideas and research around this subject."},{"slug":"ergot","title":"Ergot","date":1489750204560,"synopsis":"Ergot (pron. /ˈɜːrɡət/ UR-gət) or ergot fungi refers to a group of fungi of the genus Claviceps - [https://en.wikipedia.org/wiki/Ergot wikipedia]"},{"slug":"feast-activity","title":"FEAST Activity","date":1489750389951,"synopsis":"This form of writing and co-creation that we explore is new. It is an unusual and new way to collaborate, one which encourages us to share our early thoughts as we see them pass from hand to hand. This process we have called before [[Writing With Strangers]]."},{"slug":"quito","title":"Quito","date":1489752052213,"synopsis":"Quito (Spanish pronunciation: [ˈkito]) (Quechua: Kitu; Aymara: Kitu), formally San Francisco de Quito, is the capital city of Ecuador, and at an elevation of 2,850 metres (9,350 ft) above sea level, it is the highest official capital city in the world and the one which is closest to the equator. It is located in the Guayllabamba river basin, on the eastern slopes of Pichincha, an active stratovolcano in the Andes mountains. With a population of 2,671,191 according to the last census (2014), Quito is the second most populous city in Ecuador, after Guayaqu"},{"slug":"rye","title":"Rye","date":1489750389957,"synopsis":"Rye (Secale cereale) is a grass grown extensively as a grain, a cover crop and a forage crop. It is a member of the wheat tribe (Triticeae) and is closely related to barley (genus Hordeum) and wheat (Triticum). Rye grain is used for flour, rye bread, rye beer, crisp bread, some whiskeys, some vodkas, and animal fodder. It can also be eaten whole, either as boiled rye berries or by being rolled, similar to rolled oats - [https://en.wikipedia.org/wiki/Rye wikipedia]"},{"slug":"welcome-visitors","title":"Welcome Visitors","date":1489751779612,"synopsis":"[[Emilia Tognacchini]]"}]