[{"slug":"100-years-of-film","title":"100 Years of Film","date":1503314090506,"synopsis":"Here we collect a number of interesting films from the last 100 years of film (and dome earlier). In particular we are interested in films that would be interesting to screen in conjunction with an installation, talk, or live music performance."},{"slug":"a-man-there-was","title":"A Man There Was","date":1503189719205,"synopsis":"A Man There Was (Swedish: Terje Vigen) is a 1917 Swedish drama directed by Victor Sjöström, based on a poem of the same title by Henrik Ibsen. With a budget of SEK 60,000, it was the most expensive Swedish film made up to that point, marking a new direction in Swedish cinema with more funding to fewer films, resulting in more total quality - [https://en.wikipedia.org/wiki/A_Man_There_Was wikipedia]"},{"slug":"a-trip-to-the-moon","title":"A Trip to the Moon","date":1503188239599,"synopsis":"A Trip to the Moon (French: Le Voyage dans la Lune) is a 1902 French silent film directed by [[Georges Méliès]]. Inspired by a wide variety of sources, including Jules Verne's novels From the Earth to the Moon and Around the Moon, the film follows a group of astronomers who travel to the Moon in a cannon-propelled capsule, explore the Moon's surface, escape from an underground group of Selenites (lunar inhabitants), and return to Earth with a captive Selenite - [https://en.wikipedia.org/wiki/A_Trip_to_the_Moon wikipedia]"},{"slug":"american-kinetoscope-company","title":"American Kinetoscope Company","date":1503214887901,"synopsis":"The American Kinetoscope Company was a London based film company set up in 1895."},{"slug":"berlin-biennale","title":"Berlin Biennale","date":1523356333787,"synopsis":"The Berlin Biennale is a contemporary art exhibition, which has been held at various locations in Berlin, Germany, every two to three years since 1998. The curator or curators choose the artists who will participate. After the event became established, annual themes were introduced."},{"slug":"bobs-docs","title":"Bob's Docs","date":1509892006631,"synopsis":"For the month of August, we’ve been running a series of interviews Bob has done with documentary filmmakers. We’ve been calling it “Bob’s Docs,\" and each we’ve week we’ve gone through some of the themes of documentary filmmaking — from the personal journey to the gift of extraordinary access."},{"slug":"britannia-music-hall","title":"Britannia Music Hall","date":1503224632935,"synopsis":"The Britannia Music Hall (also known as The Panopticon or The Britannia Panopticon) in Trongate, Glasgow, Scotland is the oldest surviving music hall in the world - [https://en.wikipedia.org/wiki/Britannia_Music_Hall wikipedia]"},{"slug":"british-rationals","title":"British Rationals","date":1502959240779,"synopsis":"THOUGHT MATTER. The Great British Public are speaking whether you want to hear them or not -"},{"slug":"changes-to-this-site","title":"Changes to this Site","date":1434532209841,"synopsis":"Below we list recent changes to this site only without also listing changes from the [[Neighbourhood]]:"},{"slug":"changes-to-video-sites","title":"Changes To Video Sites","date":1509802716306,"synopsis":"Here we list changes to all the [[Sites About Video]] we know of in the federation:"},{"slug":"collaborative-film-marking","title":"Collaborative film marking","date":1523356150616,"synopsis":"Film, documentary and video production is one area of production that requires sophisticated interdisciplinary collaboration. Here we explore new techniques designed to explore the potential for wider participation in the production process at an international level."},{"slug":"documentary","title":"Documentary","date":1509898064067,"synopsis":"A [[documentary film]] is a nonfictional motion picture intended to document some aspect of reality, primarily for the purposes of instruction, education, or maintaining a historical record - [https://en.wikipedia.org/wiki/Documentary_film wikipedia]"},{"slug":"documentary-film","title":"Documentary film","date":1509890596728,"synopsis":"A documentary film is a nonfictional motion picture intended to document some aspect of reality, primarily for the purposes of instruction, education, or maintaining a historical record - [https://en.wikipedia.org/wiki/Documentary_film wikipedia]"},{"slug":"edward-bernays","title":"Edward Bernays","date":1509899415857,"synopsis":"Edward Louis James Bernays (; German: [bɛɐ̯ˈnaɪs]; November 22, 1891 − March 9, 1995) was an Austrian-American pioneer in the field of public relations and propaganda, referred to in his obituary as \"the father of public relations\". Bernays was named one of the 100 most influential Americans of the 20th century by Life magazine. He was the subject of a full length biography by Larry Tye called The Father of Spin (1999) and later an award-winning 2002 documentary for the BBC by Adam Curtis called The Century of the Self - [https://en.wikipedia.org/wiki/Ed"},{"slug":"feast-film-night","title":"FEAST Film Night","date":1503336991751,"synopsis":"Here we look at ideas for a film night that people can watch at home, with friends and over food:"},{"slug":"fedwiki-tools","title":"Fedwiki Tools","date":1523199212491,"synopsis":"Here we list a few tools that are of particular use in managing and creating [[Fedwiki]] content."},{"slug":"film-club-films","title":"Film Club Films","date":1503094728398,"synopsis":"Below are a collection of links imported from [[OneTab]]. You can view these links here - [https://www.one-tab.com/page/qlWRrEwnQz6eCR6JSeYtaw one-tab.com]:"},{"slug":"films-from-1917","title":"Films from 1917","date":1503189803039,"synopsis":"Here is a selection of films from 1917."},{"slug":"films-of-mitchell--kenyon","title":"Films of Mitchell & Kenyon","date":1503236983896,"synopsis":"Here we have some very old old film footage taken by Mitchell & Kenyon, which was discovered in an old oil drum by a builder doing a shop renovation, what a fantastic find, and all the footage has now been saved for many more generations to watch..."},{"slug":"happiness-machines","title":"Happiness Machines","date":1509899888184,"synopsis":"The story of the relationship between Sigmund Freud and his American nephew, Edward Bernays. Bernays invented the public relations profession in the 1920s and was the first person to take Freud's ideas to manipulate the masses. He showed American corporations how they could make people want things they didn't need by systematically linking mass-produced goods to their unconscious desires."},{"slug":"history-of-early-british-film","title":"History of Early British Film","date":1504631261395,"synopsis":"Here we look at the history of early British Film."},{"slug":"history-of-film","title":"History of film","date":1503214100117,"synopsis":"The history of film began in the 1890s, when motion picture cameras were invented and film production companies started to be established. Because of the limits of technology, films of the 1890s were under a minute long and until 1927 motion pictures were produced without sound."},{"slug":"isnt-life-wonderful","title":"Isn't Life Wonderful","date":1503221668953,"synopsis":"Isn't Life Wonderful? (1924) is a silent film directed by [[D. W. Griffith]] for his company D. W. Griffith Productions, and distributed by United Artists. It was based on the novel by Geoffrey Moss and it went under the alternative title Dawn - [https://en.wikipedia.org/wiki/Isn%27t_Life_Wonderful wikipedia]"},{"slug":"kino-tv","title":"Kino TV","date":1502551978219,"synopsis":"Below are a collection of links imported from [[OneTab]]. You can view these links here - [https://www.one-tab.com/page/wbuf1nbKSW-EjccRyQzlJQ one-tab.com]:"},{"slug":"kinolab-london","title":"KinoLab London","date":1502803878326,"synopsis":"KinoLab London is a collaboration between [[Kino London]] and [[KinoLab]] to create a [[Decentralised Film Festival]]."},{"slug":"le-prince","title":"Le Prince","date":1503317719305,"synopsis":"Le Prince (full name Louis Aime Augustin Le Prince?), patented the world's first single lens motion picture camera was in Leeds, England in 1888."},{"slug":"louis-le-prince","title":"Louis Le Prince","date":1503222966990,"synopsis":"Louis Aimé Augustin Le Prince; 28 August 1841 – vanished 16 September 1890) was a French inventor who shot the first moving pictures on paper film using a single lens camera. He has been heralded as the \"Father of Cinematography\" since 1930 - [https://en.wikipedia.org/wiki/Louis_Le_Prince wikipedia]"},{"slug":"man-walking-around-a-corner","title":"Man Walking Around A Corner","date":1503218199913,"synopsis":"YOUTUBE AWK-ImxF-e4"},{"slug":"mitchell-and-kenyon","title":"Mitchell and Kenyon","date":1503225085187,"synopsis":"The Mitchell & Kenyon film company was a pioneer of early commercial motion pictures based in Blackburn in Lancashire, England at the start of the 20th century. They were originally best known for minor contributions to early fictional narrative film and Boer War dramatisation films, but the discovery in 1994 of a hoard of film negatives led to restoration of the Mitchell & Kenyon Collection, the largest surviving collection of early non-fiction actuality films in the world. This collection provides a fresh view of Edwardian era Britain and is an importa"},{"slug":"policeman-inside-all-our-heads","title":"Policeman Inside All Our Heads","date":1509900300918,"synopsis":"In the 1960s, a radical group of psychotherapists challenged the influence of Freudian ideas in America. They were inspired by the ideas of Wilhelm Reich, a pupil of, who had turned against him and was hated by the Freud family. He believed that the inner self did not need to be repressed and controlled. It should be encouraged to express itself."},{"slug":"projection-mapping","title":"Projection mapping","date":1509800599078,"synopsis":"Projection mapping, also known as video mapping and spatial augmented reality, is a projection technology used to turn objects, often irregularly shaped, into a display surface for video projection - [https://en.wikipedia.org/wiki/Projection_mapping wikipedia]"},{"slug":"research-activity","title":"Research Activity","date":1523355604942,"synopsis":"On this page you can find [[research groups]] that are working on topics related to the current [[domain]]:"},{"slug":"research-group-activity","title":"Research Group Activity","date":1509805020212,"synopsis":"Here we list views of the activity of groups and individual related to the current project. You may want to keep an eye on:"},{"slug":"roundhay-garden-scene","title":"Roundhay Garden Scene","date":1503314107501,"synopsis":"Roundhay Garden Scene is an 1888 short silent actuality film recorded by French inventor [[Louis Le Prince]]. Shot at Oakwood Grange in Roundhay, Leeds in the north of England, it is believed to be the oldest surviving film in existence, as noted by the Guinness Book of Records - [https://en.wikipedia.org/wiki/Roundhay_Garden_Scene wikipedia]"},{"slug":"sipping-wine-in-kettering","title":"Sipping Wine in Kettering","date":1509900467469,"synopsis":"In the 1960s, a radical group of psychotherapists challenged the influence of Freudian ideas in America. They were inspired by the ideas of Wilhelm Reich, a pupil of, who had turned against him and was hated by the Freud family. He believed that the inner self did not need to be repressed and controlled. It should be encouraged to express itself."},{"slug":"the-accordion-player","title":"The Accordion Player","date":1503218142162,"synopsis":"The last remaining film of Le Prince's single-lens camera. The NMPFT has not remastered this film. An amateur remastering of the first 17 frames is ."},{"slug":"the-century-of-the-self","title":"The Century of the Self","date":1509900425245,"synopsis":"The Century of the Self is a 2002 British television documentary series by filmmaker [[Adam Curtis]]. It focuses on the work of psychoanalysts Sigmund Freud and Anna Freud, and PR consultant [[Edward Bernays]] - [https://en.wikipedia.org/wiki/The_Century_of_the_Self wikipedia]"},{"slug":"the-cure-1917-film","title":"The Cure (1917 film)","date":1503189079522,"synopsis":"The Cure is a 1917 short comedy film written and directed by Charlie Chaplin - [https://en.wikipedia.org/wiki/The_Cure_(1917_film) wikipedia]"},{"slug":"the-engineering-of-consent","title":"The Engineering of Consent","date":1509900056580,"synopsis":"This episode explores how those in power in post-war America used Freud's ideas about the unconscious mind to try and control the masses."},{"slug":"the-gulf-between-1917-film","title":"The Gulf Between (1917 film)","date":1503187730769,"synopsis":"The Gulf Between is a 1917 American comedy drama film that was the first motion picture made in Technicolor, the fourth feature-length color movie, and the first feature-length color movie produced in the United States. Today, the film is considered a lost film, with only very short fragments known to survive. These fragments are in the collections of the Margaret Herrick Library, George Eastman House Motion Picture Collection, and the Smithsonian National Museum of American History Photography Department - [https://en.wikipedia.org/wiki/The_Gulf_Between"},{"slug":"the-jazz-singer","title":"The Jazz Singer","date":1503218528227,"synopsis":"The Jazz Singer is a 1927 American musical film. As the first feature-length motion picture with not only a synchronized recorded music score, but also lip-synchronous singing and speech in several isolated sequences, its release heralded the commercial ascendance of sound films and the decline of the silent film era - [https://en.wikipedia.org/wiki/The_Jazz_Singer wikipedia]"},{"slug":"thought-garden-activity","title":"Thought Garden Activity","date":1501864022703,"synopsis":"View all activity from [[Thought Garden Sites]] listed in the roster below:"},{"slug":"thought-garden-events","title":"Thought Garden Events","date":1503336935764,"synopsis":"Here we look to fix down and describe a series of events for September 2017 through to September 2018."},{"slug":"thought-garden-installation","title":"Thought Garden Installation","date":1501844491689,"synopsis":"The [[Thought Garden]] installation is a [[conversational space]] that layers and places sound spatially in order to represent the architecture of the topic presented."},{"slug":"thought-garden-project-activity","title":"Thought Garden Project Activity","date":1502633995899,"synopsis":"View all activity from the [[Thought Garden Projects]] roster below:"},{"slug":"torches-of-freedom","title":"Torches of Freedom","date":1509899391648,"synopsis":"The first campaign succeeded; women smoked more cigarettes; American Tobacco Company brought in more revenue; and Lucky Strikes led the market in growth. But a taboo remained on women smoking in public. Bernays consulted with psychoanalyst  [[Abraham Brill]] , a student of Freud’s, who reported to him that cigarettes represented \"torches of freedom\" for women whose feminine desires were increasingly suppressed by their role in the modern world.<ref>Tye (1998), p. 27–28. \"Bernays understood they were up against a social taboo that cast doubt on the charac"},{"slug":"traffic-crossing-leeds-bridge","title":"Traffic Crossing Leeds Bridge","date":1503217246094,"synopsis":"Leeds Bridge documents [[Traffic Crossing Leeds Bridge]] in Leeds, West Yorkshire, England. Leeds Bridge is believed to be the second film ever made."},{"slug":"uk-public-domain-films","title":"UK Public Domain Films","date":1503095988817,"synopsis":"Below are a collection of links imported from [[OneTab]]. You can view these links here - [https://www.one-tab.com/page/KuID2aimQBKhjm9AkTIDwA one-tab.com]:"},{"slug":"welcome-visitors","title":"Welcome Visitors","date":1523358918467,"synopsis":"Here we gather notes and research regarding film,"},{"slug":"youtube-dl","title":"youtube-dl","date":1511107029511,"synopsis":"youtube-dl is a command-line program to download videos from YouTube.com and a few more sites. It requires the Python interpreter, version 2.6, 2.7, or 3.2+, and it is not platform specific - [https://github.com/rg3/youtube-dl/blob/master/README.md#description gitbub]"}]