[{"slug":"beta-battery","title":"Beta Battery","date":1481899456886,"synopsis":"Amorphous diamond collects energy from carbon-14 reactor waste. Diamond is a semiconductor, and like the operation of a silicon solar panel cell, electric current flows when valence electrons are given enough energy to be promoted into the conduction band. [http://www.electronicsweekly.com/news/research-news/diamond-nuclear-battery-generate-100%CE%BCw-5000-years-2016-12/ post]"},{"slug":"climate-engineering","title":"Climate engineering","date":1472461744325,"synopsis":"Climate engineering, commonly referred to as geoengineering, also known as climate intervention, is the deliberate and large-scale intervention in the Earth’s climatic system with the aim of limiting adverse climate change. Climate engineering is an umbrella term for two types of measures: carbon dioxide removal and solar radiation management. Carbon dioxide removal addresses the cause of climate change by removing one of the greenhouse gases (carbon dioxide) from the atmosphere. Solar radiation management attempts to offset effects of greenhouse gases b"},{"slug":"co-to-fuels-platform","title":"CO₂-to-Fuels Platform","date":1507214850710,"synopsis":"Joule has pioneered a CO₂-to-fuel production platform, effectively reversing combustion through the use of solar energy. Free of feedstock constraints and complex processing, this platform can achieve unrivaled scalability, volumes and costs without the use of any agricultural land, fresh water or crops. [http://www.jouleunlimited.com/ website]"},{"slug":"daisy-world","title":"Daisy World","date":1515840732965,"synopsis":"Daisy World is loosely modelled on [[James Lovelock]]'s [[Daisyworld]], but based in Minecraft where we can make use of the extensive environmental infrastructure of [[Biomes]], [[Plants]] and [[Animals]]."},{"slug":"earths-energy-budget","title":"Earth's energy budget","date":1515840657963,"synopsis":"Earth's energy budget accounts for the energy Earth receives from the Sun. Much of this energy is lost when the earth re-radiates it back into outer space, and the rest of the energy is distributed throughout the five components of Earth's climate system. This system is made up of earth's water, ice, atmosphere, rocky crust, and all living things - [https://en.wikipedia.org/wiki/Earth%27s_energy_budget wikipedia]"},{"slug":"global-solar-budget","title":"Global Solar Budget","date":1497051329489,"synopsis":"The [[earth's energy budget]] is a simple but profoundly important systemic way of viewing [[Global Warming]]. Let's look at the figures:"},{"slug":"global-warming","title":"Global warming","date":1511875419884,"synopsis":"Global warming, also referred to as climate change, is the observed century-scale rise in the average temperature of the Earth's climate system and its related effects. Multiple lines of scientific evidence show that the climate system is warming. Many of the observed changes since the 1950s are unprecedented in the instrumental temperature record which extends back to the mid-19th century, and in paleoclimate proxy records covering thousands of years - [https://en.wikipedia.org/wiki/Global_warming wikipedia]"},{"slug":"plantoid","title":"Plantoid","date":1495234565599,"synopsis":"Below is the original proposal sent to Primavera (and dated) - [https://docs.google.com/document/d/1puG_Pzv7DsP5woNjfrdmGNuCjSxhDLHDRHQavuJcMH4/edit#heading=h.e0d9jhgec6bo docs.google.com]"},{"slug":"solar-energy","title":"Solar Energy","date":1511875748824,"synopsis":"[[Solar power]] is the conversion of energy from sunlight into electricity, either directly using photovoltaics (PV), or indirectly using concentrated solar power. Concentrated solar power systems use lenses or mirrors and tracking systems to focus a large area of sunlight into a small beam. Photovoltaic cells convert light into an electric current using the photovoltaic effect - [https://en.wikipedia.org/wiki/Solar_power wikipedia]"},{"slug":"solar-few","title":"Solar FEW","date":1507214678926,"synopsis":"We propose the utilization of the entire solar spectrum by redirecting solar photons to maximize food, energy, and water (FEW) production from a given land area.  [https://www.nature.com/articles/s41598-017-03437-x nature]"},{"slug":"solar-power","title":"Solar power","date":1507289798373,"synopsis":"Solar power is the conversion of energy from sunlight into electricity, either directly using photovoltaics (PV), or indirectly using concentrated solar power. Concentrated solar power systems use lenses or mirrors and tracking systems to focus a large area of sunlight into a small beam. Photovoltaic cells convert light into an electric current using the photovoltaic effect - [https://en.wikipedia.org/wiki/Solar_power wikipedia]"},{"slug":"suntracker","title":"SunTracker","date":1426944769898,"synopsis":"This\tphysical\tmodel\tsimulates\tthe\tSun’s\ttracks\tacross\tthe\tsky\tat\t"},{"slug":"welcome-visitors","title":"Welcome Visitors","date":1511875567649,"synopsis":"Here we write and research about [[Solar Energy]] as part of the [[Science Commons]]. In particular what we seek to do here is investigate and research the viability of solar technologies, and supporting strategies that support developments in this area."},{"slug":"where-does-solar-power-go","title":"Where does solar power go?","date":1497270673675,"synopsis":"Here we explore the question regarding where energy from the sun, when converted by solar panels, or plants into a useable form of energy on this planet ends up."}]