[{"slug":"abstract","title":"Abstract","date":1506947688006,"synopsis":"In a world that has succeeded in the globalization of financial assets while keeping political rights enclosed to territories, we need to build new models of democratic governance that enable humanity to collaborate and address pressing global issues."},{"slug":"background","title":"Background","date":1506947959098,"synopsis":"We pioneered digital democracy having authored some of the most prominent open source democracy software as ranked by the GitHub community including the original design of DemocracyOS, a simple direct democracy project we created in 2012."},{"slug":"contents","title":"Contents","date":1506947851904,"synopsis":"This text is structured in three parts, each aiming to satisfy a different readership target (and all of whom may reside within the same persona.)"},{"slug":"democracy-earth-contents","title":"Democracy Earth Contents","date":1506944150232,"synopsis":"Below we provide links to all the sections of the original paper:"},{"slug":"legacy","title":"Legacy","date":1506948673471,"synopsis":"We can consider elections implemented by states, provinces and city municipalities as democracies where we are reduced to being passive recipients of a monologue. Citizens are called in-between substantially long periods of time, during elections, to provide a basic input: essentially accept or reject players in the same system. This is the bandwidth of the legacy system that is our so-called modern democracies. Under these systems less than one percent of the population is able to vote on legislation or execute budgets while the rest are legally forced "},{"slug":"manifesto","title":"Manifesto","date":1506948282667,"synopsis":"Current democratic systems governing societies under the territorial domain of Nation-States have grown stagnant in terms of participation and are leading towards increased polarization."},{"slug":"the-social-smart-contract","title":"The Social Smart Contract","date":1506943697131,"synopsis":"An Initial Rights Offering from Democracy Earth Foundation - [http://democracy.earth/ democracy.earth]"},{"slug":"welcome-visitors","title":"Welcome Visitors","date":1506944442108,"synopsis":"This site is a fork of the original paper by [[Democracy Earth]] which you can find over on [https://github.com/DemocracyEarth/paper github]"}]