[{"slug":"about-calculator-plugin","title":"About Calculator Plugin","date":1425394651838,"synopsis":"This calculator showed the feasibility of numerical calculations expressed in an alternate markup. Its derived from an earlier awk script now in coffeescript.  [https://github.com/fedwiki/wiki-plugin-calculator/blob/master/client/calculator.coffee#L11-L26 github]"},{"slug":"add-an-external-link","title":"Add an External Link","date":1423448738866,"synopsis":"External Links are used to provide additional information, context, or citation to a wiki article. Here we talk about when to use external links, and how to add an [[External Link]] to a page."},{"slug":"add-an-image","title":"Add an Image","date":1519649268009,"synopsis":"There are several ways to add images to wiki. The prefered way is to embed them in an HTML element after uploading the image to the assets folder. An older way is to use [[embedded image]]s that are base64 encoded into the page."},{"slug":"add-button","title":"Add Button","date":1423372343390,"synopsis":"The Add Button is used to add new items to a page."},{"slug":"add-weird-characters","title":"Add Weird Characters","date":1426004569133,"synopsis":"Wiki stores text as UTF-8 Unicode characters. You can enter exotic characters using your computer's keyboard extension or by entering HTML entity codes."},{"slug":"all-pages-in-neighborhood","title":"All Pages in Neighborhood","date":1423760208993,"synopsis":"We've talked about the Neighborhood, but have not gone into it in great detail. Here we talk about what the Neighborhood is, and how to list all pages in it."},{"slug":"assignments","title":"Assignments","date":1498779607119,"synopsis":"This is the methodology we'll be using for this Happening."},{"slug":"bookmark-key-pages","title":"Bookmark Key Pages","date":1423508994832,"synopsis":"This really isn't an optional step, although people tend to skip over anything that tells them to bookmark a page. I'm not sure why."},{"slug":"browser-within-a-browser","title":"Browser Within a Browser","date":1423001778774,"synopsis":"Fedwiki (as it stands now) is a \"newer kind of browser inside an older one\" (Ward). It achieves this by using features of HTML 5."},{"slug":"changes-to-this-site","title":"Changes to this Site","date":1499016428941,"synopsis":"Follow  [[Changes to this Site]], or [[Changes to Fedwiki Sites]], to see what we are [[Currently Working On]]. Use [[Fedwiki Tools]] to author new content."},{"slug":"choose-the-right-browser","title":"Choose the Right Browser","date":1423508325183,"synopsis":"Federated Wiki uses fairly advanced HTML to accomplish what it does. In our experience, only Chrome and Firefox provide good experiences."},{"slug":"clean-up-welcome-visitors","title":"Clean up Welcome Visitors","date":1423508920105,"synopsis":"If you are using a site hosted by fedwikihappening.net, we put some extra paragraphs on your Welcome Visitors page."},{"slug":"create-and-claim-a-site","title":"Create and Claim a Site","date":1433840829877,"synopsis":"Down at the bottom of your page (the [[Footer]]) there is a blue button (the [[Login]]). On systems running our Node code, it will say either \"Sign In\" \"Sign Out\" or \"Claim with your Email\"."},{"slug":"currently-working-on","title":"Currently Working On","date":1433841360367,"synopsis":"Here is a list of [[Recent Changes]] I consider important. View our experiments on the [[Scratch]] page. To clear stuff saved in your browser try [[Local Changes]]."},{"slug":"data-not-layout","title":"Data not Layout","date":1423333332525,"synopsis":"Pages are stored on federated wiki sites as JSON, a simple, easily parseable data format. You can see what this format looks like by clicking JSON at the bottom of the page."},{"slug":"delete-page","title":"Delete Page","date":1425291242657,"synopsis":"We've been afraid to support delete because of the ambiguity introduced by having multiple storage locations. Which exactly are you deleting? We've got to decide."},{"slug":"deploying-a-wiki","title":"Deploying a wiki","date":1423239975421,"synopsis":"There are lots of ways to deploy Federated Wiki. Here we are just talking about the easiest way to install the Node version to it's own, otherwise empty, Ubuntu 14.04 VPS from Digital Ocean."},{"slug":"discussion","title":"Discussion","date":1424282331505,"synopsis":"After Sentences About, Idea Mining, and Synthesis, now we talk."},{"slug":"edit-welcome-visitors","title":"Edit Welcome Visitors","date":1423161217592,"synopsis":"Depending on your site's configuration, your Welcome Visitors page will either have two gray boxes on it (underneath Pages About Us and Places Were We Share) or have \"dummy\" text in those areas, such as \"Your Name Here\"."},{"slug":"embed-video","title":"Embed Video","date":1423266509800,"synopsis":"Embedding video is similar to adding an image. Instead of dragging and dropping an image onto [[Factory]], however, you are going to drag and drop a URL."},{"slug":"embedded-image","title":"Embedded Image","date":1519571665295,"synopsis":"To make a embedded image all you need to do is drag the image from your desktop on top of a [[Factory]] and drop it anywhere on the grey area of the Factory."},{"slug":"factory","title":"Factory","date":1423065405243,"synopsis":"A factory is a type of item that is meant to become some other type eventually."},{"slug":"federated-wiki","title":"Federated Wiki","date":1519574767658,"synopsis":"Federated Wiki sites share pages circulating within a creative commons. A single-page browser application can read from many sites at once and save changes in that browser. Users who host their own sites can login there to have their edits shared back to the federation as they edit."},{"slug":"federated-wiki-software","title":"Federated Wiki Software","date":1519574648460,"synopsis":"We publish federated wiki software as a Node.js package ready to run on a variety of platforms. This is usefully run on a personal laptop or an industrial server in the cloud. Most people get started by joining a community and launching sites and/or servers with their help."},{"slug":"federation","title":"Federation","date":1422997537660,"synopsis":"Federation gets title billing in the name. It is one of the key features, but not the only one."},{"slug":"fedwiki","title":"Fedwiki","date":1519573851180,"synopsis":"Fedwiki is the abbreviation we use for a new form of wiki software and wiki writing. It is short for [[Federated Wiki]]."},{"slug":"fedwiki-tools","title":"Fedwiki Tools","date":1500140493229,"synopsis":"Here we list a few tools that are of particular use in managing and creating [[Fedwiki]] content."},{"slug":"foreign-server","title":"Foreign server","date":1519573748644,"synopsis":"A foreign server is another server, a different server from the [[origin server]]."},{"slug":"forking","title":"Forking","date":1422997632140,"synopsis":"Forking is a technical term, derived from the sort of fork in the phrase \"a fork in the road\". It's \"to split off\"."},{"slug":"free-culture-image","title":"Free Culture Image","date":1429352895419,"synopsis":"In order to search for a [[Free Culture]] Image to your page go to [http://images.google.com/advanced_image_search images.google.com]"},{"slug":"frequently-asked-questions","title":"Frequently Asked Questions","date":1496249723981,"synopsis":"As our end user documentation emerges we can expect there to be many questions. We will collect answers here, organize them and then use this to guide improvements."},{"slug":"growth-beyond-requirements","title":"Growth Beyond Requirements","date":1418371036924,"synopsis":"Estimated Percentage of Total Growth from Initial Requirements Until Retirement by Size and Type of Application"},{"slug":"history-travels-with-page","title":"History Travels With Page","date":1423002547061,"synopsis":"Because federated wiki pages travel between servers frequently, we can't rely on the server to maintain page histories. Therefore the history of each federated wiki page travels with each page."},{"slug":"how-to-wiki","title":"How To Wiki","date":1488041103204,"synopsis":"Here we describe how to use the web interface to the federated wiki. Read [[About Federated Wiki]] to learn about the project. If you are just starting to write in your first wiki then read the [[Field Guide to the Federation]]."},{"slug":"idea-mining","title":"Idea Mining","date":1424284339415,"synopsis":"In \"Idea Mining\" we ask students to extract generalizable ideas, patterns, or data from research they complete, media they watch, or experiments they perform."},{"slug":"ideas-of-federated-wiki","title":"Ideas of Federated Wiki","date":1423008702213,"synopsis":"Federated Wiki combines a few powerful, well-chosen ideas. It's helpful to know what these are. Most of these ideas exist someplace else, the particular power is the combination of the ideas in a single environment."},{"slug":"image-transporter","title":"Image Transporter","date":1449085902174,"synopsis":"This service creates wiki pages with images in several forms without loading image data within the page. Use this for large or detailed images that will be stored remotely."},{"slug":"imagine-transport","title":"Imagine Transport","date":1511694803010,"synopsis":"This new transport imports [[Tweet]]s, [[Flickr]] images, [[Pinterest]] pins, web images, research articles, and general web images. It also imports wikipedia articles."},{"slug":"in-a-nutshell","title":"In a Nutshell","date":1423446914649,"synopsis":"Federated Wiki is less like Microsoft Word, and more like Excel."},{"slug":"journal","title":"Journal","date":1488039720389,"synopsis":"A wiki page has a journal that records the history of how the page was made and where it has traveled."},{"slug":"know-possible-traps","title":"Know Possible Traps","date":1423160832532,"synopsis":"Federated Wiki should be regarded as a Developer Release or Technology Preview. Expect certain things to go wrong. Roll with it...."},{"slug":"learn-shift-click-magic","title":"Learn Shift-Click Magic","date":1423420575219,"synopsis":"Modifier keys are used heavily in Federated Wiki. Shift-click is one such modifier key. To use it, hold down your shift key while executing your normal click action."},{"slug":"make-an-encyclopedic-page","title":"Make an Encyclopedic Page","date":1423589608371,"synopsis":"In this activity we will make a simple encyclopedic page."},{"slug":"make-an-index-page","title":"Make an Index Page","date":1423530313650,"synopsis":"Index pages are used as entry points into your site's content. In pedagogical uses of federated wiki it can also function as a portfolio of student work. Here we show you how to make one."},{"slug":"make-your-bio-page","title":"Make Your Bio Page","date":1423177730902,"synopsis":"Your bio page helps users to understand who you are and why you might be running this site. This is how to make one."},{"slug":"molecular-paragraphs","title":"Molecular Paragraphs","date":1423097578257,"synopsis":"In federated wiki the lowly paragraph (and in a broader sense the 'item') has a special place. Paragraphs have their own IDs and edit histories. They are draggable. They can define diferent formats (Markdown, HTML, Plain Text) and still live on the same page."},{"slug":"neighborhood","title":"Neighborhood","date":1519575163091,"synopsis":"The wiki keeps track of sites you visit and sites mentioned on pages you visit on each site. Wiki seeks to know about sites in this collection called a neighborhood."},{"slug":"neighborhood-list","title":"Neighborhood List","date":1501004194509,"synopsis":"A \"neighborhood list'' is a wiki-page (note) that contains a list of references to [[Smallest Federated Wiki]] sites."},{"slug":"orientation","title":"Orientation","date":1519575988223,"synopsis":"[[Fedwiki]] involves ideas and concepts that are not the way the rest of the web you are familiar with works. It takes a little while to get accustomed to our culture, but many find it addictive when it clicks."},{"slug":"origin-server","title":"Origin Server","date":1420512882503,"synopsis":"The server that delivers the client-side javascript that starts you browsing the federated wiki is called the Origin Server. It's special."},{"slug":"parallel-pages","title":"Parallel Pages","date":1423009464173,"synopsis":"We call this idea \"Parallel Pages\" but it's really a bigger idea than that. We just don't have a name for it."},{"slug":"pattern-language","title":"Pattern Language","date":1433841033198,"synopsis":"A page with 1 items."},{"slug":"plast","title":"PLAST","date":1433841181009,"synopsis":"A page with 1 items."},{"slug":"public-side-of-wiki","title":"Public Side of Wiki","date":1512735853725,"synopsis":"Wiki is by nature public. Wiki, you might think is all about sharing freely, and loving the limelight, praising the openess. But this is not so. Wiki has a private side."},{"slug":"read-a-journal-history","title":"Read a Journal History","date":1423600478651,"synopsis":"You've probably noticed (how could you not?) that there are some weird symbols at the bottom of the Federated wiki page. This section is called the [[Journal]] and it can be extremely useful to you. Here's how it works."},{"slug":"remove-pages","title":"Remove Pages","date":1425291085491,"synopsis":"Federated wiki makes it easy to create new pages. These might be original to your site or copies of pages forked into your own environment. There is not yet any convenient way to delete unwanted pages."},{"slug":"rollup-in-pseudocode","title":"Rollup in Pseudocode","date":1420513485524,"synopsis":"The Rollup plugin provides a good example of integrating calculations from a number of pages."},{"slug":"scratch","title":"scratch","date":1425763527351,"synopsis":"OK test"},{"slug":"scratch-page","title":"Scratch Page","date":1519571608723,"synopsis":"A page, named [[Scratch]], where authors compose journal heavy edits to drag and drop on a target page when done."},{"slug":"sentences-about","title":"Sentences About","date":1433841023653,"synopsis":"We start with an activity called Sentences About."},{"slug":"sites-about-sfw","title":"Sites About SFW","date":1519575451873,"synopsis":"This [[Neighborhood List]] contains sites that explain how to use [[Smallest Federated Wiki]], or give technical explanations with regard to how these features are implemented."},{"slug":"smallest-federated-wiki","title":"Smallest Federated Wiki","date":1519574977400,"synopsis":"Our new wiki innovates three ways. It shares through federation, composes by refactoring and wraps data with visualization. Follow our open development on GitHub or just watch our work in progress videos here - [https://github.com/fedwiki github]"},{"slug":"special-page-names","title":"Special Page Names","date":1423162670504,"synopsis":"Some names and naming conventions are wired into wiki client and server side code. They are extremely limited."},{"slug":"start-here","title":"Start Here","date":1498779922181,"synopsis":"Welcome. This is the place to begin familiarising yourself with the way you write in [[Federated Wiki]]."},{"slug":"story","title":"Story","date":1423060375419,"synopsis":"A wiki page has a story told as a sequence of items, often paragraphs, but sometimes other things."},{"slug":"synthesis-and-critique","title":"Synthesis and Critique","date":1424278426373,"synopsis":"In Happenings we practice a sort of conversation through editing. It's a weird experience, but many like it. Key to creating that dynamic is that we not only read, write, and fork, but that we synthesize as well."},{"slug":"technology-sites","title":"Technology Sites","date":1427395729121,"synopsis":"A list of sites that document technology related to the technology."},{"slug":"template","title":"Template","date":1423063195707,"synopsis":"A Template page provides items as a guild for new pages intended to follow a prepared format."},{"slug":"the-federation","title":"The Federation","date":1465197141849,"synopsis":"Here we describe the The Federation. We should use this term wisely. It describes quite clearly the social aspects of this project, while also pointing gently towards [[Star Trek]] and the future of the [[Decentralised Web]]."},{"slug":"things-you-must-do","title":"Things You Must Do","date":1498780380479,"synopsis":"You can wander all day in the federation, and it's easy to get sidetracked. Here we link you directly to the things you must be do/be able to do before the starting to work with others, in a nice linear style. You can still wander if you want, but if you want to do the minimum, go through this list, skip the byways, and you will be set."},{"slug":"understand-welcome-visitors","title":"Understand Welcome Visitors","date":1423509751134,"synopsis":"Welcome Visitors is one of a few special system pages. Welcome Visitors is meant to identify what your site is about to others. It also may function as a personal landing page. See [[Special Page Names]]"},{"slug":"use-arrow-keys","title":"Use Arrow Keys","date":1423267115029,"synopsis":"This is an easy one. We're going to learn how to use keys to navigate. See [[What Arrow Keys Look Like]]."},{"slug":"view-and-restore-revisions","title":"View and Restore Revisions","date":1423608208980,"synopsis":"You can view your page at any point in its history, compare revisions, and restore a version from history. Here's how."},{"slug":"view-remote-pages","title":"View Remote Pages","date":1423509657525,"synopsis":"You've probably noticed that some of these pages have a \"blue halo\" around them. This means that the data of the page is being served from a server other than the one from which you're browsing (your [[Origin Site]])."},{"slug":"viral-academy-orientation","title":"Viral Academy Orientation","date":1434662137695,"synopsis":"[[Orientation]]"},{"slug":"virtues-of-wiki","title":"Virtues of Wiki","date":1423006428713,"synopsis":"First, federated wiki inherits the virtues of wiki:"},{"slug":"welcome-visitors","title":"Welcome Visitors","date":1519647473768,"synopsis":"This site contains information, tutorials, and practical examples that help you understand how to use and work with [[Federated Wiki]] in the [[Outlandish Academy]]."},{"slug":"writing-with-strangers","title":"Writing with Strangers","date":1429806208111,"synopsis":"Writing in the presence of rampant forking calls into question [[What it Means to Write]] and how to do it well."}]