[{"slug":"carnivore","title":"Carnivore","date":1498154090193,"synopsis":"A carnivore  meaning 'Meat Eater' (Latin, caro meaning 'meat' or 'flesh' and vorare meaning 'to devour') is an organism that derives its energy and nutrient requirements from a diet consisting mainly or exclusively of animal tissue, whether through predation or scavenging. Animals that depend solely on animal flesh for their nutrient requirements are called obligate carnivores while those that also consume non-animal food are called facultative carnivores. Omnivores also consume both animal and non-animal food, and apart from the more general definition,"},{"slug":"cellmates","title":"Cellmates","date":1467975200464,"synopsis":"Theres a black hole in the middle of the history of life: how did we go from tiny bags of chemicals to the vast menagerie of creatures we see around us? - [http://www.radiolab.org/story/cellmates/?utm_source=sharedUrl&utm_medium=metatag&utm_campaign=sharedUrl radiolab.org]"},{"slug":"changes-to-this-site","title":"Changes to this Site","date":1434532209841,"synopsis":"Below we list recent changes to this site only without also listing changes from the [[Neighbourhood]]:"},{"slug":"currently-working-on","title":"Currently Working On","date":1428639698992,"synopsis":"Here is a list of [[Recent Changes]] I consider important. View our experiments on the [[Scratch]] page. To clear stuff saved in your browser try [[Local Changes]]."},{"slug":"fedwiki-tools","title":"Fedwiki Tools","date":1498137764266,"synopsis":"Here we list a few tools that are of particular use in managing and creating [[Fedwiki]] content."},{"slug":"frog","title":"Frog","date":1498153957733,"synopsis":"A frog is any member of a diverse and largely carnivorous group of short-bodied, tailless amphibians composing the order Anura (Ancient Greek an-, without + oura, tail). The oldest fossil \"proto-frog\" appeared in the early Triassic of Madagascar, but molecular clock dating suggests their origins may extend further back to the Permian, 265 million years ago. Frogs are widely distributed, ranging from the tropics to subarctic regions, but the greatest concentration of species diversity is in tropical rainforests. There are approximately 4,800 recorded spec"},{"slug":"gray-wolf","title":"Gray wolf","date":1498154572394,"synopsis":"The gray wolf or grey wolf (Canis lupus), also known as the timber wolf or western wolf, is a canine native to the wilderness and remote areas of Eurasia and North America. It is the largest extant member of its family, with males averaging 43–45 kg (95–99 lb) and females 36–38.5 kg (79–85 lb). Like the red wolf, it is distinguished from other Canis species by its larger size and less pointed features, particularly on the ears and muzzle. Its winter fur is long and bushy and predominantly a mottled gray in color, although nearly pure white, red, and brow"},{"slug":"maize","title":"Maize","date":1498154388074,"synopsis":"Maize ( MAYZ; Zea mays subsp. mays, from Spanish: maíz after Taíno mahiz), also known as corn, is a large grain plant first domesticated by indigenous peoples in southern Mexico about 10,000 years ago. The leafy stalk of the plant produces separate pollen and ovuliferous inflorescences or ears, which are fruits, yielding kernels or seeds - [https://en.wikipedia.org/wiki/Maize wikipedia]"},{"slug":"omnivore","title":"Omnivore","date":1498154300294,"synopsis":"Omnivore /ˈɒmnivɔər/ is a consumption classification for animals that have the capability to obtain chemical energy and nutrients from materials originating from plant and animal origin. Often, omnivores also have the ability to incorporate food sources such as algae, fungi, and bacteria into their diet as well - [https://en.wikipedia.org/wiki/Omnivore wikipedia]"},{"slug":"omnivorous-species","title":"Omnivorous species","date":1498154262925,"synopsis":"A page with 0 items."},{"slug":"welcome-visitors","title":"Welcome Visitors","date":1420938191608,"synopsis":"Here we write about and research the natural world. Follow [[Changes to this Site]] to list all transpoters documented here, or to find out what we are [[Currently Working On]]."}]