[{"slug":"5upernet","title":"5uper.net","date":1514201006001,"synopsis":"5uper.net was an international artist group based in Austria that focused on artistic research at the intersection of media, arts, technology and society. The group was established in 2003 by Ile Cvetkoski, Matthias Tarasiewicz, Karina Lackner and Michal Wlodkowski and was responsible for developing the Coded Cultures festival series - [https://en.wikipedia.org/wiki/5uper.net wikipedia]"},{"slug":"a-sound-garden","title":"A Sound Garden","date":1501844972005,"synopsis":"A Sound Garden is one of six outdoor public art works on the National Oceanic and Atmospheric Administration (NOAA) campus that lies adjacent to the Warren G. Magnuson Park on the northwestern shore of Lake Washington in Seattle, Washington. The Seattle Arts Commission guided the jury selection headed by Sadao James Hilario, Engineer-in-charge of the GSA Art in Architecture Program for the NOAA Project, and the jury chose five artists from a pool of more than 250 - [https://en.wikipedia.org/wiki/A_Sound_Garden wikipedia]"},{"slug":"anthropological-soundscape","title":"Anthropological Soundscape","date":1499878559329,"synopsis":"In order to create a compelling atmosphere to engage groups in conversation around a theme, the thought is to create a soundscape that places the conversation in context. Here we look at a few pragmatic ideas about how to make this possible:"},{"slug":"aragon","title":"Aragon","date":1522496709973,"synopsis":"Aragon looks like an interesting project with good film and media capabilities in the area of blockchain and democracy:"},{"slug":"art","title":"Art","date":1509639837668,"synopsis":"Art is hard to define. It is easier to define negatively than it is positively. I don't feel that art is distinct in any essential way from other forms of creative work, whether it is product design, science or mathematics."},{"slug":"art-intervention","title":"Art intervention","date":1512556708365,"synopsis":"Art intervention is an interaction with a previously existing artwork, audience, venue/space or situation. It has the auspice of conceptual art and is commonly a form of performance art - [https://en.wikipedia.org/wiki/Art_intervention wikipedia]"},{"slug":"art-of-democracy","title":"Art of Democracy","date":1523350814544,"synopsis":"Here we explore projects and ideas that integrate art practice, theatre and documentary into political debate. How can we represent, visualise, animate and inform political concepts and their consequences. How we feed back this information to a [[Demos]]?"},{"slug":"art-of-politics","title":"Art of Politics","date":1523350643010,"synopsis":"Here we explore projects and ideas that integrate art practice, theatre and documentary into political debate."},{"slug":"augusto-boal","title":"Augusto Boal","date":1429367413599,"synopsis":"Augusto Boal was a Brazilian theatre director, writer and politician. He was the founder of Theatre of the Oppressed, a theatrical form originally used in radical popular education movements - [https://en.wikipedia.org/wiki/Augusto_Boal wikipedia]"},{"slug":"brian-eno","title":"Brian Eno","date":1509653854843,"synopsis":"Brian Peter George St John le Baptiste de la Salle Eno, RDI (; born 15 May 1948 and originally christened Brian Peter George Eno) is an English musician, composer, record producer, singer, writer, and visual artist."},{"slug":"bruce-barber","title":"Bruce Barber","date":1512557208629,"synopsis":"Bruce Barber (born in New Zealand in 1950) is an artist, writer, curator, and educator based in Halifax, Nova Scotia, where he teaches at NSCAD University. His artwork has been shown at the Paris Biennale, the Sydney Biennial, the New Museum of Contemporary Art, the Walter Phillips Gallery, London Regional Gallery, and ArtSpace Auckland."},{"slug":"changes-to-this-site","title":"Changes to this Site","date":1434532209841,"synopsis":"Below we list recent changes to this site only without also listing changes from the [[Neighbourhood]]:"},{"slug":"chaos-radio","title":"Chaos Radio","date":1457616227986,"synopsis":"Just came across this site which relates to the [[CCC]] and as an emaple here is a [[Podcast]] about [[Wikipedia]] (in German):"},{"slug":"chatham-house-rule","title":"Chatham House Rule","date":1512567799537,"synopsis":"When a meeting, or part thereof, is held under the Chatham House Rule, participants are free to use the information received, but neither the identity nor the affiliation of the speaker(s), nor that of any other participant, may be revealed -"},{"slug":"coded-cultures","title":"Coded Cultures","date":1514199776724,"synopsis":"Coded Cultures is a media arts festival series developed by the Austrian artist collective [[5uper.net]]. The first Coded Cultures focused on the theme 'Decoding Digital Culture' and took place over two weeks in May 2004 at the Museumsquartier in Vienna - [https://en.wikipedia.org/wiki/Coded_Cultures wikipedia]"},{"slug":"conversational-space","title":"Conversational Space","date":1509644572086,"synopsis":"Here we describe the architecture of conversation, in a system or design perspective, not as a singular temporal event but as a network process that occurs across time and space."},{"slug":"darvoz","title":"DarVoz","date":1535446083213,"synopsis":"DarVoz is a global decentralised conference, and art event, to take part at the end of January 2019. It is billed as an anual parallel or fringe event to the [[World Economic Forum]] at [[Davos]] in Switzerland that will take place at the same time."},{"slug":"darvozweek","title":"#darVOZweek","date":1522759728412,"synopsis":"The Newspeak [[#darVOZweek ]] hackathon was the first of a series of sprints organised by the [[Culture Collective]] on community designed technology."},{"slug":"davos","title":"Davos","date":1523468767175,"synopsis":"Davos is an Alpine town, and a municipality in the Prättigau/Davos Region in the canton of Graubünden, Switzerland. It has a permanent population of 11,060 (2016). Davos is located on the river Landwasser, in the Rhaetian Alps, between the Plessur and Albula Range. At 1,560 m (5,120 ft), it is described as \"the highest town in the Alps\". - [https://en.wikipedia.org/wiki/Davos wikipedia]"},{"slug":"democracy","title":"Democracy","date":1491770935617,"synopsis":"Democracy is a system of government in which all the people of a state or polity are involved in making decisions about its affairs, typically by voting to elect representatives to a parliament or similar assembly."},{"slug":"democracy-activity","title":"Democracy Activity","date":1519815163138,"synopsis":"View all activity from [[Democracy Sites]] listed in the roster below:"},{"slug":"democracy-caf","title":"Democracy Café","date":1516544538019,"synopsis":"The purpose of Democracy Cafes is to make genuine transnational politics possible, by providing an online space in which political activists from across Europe can meet and discuss pressing political issues in an informal “Cafe” setting."},{"slug":"diem-caf","title":"DIEM Café","date":1516544319052,"synopsis":"DIEM Café was an early experiment in which we explored ideas and software around the use of [[World Café]] meetings online for [[DIEM25]]. This project has now become [[Democracy Café]]."},{"slug":"feast","title":"FEAST","date":1498213544061,"synopsis":"FEAST is a celebration of local cultures that are unique yet connected. We come together around food, music, and conversation, which we celebrate locally while connecting globally to other communities through the medium of radio."},{"slug":"feast-food","title":"FEAST Food","date":1503243451892,"synopsis":"There would be no FEAST without food. Here we explore and celebrate the many sides a vairieties of food."},{"slug":"feast-is-a-festival","title":"FEAST is a Festival","date":1489772120013,"synopsis":"FEAST is designed to be a popular and adaptable festival that is able to engage as wide and diverse a community as possible. We will be creating a unique platform for emerging artists, buskers and new bands, and will work with project partners wherever possible to find, and help to promote new upcoming talent."},{"slug":"fedwiki-tools","title":"Fedwiki Tools","date":1523199212491,"synopsis":"Here we list a few tools that are of particular use in managing and creating [[Fedwiki]] content."},{"slug":"festival-of-mint","title":"Festival of Mint","date":1490201146460,"synopsis":"The MINT Festival is a celebration of local growing. One weekend a year they work with local cafés, restaurants, bars and growing spaces to serve fresh locally grown produce."},{"slug":"goals-for-darvozweek","title":"Goals for Darvozweek","date":1520425947382,"synopsis":"To create a decentralised version of [[Federated Wiki]] on [[Holochain]]. - which might be called [[Liquid Wiki]]"},{"slug":"he-will-not-divide-us","title":"He Will Not Divide Us","date":1502726038552,"synopsis":"HE WILL NOT DIVIDE. US is an ongoing durational artwork by LaBeouf, Rönkkö & Turner - [http://www.hewillnotdivide.us/ hewillnotdivide.us]"},{"slug":"hundred-rabbits","title":"Hundred Rabbits","date":1522519356569,"synopsis":"We are Rekka & Devine, two unlikely sailors. In January 2016 we left the cold of Montreal and moved west to British Columbia, there, we purchased our sailboat Pino. Keep in mind, we were a pair of city kids with limited outdoor experience, and neither of us had ever stepped onto a sailboat before."},{"slug":"its-a-rich-mans-world","title":"It's A Rich Man's World","date":1494066756720,"synopsis":"It's a Rich Man's World is a performance conference and immersive musical event which celebrates the world of [[The One Percent]]. It's [[Harry Enfield]] set to music."},{"slug":"jenny-holzer","title":"Jenny Holzer","date":1509814975254,"synopsis":"Jenny Holzer (born July 29, 1950, Gallipolis, Ohio) is an American neo-conceptual artist, based in Hoosick Falls, New York. The main focus of her work is the delivery of words and ideas in public spaces - [https://en.wikipedia.org/wiki/Jenny_Holzer wikipedia]"},{"slug":"johannes-grenzfurthner","title":"Johannes Grenzfurthner","date":1514199524960,"synopsis":"Johannes Grenzfurthner (German: [joˈhanəs ˈgrɛntsfʊɐ̯tnɐ]; born 1975 in Vienna) is an award-winning Austrian artist, filmmaker, writer, actor, curator, theatre director and lecturer. He is known as the founder, conceptualist and artistic director of monochrom, an international art and theory group. Most of his artworks are labelled monochrom - [https://en.wikipedia.org/wiki/Johannes_Grenzfurthner wikipedia]"},{"slug":"jonas-staal","title":"Jonas Staal","date":1509641044686,"synopsis":"Jonas Staal  is a Dutch visual artist. His work deals with the relationship between art, politics and ideology and has often generated public debate - [http://www.jonasstaal.nl/ jonasstaal.nl]"},{"slug":"littoral-art","title":"Littoral Art","date":1512557537367,"synopsis":"According to [[Bruce Barber]], [[communicative action]] is very different from direct action or intervention, although it may seem to employ some of the characteristics of both.  [[Jürgen Habermas]], who has arguably done more than anyone else to theorize various forms of political action within the [[public sphere]], distinguishes between strategic, instrumental and communicative actions."},{"slug":"mcyp","title":"MCYP","date":1523049231866,"synopsis":"The Multi-Cultural Yoghurt Party ([[MCYP]]) was an art project i did with the Turkish artist [[Dilek Winchester]] for the [[Stoke Newington Festival]] (2002)."},{"slug":"monochrom","title":"Monochrom","date":1514201049332,"synopsis":"monochrom is an international art-technology-philosophy group, founded in 1993, that defines itself as \"an unpeculiar mixture of proto-aesthetic fringe work, pop attitude, subcultural science and political activism\". Its main office is located at Museumsquartier/Vienna (at 'QDK') - [https://en.wikipedia.org/wiki/Monochrom wikipedia]"},{"slug":"notenough","title":"#NotEnough","date":1513552615779,"synopsis":"#NotEnough is an art project from 2013. The idea is for people to take a photo of themselves showing the number of votes they expect to have left to express an entire lifetime of values and beliefs."},{"slug":"one-hundred-percent","title":"One Hundred Percent","date":1539009326698,"synopsis":"This is a derivative work based on [[Rimini Protokoll]]s [[100 % City]] - [https://vimeo.com/riminiprotokoll vimeo]"},{"slug":"palace-of-the-parliament","title":"Palace of the Parliament","date":1515499760699,"synopsis":"The Palace of the Parliament is the seat of the Parliament of Romania. Located on Dealul Arsenalului in central Bucharest (Sector 5). It is the largest administrative building in the world, and in terms of weight,it is the heaviest building in the world - [https://en.wikipedia.org/wiki/Palace_of_the_Parliament wikipedia]"},{"slug":"plantoid","title":"Plantoid","date":1495234565599,"synopsis":"Below is the original proposal sent to Primavera (and dated) - [https://docs.google.com/document/d/1puG_Pzv7DsP5woNjfrdmGNuCjSxhDLHDRHQavuJcMH4/edit#heading=h.e0d9jhgec6bo docs.google.com]"},{"slug":"propaganda","title":"Propaganda","date":1509886982084,"synopsis":"Propaganda is information that is not objective and is used primarily to influence an audience and further an agenda, often by presenting facts selectively to encourage a particular synthesis or perception, or using loaded language to produce an emotional rather than a rational response to the information that is presented. Propaganda is often associated with material prepared by governments, but activist groups, companies and the media can also produce propaganda - [https://en.wikipedia.org/wiki/Propaganda wikipedia]"},{"slug":"pubic-happening","title":"Pubic Happening","date":1529311373364,"synopsis":"A public [[Happening]] is an event that takes place in a public venue, theatre, café, Hackspace, conference or social venue. It is designed to be of value to a public audience that may observe or otherwise take part in the event."},{"slug":"radio---general","title":"Radio - general","date":1512572429889,"synopsis":"Here we discuss how we will use internet radio to connect local communities globally."},{"slug":"ramics","title":"RAMICS","date":1522760777766,"synopsis":"RESEARCH ASSOCIATION ON MONETARY INNOVATION AND COMMUNITY AND COMPLEMENTARY CURRENCY SYSTEMS - [https://ramics.org/ ramics.org]"},{"slug":"reading-rooms","title":"Reading Rooms","date":1512561781315,"synopsis":"In his ''Reading Rooms'', Bruce Barber worked with [[Alexander Rodchenko]]'s 1925 Reading Room as a model for a workers' library and study.  These multi-part installations made use of multi-media formats to re-present various forms of corporate advertising and news reporting."},{"slug":"reading-the-open-text","title":"Reading the Open Text","date":1512567814545,"synopsis":"Among some of the aphorisms contained in this essay by [[Bruce Barber]] are the following:"},{"slug":"riat","title":"RIAT","date":1514201086442,"synopsis":"RIAT is an institute for research, development, communication and education in the fields of [[cryptoeconomics]] and the [[blockchain]] in Vienna - [https://riat.at/ riat.at]"},{"slug":"rimini-protokoll","title":"Rimini Protokoll","date":1509815122302,"synopsis":"Rimini Protokoll works in the realm of theater, sound and radio plays, film and installation emerge in constellations of two or three and solo as well."},{"slug":"rsa-animate","title":"RSA Animate","date":1509887100009,"synopsis":"The RSA Animate series was conceived as an innovative, accessible and unique way of illustrating and sharing the world-changing ideas from the RSA's free public events programme."},{"slug":"sound-garden","title":"Sound Garden","date":1512571555589,"synopsis":"The Sound Garden installation uses spatialised or 3D [[Immersive Sound]] to reflect the location of the speakers in geographical or conceptual space."},{"slug":"sound-picture-of-the-world","title":"Sound Picture of the World","date":1501865015942,"synopsis":"We create a 3D picture of the world in sound. Sounds are located in space, and then mapped to the installation, or navigated interactively using an app. As you move through space the sounds move closer, or further away as you approach them and pass by."},{"slug":"soundscape","title":"Soundscape","date":1501861314968,"synopsis":"A soundscape is a sonic landscape. It is a way of picturing a space or an idea in sound."},{"slug":"spaces","title":"Spaces","date":1515499133939,"synopsis":"Here we list spaces that are of interest, that we may be able to twin with, organise discussions, and research together:"},{"slug":"spoken-word","title":"Spoken word","date":1516470983802,"synopsis":"Spoken word is a performance art that is word based. It is an oral art that focuses on the aesthetics of word play and intonation and voice inflection - [https://en.wikipedia.org/wiki/Spoken_word wikipedia]"},{"slug":"stalker","title":"Stalker","date":1509640120202,"synopsis":"Stalker is a collective of architects and researchers connected to the Roma Tre University who came together in the mid-1990s. In 2002, Stalker founded the research network Osservatorio Nomade (ON), which consists of architects, artists, activists and researchers working experimentally and engaging in actions to create self-organised spaces and situations - [http://www.spatialagency.net/database/how/networking/stalkerosservatorio.nomade spatialagency.net]"},{"slug":"suli-breaks","title":"Suli Breaks","date":1516471951319,"synopsis":"Darryll Suliaman Amoako (born 22 January 1988), better known by his stage name Suli Breaks, is an English spoken word poet. He is best known for his [[spoken word]] videos on his YouTube channel sulibreezy. He is best known for his 2012 video \"Why I Hate School but Love Education\" and his 2013 video \"I Will Not Let an Exam Result Decide My Fate\" - [https://en.wikipedia.org/wiki/Suli_Breaks wikipedia]"},{"slug":"the-firesign-theatre","title":"The Firesign Theatre","date":1529311427918,"synopsis":"The Firesign Theatre (also known as The Firesigns) were an American surreal comedy group who first performed live on Los Angeles radio station KPFK during the mid-1960s."},{"slug":"theatre","title":"Theatre","date":1529311301862,"synopsis":"Theatre or theater is a collaborative form of fine art that uses live performers, typically actors or actresses, to present the experience of a real or imagined event before a live audience in a specific place, often a stage - [https://en.wikipedia.org/wiki/Theatre wikipedia]"},{"slug":"thought-garden-installation","title":"Thought Garden Installation","date":1501841983975,"synopsis":"The [[Thought Garden]] installation is a [[conversational space]] that layers and places sound spatially in order to represent the architecture of the topic presented."},{"slug":"thought-garden-project-activity","title":"Thought Garden Project Activity","date":1503250152070,"synopsis":"View all activity from the [[Thought Garden Projects]] roster below:"},{"slug":"thousand-rooms","title":"Thousand Rooms","date":1522519436289,"synopsis":"Thousand rooms is a visual novel by [[Hundred Rabbits]], that explores concepts of time and space, through the behaviours of four characters in an enclosed room. The book was put together in the hopes of creating a sort of Borges for children in which the reader follows a bat, a cat, an owl and a fox who try to make sense of a simple system with what is available to them - [https://hundredrabbits.itch.io/thousand-rooms itch.io]"},{"slug":"tyranny-of-structurelessness","title":"Tyranny of Structurelessness","date":1522762173690,"synopsis":"by Jo Freeman aka Joreen - [http://www.jofreeman.com/joreen/tyranny.htm jofreeman.com]"},{"slug":"unison","title":"UniSon","date":1509377179458,"synopsis":"I saw the closing matinee of UniSon last week. It was, as you told me, fabulous. What you didn't tell me is that I would want to see it again, immediately. But no, that can't happen now. [https://www.osfashland.org/en/productions/2017-plays/unison.aspx osf]"},{"slug":"viennese-actionism","title":"Viennese Actionism","date":1512556723837,"synopsis":"Viennese Actionism was a short and violent movement in 20th-century art. It can be regarded as part of the many independent efforts of the 1960s to develop \"performance art\" (Fluxus, happening, action painting, body art, etc.). Its main participants were Günter Brus, Otto Mühl, Hermann Nitsch, and Rudolf Schwarzkogler. As \"actionists\", they were active between 1960 and 1971. Most have continued their artistic work independently from the early 1970s onwards - [https://en.wikipedia.org/wiki/Viennese_Actionism wikipedia]"},{"slug":"walls","title":"Walls","date":1509653796249,"synopsis":"Here we collect links, images and ideas about walls:"},{"slug":"welcome-visitors","title":"Welcome Visitors","date":1533430628275,"synopsis":"The purpose of this site is to research and discuss the relationship between [[Art and Democracy]] in [[Progressive Politics]]."},{"slug":"whats-left-when-youre-right","title":"What's Left When You're Right?","date":1471597082876,"synopsis":"From the stage to the cage, a series of showdowns that leave us wondering about the price of being right ... or coming from the left - [http://www.radiolab.org/story/whats-left-when-youre-right/?utm_source=sharedUrl&utm_medium=metatag&utm_campaign=sharedUrl radiolab.org]"},{"slug":"wochenklausur","title":"WochenKlausur","date":1512563081982,"synopsis":"Since 1993 and on invitation from different art institutions, the artist group [[WochenKlausur]] develops concrete proposals aimed at small, but nevertheless effective improvements to socio-political deficiencies."},{"slug":"world-caf","title":"World Café","date":1533669923177,"synopsis":"Small groups of four or five participants sit around a table and discuss an open-ended question for a structured amount of time."},{"slug":"world-economic-forum","title":"World Economic Forum","date":1539008978523,"synopsis":"The WEF is best known for its annual meeting at the end of January in [[Davos]], a mountain resort in [[Graubünden]], in the eastern [[Alps]] region of Switzerland - [https://en.wikipedia.org/wiki/World_Economic_Forum wikipedia]"},{"slug":"worldscape","title":"Worldscape","date":1539009817479,"synopsis":"Worldscape is an performance event involving immersive sound art, video projection, that augment a series of curated talks and and conversations around the [[Worldscape Table]]."},{"slug":"yanis-varoufakis","title":"Yanis Varoufakis","date":1511262837809,"synopsis":""},{"slug":"rehearsals","title":"Rehearsals","date":1535446495186,"synopsis":"The [[Decentralised conversations]] that we seek to organise are designed to be a new form of activity, and produce a new form of media. In this section we try to capture the feel of these events."},{"slug":"illustration","title":"Illustration","date":1536153809438,"synopsis":"Some artists and illustrators of interest:"},{"slug":"dropped-image","title":"Dropped Image","date":1536153747453,"synopsis":"This is a simple image dropped on to a wiki."},{"slug":"history-of-wef","title":"History of WEF","date":1539008289398,"synopsis":"The WEF was founded in 1971 by [[Klaus Schwab]], a German-born business professor at the [[University of Geneva]]. First named the \"European Management Forum\", it changed its name to the World Economic Forum in 1987 and sought to broaden its vision to include providing a platform for resolving international conflicts - [https://en.wikipedia.org/wiki/World_Economic_Forum#History wikipedia]"},{"slug":"wef-organisational-structure","title":"WEF Organisational Structure","date":1539008452707,"synopsis":"Headquartered in Cologny, the WEF also has offices in New York, Beijing and Tokyo. On October 10, 2016, the Forum announced the opening of its new Center for the Fourth Industrial Revolution in San Francisco. According to the Forum, the center will \"serve as a platform for interaction, insight and impact on the scientific and technological changes that are changing the way we live, work and relate to one another\" - [https://en.wikipedia.org/wiki/World_Economic_Forum#Organization wikipedia]"},{"slug":"annual-meeting-in-davos","title":"Annual meeting in Davos","date":1539008570425,"synopsis":"The flagship event of the foundation is the invitation-only annual meeting held during the winter at the end of January in Davos, Switzerland, bringing together chief executive officers from its 1,000 member companies, as well as selected politicians, representatives from [[academia]], [[NGOs]], religious leaders, and the media in an [[Swiss Alps]] winter environment. The town is small enough to allow participants to meet anywhere outside the sessions and allows them the greatest opportunities to attend receptions organized by companies and countries. Th"},{"slug":"criticism-of-davos","title":"Criticism of Davos","date":1539008777690,"synopsis":"The Transnational Institute describes the World Economic Forum's main purpose as being \"to function as a socializing institution for the emerging [[global elite]], [[globalization]]'s \"Mafiocracy\" of [[banker]]s, [[industrialist]]s, [[Business oligarch]], [[technocrat]]s and politicians. They promote common ideas, and serve common interests: their own.\" - [https://en.wikipedia.org/wiki/World_Economic_Forum#Criticism wikipedia]"},{"slug":"immersive-sound","title":"Immersive Sound","date":1510411886623,"synopsis":"Immersive sound is both a general term for spatial sound, and a specific term relating to the enhancement of traditional 3-dimensional sound to include height as a component."},{"slug":"worldscape-table","title":"Worldscape Table","date":1539009748675,"synopsis":"# How it's made"}]