[{"slug":"9091-rule","title":"90–9–1 rule","date":1515081434256,"synopsis":"All large-scale, multi-user communities and online social networks that rely on users to contribute content or build services share one property: most users don't participate very much. Often, they simply lurk in the background."},{"slug":"active-conference","title":"Active Conference","date":1511698617443,"synopsis":"An active conference is a conference that concentrates on action, rather than talk. More accurately any discussion, presentations and papers presented are assessed according to the merit of any action or call for participation they engender."},{"slug":"conference-happenings","title":"Conference Happenings","date":1450792716722,"synopsis":"How can we use Fedwiki to transform the way in which we interact and experience conferences? That is the question we explore here."},{"slug":"distributed-unconference","title":"Distributed Unconference","date":1433264636983,"synopsis":"We need to be able to hold rich distributed conversations. This is both a core part of the process of deliberation in the [[Parliament of Things]], and a bootstrapping process in order to enable us to design the tools and techniques that we need to support the construction of this new democracy. It is a pressing question of practice, not merely theory - [http://www.parliamentofthings.org/thing/distributed-unconferences/ parliamentofthings.org]"},{"slug":"durational-conference","title":"Durational Conference","date":1490013689869,"synopsis":"A durational conference is a format for an intense 48 hour conference for a small group of people that are required to take an active part in the discussion."},{"slug":"events","title":"Events","date":1515068015587,"synopsis":"A book is more than the content it contains. An event is more than the activities on stage."},{"slug":"feast-is-a-conference","title":"FEAST is a Conference","date":1507024784723,"synopsis":"[[FEAST]] creates a platform for a decentralised conference, in which groups can engage in in-depth discussion face-to-face, and then give feedback in the form of a live audio podcast."},{"slug":"gardens-meet","title":"Garden's Meet","date":1511863392730,"synopsis":"How would one prepare for a conference workshop if one were asked to provide a position statement in the form of a federated wiki site? How can we develop a style for this form of engagement?"},{"slug":"parasitic-conference","title":"Parasitic Conference","date":1470926700767,"synopsis":"A parasitic conference is a conference that takes place, feeds off, and is dependent on an existing conference. It is in a sense a popup conference that can take place at informal venues, or be structured as part of an existing conference in which participants discuss the topics and themes taking place in the host conference."},{"slug":"participation-inequality","title":"Participation inequality","date":1515081252966,"synopsis":"In social sciences, participation inequality consists of difference between levels of participation of various groups in certain activities - [https://en.wikipedia.org/wiki/Participation_inequality wikipedia]"},{"slug":"pubic-happening","title":"Pubic Happening","date":1470235863828,"synopsis":"A public [[Happening]] is an event that takes place in a public venue, theatre, café, Hackspace, conference or social venue. It is designed to be of value to a public audience that may observe or otherwise take part in the event."},{"slug":"radio-conference","title":"Radio Conference","date":1491928023879,"synopsis":"Radio as we understand it today is a broadcast medium. Conferences are events that take place in physical space. Both allow only limited forms of dialogue and questioning from the audience. FEAST aims to create an entirely new form of radio show and dialogue with the audience."},{"slug":"thought-garden-events","title":"Thought Garden Events","date":1502797740662,"synopsis":"Here we look to fix down and describe a series of events for September 2017 through to September 2018."},{"slug":"user-generated-content","title":"User-generated content","date":1515081291952,"synopsis":"User-generated content (UGC), alternatively known as user-created content, is any form of content created by users of a system or service and made available publicly on that system - [https://en.wikipedia.org/wiki/User-generated_content wikipedia]"},{"slug":"walk-and-talks","title":"Walk And Talks","date":1490013799806,"synopsis":"The format is one in which people gather, and someone presents a theme, topic or conversation piece. The audience then pairs off in two's or three's, and instead of everyone sitting and discussing things around a table or in a conference setting, people are encouraged to walk, and talk while walking somewhere."},{"slug":"walking-charrette","title":"Walking Charrette","date":1469024012791,"synopsis":"The proposal is that we organise a series of events, supported by a from of writing and research that uses wiki, but is based on the physical act of walking and discussing ideas of relevance the the physical location of the walk."},{"slug":"welcome-visitors","title":"Welcome Visitors","date":1515068117805,"synopsis":"Here we gather notes and research regarding [[Thought Garden Events]]."},{"slug":"writing-with-strangers","title":"Writing with Strangers","date":1429804097374,"synopsis":"Writing in the presence of rampant forking calls into question [[What it Means to Write]] and how to do it well."},{"slug":"writing-with-strangers-at-32c3","title":"Writing with Strangers at 32C3","date":1511863444484,"synopsis":"Some thoughts on how we might organise 3 Hangouts and Fedwiki writing sessions at 32C3 - on the 27-29th December at 6pm GMT each evening of the event. How in practice does [[Writing with Strangers]] work in a physical and virtual hybrid situation?"}]