[{"slug":"activating-cities-ii","title":"Activating Cities II","date":1489588505375,"synopsis":"ACTIVATING CITIES II"},{"slug":"changes-to-this-site","title":"Changes to this Site","date":1434532209841,"synopsis":"Below we list recent changes to this site only without also listing changes from the [[Neighbourhood]]:"},{"slug":"conversations-across-space","title":"Conversations Across Space","date":1498942144279,"synopsis":"We understand what a conversation is, how it can be conducted. We value good quality conversations that are respectful, in which each party deepens their learning and understanding. Yet we have little idea how to conduct such conversations across space."},{"slug":"currently-working-on","title":"Currently Working On","date":1489307567578,"synopsis":"Here is a list of [[Recent Changes]] I consider important. View our experiments on the [[Scratch]] page. To clear stuff saved in your browser try [[Local Changes]]."},{"slug":"david-bovill","title":"David Bovill","date":1455031605895,"synopsis":"On this site I write about [[Livecode]], the projects I am working on and the courses I am teaching."},{"slug":"ergot","title":"Ergot","date":1489750204560,"synopsis":"Ergot (pron. /ˈɜːrɡət/ UR-gət) or ergot fungi refers to a group of fungi of the genus Claviceps - [https://en.wikipedia.org/wiki/Ergot wikipedia]"},{"slug":"feast","title":"FEAST","date":1490209876402,"synopsis":"[[FEAST]] is a global decentralised conference and music festival, connected by radio. It is a celebration of local culture, with communities connected globally through conversation, sound and music."},{"slug":"feast-activity","title":"FEAST Activity","date":1489751464382,"synopsis":"This form of writing and co-creation that we explore is new. It is an unusual and new way to collaborate, one which encourages us to share our early thoughts as we see them pass from hand to hand. This process we have called before [[Writing With Strangers]]."},{"slug":"feast-is-a-conference","title":"FEAST is a Conference","date":1489160460568,"synopsis":"A page with 1 items."},{"slug":"feast-is-a-festival","title":"FEAST is a Festival","date":1489158325558,"synopsis":"FEAST is designed to be a popular and adaptable festival that is able to engage as wide and diverse a community as possible. We will be creating a unique platform for emerging artists, buskers and new bands, and will work with project partners wherever possible to find, and help to promote new upcoming talent."},{"slug":"feast-is-a-gathering","title":"FEAST is a Gathering","date":1489160450513,"synopsis":"A FEAST is a gathering of friends and neighbours.  Individuals are invited to take part anywhere in the world, simply by cooking locally sourced food, inviting some friends and tuning into the radio. We make it simple for these small groups to take an active part in the festival, whether that be by becoming a radio presenter, DJ, or holding a panel discussion. Speakers and performers can take part from anywhere in the world through the magic of the internet."},{"slug":"feast-is-global","title":"FEAST is Global","date":1514219940097,"synopsis":"[[FEAST]] is a globally connected festival. While people meet face-to-face, locally to enjoy music, food and each others company, we look to realise a sense of connectedness, and enable a purposeful call to action."},{"slug":"feast-is-local","title":"FEAST is Local","date":1514219658921,"synopsis":"FEAST creates an intimate connection between live performers and the audience, with the events taking place in peoples homes, cafes and local communities. Artists perform in front of a live local audience, while reaching out to a larger audience through local radio and syndicating their content to twinned festivals in other parts of the world, international radio stations, and through archived on-demand podcasts."},{"slug":"feast-is-platform","title":"FEAST is Platform","date":1489136743930,"synopsis":"FEAST is also a platform for sustainably financed, self-organised community festivals. We create a template designed to make it as simple as possible for anyone to create a festival in their community. This template enables local artists, community organisations to work with and gain the support of local businesses, cafés, bars and venues to create a sustainable festival that benefits the whole community."},{"slug":"feast-researchers","title":"FEAST Researchers","date":1519566420289,"synopsis":"Below we list our growing group of researchers. Try not to fork this page. It is a master copy that all [[FEAST Activity]] pages refer to."},{"slug":"fedwiki-tools","title":"Fedwiki Tools","date":1449105067435,"synopsis":"Here we list a few tools that are of particular use in managing and creating [[Fedwiki]] content."},{"slug":"global","title":"Global","date":1489579740978,"synopsis":"The atmosphere created is one of a pervasive and subtle sense of connection. Connection to the local community and to other people around the world celebrating in a similar way, discussing and thinking about the same issues."},{"slug":"kaduna-state","title":"Kaduna State","date":1489519245798,"synopsis":"Kaduna, usually referred to as Kaduna State to distinguish it from the city of Kaduna, is a state in Northwest Nigeria. Its capital is Kaduna - [https://en.wikipedia.org/wiki/Kaduna_State wikipedia]"},{"slug":"kafanchan","title":"Kafanchan","date":1489519008183,"synopsis":"Kafanchan is a town in southern Kaduna State in north-central Nigeria. It is the location of a junction station of the Nigerian Railway Corporation, and it sits on the line connecting Port Harcourt, Enugu, Kafanchan, Kuru, Bauchi, and finally Maiduguri. As of 2007 Kafanchan had an estimated population of 83,092 - [https://en.wikipedia.org/wiki/Kafanchan wikipedia]"},{"slug":"live-and-local","title":"Live and Local","date":1489595277253,"synopsis":"The radio connects people through sound. As you walk from café to café, the music you hear is curated by local artists, and the [[Local Adverts]] tell the story of projects, and local venues."},{"slug":"live-performers","title":"Live Performers","date":1489595122369,"synopsis":"Local buskers and performers tour the venues using mobile technology to broadcast their performances live on the radio."},{"slug":"local-adverts","title":"Local Adverts","date":1489673745870,"synopsis":"FEAST aims to be a different form of event. It is not intended to be financed in the traditional sense of a media event, and this is most clearly illustrated with regard to our relationship with advertising and sponsorship."},{"slug":"local-festivals","title":"Local Festivals","date":1489674499457,"synopsis":"FEAST connects local festival venues through a 24/7 live radio station. We create a map of participating venues. Cafés, bars, local galleries and community spaces organise their own events."},{"slug":"map-test","title":"Map Test","date":1489519245795,"synopsis":"This is a test map"},{"slug":"parasitic-conference","title":"Parasitic Conference","date":1470405553714,"synopsis":"A parasitic conference is a conference that takes place, feeds off, and is dependent on an existing conference. It is in a sense a popup conference that can take place at informal venues, or be structured as part of an existing conference in which participants discuss the topics and themes taking place in the host conference."},{"slug":"radio","title":"Radio","date":1489580430429,"synopsis":"FEAST aims to work with local radio stations and podcasters around the world to celebrate the diverse and vibrant culture of local radio. It is structured as an artist led coop, and we create and provide tools that make it simpler and legal for stations to share content and collaborate on productions."},{"slug":"radio-station","title":"Radio Station","date":1489518224950,"synopsis":"A page with 0 items."},{"slug":"recent-changes","title":"Recent Changes","date":1489590322635,"synopsis":"Here we list neighborhood pages with those most recently changed listed first. See also [[Local Changes]]."},{"slug":"rye","title":"Rye","date":1489749936649,"synopsis":"Rye (Secale cereale) is a grass grown extensively as a grain, a cover crop and a forage crop. It is a member of the wheat tribe (Triticeae) and is closely related to barley (genus Hordeum) and wheat (Triticum). Rye grain is used for flour, rye bread, rye beer, crisp bread, some whiskeys, some vodkas, and animal fodder. It can also be eaten whole, either as boiled rye berries or by being rolled, similar to rolled oats - [https://en.wikipedia.org/wiki/Rye wikipedia]"},{"slug":"soundscape","title":"Soundscape","date":1501861314968,"synopsis":"A soundscape is a sonic landscape. It is a way of picturing a space or an idea in sound."},{"slug":"trypod","title":"#TryPod","date":1489307608772,"synopsis":"This is a campaign by several US public podcasters to encourage people to listen to podcasts."},{"slug":"turkish-food","title":"Turkish Food","date":1504720092193,"synopsis":"Test"},{"slug":"uses-of-radio","title":"Uses of radio","date":1489518881424,"synopsis":"Early uses were maritime, for sending telegraphic messages using [[Morse code]] between ships and land. The earliest users included the Japanese Navy scouting the Russian fleet during the [[Battle of Tsushima]] in 1905. One of the most memorable uses of marine telegraphy was during the sinking of the RMS ''Titanic'' ([[RMS Titanic]]) in 1912, including communications between operators on the sinking ship and nearby vessels, and communications to shore stations listing the survivors - [https://en.wikipedia.org/wiki/Radio#Uses_of_radio wikipedia]"},{"slug":"welcome-visitors","title":"Welcome Visitors","date":1501525473489,"synopsis":"[[FEAST]] is a global decentralised conference and music festival, connected by radio. It is a celebration of local culture, with communities around the world sharing conversation, sound and music."},{"slug":"wikpedia-image-import","title":"Wikpedia Image Import","date":1489518905801,"synopsis":"Here is an image from Wikipedia ready to drag onto your page..."},{"slug":"world-radio-day","title":"World Radio Day","date":1489519094974,"synopsis":"World Radio Day is an observance day held annually on 13 February[1]. World Radio Day is about celebrating radio, why we love it and why we need it today more than ever. A day to remember the unique power of radio to touch lives and bring people together across every corner of the globe[2]. It was proclaimed on 3 November 2011 by UNESCO's 36th General Conference after originally proposed by the Kingdom of Spain - [https://en.wikipedia.org/wiki/World_Radio_Day wikipedia]"},{"slug":"writing-with-strangers","title":"Writing with Strangers","date":1489591338581,"synopsis":"Writing in the presence of rampant forking calls into question [[What it Means to Write]] and how to do it well."}]