[{"slug":"adam-smith","title":"Adam Smith","date":1517412417834,"synopsis":"Adam Smith  (16 June 1723 NS (5 June 1723 OS) – 17 July 1790) was a Scottish economist, philosopher and author as well as a moral philosopher, a pioneer of political economy and a key figure during the Scottish Enlightenment era. Smith is best known for two classic works: The Theory of Moral Sentiments (1759) and An Inquiry into the Nature and Causes of the Wealth of Nations (1776). The latter, usually abbreviated as The Wealth of Nations, is considered his magnum opus and the first modern work of economics - [https://en.wikipedia.org/wiki/Adam_Smith wik"},{"slug":"alex-pentland","title":"Alex Pentland","date":1517678976488,"synopsis":"Alex Paul \"Sandy\" Pentland (born 1952) is an American computer scientist, the Toshiba Professor at MIT, and serial entrepreneur. He is one of the most cited authors in computer science, and helped create the MIT Media Lab. He has an h-index of 123 - [https://en.wikipedia.org/wiki/Alex_Pentland wikipedia]"},{"slug":"andrew-orford","title":"Andrew Orford","date":1517684073160,"synopsis":""},{"slug":"argument-map","title":"Argument map","date":1517491203058,"synopsis":"In informal logic and philosophy, an argument map or argument diagram is a visual representation of the structure of an argument - [https://en.wikipedia.org/wiki/Argument_map wikipedia]"},{"slug":"argument-mapping-chat","title":"Argument Mapping Chat","date":1517580160868,"synopsis":"We recored this chat when we first noticed that there were lots of useful links. There is more before and after."},{"slug":"arthur-brock","title":"Arthur Brock","date":1517232300780,"synopsis":"Arthur Brock's [http://artbrock.com/ Personal website]"},{"slug":"asch-conformity-experiments","title":"Asch Conformity Experiments","date":1517409453876,"synopsis":"In psychology, the Asch conformity experiments or the Asch Paradigm refers to a series of studies directed by Solomon Asch studying if and how individuals yielded to or defied a majority group and the effect of such influences on beliefs and opinions - [https://en.wikipedia.org/wiki/Asch_conformity_experiments wikipedia]"},{"slug":"asynchronous-collaboration","title":"Asynchronous Collaboration","date":1517317259192,"synopsis":"The non-live industrial relations which enable a chain of productivity."},{"slug":"atom-with-teletype","title":"Atom with Teletype","date":1517326502648,"synopsis":"A live code sharing tool for programmers which lets participants see a shared view of code including such screen activity as highlighting text. Used in a table-work setting or via conference call, coders can work (in a coordinated fashion) on the same code simultaneously."},{"slug":"auguste-comte","title":"Auguste Comte","date":1517679087943,"synopsis":"Isidore Marie Auguste François Xavier Comte (French: [oɡyst kɔ̃t]; 19 January 1798 – 5 September 1857) was a French philosopher who founded the discipline of praxeology and the doctrine of positivism. He is sometimes regarded as the first philosopher of science in the modern sense of the term - [https://en.wikipedia.org/wiki/Auguste_Comte wikipedia]"},{"slug":"augusto-boal","title":"Augusto Boal","date":1429367413599,"synopsis":"Augusto Boal was a Brazilian theatre director, writer and politician. He was the founder of Theatre of the Oppressed, a theatrical form originally used in radical popular education movements - [https://en.wikipedia.org/wiki/Augusto_Boal wikipedia]"},{"slug":"avicenna","title":"Avicenna","date":1517397610060,"synopsis":"Avicenna (; also Ibn Sīnā or Abu Ali Sina; Persian: ابن سینا‎; c. 980 – June 1037) was a Persian polymath who is regarded as one of the most significant physicians, astronomers, thinkers and writers of the Islamic Golden Age. He has been described as the father of early modern medicine. Of the 450 works he is known to have written, around 240 have survived, including 150 on philosophy and 40 on medicine - [https://en.wikipedia.org/wiki/Avicenna wikipedia]"},{"slug":"barcampnfp","title":"BarcampNFP","date":1517511277343,"synopsis":"[https://twitter.com/search?f=tweets&vertical=default&q=%23Barcampnfp&src=tyah #BarcampNFP on Twitter]"},{"slug":"barry-oshry","title":"Barry Oshry","date":1517414706203,"synopsis":"YOUTUBE VYpO-pK7IFA"},{"slug":"clutter","title":"Clutter","date":1517230717447,"synopsis":"YOUTUBE qim3ZcVmnz4"},{"slug":"conference-dashboard","title":"Conference Dashboard","date":1517676083955,"synopsis":"Monitor and diagnose conference activity with [[Epistemic Sensors]]."},{"slug":"connor-turland","title":"Connor Turland","date":1517253911254,"synopsis":"@Connoropolous"},{"slug":"cybernetics","title":"Cybernetics","date":1501440882388,"synopsis":"Cybernetics is a transdisciplinary approach for exploring regulatory systems, their structures, constraints, and possibilities. In the 21st century, the term is often used in a rather loose way to imply \"control of any system using technology.\" - [https://en.wikipedia.org/wiki/Cybernetics wikipedia]"},{"slug":"cynefin","title":"Cynefin","date":1501445426783,"synopsis":"<div style='padding: 12px; background:#eee; width:96%; align=centered;'>"},{"slug":"darvozweek-andrews-metanotes","title":"Darvozweek Andrew's Metanotes","date":1517762402138,"synopsis":"This is how I remember what I was thinking at the time. This is a [[Sensemaking]] exercise."},{"slug":"darvozweek-day-1","title":"Darvozweek Day 1","date":1517323244978,"synopsis":"Monday 29th January 2018 at [[Newspeak House]]"},{"slug":"darvozweek-day-2","title":"Darvozweek Day 2","date":1517337166098,"synopsis":"Tuesday 30th January 2018 at [[Newspeak House]]"},{"slug":"darvozweek-day-3","title":"Darvozweek Day 3","date":1517416956588,"synopsis":"Wednesday 31st January 2018 at [[Newspeak House]]"},{"slug":"darvozweek-day-4","title":"Darvozweek Day 4","date":1517689242774,"synopsis":"Thursday 1st February 2018 at [[Newspeak House]]"},{"slug":"darvozweek-day-5","title":"Darvozweek Day 5","date":1517687453536,"synopsis":"Friday 2nd February 2018 at [[Newspeak House]]"},{"slug":"darvozweek-day-6","title":"Darvozweek Day 6","date":1517691494515,"synopsis":"Saturday 3rd February 2018 at [[Newspeak House]]"},{"slug":"darvozweek-day-7","title":"Darvozweek Day 7","date":1517766069444,"synopsis":"Sunday 4th February 2018 at [[Newspeak House]]"},{"slug":"david-bovill","title":"David Bovill","date":1489691927769,"synopsis":"On this site I write about [[Livecode]], the projects I am working on and the courses I am teaching."},{"slug":"david-graeber","title":"David Graeber","date":1517410472330,"synopsis":"David Rolfe Graeber (; born 12 February 1961) is an American-born, London-based anthropologist and anarchist activist, perhaps best known for his 2011 volume [[Debt: The First 5000 Years]]. He is professor of anthropology at the London School of Economics - [https://en.wikipedia.org/wiki/David_Graeber wikipedia]"},{"slug":"debt-the-first-5000-years","title":"Debt: The First 5000 Years","date":1517410487375,"synopsis":"Debt: The First 5,000 Years is a book by anthropologist [[David Graeber]] published in 2011. It explores the historical relationship of debt with social institutions such as barter, marriage, friendship, slavery, law, religion, war and government; in short, much of the fabric of human life in society. It draws on the history and anthropology of a number of civilizations, large and small, from the first known records of debt from Sumer in 3500 BC until the present - [https://en.wikipedia.org/wiki/Debt:_The_First_5000_Years wikipedia]"},{"slug":"deliberative-democracy","title":"Deliberative Democracy","date":1510232371877,"synopsis":"Deliberative democracy or discursive democracy is a form of democracy in which deliberation is central to decision-making. It adopts elements of both consensus decision-making and majority rule - [https://en.wikipedia.org/wiki/Deliberative_democracy wikipedia]"},{"slug":"democracy-lab","title":"Democracy Lab","date":1517746647691,"synopsis":"What are our ideas, techniques and technologies to facilitate Democracy."},{"slug":"democratic-money","title":"Democratic Money","date":1517315068000,"synopsis":"We'll lay the groundwork for a '[[Pattern Language]] of Mutual Credit'."},{"slug":"diem25","title":"DiEM25","date":1510171887231,"synopsis":"The Democracy in Europe Movement 2025, or DiEM25, is a Pan-European political movement launched in 2015 by former Greek finance minister [[Yanis Varoufakis]]."},{"slug":"dil-green","title":"Dil Green","date":1517245128321,"synopsis":"# About Me"},{"slug":"distributed-ledger","title":"Distributed Ledger","date":1517746789899,"synopsis":"A distributed ledger (also called a shared ledger, or referred to as distributed ledger technology) is a consensus of replicated, shared, and synchronized digital data geographically spread across multiple sites, countries, or institutions. There is no central administrator or centralised data storage - [https://en.wikipedia.org/wiki/Distributed_ledger wikipedia]"},{"slug":"doug-walton","title":"Doug Walton","date":1517493591169,"synopsis":"Douglas Neil Walton (PhD University of Toronto, 1972) is a Canadian academic and author, known for his books and papers on argumentation, logical fallacies and informal logic. He is presently Distinguished Research Fellow of the Centre for Research in Reasoning, Argumentation, and Rhetoric (CRRAR) at the University of Windsor, Ontario, Canada, and before that (2008–14), he held the Assumption Chair of Argumentation Studies at the University of Windsor. Walton’s work has been used to better prepare legal arguments and to help develop artificial intelligen"},{"slug":"epistemic-sensors","title":"Epistemic Sensors","date":1517708481513,"synopsis":"By collecting (applicable) data and metrics from the conference, an algorithm could diagnose progress toward predefined goals."},{"slug":"ethereum","title":"Ethereum","date":1464377729809,"synopsis":"Web 3.0 publishing platform. Purpose of Ethereum is to decentralise the Web. Read more on [http://en.wikipedia.org/wiki/ethereum Wikipedia] and [https://forum.ethereum.org Ethereum forum]"},{"slug":"ethos","title":"Ethos","date":1517402574789,"synopsis":"Ethos is a Greek word meaning \"character\" that is used to describe the guiding beliefs or ideals that characterize a community, nation, or ideology. The Greeks also used this word to refer to the power of music to influence emotions, behaviours, and even morals. Early Greek stories of Orpheus exhibit this idea in a compelling way. The word's use in rhetoric is closely based on the Greek terminology used by Aristotle in his concept of the three artistic proofs - [https://en.wikipedia.org/wiki/Ethos wikipedia]"},{"slug":"fedwiki-tools","title":"Fedwiki Tools","date":1502208875309,"synopsis":"Here we list a few tools that are of particular use in managing and creating [[Fedwiki]] content."},{"slug":"future-of-the-federation","title":"Future of the Federation","date":1489051327477,"synopsis":"Here we collect notes and ideas about how [[The Federation]] should evolve - where it is going. See [[Changes to the Future]]."},{"slug":"future-of-wiki","title":"Future of Wiki","date":1517687708681,"synopsis":"[[Wikimedia Foundation]]"},{"slug":"geoffrey-moore","title":"Geoffrey Moore","date":1517413331673,"synopsis":"Geoffrey Moore (born 1946) is an American organizational theorist, management consultant and author, known for his work Crossing the Chasm: Marketing and Selling High-Tech Products to Mainstream Customers - [https://en.wikipedia.org/wiki/Geoffrey_Moore wikipedia]"},{"slug":"gilson-schwartz","title":"Gilson Schwartz","date":1512739499872,"synopsis":"Prof Gilson Schwartz is a leading senior researcher in digital culture and public policy in Brazil since he was awarded a Visiting Research Fellowship at the IAS of the University of São Paulo for his “City of Knowledge” Project (1999-2002) - [https://warwick.ac.uk/fac/arts/theatre_s/cp/research/researchthemes/iamukbrazil/ warwick.ac.uk]"},{"slug":"github","title":"GitHub","date":1517495671546,"synopsis":"GitHub is a web-based Git repository hosting service. It offers all of the distributed revision control and source code management (SCM) functionality of Git as well as adding its own features - [https://en.wikipedia.org/wiki/Github wikipedia]"},{"slug":"goals-for-darvozweek","title":"Goals for Darvozweek","date":1517562334979,"synopsis":"To create a decentralised version of [[Federated Wiki]] on [[Holochain]]. - which might be called [[Liquid Wiki]]"},{"slug":"good-practice","title":"Good Practice","date":1517512272128,"synopsis":"The [[Cynefin]] framework makes the crucial distinction between Good Practice and Best Practice."},{"slug":"good-regulator","title":"Good Regulator","date":1510996653195,"synopsis":"The good regulator is a theorem conceived by Roger C. Conant and W. Ross Ashby that is central to cybernetics  - [https://en.wikipedia.org/wiki/Good_regulator wikipedia]"},{"slug":"habib-belaribi","title":"Habib Belaribi","date":1516711835982,"synopsis":"Je suis [[Habib Belaribi]], bienvenue sur mon [[wiki]]! Ici, j'écris des tutoriels sur les choses que j'aime apprendre de manière à partager les recettes avec tous les francophones. J'ai pris connaissance de Federated Wiki grâce à une belle introduction faite par [[David Bovill]], un ami programmeur de logiciels libres de longue date basé à Londres. J'utilise généralement Fed Wiki avec Sophie, avec qui j'ai fondé"},{"slug":"hack-platform-earth","title":"Hack Platform Earth","date":1517574881354,"synopsis":"We're interested in what is happening in London and they are interested in what is happening in the world."},{"slug":"holo","title":"Holo","date":1517248175410,"synopsis":"<blockquote>"},{"slug":"holochain","title":"Holochain","date":1514134906111,"synopsis":"Holographic storage for distributed applications. A holochain is a validating distributed hash table (DHT) where every node enforces validation rules on data against the signed chains where the data originated - [http://ceptr.org/projects/holochain ceptr.org]"},{"slug":"holochain-dna","title":"Holochain DNA","date":1517231820405,"synopsis":"<blockquote>"},{"slug":"homeostasis","title":"Homeostasis","date":1517401935795,"synopsis":"Homeostasis can be defined as the stable condition of an organism and of its internal environment; or as the maintenance or regulation of the stable condition, or its equilibrium; or simply as the balance of bodily functions. The stable condition is the condition of optimal functioning for the organism, and is dependent on many variables, such as body temperature and fluid balance, being kept within certain pre-set limits. Other variables include the pH of extracellular fluid, the concentrations of sodium, potassium and calcium ions, as well as that of t"},{"slug":"hypothesis","title":"Hypothes.is","date":1517745774831,"synopsis":"[https://web.hypothes.is/ Hypothes.is] is a 501(c) open-source software project that aims to collect comments about statements made in any web-accessible content, and filter and rank those comments to assess each statement's credibility. It has been summarized as \"a peer review layer for the entire Internet.\" - [https://en.wikipedia.org/wiki/Hypothes.is wikipedia]"},{"slug":"ifttt","title":"IFTTT","date":1517677364745,"synopsis":"If This Then That, also known as IFTTT (pronounced ), is a free web-based service to create chains of simple conditional statements, called applets - [https://en.wikipedia.org/wiki/IFTTT wikipedia]"},{"slug":"james-salsman","title":"James Salsman","date":1517508068839,"synopsis":"@jsalsman"},{"slug":"jane-jacobs","title":"Jane Jacobs","date":1517411520299,"synopsis":"Jane Jacobs  (born Jane Butzner; May 4, 1916 – April 25, 2006) was an American-Canadian journalist, author, and activist best known for her influence on urban studies, sociology, and economics. Her influential book The Death and Life of Great American Cities (1961) argued that urban renewal did not respect the needs of most city-dwellers. In the book she introduced sociological concepts such as \"eyes on the street\" and \"social capital\" - [https://en.wikipedia.org/wiki/Jane_Jacobs wikipedia]"},{"slug":"json","title":"JSON","date":1517258853021,"synopsis":"JSON, or JavaScript Object Notation, is an open standard format that uses human-readable text to transmit data objects consisting of attribute‚Äìvalue pairs. It is used primarily to transmit data between a server and web application, as an alternative to XML."},{"slug":"karl-polanyi","title":"Karl Polanyi","date":1517475922265,"synopsis":"Author of [[The Great Transformation]] 1944"},{"slug":"katherine-maher","title":"Katherine Maher","date":1517686762735,"synopsis":"Katherine Roberts Maher (born April 18, 1983) is the executive director of the Wikimedia Foundation, a position she has held since June 2016. Previously she was chief communications officer. In addition to a background in the field of information and communications technology (ICT), Maher has worked in the non-profit and international sectors focusing on the use of technology to empower human rights and international development - [https://en.wikipedia.org/wiki/Katherine_Maher wikipedia]"},{"slug":"kuhn-cycle","title":"Kuhn Cycle","date":1451851237849,"synopsis":"Thomas Kuhn's Structure of Scientific Revolutions described the social cycle through which science advances, one stage of which is the paradigm shift for which he is famous."},{"slug":"liquid-wiki","title":"Liquid Wiki","date":1517248205646,"synopsis":"[https://www.darvoz.org/liquidwiki Liquid Wiki]"},{"slug":"mattermost","title":"Mattermost","date":1517324431890,"synopsis":"'Mattermost is an open-source, private cloud, slack alternative'."},{"slug":"michael-polanyi","title":"Michael Polanyi","date":1515777561479,"synopsis":"Brother of [[Karl Polanyi]]"},{"slug":"microservice","title":"Microservice","date":1510671826092,"synopsis":"A microservice is for all intents and purposes a small [[restful web service]] :)"},{"slug":"microservices","title":"Microservices","date":1510673640830,"synopsis":"A [[microservice]] is an architectural style, in which complex applications are composed of small, independent processes communicating with each other using language-agnostic APIs - [https://en.wikipedia.org/wiki/Microservices wikipedia]"},{"slug":"moral-modalities","title":"Moral Modalities","date":1517410779371,"synopsis":"A framework developed by [[Trevor E Hilder]]."},{"slug":"newspeak-house","title":"Newspeak House","date":1513595854862,"synopsis":"Newspeak House is a space that hosts public and private events for researching the intersection of Politics, Media and Government - [https://www.nwspk.com/about nwspk.com]"},{"slug":"nicerine-razwani-bres","title":"Nicerine Razwani Bres","date":1517313131258,"synopsis":"Hey"},{"slug":"onetab","title":"OneTab","date":1498133001583,"synopsis":"OneTab converts all of your tabs into a list. When you need to access the tabs again, you can either restore them individually or all at once - [https://www.one-tab.com/ one-tab.com]"},{"slug":"onetab-transport","title":"OneTab Transport","date":1517506917683,"synopsis":"[[OneTab]] converts all of your tabs into a list. When you need to access the tabs again, you can either restore them individually or all at once."},{"slug":"orcid","title":"ORCID","date":1517747976784,"synopsis":"ORCID (Open Researcher and Contributor ID) is a nonproprietary alphanumeric code to uniquely identify scientific and other academic authors and contributors. This addresses the problem that a particular author's contributions to the scientific literature or publications in the humanities can be hard to recognize as most personal names are not unique, they can change (such as with marriage), have cultural differences in name order, contain inconsistent use of first-name abbreviations and employ different writing systems. It provides a persistent identity "},{"slug":"pattern-language","title":"Pattern Language","date":1517315895671,"synopsis":"A pattern language is a method of describing good design practices or patterns of useful organization within a field of expertise. The term was coined by architect [[Christopher Alexander]] and popularized by his 1977 book A Pattern Language - [https://en.wikipedia.org/wiki/Pattern_language wikipedia]"},{"slug":"platform-earth","title":"Platform Earth","date":1516040195327,"synopsis":"Platform Earth is a [[microservice]] platform for the commons. Microservices are traditionally employed by large companies, distributed across many departments and work teams, to achieve scalability, agility and the ability to maintain high reliability systems."},{"slug":"platform-earth-activity","title":"Platform Earth Activity","date":1516713706837,"synopsis":"View all activity from [[Platform Earth Sites]] listed in the roster below:"},{"slug":"platform-for-cooperation","title":"Platform for Cooperation","date":1516038064254,"synopsis":"[[Platform Earth]] is aimed at providing as simple and as scaleable a means to allow socially oriented organisations to cooperate. Too many projects are re-inventing the wheel, and we now have robust open source tool chains that these organisations can deploy to reduce costs and improve quality."},{"slug":"post-hackathon-discourse","title":"Post-Hackathon Discourse","date":1517510952185,"synopsis":"What happens to all the valuable content captured during an unconference or hackathon?"},{"slug":"public-key-infrastructure","title":"Public Key Infrastructure","date":1517747823725,"synopsis":"A public key infrastructure ([[PKI]]) is a set of roles, policies, and procedures needed to create, manage, distribute, use, store, and revoke [[digital certificate]]s and manage public-key encryption - [https://en.wikipedia.org/wiki/Public_key_infrastructure wikipedia]"},{"slug":"redesigning-agility","title":"Redesigning Agility","date":1517762055521,"synopsis":"I participated in a one-day workshop on integrating user experience design into the agile development process. This is interesting in this context only in that the participants came with strong opinions and lots at stake professionally. I directed and produced this video summary with my cell phone camera and consumer grade video editing software."},{"slug":"roomnzoom","title":"Room'n'Zoom","date":1517514437948,"synopsis":"The conference in the room is livestreamed on [[Zoom]] whilst displayed on a projector, so the remote participants are visible to the room attendees."},{"slug":"scenarios","title":"Scenarios","date":1517317707474,"synopsis":"When you're designing a product, you need to have some real live scenarios in mind for how people are going to use it. Otherwise you end up designing a product that doesn't correspond to any real-world usage (like the Cue?Cat)."},{"slug":"self-organization","title":"Self-organization","date":1517398840553,"synopsis":"Self-organization, also called spontaneous order (in the social sciences), is a process where some form of overall order arises from local interactions between parts of an initially disordered system. The process is spontaneous, not needing control by any external agent. It is often triggered by random fluctuations, amplified by positive feedback. The resulting organization is wholly decentralized, distributed over all the components of the system. As such, the organization is typically robust and able to survive or self-repair substantial perturbation. "},{"slug":"sensemaking","title":"Sensemaking","date":1517504281260,"synopsis":"Sensemaking is the process by which people give meaning to experience. While this process has been studied by other disciplines under other names for centuries, the term \"sensemaking\" has primarily marked three distinct but related research areas since the 1970s: Sensemaking was introduced to human–computer interaction by PARC researchers Russell, Stefik, Pirolli and Card in 1993, to information science by Brenda Dervin, and to organizational studies by Karl E. Weick - [https://en.wikipedia.org/wiki/Sensemaking wikipedia]"},{"slug":"shoreditch","title":"Shoreditch","date":1517751551481,"synopsis":"Shoreditch is an inner city district in the East End of London, Central London in the London Borough of Hackney and lies immediately to the north and north east of the City of London. Shoreditch High Street railway station partly in Shoreditch but mostly in the Bethnal Green area of Tower Hamlets. As a result, sometimes adjacent areas of Bethnal Green are informally referred to as part of Shoreditch - [https://en.wikipedia.org/wiki/Shoreditch wikipedia]"},{"slug":"social-physics","title":"Social Physics","date":1517678963785,"synopsis":"Social physics or sociophysics is a field of science which uses mathematical tools inspired by physics to understand the behavior of human crowds. In a modern commercial use, it can also refer to the analysis of social phenomena with big data - [https://en.wikipedia.org/wiki/Social_physics wikipedia]"},{"slug":"sociocracy","title":"Sociocracy","date":1517751736873,"synopsis":"Sociocracy, also known as dynamic governance, is a system of governance which seeks to achieve solutions that create harmonious social environments as well as productive organizations and businesses. It is distinguished by the use of consent rather than majority voting in decision-making, and decision-making after discussion by people who know each other - [https://en.wikipedia.org/wiki/Sociocracy wikipedia]"},{"slug":"sovrin","title":"Sovrin","date":1517749272796,"synopsis":"Sovrin Identity Network public/permissioned [[Distributed Ledger]]."},{"slug":"space-keeping","title":"Space Keeping","date":1517571329223,"synopsis":"During a conference/unconference or hacakthon, there is both the host of the building and also the host of the conference."},{"slug":"sparql","title":"SPARQL","date":1517665910625,"synopsis":"SPARQL (pronounced \"sparkle\" is an [[RDF Query Language]], that is, a semantic query language for databases, able to retrieve and manipulate data stored in [[RDF]] format - [https://en.wikipedia.org/wiki/SPARQL wikipedia]"},{"slug":"stafford-beer","title":"Stafford Beer","date":1517398157868,"synopsis":"Stafford Beer (born Anthony Stafford Beer, 25 September 1926 – 23 August 2002) was a British theorist, consultant and professor at the Manchester Business School. He is best known for his work in the fields of operational research and management cybernetics - [https://en.wikipedia.org/wiki/Stafford_Beer wikipedia]"},{"slug":"systems-of-survival","title":"Systems of Survival","date":1517411499833,"synopsis":"Systems of Survival: A Dialogue on the Moral Foundations of Commerce and Politics, is a book written by Jane Jacobs in 1992 - [https://en.wikipedia.org/wiki/Systems_of_Survival wikipedia]"},{"slug":"tacit-knowledge","title":"Tacit Knowledge","date":1517415554640,"synopsis":"Tacit knowledge (as opposed to formal, codified or explicit knowledge) is the kind of knowledge that is difficult to transfer to another person by means of writing it down or verbalizing it. For example, that London is in the United Kingdom is a piece of explicit knowledge that can be written down, transmitted, and understood by a recipient. However, the ability to speak a language, knead dough, play a musical instrument, or design and use complex equipment requires all sorts of knowledge that is not always known explicitly, even by expert practitioners,"},{"slug":"test-area","title":"test-area","date":1517562872389,"synopsis":"A page with 0 items."},{"slug":"the-great-transformation","title":"The Great Transformation","date":1517416122995,"synopsis":"The Great Transformation is a book by [[Karl Polanyi]], a Hungarian-American political economist. First published in 1944 by Farrar & Rinehart, it deals with the social and political upheavals that took place in England during the rise of the market economy. Polanyi contends that the modern market economy and the modern nation-state should be understood not as discrete elements but as the single human invention he calls the \"Market Society\" - [https://en.wikipedia.org/wiki/The_Great_Transformation_(book) wikipedia]"},{"slug":"the-wealth-of-networks","title":"The Wealth of Networks","date":1517415964860,"synopsis":"The Wealth of Networks: How Social Production Transforms Markets and Freedom is a book by Harvard Law School professor Yochai Benkler published by Yale University Press on April 3, 2006 - [https://en.wikipedia.org/wiki/The_Wealth_of_Networks wikipedia]"},{"slug":"thomas-kuhn","title":"Thomas Kuhn","date":1517413395290,"synopsis":"Thomas Samuel Kuhn (; July 18, 1922 – June 17, 1996) was an American physicist, historian and philosopher of science whose controversial 1962 book The Structure of Scientific Revolutions was influential in both academic and popular circles, introducing the term paradigm shift, which has since become an English-language idiom - [https://en.wikipedia.org/wiki/Thomas_Kuhn wikipedia]"},{"slug":"trevor-e-hilder","title":"Trevor E Hilder","date":1517397850348,"synopsis":"I am the founder of [http://www.webofwealth.org webofwealth.org] and [http://www.nailsoup.net Nail Soup Ltd]"},{"slug":"twine","title":"Twine","date":1517677197599,"synopsis":"YOUTUBE 1jukyU4EK2M"},{"slug":"user-journey","title":"User Journey","date":1517318674566,"synopsis":"The terminology designers use to describe grandma trying and failing to change tv channels."},{"slug":"viable-systems","title":"Viable Systems","date":1517395871278,"synopsis":"The viable system model (VSM) is a model of the organisational structure of any autonomous system capable of producing itself. A viable system is any system organised in such a way as to meet the demands of surviving in the changing environment. One of the prime features of systems that survive is that they are adaptable. The VSM expresses a model for a viable system, which is an abstracted cybernetic (regulation theory) description that is applicable to any organisation that is a viable system and capable of autonomy - [https://en.wikipedia.org/wiki/Via"},{"slug":"w-ross-ashby","title":"W. Ross Ashby","date":1511264699741,"synopsis":"W. Ross Ashby (6 September 1903 in London – 15 November 1972) was an English psychiatrist and a pioneer in [[cybernetics]], the study of the science of communications and automatic control systems in both machines and living things. His first name was not used: he was known as Ross Ashby - [https://en.wikipedia.org/wiki/W._Ross_Ashby wikipedia]"},{"slug":"ward-cunningham","title":"Ward Cunningham","date":1430937369159,"synopsis":"I'm enjoying reading more in [[The Federation]]. Here is a place that I can fork content without concern for the information architecture that results."},{"slug":"welcome-visitors","title":"Welcome Visitors","date":1517751577814,"synopsis":"[https://twitter.com/hashtag/darvozweek?f=tweets&vertical=default #darVOZweek] on Twitter"},{"slug":"wessel-reijers","title":"Wessel Reijers","date":1518386686156,"synopsis":"Wessel is a PhD researcher in Dublin, studying ethics of technology. He is a member of [[DiEM25]] and one of his main interests is organising ways of grassroots democracy."},{"slug":"wikidata","title":"Wikidata","date":1517687773512,"synopsis":"Wikidata is a collaboratively edited knowledge base hosted by the [[Wikimedia Foundation]]. It is intended to provide a common source of data which can be used by [[Wikimedia]] projects such as Wikipedia, and by anyone else, under a public domain license. This is similar to the way Wikimedia Commons provides storage for media files and access to those files for all Wikimedia projects, and which are also freely available for reuse. Wikidata is powered by the software Wikibase - [https://en.wikipedia.org/wiki/Wikidata wikipedia]"},{"slug":"wikimedia","title":"Wikimedia","date":1517687146920,"synopsis":"The Wikimedia movement, or simply Wikimedia, is the global community of contributors to Wikimedia Foundation projects. The movement was created around Wikipedia's community, and has since expanded to the other Wikimedia projects, including the commons projects Wikimedia Commons and Wikidata, and volunteer software developers contributing to MediaWiki. These volunteers are supported by numerous organizations around the world, including the [[Wikimedia Foundation]], related chapters, thematic organizations, and user groups - [https://en.wikipedia.org/wiki/"},{"slug":"wikimedia-foundation","title":"Wikimedia Foundation","date":1517687075554,"synopsis":"The Wikimedia Foundation, Inc. (WMF, or simply Wikimedia) is an American non-profit and charitable organization headquartered in San Francisco, California. It is mostly known for participating in the [[Wikimedia]] movement. It owns the internet domain names of most movement projects and hosts sites like Wikipedia. The foundation was founded in 2003 by Jimmy Wales as a way to fund Wikipedia and its sister projects through non-profit means - [https://en.wikipedia.org/wiki/Wikimedia_Foundation wikipedia]"},{"slug":"wikimedia-uk","title":"Wikimedia UK","date":1517686906116,"synopsis":"Wikimedia UK (WMUK) is a registered charity established to support volunteers in the United Kingdom who work on [[Wikimedia]] projects such as Wikipedia. As such, it is a Wikimedia chapter approved by the Wikimedia Foundation which owns and hosts those projects - [https://en.wikipedia.org/wiki/Wikimedia_UK wikipedia]"},{"slug":"yochai-benkler","title":"Yochai Benkler","date":1517475941590,"synopsis":"Benkler's 2006 book [[The Wealth of Networks]] describes the impact on society of new ways to work. In this presentation to the World Economic Forum he refers to the work of [[Karl Polanyi]] and his 1944 book: [[The Great Transformation]]. It is a critique of the so called shared economy or on-demand economy which highlights the threats to social solidarity."},{"slug":"zomes","title":"Zomes","date":1517232821307,"synopsis":"<div style='padding: 12px; background:#eee; width:96%; align=centered;'>"},{"slug":"zoom","title":"Zoom","date":1508337403329,"synopsis":"Zoom is video conferencing software that is affordable, highly functional and most importantly has a robust API that ensures that using the platform does not result us being locked into a proprietary platform."},{"slug":"zoomcraft","title":"Zoomcraft","date":1517516683060,"synopsis":"Facilitator and presenter [[Good Practice]] on [[Zoom]] or other videoconferencing."}]