[{"slug":"9091-rule","title":"90–9–1 rule","date":1515082507820,"synopsis":"In Internet culture, the [[1% rule (Internet culture)]] is a rule of thumb pertaining to participation in an internet community, stating that only 1% of the users of a website actively create new content, while the other 99% of the participants only lurk."},{"slug":"a-modest-proposal","title":"A modest proposal","date":1520182336316,"synopsis":"There are many fantastic ambitious projects out there that aspire to make big changes to how our earth is governed and how we can cooperate better. [[Platform.Earth]] takes a different approach, in that we look to do simple, scaleable things that we can build together."},{"slug":"about-force-plugin","title":"About Force Plugin","date":1518346620035,"synopsis":"The Force plugin renders nodes and links from a Data item as a graph with dots and arcs automatically positioned by a force relaxation algorithm built into the d3.js visualization package."},{"slug":"adding-a-new-site","title":"Adding a new site","date":1520514616853,"synopsis":"Here we look at how you add a new fedwiki site to your server. How you point [[DNS A Records]] to your server, configure your wiki, and add credentials to Google."},{"slug":"advanced-wiki-nature","title":"Advanced Wiki Nature","date":1519224374192,"synopsis":"The 1995 wiki was recognizably different. Authors collaborating there called this wiki nature. In 2011 we set out to make a work environment that was recognizably wiki but equipped to do data processing. Now we ask, how is that turning out?"},{"slug":"agent-centric","title":"Agent-centric","date":1522509057159,"synopsis":"A page with 1 items."},{"slug":"agile-project-management","title":"Agile Project Management","date":1498578685195,"synopsis":"[[Agile Project Management]] or [[Agile Management]] is an iterative and incremental method of managing the design and build activities for any new product or service."},{"slug":"airtable","title":"Airtable","date":1521643743936,"synopsis":"Below are a collection of links imported from [[OneTab]]. You can view these links here - [https://www.one-tab.com/page/p28n5f_MTaGW2Cs9cXWHBw one-tab.com]:"},{"slug":"analysis-of-operations","title":"Analysis of operations","date":1522511258657,"synopsis":"Project and program planners must assess the lowest organizational level at which functions can be carried out efficiently and effectively.  Governments deciding to privatize functions must decide which are best privatized. Existing types of decentralization must be studied. The appropriate balance of centralization and decentralization should be studied. Training for both national and local managers and officials is necessary, as well as technical assistance in the planning, financing, and management of decentralized functions.<ref name=Forms/>"},{"slug":"anatomy-of-a-server","title":"Anatomy of a Server","date":1520439645476,"synopsis":"Here we describe the essential elements that make up a [[Wiki Node Server]]:"},{"slug":"anders-explaining-the-map","title":"Anders explaining the map","date":1521645513154,"synopsis":"This is \"Anders explaining the map\" by David Bovill on Vimeo, the home for high quality videos and the people who love them- [https://vimeo.com/260997275 vimeo.com]"},{"slug":"anthropological-archive","title":"Anthropological Archive","date":1517312364116,"synopsis":"An [[archive]] can be considered as a store of artefacts, whether digital or physical, but here we look to describe something more organic, more \"present\" and evolving in terms of structure, and more psychosocial in terms of content."},{"slug":"application-research-and-links","title":"Application research and links","date":1522312819143,"synopsis":"Here we gather links regarding [[Platform Earth]] funders and partners with regard to developing a [[business plan]] for the [[Unfound]] incubator:"},{"slug":"appropriate-size","title":"Appropriate size","date":1522511319784,"synopsis":"Gauging the appropriate size or scale of decentralized units has been studied in relation to the size of sub-units of hospitals and schools, road networks, administrative units in business and public administration, and especially town and city governmental areas and decision making bodies."},{"slug":"assets-plugin","title":"Assets Plugin","date":1519469923482,"synopsis":"We want a plugin that can show a subdirectory of assets, offer links to those assets, and add more on drop."},{"slug":"asymmetry","title":"Asymmetry","date":1522511371402,"synopsis":"Decentralization may be uneven and \"asymmetric\" given any one country's population, political, ethnic and other forms of diversity. In many countries, political, economic and administrative responsibilities may be decentralized to the larger urban areas, while rural areas are administered by the central government. Decentralization of responsibilities to provinces may be limited only to those provinces or states which want or are capable of handling responsibility. Some privatization may be more appropriate to an urban than a rural area; some types of pr"},{"slug":"audio-file-in-fedwiki","title":"audio file in fedwiki","date":1518439694904,"synopsis":"[[Sina Def]] ask me about how to drag and drop audio file from her laptop to a fedwiki pages."},{"slug":"autonomous-groups","title":"Autonomous Groups","date":1522508284959,"synopsis":"A page with 1 items."},{"slug":"be-technology-agnostic","title":"Be Technology Agnostic","date":1520171101059,"synopsis":"Each team should be able to choose and upgrade their stack without having to coordinate with other teams. Custom Elements are a great way to hide implementation details while providing a neutral interface to others."},{"slug":"blockchain","title":"Blockchain","date":1522998927699,"synopsis":"A blockchain is a peer to peer tool that works something like an open ledger. Every participant in a certain network had access to the whole history of every \"transaction\"- whether it be financial as in the case of Bitcoin, or also general information."},{"slug":"bootstrapping-phase","title":"Bootstrapping Phase","date":1522522438642,"synopsis":"A page with 1 items."},{"slug":"branding","title":"Branding","date":1522502874781,"synopsis":"Here we explore names, and ideas for naming sub-projects and products within the [[platform earth]] initiative."},{"slug":"build-a-resilient-site","title":"Build a Resilient Site","date":1520171133226,"synopsis":"Your feature should be useful, even if JavaScript failed or hasn’t executed yet. Use Universal Rendering and Progressive Enhancement to improve perceived performance."},{"slug":"business-plan","title":"Business Plan","date":1522255963494,"synopsis":"The starting place is the [[Business Plan]], which I've started making notes on here - [[Bootstrap.coop]]. It's just a working title - [[Coop Platform]] may be a better one, or simple [[Platform Earth]]."},{"slug":"caddy-on-dreamfactory","title":"Caddy on DreamFactory","date":1511885789201,"synopsis":"Below are a collection of links imported from [[OneTab]]. You can view these links here - [https://www.one-tab.com/page/jzTse7Z6ST6FwGU_OWrDgQ one-tab.com]:"},{"slug":"changes-to-this-site","title":"Changes to this Site","date":1434532209841,"synopsis":"Below we list recent changes to this site only without also listing changes from the [[Neighbourhood]]:"},{"slug":"citation-bar","title":"Citation Bar","date":1512232837479,"synopsis":"The \"citation bar\" is a proposal for a new framing of the journal display in wiki."},{"slug":"civil-law","title":"Civil law","date":1520422341953,"synopsis":"Il civil law, in italiano diritto continentale o diritto romano-germanico, è un modello di ordinamento giuridico derivante dal diritto romano, oggi dominante a livello mondiale.I sistemi di civil law si sono sviluppati dapprima nell'Europa continentale e poi in moltissimi stati del pianeta, all'interno della cornice dottrinaria del diritto romano-giustinianeo - [https://it.wikipedia.org/wiki/Civil_law wikipedia]"},{"slug":"coding-tips","title":"Coding Tips","date":1520439891447,"synopsis":"Even simple things require a few steps in the [[Federated Wiki]] code. Here I remind myself how to get things done."},{"slug":"coffeehouse","title":"Coffeehouse","date":1516547041190,"synopsis":"A coffeehouse, coffee shop or café (sometimes spelled cafe) is an establishment which primarily serves hot coffee, related coffee beverages (e.g., café latte, cappuccino, espresso), tea, and other hot beverages - [https://en.wikipedia.org/wiki/Coffeehouse wikipedia]"},{"slug":"commons","title":"Commons","date":1520438124212,"synopsis":"The commons is the cultural and natural resources accessible to all members of a society, including natural materials such as air, water, and a habitable earth. These resources are held in common, not owned privately - [https://en.wikipedia.org/wiki/Commons wikipedia]"},{"slug":"commons-writing","title":"Commons Writing","date":1520856724422,"synopsis":"Commons writing is the process of enabling collaborative writing and research between groups that lays down over time an archive of readily forkable content of use to the cooperative economy."},{"slug":"complex-software-projects","title":"Complex Software Projects","date":1522508233808,"synopsis":"A page with 1 items."},{"slug":"config-notes","title":"Config Notes","date":1513502486506,"synopsis":"We note the paths where important server files get installed. See also [[Wiki Admin]], [[Wiki Relocation]]"},{"slug":"configjson","title":"config.json","date":1520439899844,"synopsis":"A page with 1 items."},{"slug":"configuring-wiki-security-passportjs","title":"Configuring Wiki-Security-Passportjs","date":1510694052207,"synopsis":"[[Wiki security]] is provided through the [[Passport.js]]. We can consider modifying the code to enable [[JWT]] based security for [[tranporter]]s - [https://github.com/fedwiki/wiki-security-passportjs/blob/6f60d07a3a7a9f6ade7343cf6e29cc0202d7fc1d/server/social.coffee#L372-L388 github]"},{"slug":"conflict-resolution","title":"Conflict resolution","date":1522510896951,"synopsis":"Economic and/or political decentralization can help prevent or reduce conflict because they reduce actual or perceived inequities between various regions or between a region and the central government."},{"slug":"connor-on-fed-wiki","title":"Connor on Fed Wiki","date":1521645508619,"synopsis":"This is \"Connor on Fed Wiki\" by David Bovill on Vimeo, the home for high quality videos and the people who love them- [https://vimeo.com/261005007 vimeo.com]"},{"slug":"continuous-deployment","title":"Continuous Deployment","date":1522509087748,"synopsis":"A page with 1 items."},{"slug":"cooperative","title":"Cooperative","date":1521636948700,"synopsis":"A cooperative (also known as co-operative, co-op, or coop) is \"an autonomous association of persons united voluntarily to meet their common economic, social, and cultural needs and aspirations through a jointly-owned and democratically-controlled enterprise\" - [https://en.wikipedia.org/wiki/Cooperative wikipedia]"},{"slug":"coproduction","title":"Coproduction","date":1522522471859,"synopsis":"A page with 1 items."},{"slug":"copy-ssh-keys-to-server","title":"Copy SSH Keys to Server","date":1434701838287,"synopsis":"Here we describe how to copy over your public ssh keys to a server on Linux and MacOS."},{"slug":"cors","title":"CORS","date":1434978920386,"synopsis":"Here we look at how [[Federated Wiki]] uses CORS headers to enable cross-origin resource sharing. We are particularly interested to see how using CORS might allow us to play nicely with other applications on the web."},{"slug":"creating-a-hugo-website","title":"Creating a Hugo website","date":1516722830014,"synopsis":"On this page we walk through an example of how to create a hugo website. The example we is based on documenting our experience of getting up a real website ([http://SOCIALMEDIASQUAD.CC socialmediasqaud.cc])"},{"slug":"creative-commons","title":"Creative Commons","date":1516036680830,"synopsis":"Creative Commons (CC) is an American non-profit organization devoted to expanding the range of creative works available for others to build upon legally and to share. The organization has released several copyright-licenses known as Creative Commons licenses free of charge to the public - [https://en.wikipedia.org/wiki/Creative_Commons wikipedia]"},{"slug":"creative-currency","title":"Creative Currency","date":1520419910951,"synopsis":"A page with 0 items."},{"slug":"current-stuff-to-see","title":"CURRENT stuff to SEE","date":1523016838335,"synopsis":"Here we start to create graphic and design elements for [[Voz]] and community currencies in general."},{"slug":"custom-elements","title":"Custom Elements","date":1520182389849,"synopsis":"There are two parts to Custom Elements: autonomous custom elements and customized built-in elements."},{"slug":"daemon-computing","title":"Daemon (computing)","date":1516989666382,"synopsis":"In multitasking computer operating systems, a daemon ( or ) is a computer program that runs as a background process, rather than being under the direct control of an interactive user. Traditionally, the process names of a daemon end with the letter d, for clarification that the process is, in fact, a daemon, and for differentiation between a daemon and a normal computer program. For example, syslogd is the daemon that implements the system logging facility, and sshd is a daemon that serves incoming SSH connections - [https://en.wikipedia.org/wiki/Daemon_"},{"slug":"dangers-of-decentralization","title":"Dangers of Decentralization","date":1522511616585,"synopsis":"The literature identifies eight essential preconditions that must be ensured while implementing decentralization in order to avert the so-called \"dangers of decentralization\"."},{"slug":"darvoz","title":"Darvoz","date":1521797840159,"synopsis":"[[Darvoz]] is Portuguese for \"to give voice\"."},{"slug":"darvozweek","title":"#darVOZweek","date":1523950541124,"synopsis":"The Newspeak [[#darVOZweek ]] hackathon was the first of a series of sprints organised by the [[Culture Collective]] on community designed technology."},{"slug":"darvozweek-day-5","title":"Darvozweek Day 5","date":1517527299763,"synopsis":"Raw notes from the Zoom meeting (first part of the meeting was not recorded on the video):"},{"slug":"darvozweek-videos","title":"darVozWeek Videos","date":1521643543690,"synopsis":"Below are a collection of links imported from [[OneTab]]. You can view these links here - [https://www.one-tab.com/page/U_O7vbCXR5-119Y71aACjw one-tab.com]:"},{"slug":"data-activity","title":"Data Activity","date":1519755162310,"synopsis":"View all activity from [[Data Sites]] listed in the roster below:"},{"slug":"data-plugins","title":"Data Plugins","date":1489377342487,"synopsis":"Wiki plugins can share data with other plugins rendered in the lineup. Signaling conventions vary with older plugins supporting multiple formats."},{"slug":"davos","title":"Davos","date":1523468767175,"synopsis":"Davos is an Alpine town, and a municipality in the Prättigau/Davos Region in the canton of Graubünden, Switzerland. It has a permanent population of 11,060 (2016). Davos is located on the river Landwasser, in the Rhaetian Alps, between the Plessur and Albula Range. At 1,560 m (5,120 ft), it is described as \"the highest town in the Alps\". - [https://en.wikipedia.org/wiki/Davos wikipedia]"},{"slug":"decentralised-technology","title":"Decentralised Technology","date":1522513984846,"synopsis":"The [[internet]] was originally conceived of as a fully decentralized network, having no owners at all. This is no longer the case - [http://www.newyorker.com/online/blogs/elements/2013/12/the-mission-to-decentralize-the-internet.html newyorker.com]"},{"slug":"decentralization","title":"Decentralization","date":1522511968747,"synopsis":"Decentralization is the process of distributing or dispersing functions, powers, people or things away from a central location or authority. While centralization, especially in the governmental sphere, is widely studied and practiced, there is no common definition or understanding of decentralization."},{"slug":"decentralization-of-corruption","title":"Decentralization of Corruption","date":1522511622130,"synopsis":"A page with 1 items."},{"slug":"decentralized-livecode","title":"Decentralized Livecode","date":1521813171165,"synopsis":"I've been working for a while now on a decentralised, serverless version of [[Livecode]]. The aim is to create an agile coding environment for decentralised application development that works with [[platform.earth]]."},{"slug":"democracy-caf","title":"Democracy Café","date":1516549600000,"synopsis":"The purpose of Democracy Cafes is to make genuine transnational politics possible, by providing an online space in which political activists from across Europe can meet and discuss pressing political issues in an informal “Cafe” setting."},{"slug":"democracy-cafe","title":"Democracy Cafe","date":1517675193815,"synopsis":"Here are a few notes on the Democracy café format that we are using for political discusssions:"},{"slug":"detailed-look-at-wiki-components","title":"detailed look at wiki components","date":1516030115081,"synopsis":"Several components collaborate to make this local wiki farm work.  Here we consider the parts and their interaction with the whole."},{"slug":"devops","title":"DevOps","date":1502218167112,"synopsis":"DevOps is a software development and delivery process that emphasises communication and collaboration between product management, software development, and operations professionals."},{"slug":"devops-microservices","title":"DevOps Microservices","date":1520856751393,"synopsis":"The aim here is to create a range of technical services that make it easy for software to control DNS, and things like site provisioning."},{"slug":"digitalocean","title":"DigitalOcean","date":1428065631465,"synopsis":"[[DigitalOcean]] is an American virtual private server provider based in New York City. The company leases capacity from existing datacenters, including sites in New York, Amsterdam, San Francisco, London and Singapore."},{"slug":"digitalocean-api","title":"DigitalOcean API","date":1520437913317,"synopsis":"The first step to using the API is to generate a personal access token. Personal access tokens function like ordinary [[OAuth]] access tokens. They can be used instead of a password for [[DigitalOcean]] over [[HTTPS]], or can be used to authenticate to the API over [[Basic Authentication]]."},{"slug":"dil-green","title":"Dil Green","date":1522736740970,"synopsis":"Dil trained and worked as an architect over 30-odd years, but recently have been doing more and more in the digital world."},{"slug":"dil-presentation","title":"Dil presentation","date":1521645518757,"synopsis":"This is \"Dil presentation\" by David Bovill on Vimeo, the home for high quality videos and the people who love them- [https://vimeo.com/261011731 vimeo.com]"},{"slug":"discourse-sso","title":"Discourse SSO","date":1521034272359,"synopsis":"[[Discourse]]"},{"slug":"distributed-ledger","title":"Distributed Ledger","date":1517746789899,"synopsis":"A distributed ledger (also called a shared ledger, or referred to as distributed ledger technology) is a consensus of replicated, shared, and synchronized digital data geographically spread across multiple sites, countries, or institutions. There is no central administrator or centralised data storage - [https://en.wikipedia.org/wiki/Distributed_ledger wikipedia]"},{"slug":"diversity","title":"Diversity","date":1522510929836,"synopsis":"Norman L. Johnson writes that diversity plays an important role in decentralized systems like [[ecosystems]], [[social groups]], large organizations, [[political systems]]. \"Diversity is defined to be unique properties of entities, agents, or individuals that are not shared by the larger group, population, structure. Decentralized is defined as a property of a system where the agents have some ability to operate \"locally.”  Both decentralization and diversity are necessary attributes to achieve the self-organizing properties of interest.\"<ref name=NLJohn"},{"slug":"dns-microservice","title":"DNS Microservice","date":1520785528190,"synopsis":"Here we track the progress of creating [[microservices]] for [[the commons]] that let us own and control our own [[domain names]]."},{"slug":"dns-tools","title":"DNS Tools","date":1523286845347,"synopsis":"Below are a collection of links imported from [[OneTab]]. You can view these links here - [https://www.one-tab.com/page/UjPZTHdTRKiruUBe90YTeg one-tab.com]:"},{"slug":"docker-based-deployment","title":"Docker based deployment","date":1522509097793,"synopsis":"A page with 1 items."},{"slug":"domain-api","title":"Domain API","date":1457860995215,"synopsis":"Search for and register domains and manage your [[DNS]] settings with a [[REST]]ful [[Domain API]]."},{"slug":"domain-names","title":"Domain Names","date":1520433169546,"synopsis":"Here we gather useful information about services you can use to manage your domain names, or look up information about domain names."},{"slug":"domain-specific-language","title":"Domain-specific language","date":1523522249742,"synopsis":"A domain-specific language (DSL) is a computer language specialized to a particular application domain. This is in contrast to a general-purpose language, which is broadly applicable across domains - [https://en.wikipedia.org/wiki/Domain-specific_language wikipedia]"},{"slug":"domain-specific-legal-language","title":"Domain Specific Legal Language","date":1523521706751,"synopsis":"A [[Domain Specific Language]] or DSL is a simplified language that makes it easier for subject experts to implement software solutions in their chosen domain."},{"slug":"dreamfactory","title":"DreamFactory","date":1519560640909,"synopsis":"Here we look at installing DreamFactory on [[DigitalOcean]] servers. Essentially the main purpose of DreamFactory is to make it easy to provide and manage a [[REST Gateway]] that can act as a proxy to a wide range of [[microservices]]."},{"slug":"dreamfactory-nginx-config","title":"DreamFactory Nginx Config","date":1502526722232,"synopsis":"Here we should link to the [[Nginx Configuration File]] for the DreamFactory Wiki."},{"slug":"dreamfactory-paths","title":"DreamFactory Paths","date":1519506398950,"synopsis":"Here are some of the paths to the files that have been configured on the server:"},{"slug":"dreamfactory-wiki","title":"DreamFactory Wiki","date":1503088482614,"synopsis":"So the idea here is to see if we can get [[DreamFactory]] to fulfil the basic [[Fedwiki Server Requirements]], which essentially means serving json files, a favicon and a sitemap via HTTP GET."},{"slug":"dreamfactory-wiki-assets","title":"Dreamfactory Wiki Assets","date":1502543350082,"synopsis":"Here we explore how we will organise media assets in wiki to create our own [[decentralised media commons]] on"},{"slug":"dreamfactory-wiki-files","title":"DreamFactory Wiki Files","date":1503088220939,"synopsis":"Here we look at how we can provide proper [[RESTful]] access to [[Fedwiki Files]] from multiple domains using [[DreamFactory]]."},{"slug":"dropped-image","title":"Dropped Image","date":1523046093397,"synopsis":"This is a simple image dropped on to a wiki."},{"slug":"dsls-in-javascript","title":"DSLs in Javascript","date":1523521811657,"synopsis":"Here we research the viability of creating [[domain specific language]]s  in [[javascript]]."},{"slug":"dynadot","title":"Dynadot","date":1520767553962,"synopsis":"Dynadot is a service for registering, managing and generally dealing with all aspects on DNS management. Most importantly it has a full API, and is free to use."},{"slug":"dynamic-routing","title":"Dynamic Routing","date":1520904365792,"synopsis":"Below are a collection of links imported from [[OneTab]]. You can view these links here - [https://www.one-tab.com/page/udRw-sMATVG7hGahrM7yuw one-tab.com]:"},{"slug":"economies-of-scale","title":"Economies of Scale","date":1522522465218,"synopsis":"A page with 1 items."},{"slug":"ecosystem","title":"Ecosystem","date":1501683848863,"synopsis":"The term \"ecosystem\" was first used in 1935 in a publication by British ecologist [[Arthur Tansley]]."},{"slug":"efficiency","title":"Efficiency","date":1522510801628,"synopsis":"In business, decentralization leads to a management by results ([[management by objectives]]) philosophy which focuses on definite objectives to be achieved by unit results. Decentralization of government programs is said to increase efficiency – and effectiveness – due to reduction of congestion in communications, quicker reaction to unanticipated problems, improved ability to deliver services, improved information about local conditions, and more support from beneficiaries of programs."},{"slug":"equitable-working-practices","title":"Equitable Working Practices","date":1522508309061,"synopsis":"A page with 1 items."},{"slug":"establish-team-prefixes","title":"Establish Team Prefixes","date":1520171123515,"synopsis":"Agree on naming conventions where isolation is not possible yet. Namespace CSS, Events, Local Storage and Cookies to avoid collisions and clarify ownership."},{"slug":"etherpad-lite","title":"Etherpad Lite","date":1512054976393,"synopsis":"[[Etherpad Lite]] is an almost complete rewrite of the original [[Etherpad]] software, based on different technical foundations and written by different authors."},{"slug":"etruscan-language","title":"Etruscan language","date":1524769368307,"synopsis":"The Etruscan language was the spoken and written language of the Etruscan civilization, in Italy, in the ancient region of Etruria and in parts of Corsica, Campania, Veneto, Lombardy and Emilia-Romagna. Etruscan influenced Latin, but was eventually completely superseded by it."},{"slug":"expand-and-sketch","title":"Expand and sketch","date":1525627956926,"synopsis":"On this page we start an initial design and sketch process. We start with:"},{"slug":"farm-roster","title":"Farm Roster","date":1437706106712,"synopsis":"We can use the unix find command to list farm sites with non-empty pages directories. Cut extracts the domain name from the path. Sort arranges them in a canonical order."},{"slug":"federated-data","title":"Federated Data","date":1513521869730,"synopsis":"When we are thinking about data in the federation we are talking about people curating there own data sets by embedding [[Live Data]] or [[Static Data]] as [[JSON Data Objects]] into one of their [[Federated Wiki Pages]]."},{"slug":"federated-microservice","title":"Federated Microservice","date":1511368391023,"synopsis":"Here we explore how we might implement a [[microservice]] architecture in a federated way."},{"slug":"federated-wiki","title":"Federated Wiki","date":1523375309793,"synopsis":"[[Federated Wiki]] is a complete rethink of Wiki from its inventor, [[Ward Cunningham]]. He felt that the build out of wiki had never quite enabled the character of collaboration he had hoped for, and set out to build anew."},{"slug":"federated-wiki-page","title":"Federated Wiki Page","date":1457827148355,"synopsis":"A [[Fedwiki Page]] is a mobile-phone sized column of authored hypertext, that can be displayed side-by-side in a [[Fedwiki Lineup]] to form a dynamically constructed [[Web Page]]."},{"slug":"fedwiki","title":"FedWiki","date":1516790411884,"synopsis":"Fedwiki is short for [[Federated Wiki]]. Originally it was called [[Smallest Federated Wiki]]. Inside the community we tend to simply use [[wiki]]."},{"slug":"fedwiki-farm-admin","title":"Fedwiki Farm Admin","date":1521644905497,"synopsis":"A first look at the code for managing wiki farms and creating group working practices such as legal entities, community currencies and collaborations around commons…- [https://vimeo.com/261095206 vimeo.com]"},{"slug":"fedwiki-for-notetaking","title":"FedWiki for Notetaking","date":1520168683866,"synopsis":"All the usual warning apply: can't edit on a tablet - it needs a mouse.  Changing a note name means re-organizing content into a new note."},{"slug":"fedwiki-for-scholarly-work","title":"FedWiki for Scholarly Work","date":1437927172554,"synopsis":"What is scholarly work?"},{"slug":"fedwiki-page","title":"Fedwiki Page","date":1457827278953,"synopsis":"A [[Fedwik]]i page is a mobile-phone sized column of authored hypertext, that can be displayed side-by-side in a [[Fedwiki Lineup]] to form a dynamically constructed [[Web Page]]."},{"slug":"fedwiki-server","title":"Fedwiki Server","date":1517402974543,"synopsis":"This page is about the current and future of [[Fedwiki]] servers. The current reference implementation in [[Node]] can be found her on [https://github.com/fedwiki/wiki-node-server gitbub]"},{"slug":"fedwiki-server-requirements","title":"Fedwiki Server Requirements","date":1519491253112,"synopsis":"Here we list the minimum requirements for a Fedwiki Server. Our aim is to maintain these requirement for [[Liquid Wiki]] as described in the [[Functional Specification]]. See [[Implementing Liquid Wiki]]"},{"slug":"fedwiki-server-routes","title":"Fedwiki Server Routes","date":1520439582882,"synopsis":"Here we examine the current fedwiki server routing:"},{"slug":"fedwiki-site-administration","title":"Fedwiki Site Administration","date":1517403029846,"synopsis":"These pages are about techniques, problems and issues with regard to running a [[Fedwiki Server]]."},{"slug":"fedwiki-theme-folder","title":"Fedwiki Theme Folder","date":1520439842301,"synopsis":"You can set the [[CSS]] (or indeed any file such as an image file) that you want to wiki to serve), by adding a [[Fedwiki Theme Folder]] to the status folder of the site."},{"slug":"fedwiki-tools","title":"Fedwiki Tools","date":1523477599939,"synopsis":"Here we list a few tools that are of particular use in managing and creating [[Fedwiki]] content. For a full list of transporters navigate to the site below:"},{"slug":"firebase","title":"Firebase","date":1521644305103,"synopsis":"Firebase is a mobile and web application development platform developed by Firebase, Inc. in 2011, then acquired by Google in 2014 - [https://en.wikipedia.org/wiki/Firebase wikipedia]"},{"slug":"first-iteration","title":"First Iteration","date":1523602120849,"synopsis":"Here are .png images made from the first Active VSM sketches."},{"slug":"flickr-microservice","title":"Flickr Microservice","date":1519680318502,"synopsis":"Use these images to test the [[Flickr Microservice]]."},{"slug":"flickr-test-images","title":"Flickr Test Images","date":1519680141961,"synopsis":"Use these images to test the [[Flickr Microservice]]."},{"slug":"flp-transporter","title":"FLP Transporter","date":1448849560736,"synopsis":"This service imports pages from the Federated Library Project, a wiki-like network of WordPress blogs. [http://hapgood.us/2015/10/27/write-for-the-federated-library-project/ post]"},{"slug":"freelance-co-ops","title":"Freelance co-ops","date":1521637115576,"synopsis":"Here we start some research of freelance [[cooperative]]s. An aim here is to provide a service and begin to reach out to coops and individuals with media, design and technology (eg coding) skills and work with them to co-design [[platform earth]] infrastructure sharing, and cooperative working and governanceusing [[Voz]]."},{"slug":"functional-specification","title":"Functional Specification","date":1517186490113,"synopsis":"A functional specification describes how a product will work entirely from the user's perspective. It doesn't care how the thing is implemented. It talks about features. It specifies screens, menus, dialogs, and so on - [http://www.joelonsoftware.com/articles/fog0000000035.html joelonsoftware.com]"},{"slug":"future-of-wiki","title":"Future of Wiki","date":1516535209952,"synopsis":"During the day, we invite you to join in a number of workshops where you can explore a news forms of wiki and new forms of writing together."},{"slug":"garden-of-eden","title":"Garden of Eden","date":1520422491778,"synopsis":"The Garden of Eden (Hebrew גַּן עֵדֶן, Gan ʿEḏen) or (often) Paradise, is the biblical \"garden of God\", described most notably in the Book of Genesis chapters 2 and 3, and also in the Book of Ezekiel. Genesis 13:10 refers to the \"garden of God\" (not called Eden by name), and the \"trees of the garden\" are mentioned in Ezekiel 31. The Book of Zechariah and the Book of Psalms also refer to trees and water in relation to the temple without explicitly mentioning Eden - [https://en.wikipedia.org/wiki/Garden_of_Eden wikipedia]"},{"slug":"get-in-touch","title":"Get in touch:)","date":1516203766982,"synopsis":"A page with 1 items."},{"slug":"gitkraken","title":"Gitkraken","date":1522423470196,"synopsis":"[https://blog.axosoft.com/ gitkraken blog]"},{"slug":"goals-for-darvozweek","title":"Goals for Darvozweek","date":1520425947382,"synopsis":"To create a decentralised version of [[Federated Wiki]] on [[Holochain]]. - which might be called [[Liquid Wiki]]"},{"slug":"google-sheet-api","title":"Google Sheet API","date":1521643572503,"synopsis":"Below are a collection of links imported from [[OneTab]]. You can view these links here - [https://www.one-tab.com/page/XZhhDwhRQpmdItfl00WM_w one-tab.com]:"},{"slug":"governance-interface","title":"Governance Interface","date":1523017653186,"synopsis":"Governance is complex. Simplified governance is possible, it can be effective, however such simplified governance has a proven track record of negative consequences."},{"slug":"graph-database","title":"Graph database","date":1466779466598,"synopsis":"In computing, a graph database is a database that uses graph structures for semantic queries with nodes, edges and properties to represent and store data - [https://en.wikipedia.org/wiki/Graph_Database wikipedia]"},{"slug":"group-to-group-conversation","title":"Group-to-Group Conversation","date":1516548734537,"synopsis":"A page with 1 items."},{"slug":"gunjs","title":"Gun.js","date":1521644532527,"synopsis":"I like the look of [[Gun.js]] for a distributed [[graph database]] with realtime sync. This is an alternative to using something like [[Airtable]] and a more traditional relational database approach."},{"slug":"hackmd","title":"HackMD","date":1524769541416,"synopsis":"Below are a collection of links imported from [[OneTab]]. You can view these links here - [https://www.one-tab.com/page/0o4kViDsStCErSr7V-eakA one-tab.com]:"},{"slug":"hand-drawn-vsm-components","title":"Hand-drawn VSM Components","date":1523552271794,"synopsis":"Here I document the early sketching and ideation work in the [[Active VSM diagrams]] project."},{"slug":"hawala","title":"Hawala","date":1520422270429,"synopsis":"Hawala or hewala (Arabic: حِوالة‎, meaning transfer or sometimes trust), also known as hundi or in Somali, xawala or xawilaad, is a popular and informal value transfer system based on the performance and honour of a huge network of money brokers (known as \"hawaladars\")."},{"slug":"help-with-coding-microservices","title":"Help with coding microservices","date":1516212175395,"synopsis":"A page with 0 items."},{"slug":"help-with-facilitation","title":"Help with facilitation","date":1516291782623,"synopsis":"Any project starts with people, and if we are to build useful [[microservices]] the social projects need, the only way to do this is to grow a community, and create a [[participatory design process]] in which the community specifies the services it needs."},{"slug":"help-with-graphic-design","title":"Help with graphic design","date":1516212171953,"synopsis":"A page with 0 items."},{"slug":"help-with-sysadmin-and-devops","title":"Help with sysadmin and devops","date":1516212161265,"synopsis":"A page with 0 items."},{"slug":"help-with-writing-and-research","title":"Help with writing and research","date":1516212151817,"synopsis":"A page with 0 items."},{"slug":"holochain","title":"Holochain","date":1514134906111,"synopsis":"Holographic storage for distributed applications. A holochain is a validating distributed hash table (DHT) where every node enforces validation rules on data against the signed chains where the data originated - [http://ceptr.org/projects/holochain ceptr.org]"},{"slug":"holochain-hackathon","title":"Holochain Hackathon","date":1522245053125,"synopsis":"A parte da manhã do evento será focada em explicar os conceitos, e vai contar com uma palestra em inglês, e sessão de perguntas com membros internacionais da equipe do [[Holochain]] - [https://www.sympla.com.br/meetup-holochain-brasil__250535 sympla.com.br]"},{"slug":"how-hawala-works","title":"How hawala works","date":1520421210536,"synopsis":"In the most basic variant of the hawala system, money is transferred via a network of hawala brokers, or ''hawaladars'' - [https://en.wikipedia.org/wiki/Hawala#How_hawala_works wikipedia]"},{"slug":"how-to-wiki","title":"How To Wiki","date":1488041103204,"synopsis":"Here we describe how to use the web interface to the federated wiki. Read [[About Federated Wiki]] to learn about the project. If you are just starting to write in your first wiki then read the [[Field Guide to the Federation]]."},{"slug":"how-you-can-help","title":"How you can help","date":1520182339605,"synopsis":"There are many ways to get involved. [[A modest proposal]] starts small and we hope to make as welcoming and easy as possible to get involved, from technical areas, to community and project management."},{"slug":"html-imports","title":"HTML Imports","date":1520014500573,"synopsis":"HTML import is a tool to include [[HTML]] documents and web components from external sources without using AJAX ([[Ajax (programming)]]) requests and similar methods - [https://www.w3.org/TR/html-imports/ w3.org]"},{"slug":"html-templates","title":"HTML Templates","date":1520017298636,"synopsis":"The HTML <template> element represents a template in your markup. It contains \"template contents\"; essentially inert chunks of cloneable DOM."},{"slug":"hugo","title":"Hugo","date":1516724702942,"synopsis":"Hugo is a fast and modern [[static site]] generator written in Go, and designed to make website creation fun again. Websites built with Hugo are extremely fast and secure."},{"slug":"hugo-cms","title":"Hugo CMS","date":1521837973417,"synopsis":"Here we look at how we can install and use Hugo CMS to make it easy to edit and manipulate content for your [[Hugo]] site."},{"slug":"hugo-kube-theme","title":"Hugo Kube theme","date":1516022582672,"synopsis":"Kube is a professional and a responsive [[Hugo]] theme for developers and designers that offers a documentation section mixed with a landing page and a blog. The theme based on the Version 6.5.2 Kube Framework - [https://imperavi.com/kube/ imperavi.com]"},{"slug":"hugo-on-netlify","title":"Hugo on Netlify","date":1534376036341,"synopsis":"A personal experience about deploying Hugo with Netlify"},{"slug":"hugo-template-example","title":"Hugo template example","date":1516894070394,"synopsis":"Below are a collection of links imported from [[OneTab]]. You can view these links here - [https://www.one-tab.com/page/ghogt24YRzeTbRE7iPYdnQ one-tab.com]:"},{"slug":"hugo-themes","title":"Hugo Themes","date":1516724644690,"synopsis":"Here we collect [[Hugo]] themes that we can use in projects. You may also want to take a look at the curated list of [[Retro]] themed sites."},{"slug":"ideas-behind-micro-frontends","title":"Ideas behind Micro Frontends","date":1520171631574,"synopsis":"Here we look at the core ideas behind [[Micro Frontends]]. Let's discuss these and see how they compare to the existing [[Wiki Client]], and how this may be used for [[Platform Earth Frontends]]."},{"slug":"identity-microservices","title":"Identity Microservices","date":1523034670549,"synopsis":"Description of the approach to developing the forthcoming identity micro services."},{"slug":"image-drag--drop","title":"Image Drag & Drop","date":1523050080293,"synopsis":"Here we look at the current image drag and drop functionality, demo a tip, and suggest an improvement that would enable direct drag and drop from any image url on a web site."},{"slug":"image-search","title":"Image Search","date":1523049357342,"synopsis":"You can now search for images and bring them easily into wiki. Simply drag and drop images onto the [[Imagine Transport]] to bring images into wiki, or use [[Google Image Search]] to search for images and then bring them in as a batch."},{"slug":"image-transporter","title":"Image Transporter","date":1523046093405,"synopsis":"This service creates wiki pages with images in several forms without loading image data within the page. Use this for large or detailed images that will be stored remotely."},{"slug":"implementing-liquid-wiki","title":"Implementing Liquid Wiki","date":1517185641162,"synopsis":"Here we start the basis of a [[functional specification]] for [[Liquid Wiki]]:"},{"slug":"import-documents","title":"Import Documents","date":1420512843820,"synopsis":"Federated wiki is just one more document format that hopes to play well with others and bring something new to the party."},{"slug":"inadvertent-or-silent","title":"Inadvertent or silent","date":1522511354147,"synopsis":"Decentralization ideally happens as a careful, rational, and orderly process, but it often takes place during times of economic and political crisis, the fall of a regime and the resultant power struggles. Even when it happens slowly, there is a need for experimentation, testing, adjusting, and replicating successful experiments in other contexts. There is no one blueprint for decentralization since it depends on the initial state of a country and the power and views of political interests and whether they support or oppose decentralization."},{"slug":"initiation","title":"Initiation","date":1522511219905,"synopsis":"The processes by which entities move from a more to a less centralized state vary. They can be initiated from the centers of authority ([[top-down]])) or from individuals, localities or regions ([[Top-down and bottom-up design]]), or from a \"mutually desired\" combination of authorities and localities working together."},{"slug":"install-graph-plugins","title":"Install Graph Plugins","date":1497207512781,"synopsis":"We'll write patterns using graph plugins developed initially for knowledge representation."},{"slug":"installing-dreamfactory","title":"Installing DreamFactory","date":1519560601237,"synopsis":"Follow this steps for installing Dreamfactory 2.1 on DigitalOcean Server choosing Nginx (not Apache) as the web server and MariaDb as the database - [http://wiki.dreamfactory.com/DreamFactory/APT/Ubuntu_16.04/Installation Install DreamFactory]"},{"slug":"installing-nginx-on-osx","title":"Installing Nginx on OSX","date":1502226749856,"synopsis":"It's straightforwards to install Nginx on OSX with [[bre]] - [http://www.parisnakitakejser.com/homebrew-install-nginx-and-php-fpm-on-mac-os-x/ parisnakitakejser.com]"},{"slug":"ipfs-video-streaming","title":"IPFS Video Streaming","date":1467105344055,"synopsis":"Here we examine how we stream video using IPFS."},{"slug":"isolate-team-code","title":"Isolate Team Code","date":1520171113802,"synopsis":"Don’t share a runtime, even if all teams use the same framework. Build independent apps that are self contained. Don’t rely on shared state or global variables."},{"slug":"item-templates","title":"Item Templates","date":1520871719977,"synopsis":"Here we experiment with automatically generated paragraphs constructed from data. The idea is that a quick copy and paste of a normal paragraph or markdown page-item can be turned into a dynamically generated paragraph with a plugin or server side code."},{"slug":"jason-on-fed-wiki","title":"Jason on Fed Wiki","date":1521645527937,"synopsis":"This is \"Jason on Fed Wiki\" by David Bovill on Vimeo, the home for high quality videos and the people who love them- [https://vimeo.com/261010967 vimeo.com]"},{"slug":"javascript-persists","title":"Javascript Persists","date":1523646131499,"synopsis":"I'm trying to think of a metaphor to describe why I find javascript fascinating even though it is certainly the most carelessly structured environment I have ever struggled to put to work."},{"slug":"jrgen-habermas","title":"Jürgen Habermas","date":1516546780845,"synopsis":"Jürgen Habermas (born 18 June 1929) is a German sociologist and philosopher in the tradition of critical theory and pragmatism. He is perhaps best known for his theories on communicative rationality and the [[public sphere]] - [https://en.wikipedia.org/wiki/J%C3%BCrgen_Habermas wikipedia]"},{"slug":"json-schema","title":"JSON Schema","date":1438562856175,"synopsis":"Here we describe the JSON Schema for a [[Wiki Page]], that is the [[Wiki Page JSON]] that [[Fedwiki Page]]s are built out of. You can see this JSON for any particular page by selecting the JSON link at the bottom of the page."},{"slug":"json-web-token","title":"JSON Web Token","date":1518887837633,"synopsis":"JSON Web Token (JWT, pronounced jot) is a relatively new token format used in space-constrained environments such as HTTP Authorization headers. JWT is architected as a method for transferring security claims based between parties - [https://en.wikipedia.org/wiki/JSON_Web_Token wikipedia]"},{"slug":"kudos","title":"Kudos","date":1521912501749,"synopsis":"Kudos (from the Ancient Greek: κῦδος) is acclaim or praise for exceptional achievement - [https://en.wikipedia.org/wiki/Kudos wikipedia]"},{"slug":"law-of-requisite-variety","title":"Law of Requisite Variety","date":1522921036799,"synopsis":"If a system is to be stable, the number of states of its control mechanism must be greater than or equal to the number of states in the system being controlled."},{"slug":"learning-model","title":"Learning Model","date":1522521699883,"synopsis":"# See also"},{"slug":"learning-roles","title":"Learning Roles","date":1523468928512,"synopsis":"I am proposing these terms to be used as Federated Wiki Roles in events with multiple participants such as a [[Federated Lightning Talk]], [[Federated Happening]] or [[Federated Writing Sprint]]."},{"slug":"linked-sites","title":"Linked Sites","date":1534677904722,"synopsis":"Here we list sites that are linked to the [[platform.earth]] domain. You may also want to see the broader roster for [[Platform Earth Sites]]."},{"slug":"liquid-wiki","title":"Liquid Wiki","date":1520169008965,"synopsis":"A key sprint aim of the [[Holo Sprintathon]] week will be to implement a version of Federated Wiki on [[Holo]], which has been christened [[Liquid Wiki]]."},{"slug":"liquid-wiki-notes","title":"Liquid Wiki Notes","date":1520168460965,"synopsis":"So essentially we are looking to port Federated wiki to holochain - so we end up with a holochain app that can use all the content and community we have already written around blockchain, commons, graphing etc but in a new holochain app."},{"slug":"list-of-plugins","title":"List of Plugins","date":1469229607290,"synopsis":"This server has many plugins installed. Some are experiments old or new. A few provide basic mechanisms. The rest have some purpose explained in the About pages embedded in the plugin."},{"slug":"make-a-new-plugin","title":"Make a New Plugin","date":1420517275181,"synopsis":"We'll take notes as we make a new plugin. We've made a few so this represents the best approach so far."},{"slug":"managing-lists-of-plugins","title":"Managing Lists of Plugins","date":1489356385609,"synopsis":"The Plugmatic plugin can be configured with a list of plugins that work well together and can be managed by a server administrator from within wiki itself."},{"slug":"markdown-files","title":"Markdown files","date":1521838220742,"synopsis":"Markdown Markdown is a lightweight markup language with plain text formatting syntax. It is designed so that it can be converted to HTML and many other formats using a tool by the same name - [https://en.wikipedia.org/wiki/ wikipedia]"},{"slug":"matching-microservices","title":"Matching microservices","date":1523035552411,"synopsis":"Description of matching suite for community currency micro services. How this will work with decentralised architectures and JSON-LD."},{"slug":"matrix","title":"Matrix","date":1521034036728,"synopsis":"Matrix is an open standard for interoperable, decentralised, real-time communication over IP. It can be used anywhere you need a standard HTTP API for publishing and subscribing to data whilst tracking the conversation history - [http://matrix.org/docs/guides/faq.html#general matrix.org]"},{"slug":"matrix-api","title":"Matrix API","date":1521034067066,"synopsis":"Matrix provides the following [[Matrix API]]s:"},{"slug":"measurement","title":"Measurement","date":1522511389346,"synopsis":"Measuring the amount of decentralization, especially politically, is difficult because different studies of it use different definitions and measurements. An OECD study quotes ''Chanchal Kumar Sharma'' as stating: \"a true assessment of the degree of decentralization in a country can be made only if a comprehensive approach is adopted and rather than trying to simplify the syndrome of characteristics into the single dimension of autonomy, interrelationships of various dimensions of decentralization are taken into account.\""},{"slug":"measuring-performance","title":"Measuring performance","date":1522515659977,"synopsis":"In [[Brain of the Firm]] Beer describes a triple vector to characterize activity in a [[System 1]]. The components are:"},{"slug":"meetings","title":"Meetings","date":1521207524051,"synopsis":"MARCH 8th Meeting notes (ad hoc)"},{"slug":"metalanguage","title":"Metalanguage","date":1522515845766,"synopsis":"In ascending the recursions of the viable system the context of each autonomous 5-4-3-2 [[metasystem]] enlarges and acquires more variety ([[Variety (cybernetics)]])."},{"slug":"micro-frontends","title":"Micro Frontends","date":1520182654056,"synopsis":"The term Micro Frontends first came up at the end of 2016. It extends the concepts of [[microservices]] to the frontend world - [https://micro-frontends.org/ micro-frontends.org]"},{"slug":"microorgs","title":"MicroOrgs","date":1519558477433,"synopsis":"Here we define what we mean by a MicroOrg or \"micro org\". A MicroOrg is a legal organisation that runs a [[microservice]]."},{"slug":"microservice","title":"Microservice","date":1510671826092,"synopsis":"A microservice is for all intents and purposes a small [[restful web service]] :)"},{"slug":"microservices","title":"Microservices","date":1510673640830,"synopsis":"A [[microservice]] is an architectural style, in which complex applications are composed of small, independent processes communicating with each other using language-agnostic APIs - [https://en.wikipedia.org/wiki/Microservices wikipedia]"},{"slug":"microservices-for-governance","title":"Microservices for Governance","date":1522999009321,"synopsis":"# See also"},{"slug":"microservices-for-trading","title":"Microservices for Trading","date":1523035755442,"synopsis":"Here we take a look at a suite of microservices that facilitate generic trading between members.  This trading functionality can be broken down to the following concerns:"},{"slug":"microservices-visualized","title":"Microservices Visualized","date":1501836305754,"synopsis":"Ben Halpern's Practical Dev tweeted an enchanting video loop suggesting that it represented microservice architecture or pretty much any software ever. [https://twitter.com/ThePracticalDev/status/845285541528719360 tweet]"},{"slug":"mutual-credit","title":"Mutual Credit","date":1523046253312,"synopsis":"<div style='padding: 12px; background:#eee; width:96%; align=centered;'>"},{"slug":"neo4j","title":"Neo4J","date":1512130229471,"synopsis":"Neo4j is an open-source graph database implemented in Java and accessible from software written in other languages using the Cypher query language through a transactional HTTP endpoint -"},{"slug":"netlify","title":"Netlify","date":1534374678017,"synopsis":"Netlify can be used both from a web UI or by using command line tools. You can create unlimited domains with the free account. For $45 a month you get team sharing, administrator roles, visitor password control, and email and chat support."},{"slug":"netlify-earth","title":"Netlify Earth","date":1521838517480,"synopsis":"Here we research more on using [[Netlify]] for [[Platform Earth]]."},{"slug":"new-plugins","title":"New Plugins","date":1521207458944,"synopsis":"Here we list and explain the use of new [[plugins]] installed on the [[Atopia Server]]:"},{"slug":"newspeak-hackathon","title":"Newspeak Hackathon","date":1521797751176,"synopsis":"The Newspeak [[#darVOZweek ]] hackathon was the first of a series of sprints organised by the [[Culture Collective]] on community designed technology."},{"slug":"nginx","title":"Nginx","date":1520904339103,"synopsis":"Nginx (pronounced \"engine x\") is a web server. It can act as a reverse proxy server for HTTP, HTTPS, SMTP, POP3, and IMAP protocols, as well as a load balancer and an HTTP cache - [https://en.wikipedia.org/wiki/Nginx wikipedia]"},{"slug":"nginx-configuration","title":"Nginx Configuration","date":1519506001880,"synopsis":"First we need to change in our NGINX config file, open NGINX config file in your editor, i primary use [[nano]]:"},{"slug":"nginx-configuration-file","title":"Nginx Configuration File","date":1519506086459,"synopsis":"You can read about [[Nginx]] configuration on [[Ubuntu]] over at - [https://www.digitalocean.com/community/tutorials/how-to-set-up-nginx-server-blocks-virtual-hosts-on-ubuntu-16-04 digitalocean.com]"},{"slug":"nginx-virtual-hosts","title":"Nginx Virtual Hosts","date":1502531404871,"synopsis":"Here we look at how to configure [[Virtual Host]]s in [[Nginx]]."},{"slug":"one-click-deployment","title":"One Click Deployment","date":1522521765507,"synopsis":"A page with 1 items."},{"slug":"oneclickorgs","title":"OneClickOrgs","date":1522520575845,"synopsis":"One Click Orgs is a social enterprise based in London that provides a range of innovative platforms for democratic membership organisations - [http://www.oneclickorgs.com/ oneclickorgs.com]"},{"slug":"onetab","title":"OneTab","date":1523286845345,"synopsis":"Whenever you find yourself with too many tabs, click the OneTab icon to convert all of your tabs into a list. When you need to access the tabs again, you can either restore them individually or all at once - [https://www.one-tab.com/ one-tab.com]"},{"slug":"open-banking","title":"Open banking","date":1520785556050,"synopsis":"Open Banking is a financial services term as part of financial technology that refers to:"},{"slug":"openresty","title":"OpenResty","date":1520903958383,"synopsis":"Below are a collection of links imported from [[OneTab]]. You can view these links here - [https://www.one-tab.com/page/H-_DoCxYT1-KouSz1zBpHA one-tab.com]:"},{"slug":"organic-governance","title":"Organic Governance","date":1522997162276,"synopsis":"Consensus building is not agile, takes a lot of time and generates lots of garbage and heartbreak. I am much more confortable with the use of [[Consent]] from Sociocracy/Holacracy, are you familiar with them?"},{"slug":"origin-server","title":"Origin Server","date":1437492864837,"synopsis":"The server that delivers the client-side javascript that starts you browsing the federated wiki is called the Origin Server. It's special."},{"slug":"our-world-in-data","title":"Our World In Data","date":1516202800553,"synopsis":"Our World in Data is an online publication that shows how living conditions are changing - [https://ourworldindata.org/about ourworldindata.org]"},{"slug":"p2p-foundation","title":"P2P Foundation","date":1457267971740,"synopsis":"P2P Foundation: The Foundation for Peer to Peer Alternatives is an organization with the aim of studying the impact of peer to peer technology and thought on society. It was founded by Michel Bauwens - [https://en.wikipedia.org/wiki/P2P_Foundation wikipedia]"},{"slug":"page-composition","title":"Page Composition","date":1520171417014,"synopsis":"Beside the client- and serverside integration of code written in different frameworks itself, there are a lot of side topics that should be discussed: mechanisms to isolate js, avoid css conflicts, load resources as needed, share common resources between teams, handle data fetching and think about good loading states for the user. We’ll go into these topics one step at a time."},{"slug":"page-origin-store","title":"Page Origin Store","date":1411271627428,"synopsis":"This instantiated module performs storage operations such as get, put, update and sitemap. Ajax to origin provide our primary exemplar for an abstract interface."},{"slug":"palace-of-the-parliament","title":"Palace of the Parliament","date":1517524709019,"synopsis":"The Palace of the Parliament (Romanian: Palatul Parlamentului) is the seat of the Parliament of Romania. Located on Dealul Arsenalului in central Bucharest (Sector 5), it is the largest administrative building in the world with a height of 84 metres (276 ft), an area of 365,000 square metres (3,930,000 sq ft) and a volume of 2,550,000 cubic metres (90,000,000 cu ft). In terms of weight, the Palace of the Parliament is the heaviest building in the world, weighing in at around 4,098,500,000 kilograms (9.0356×109 lb) - [https://en.wikipedia.org/wiki/Palace_"},{"slug":"paolo-guerrero","title":"Paolo Guerrero","date":1520087507978,"synopsis":"José Paolo Guerrero Gonzales (Spanish pronunciation: [xoˈse paˈolo ɣeˈreɾo ɣonˈsales]; born 1 January 1984) is a Peruvian footballer who plays as a striker for Brazilian club Flamengo and the Peru national team - [https://en.wikipedia.org/wiki/Paolo_Guerrero wikipedia]"},{"slug":"participation","title":"Participation","date":1522509471421,"synopsis":"In decentralization the principle of [[subsidiarity]] is often invoked. It holds that the lowest or least centralized authority which is capable of addressing an issue effectively should do so."},{"slug":"participatory-design","title":"Participatory design","date":1522509136075,"synopsis":"Participatory design (originally co-operative design, now often co-design) is an approach to design attempting to actively involve all stakeholders (e.g. employees, partners, customers, citizens, end users) in the design process to help ensure the result meets their needs and is usable. Participatory design is an approach which is focused on processes and procedures of design and is not a design style. The term is used in a variety of fields e.g. software design, urban design, architecture, landscape architecture, product design, sustainability, graphic "},{"slug":"passportjs","title":"Passport.js","date":1502462519665,"synopsis":"Passport is authentication middleware for Node.js. Extremely flexible and modular, Passport can be unobtrusively dropped in to any Express-based web application. A comprehensive set of strategies support authentication using a username and password, Facebook, Twitter, and more -"},{"slug":"pattern-language","title":"Pattern language","date":1522920116507,"synopsis":"A pattern language is a method of describing good design practices or patterns of useful organization within a field of expertise. The term was coined by architect [[Christopher Alexander]] and popularized by his 1977 book A Pattern Language - [https://en.wikipedia.org/wiki/Pattern_language wikipedia]"},{"slug":"people","title":"People","date":1524771139451,"synopsis":"Our aim is to slowly add people to this group, in particular coders interested in working on microservices, devops, and sysadmin types, but also people interested in the commons and improving cooperation withing the cooperative movement."},{"slug":"permanent-archive","title":"Permanent Archive","date":1518368010154,"synopsis":"The permanent archive is the immutable aspect of the [[permanent wiki]]. The aim is to create a publishing medium for wiki. It is designed to store immutable assets such as images, video and audio together with standard single page sites, and  finalise json data."},{"slug":"platform-earth","title":"Platform Earth","date":1516040195327,"synopsis":"Platform Earth is a [[microservice]] platform for the commons. Microservices are traditionally employed by large companies, distributed across many departments and work teams, to achieve scalability, agility and the ability to maintain high reliability systems."},{"slug":"platform-earth-activity","title":"Platform Earth Activity","date":1524665026343,"synopsis":"View all activity from [[Platform Earth Sites]] listed in the roster below:"},{"slug":"platform-earth-frontends","title":"Platform Earth Frontends","date":1520171737017,"synopsis":"# See also"},{"slug":"platform-earth-microservices","title":"Platform Earth Microservices","date":1520853576461,"synopsis":"Here we outline a basic suite of [[microservices]] that we intend to build for [[Platform Earth Zero]]:"},{"slug":"platform-earth-philosophy","title":"Platform Earth Philosophy","date":1519560374041,"synopsis":"You can find out more about [[Platform Earth Philosophy]] below:"},{"slug":"platform-earth-roadmap","title":"Platform Earth Roadmap","date":1522522460929,"synopsis":"The roadmap for [[platform earth]] is a living document governed by it's members. We are seeking to build a [[microservice]] [[platform for the commons]], based on open source software, and a pragmatic, agile approach to software development."},{"slug":"platform-earth-sites","title":"Platform Earth Sites","date":1534684366939,"synopsis":"Here we gather researchers and writers interested in developing an integrated set of services for the commons that we call [[Platform Earth]]."},{"slug":"platform-for-cooperation","title":"Platform for Cooperation","date":1516038064254,"synopsis":"[[Platform Earth]] is aimed at providing as simple and as scaleable a means to allow socially oriented organisations to cooperate. Too many projects are re-inventing the wheel, and we now have robust open source tool chains that these organisations can deploy to reduce costs and improve quality."},{"slug":"platform-for-the-commons","title":"Platform for the Commons","date":1522508204621,"synopsis":"A page with 1 items."},{"slug":"platformearth","title":"Platform.Earth","date":1516203757877,"synopsis":"Platform Earth is a [[microservice]] platform for the commons. Microservices are traditionally employed by large companies, distributed across many departments and work teams, to achieve scalability, agility and the ability to maintain high reliability systems."},{"slug":"plugins","title":"Plugins","date":1521207428685,"synopsis":"Here we list and document the plugins installed on this server:"},{"slug":"polyglot-computing","title":"Polyglot (computing)","date":1523521548536,"synopsis":"In computing, a polyglot is a computer program or script written in a valid form of multiple programming languages, which performs the same operations or output independent of the programming language used to compile or interpret it. - [https://en.wikipedia.org/wiki/Polyglot_(computing) wikipedia]"},{"slug":"polyglot-earth","title":"Polyglot Earth","date":1523520970926,"synopsis":"A page with 1 items."},{"slug":"polyglot-software-development","title":"Polyglot Software Development","date":1502221898734,"synopsis":"We look to enable coders to programme in their language of choice, by providing a robust [[RESTful]] [[Microservice Architecture]]."},{"slug":"power-of-fork","title":"Power of Fork","date":1509194056527,"synopsis":"In politics there is little understanding of the importance and relevance of the concept of \"forking\" that originates in the world of software development."},{"slug":"rapid-incentivised-coproduction","title":"Rapid Incentivised Coproduction","date":1522521893813,"synopsis":"A page with 1 items."},{"slug":"related-sites","title":"Related Sites","date":1534678394492,"synopsis":"Here we list sites that are related in some way to the current site:"},{"slug":"requisite-variety","title":"Requisite Variety","date":1522921076748,"synopsis":"If a system is to be stable, the number of states of its control mechanism must be greater than or equal to the number of states in the system being controlled."},{"slug":"research-activity","title":"Research Activity","date":1523450939476,"synopsis":"On this page you can find [[research groups]] that are working on topics related to the current [[domain]]:"},{"slug":"rest","title":"REST","date":1493381725173,"synopsis":"Representational State Transfer (REST) is a software architecture style consisting of guidelines and best practices for creating scalable web services - [https://en.wikipedia.org/wiki/Representational_state_transfer wikipedia]"},{"slug":"rules-for-the-viable-system","title":"Rules for the viable system","date":1522515391597,"synopsis":"In \"Heart of Enterprise\" a companion volume to \"Brain...\", Beer applies Ashby's ([[William Ross Ashby]]) concept of (Requisite) Variety ([[Variety (cybernetics)]]): the number of possible states of a system or of an element of the system.  There are two aphorisms that permit observers to calculate Variety; four Principles of Organization; the Recursive System Theorem; three Axioms of Management and a Law of Cohesion. These rules ensure the Requisite Variety condition is satisfied, in effect that resources are matched to requirement."},{"slug":"seigniorage","title":"Seigniorage","date":1524769479010,"synopsis":"Seigniorage, also spelled seignorage or seigneurage, is the difference between the value of money and the cost to produce and distribute it. The term can be applied in the following ways: Seigniorage derived from specie—metal coins—is a tax, added to the total price of a coin, that a customer of the mint had to pay to the mint, and that was sent to the sovereign of the political area."},{"slug":"self-sovereign","title":"Self-sovereign","date":1522509061805,"synopsis":"A page with 1 items."},{"slug":"serverless-computing","title":"Serverless computing","date":1523520995417,"synopsis":"Serverless computing is a cloud computing execution model in which the cloud provider dynamically manages the allocation of machine resources. Pricing is based on the actual amount of resources consumed by an application, rather than on pre-purchased units of capacity. It is a form of utility computing. - [https://en.wikipedia.org/wiki/Serverless_computing wikipedia]"},{"slug":"serving-static-content","title":"Serving Static Content","date":1491992900796,"synopsis":"The first way to do this is to use the theme folder to serve files."},{"slug":"set-up-a-gihub-account","title":"Set up a GiHub Account","date":1516728920089,"synopsis":"Head over to [[GitHub]] and create a new account:"},{"slug":"set-up-your-ssh-keys","title":"Set up Your SSH Keys","date":1517184988346,"synopsis":"The next step in securing your server is to set up public key authentication for your new user. Setting this up will increase the security of your server by requiring a private SSH key to log in."},{"slug":"shadow-dom","title":"Shadow DOM","date":1520014465637,"synopsis":"Shadow DOM is a functionality that allows the [[web browser]] to render DOM elements without putting them into the main document DOM tree."},{"slug":"shared-onetab-links","title":"Shared OneTab Links","date":1520932438939,"synopsis":"Shared [[OneTab]] Links"},{"slug":"shoreditch","title":"Shoreditch","date":1517680869700,"synopsis":"Shoreditch is an inner city district in the East End of London, Central London in the London Borough of Hackney and lies immediately to the north and north east of the City of London. Shoreditch High Street railway station partly in Shoreditch but mostly in the Bethnal Green area of Tower Hamlets. As a result, sometimes adjacent areas of Bethnal Green are informally referred to as part of Shoreditch - [https://en.wikipedia.org/wiki/Shoreditch wikipedia]"},{"slug":"signature-plugin","title":"Signature Plugin","date":1519154485138,"synopsis":"We will try out the plugin here. For the moment we are interested mostly in workflow enabled by wiki with only a nod to digital signatures."},{"slug":"simple-hugo-site","title":"Simple hugo site","date":1534375015702,"synopsis":"Here we walk through creating the most minimal [[hugo]] based site we can think of to [[netlify]] using our own custom domain."},{"slug":"sina-def","title":"Sina Def","date":1518439694906,"synopsis":"I would describe myself as a creative. Of course, everyone has the ability to be creative, and creative people are not only that- they can also be logical thinkers."},{"slug":"sitemap-scrape-statistics","title":"Sitemap Scrape Statistics","date":1465073172963,"synopsis":"We collect various counts while scraping sitemaps and report them as a text file. Here we plot the most recent counts available."},{"slug":"sitemapjson","title":"sitemap.json","date":1517402243608,"synopsis":"To understand the structure of the sitemap.json  best take a look at the server codewhich you can find on -"},{"slug":"smallest-federated-wiki","title":"Smallest Federated Wiki","date":1516721379369,"synopsis":"The Smallest [[Federated Wiki]] was the founding project that has grown into many sites running substantially evolved client and server software. See [[Federated Wiki]]"},{"slug":"spreadsheet-currency","title":"Spreadsheet Currency","date":1523448992492,"synopsis":"A description of why and how to use Spread sheets for community currency use in [[Voz]] (or indeed any community currency)."},{"slug":"sqlite","title":"SQLite","date":1521644236222,"synopsis":"SQLite ( or ) is a relational database management system contained in a C programming library. In contrast to many other database management systems, SQLite is not a client–server database engine. Rather, it is embedded into the end program - [https://en.wikipedia.org/wiki/SQLite wikipedia]"},{"slug":"ssh-copy-id","title":"ssh-copy-id","date":1517182458199,"synopsis":"ssh-copy-id is a handy script that installs your public key in a remote machine's authorized_keys."},{"slug":"starting-fedwiki","title":"Starting Fedwiki","date":1438073449680,"synopsis":"To start the [[Fedwiki Server]] on a local machine, you simply need to run:"},{"slug":"static-site-generation","title":"Static Site Generation","date":1523044177019,"synopsis":"People sometimes ask if static sites make sense for anything beyond a one-pager. This leaderboard highlights the top open source projects, in many different languages, that make static sites not only viable, but an attractive option for creating sophisticated websites!"},{"slug":"static-site-microservices","title":"Static Site Microservices","date":1523044216328,"synopsis":"For [[platform.earth]] we are developing a suite of microservices for [[Static Site Generation]] that facilitate drag and drop creation of low cost (virtually free) web sites for the commons - ie cooperatives and the not-for-profit sector."},{"slug":"storycraft-roles","title":"Storycraft Roles","date":1522493002733,"synopsis":"Here we list all the different roles in the [[Storycrafts]] game. From here you can navigate to a more detailed description of each role."},{"slug":"storycrafts","title":"Storycrafts","date":1522493185465,"synopsis":"*Les Traceurs* is a game that allows you to collaboratively **produce the Story** of an event (be it a meeting, a conference, a workshop, a festival, a web-festival, etc...), almost live, and to **disseminate it** to the relevant federations and communities across the Internets."},{"slug":"sustainable-learning-model","title":"Sustainable Learning Model","date":1522521642146,"synopsis":"Our aim is to set up a flexible member based organisation through which we can structure international partnerships with as far as possible minimal and automated accountancy using internal software mediated mechanisms such as currency systems that account for soft contributions as well as hard contributions."},{"slug":"system-1","title":"System 1","date":1522514523226,"synopsis":"[[System 1]] in a viable system contains several primary activities. Each System 1 primary activity is itself a viable system due to the recursive nature of systems as described above. These are concerned with performing a function that implements at least part of the key transformation of the organization."},{"slug":"system-1-sketch","title":"System 1 Sketch","date":1523602648221,"synopsis":"[[System 1]] - as discussed in [[RE-describe the VSM]], this needs two symbols - one for the value production activity, and the other for the internalised systems 3,4,5, labelled 'Creative Control' (the system 2 symbol is small enough to work when small)."},{"slug":"system-2","title":"System 2","date":1522514564933,"synopsis":"System 2 represents the information channels and bodies that allow the primary activities in [[System 1]] to communicate between each other and which allow [[System 3]] to monitor and co-ordinate the activities within System 1. Represents the scheduling function of shared resources to be used by System 1."},{"slug":"system-2-sketch","title":"System 2 Sketch","date":1523602492754,"synopsis":"[[System 2]] - considered as a tool that engages and interacts. This was hard. Original VSM triangle works well - perhaps with added dynamism?"},{"slug":"system-3","title":"System 3","date":1522514614846,"synopsis":"System 3 represents the structures and controls that are put into place to establish the rules, resources, rights and responsibilities of [[System 1]] and to provide an interface with [[Systems 4]]/5. Represents the big picture view of the processes inside of System 1."},{"slug":"system-3-sketch","title":"System 3 Sketch","date":1523602415509,"synopsis":"[[System 3]] - considered as the original meaning of the word cybernaut - 'the steersman', tried 'the rudder' too..."},{"slug":"system-4","title":"System 4","date":1522514647136,"synopsis":"System 4 is made up of bodies that are responsible for looking outwards to the environment to monitor how the organization needs to adapt to remain viable."},{"slug":"system-4-sketch","title":"System 4 Sketch","date":1523601992872,"synopsis":"[[System 4]] - considered as an air-traffic control or watch-tower (ivory tower considered and rejected - no obvious graphic content, and derogatory overtones)."},{"slug":"system-5","title":"System 5","date":1522514663814,"synopsis":"System 5 is responsible for policy decisions within the organization as a whole to balance demands from different parts of the organization and steer the organization as a whole."},{"slug":"system-5-sketch","title":"System 5 Sketch","date":1523552361345,"synopsis":"[[System 5]] can be represented as either the Heart of the organisation, or the board-room table."},{"slug":"task","title":"Task","date":1522491045466,"synopsis":"Here we can generate a list of current pages marked up with tasks. Simply add a task to a page and it will be listed here. See below for different formats you can drag and drop onto a page."},{"slug":"technological-decentralization","title":"Technological decentralization","date":1522512236173,"synopsis":"''Technological decentralization'' can be defined as a shift from concentrated to distributed modes of production and consumption of goods and services. Generally, such shifts are accompanied by transformations in technology and different technologies are applied for either system. Technology includes tools, materials, skills, techniques and processes by which goals are accomplished in the public and private spheres. Concepts of decentralization of technology are used throughout all types of technology ([[Outline of technology]]), including especially [["},{"slug":"test-sheetview","title":"Test Sheetview","date":1523442541224,"synopsis":"Here we test out some views of spreadsheets that we embed in wiki."},{"slug":"testing-plugmatic-plugin","title":"Testing Plugmatic Plugin","date":1519725371950,"synopsis":"Now we try inquiry about a specific inventory."},{"slug":"the-audio-poet","title":"The Audio Poet","date":1522492858136,"synopsis":"See also [[The Poet]] for a simpler shorter more flexible title."},{"slug":"the-cartographer","title":"The Cartographer","date":1522493074435,"synopsis":"[[The Cartographer]] is the one to propose insightful visualizations (be them digital datavisualization or handmade drawings) to give the future readers of the Story a sense of the atmosphere, spirit and mood of the event."},{"slug":"the-dom-is-the-api","title":"The DOM is the API","date":1520171167658,"synopsis":"Custom Elements, the interoperability aspect from the Web Components Spec, are a good primitive for integration in the browser."},{"slug":"the-empathetic-skeptic","title":"The Empathetic-Skeptic","date":1522493126348,"synopsis":"[[The Empathetic-Skeptic]] is the one who criticise or congratulate some element or content about the event."},{"slug":"the-iconographer","title":"The Iconographer","date":1522492289480,"synopsis":"[[The Iconographer]] is a person who is in charge to illustrate the event. His/her task is to find on the Internet or to take picture of the event and to select the more appropriate to illustrate what's the scribe is writing."},{"slug":"the-poet","title":"The Poet","date":1522492878121,"synopsis":"see [[The Audio Poet]]"},{"slug":"the-pollinator","title":"The Pollinator","date":1522492588258,"synopsis":"[[The Pollinator]] has the following tasks:"},{"slug":"the-scribe","title":"The Scribe","date":1522492306784,"synopsis":"[[The Scribe]] is the one who's writing the content. He/she is collecting all the information/content about the event and he /she retrancripts by writing text."},{"slug":"the-sourcerer","title":"The Sourcerer","date":1522492341961,"synopsis":"[[The Sourcerer]] involves someone to double check all the information (Scribe and the empathetic-skeptic). He/she have to find articles, conversations, forum about the topic about and try to find and complete the writing by good sources, and if there is a polemic,  try to find what is about)"},{"slug":"the-summarian","title":"The Summarian","date":1522492398112,"synopsis":"[[The Summarian]] or \"Animator\" collects all the contents and makes them coherent with each others, especially by summarising them (be it through drawings, text or audio format) and by proposing an aesthetics to put them altogether."},{"slug":"the-translator","title":"The Translator","date":1522493126352,"synopsis":"[The Translator]] translates all the contents into a sign language fashion."},{"slug":"translation-espfr-1","title":"Translation Esp/Fr #1","date":1518439603087,"synopsis":"Sur le plan social, une révolution ne créé rien ; elle peut dissoudre, libérer et investir, c'est à dire consommer et faire devenir puissant ce qui existait déjà dans la société. Dans l'évolution historique, l'heure de la révolution n'est pas celle de la conception, mais celle de l'accouchement, mais celui-ci à du sens seulement si il y a eu auparavant conception."},{"slug":"transporter","title":"Transporter","date":1501658773948,"synopsis":"A [[Transporter]] is a web service that provides services to the Federation. Using the [[Transporter Plugin]] you can call these services simply by dragging and drooping a URL from an external site, or another [[Fedwiki]] site, in order to import of perform some other manipulation of the sites content."},{"slug":"travelers-and-nodes","title":"Travelers and Nodes","date":1518363192388,"synopsis":"@ is a programming paradigm in which code is executed as a [[Traveler]] traverse a graph of [[Computational nodes]]."},{"slug":"trevors-activity","title":"Trevor's Activity","date":1502271266649,"synopsis":"Here we list Trevor's recent activity, and writing and research currently being focussed on."},{"slug":"trustlines","title":"TrustLines","date":1520419898988,"synopsis":"The Trustlines Network is the original [[Ripple (payment protocol)]] built on [[Ethereum]]. It looks like an interesting and solid basis for building a [[Creative Currency]] - [https://trustlines.network/ trustlines.network]"},{"slug":"ubuntu-1604","title":"Ubuntu 16.04","date":1521904673798,"synopsis":"Shuttleworth announced on 21 October 2015 that Ubuntu 16.04 LTS would be called ''Xenial Xerus''. It was released on 21 April 2016 - [https://insights.ubuntu.com/2016/04/20/canonical-unveils-6th-lts-release-of-ubuntu-with-16-04 ubuntu.com]"},{"slug":"ubuntu-64bits","title":"Ubuntu 64bits","date":1521904704718,"synopsis":"Forwarded to [[Ubuntu 16.04]]"},{"slug":"upstart-script","title":"upstart script","date":1518088271182,"synopsis":"According to [[Config Notes]] you can find the upstart script at:"},{"slug":"viable-system-model","title":"Viable system model","date":1523017828339,"synopsis":"The viable system model (VSM) is a model of the organisational structure of any autonomous system capable of producing itself -  [https://en.wikipedia.org/wiki/Viable_system_model wikipedia]"},{"slug":"view-vozy-balances","title":"View VOZy balances","date":1523016865408,"synopsis":"# All VOZy balances"},{"slug":"voz","title":"Voz","date":1521911253248,"synopsis":"Voz is designed to be a simple [[mutual credit]] based currency designed to facilitate and bootstrap our collaboration."},{"slug":"voz-activity","title":"Voz Activity","date":1522267550808,"synopsis":"View all activity from [[Voz Sites]] listed in the roster below:"},{"slug":"voz-and-elegance","title":"Voz and Elegance","date":1523036128568,"synopsis":"Some initial thoughts in currency design from the social perspective."},{"slug":"voz-animation","title":"Voz Animation","date":1523035248767,"synopsis":"How x, y and z can be animated."},{"slug":"voz-markdown","title":"Voz Markdown","date":1521908591904,"synopsis":"A page with 0 items."},{"slug":"voz-notation","title":"Voz Notation","date":1523016906827,"synopsis":"Voz notation is designed to be easily typed. There are three typed or kinds of currency that we aim to integrate into a managed system:"},{"slug":"voz-sites","title":"Voz Sites","date":1523476874027,"synopsis":"Here we gather researchers and writers interested in developing [[Voz]] for [[Platform Earth]]. See also [[Platform Earth Sites]]."},{"slug":"voz-symbols","title":"Voz Symbols","date":1523016850936,"synopsis":"Here we start the process of designing our currency symbols. The eventual aim is to include these in a font that would also include other community governance tols (such as argument map glyphs)."},{"slug":"voz-working-group","title":"Voz Working Group","date":1521911587486,"synopsis":"The Voz Working Group - is a small group of individuals that have decided to work together to create a currency system suitable for cooperative working."},{"slug":"voz-x","title":"(voz-X)","date":1523016891787,"synopsis":"# See also"},{"slug":"voz-y","title":"(voz-Y)","date":1522488224110,"synopsis":"A page with 0 items."},{"slug":"voz-z","title":"(voz-Z)","date":1522488226719,"synopsis":"A page with 0 items."},{"slug":"voz18-current-work-lists","title":"VOZ'18 CURRENT WORK LISTS","date":1519818132631,"synopsis":"In alphabetical order..."},{"slug":"vsm-subsystems","title":"VSM Subsystems","date":1522515173563,"synopsis":"Here we give a brief introduction to the cybernetic description of the organization encapsulated in a single level of the VSM. The model is derived from the architecture of the brain and nervous system - [https://en.wikipedia.org/wiki/Viable_system_model#Components wikipedia]"},{"slug":"ward-cunningham","title":"Ward Cunningham","date":1430937369159,"synopsis":"I'm enjoying reading more in [[The Federation]]. Here is a place that I can fork content without concern for the information architecture that results."},{"slug":"web-components","title":"Web Components","date":1520169267253,"synopsis":"Web Components are a set of features currently being added by the W3C to the HTML and DOM specifications that allow for the creation of reusable widgets or components in web documents and web applications."},{"slug":"welcome-visitors","title":"Welcome Visitors","date":1534677801141,"synopsis":"[[Platform Earth]] is a [[microservice]] platform for the [[commons]]. Here we document and organise [[Hackathons]] for [[the federation]]."},{"slug":"whats-a-modern-web-app","title":"What’s a Modern Web App?","date":1520169823747,"synopsis":"In the introduction I’ve used the phrase “building a modern web app”. Let’s define the assumptions that are connected with this term."},{"slug":"where-pages-live","title":"Where Pages Live","date":1420345697537,"synopsis":"We describe where the json representing a wiki page can be stored and how pages move between these stores."},{"slug":"wiki","title":"Wiki","date":1466862122875,"synopsis":"A wiki is a website that provides collaborative modification of its content and structure directly from the web browser. In a typical wiki, text is written using a simplified markup language (known as \"wiki markup\"), and often edited with the help of a rich-text editor - [https://en.wikipedia.org/wiki/Wiki wikipedia]"},{"slug":"wiki-admin","title":"Wiki Admin","date":1504802561572,"synopsis":"An administrator is identified by the --admin parameter when starting wiki. The admin value would depend on how individuals are identified by the security module in use."},{"slug":"wiki-and-hugo","title":"Wiki and Hugo","date":1516724099349,"synopsis":"Here we work on the relationship between [[Hugo]] and [[FedWiki]]."},{"slug":"wiki-as-flat-json-database","title":"Wiki as flat json database","date":1522853293918,"synopsis":"There is some interest in creating static HTML from a wiki.  Here is a pure javascript proof-of-concept."},{"slug":"wiki-page","title":"Wiki Page","date":1511704145553,"synopsis":"A [[Federated Wiki Page]], or [[Fedwiki Page]] is a mobile-phone sized column of authored hypertext, that can be displayed side-by-dide in a [[Fedwiki Lineup]] to form a dynamically constructed [[Web Page]]."},{"slug":"wiki-page-json","title":"Wiki Page JSON","date":1438563289032,"synopsis":"We use this term to describe the JSON returned when a new wiki-page is fetched from the server."},{"slug":"working-with-maps","title":"Working with Maps","date":1502035651244,"synopsis":"Below are a collection of links imported from [[OneTab]]. You can view these links here - [https://www.one-tab.com/page/PmjzwDu9S3CZQyupxiH39Q one-tab.com]:"},{"slug":"world-time-forecast","title":"World Time Forecast","date":1520826651126,"synopsis":"We imagine a slide rule useful for scheduling and awaiting events where offsets that change with seasons and prefered times of participants are taken into account."},{"slug":"writing-with-strangers","title":"Writing with Strangers","date":1429804097374,"synopsis":"Writing in the presence of rampant forking calls into question [[What it Means to Write]] and how to do it well."}]