[{"slug":"a-film-about-migrants-becoming-sex-slaves-based-on-nativa-inongo-makomes-book","title":"A film about migrants becoming sex slaves... based on NATIVA Inongo Makome's book","date":1455111075280,"synopsis":"Phoneme Media, a nonprofit publishing house for literature in translation based in the United States, has shared an excerpt from Natives, Cameroonian author Inongo-vi-Makomè’s English-language debut, translated from the Spanish by Michael Ugarte.\n"},{"slug":"african-film-locations-of-the-future","title":"African film locations of the future","date":1455111523266,"synopsis":"A page with 1 items."},{"slug":"applied-fiction","title":"Applied Fiction","date":1455109627429,"synopsis":"Welcome To Applied Fiction! Where filmmaker, writer and critic Jean-Pierre Bekolo radically questions and deconstructs the notions, processes and perceptions of both film- and exhibition-making. By dissecting, unpacking or dismantling the concepts of cinema and exhibition into their singular units and by displaying them, Bekolo engages in a pathological inquest, an autopsy of the arts of film- and exhibition-making. Inherent to this diagnostic process are the etymological logia (to account of/for) and pathos (experience or suffering) that might help understand what film- and exhibition-making mean in our contemporary.\n\n"},{"slug":"changes-to-this-site","title":"Changes to this Site","date":1456070701314,"synopsis":"A page with 0 items."},{"slug":"cinema-of-the-future","title":"Cinema of the Future","date":1455101468288,"synopsis":"How can we still talk about writing a traditional script when our writing today, everyday writing, in social media includes video links, photos, other people's comments, likes, etc.?"},{"slug":"currently-working-on","title":"Currently Working On","date":1456070738264,"synopsis":"Here is a list of [[Recent Activity]] I consider important.  To clear stuff saved in your browser try [[Local Changes]]."},{"slug":"ecosystem-map","title":"Ecosystem Map","date":1453137819250,"synopsis":"This is a map that displays stakeholders and relationships in space, with directional arrows for interactional flow."},{"slug":"evil--poetry---------y---the-healing-path","title":"EVIL & POETRY\n       (-Y-\n The Healing Path)","date":1455115282774,"synopsis":"          We should probably ask someone for\n          directions?\n"},{"slug":"evil-poetry-activity","title":"Evil Poetry Activity","date":1455122354496,"synopsis":"Here we list all the recent activity by writers working on the [[Evil Poetry]] narrative:"},{"slug":"excerpt","title":"excerpt","date":1455111047944,"synopsis":"An excerpt from Natives, by Inongo-vi-Makomè, translated by Michael Ugarte:\n"},{"slug":"future-narratives","title":"Future Narratives","date":1455109761154,"synopsis":"The most essential method for [[Applied Fiction]] is collecting stories for Future Narratives.\nWe can engage on the following themes: ancestry, education, connections to the outside world, technology, opportunity,\nand nature. "},{"slug":"heather-a-moore","title":"Heather A. Moore","date":1455121680032,"synopsis":"I'm a Futurist and Founder of [[The Shape of Things]], an design research & foresight strategy consulting group in Berlin."},{"slug":"hthr","title":"Hthr","date":1455121426927,"synopsis":"I'm a Futurist and Founder of [[The Shape of Things]], an design research & foresight strategy consulting group in Berlin."},{"slug":"ich-und-meine-ddr","title":"Ich und meine DDR","date":1455110450853,"synopsis":"This film chronicles my personal childhood experiences in the former GDR where along with other Namibian children we were sent from Angola to the former East Germany in a safe place, away from the war between SWAPO (South West Africa People’s Organization) and the then apartheid government of South Africa under the National Party.\n \n"},{"slug":"jean-pierre-beloko","title":"Jean-Pierre Beloko","date":1455123235519,"synopsis":"Jean-Pierre Bekolo is a film maker, writer and critic from Cameroon. His debut film Quartier Mozart received the Prix Afrique en Création at the 1992 Cannes Film Festival. His second film, Aristotle's Plot, was commissioned by the British Film Institute to celebrate the 100th anniversary of cinema, and was the first African film selected at Sundance. His 2005 released film Les Saignantes won the Silver Stallion and Best Actress Awards at FESPACO. Bekolo's video installation An African Woman in Space was on display at the Musée du Quai Branly in Paris in 2008. Banned in Cameroon in 2013, Jean-Pierre Bekolo's controversial film Le President questions the phenomenon of Africa's \"perpetual governments\". His 4-hour documentary Les Choses et Les Mots de Mudimbe was part of the official selection of the 2015 Berlinale. In 2009 he published Africa for the Future – Sortir un Nouveau Monde du Cinéma. Bekolo has also taught at UNC Chapel Hill, Duke University, and the University of Yaoundé. Since 2006, Bekolo has served as the Secretary General of the Guild of African Filmmakers, and is the founding member of the World Cinema Alliance. In 2015 he received the Prince Claus Award. Since the summer of 2015 he is a fellow of the DAAD Artists-in-Berlin Program."},{"slug":"neighborhood","title":"Neighborhood","date":1453216977844,"synopsis":"See also - [[Recent Changes]] - [[Local Changes]] - [[topics]] - [[sub-topics]]"},{"slug":"neighbourhood","title":"Neighbourhood","date":1453217018024,"synopsis":"The neighborhood is the list of sites seen while browsing within one tab. The site's flags are shown in the footer."},{"slug":"recent-activity","title":"Recent Activity","date":1456070742638,"synopsis":"A page with 0 items."},{"slug":"snare-adaptation","title":"Snare Adaptation","date":1456068418163,"synopsis":"Film Script Adaptation from the Novel *Snare* by Priscillia M. Manjoh"},{"slug":"space-collective","title":"Space Collective","date":1453217656914,"synopsis":"is a group that I came across in 2008 when I was researching for the KashKlash project."},{"slug":"the-shape-of-things","title":"The Shape of Things","date":1441485850738,"synopsis":"Here is the website - [http://www.theshapeofthings.de theshapeofthings.de]"},{"slug":"welcome-visitors","title":"Welcome Visitors","date":1456070958678,"synopsis":"Welcome to this [[Future Narratives]] site. We gather snippets of stories, hopes, fears and visions of the future."}]