[{"slug":"farmers-and-pastoralists-research-archive","title":"Farmers and Pastoralists Research Archive","date":1495748020828,"synopsis":"See [[Conflict Resolution Resources]]"},{"slug":"introduction-to-exponentially-human","title":"Introduction to Exponentially Human","date":1499033932317,"synopsis":"This is about an event taking place in September Twenty Twenty-Seven, and how you can get involved."},{"slug":"john-dada","title":"John Dada","date":1499077690455,"synopsis":""},{"slug":"more-about-john-dada","title":"More about John Dada","date":1495737818060,"synopsis":"This page will have additional information about John Dada harvested from various sources."},{"slug":"pamela-mclean","title":"Pamela McLean","date":1499041188517,"synopsis":"I became aware of \"International Development\" issues on a personal level in 2000. This was through a friend who was married to a Nigerian.  I started to help them with a project they were doing in Oke-Ogun in SW Nigeria.  It related to local community development, and aspects of the project overlapped my own interests in education and in digital technologies."},{"slug":"resources-for-soas-radio","title":"Resources for SOAS Radio","date":1499084720019,"synopsis":"This page collects publications relevant to the topic of pastoralists and farmers. It explains how the authors connect with us regarding radio and distributed conferences."},{"slug":"temp","title":"temp","date":1499075699788,"synopsis":"A page with 1 items."},{"slug":"welcome-visitors","title":"Welcome Visitors","date":1499116778185,"synopsis":"Welcome to this [[Federated Wiki]] site. From this page you can find who we are and what we do. New sites provide this information and then claim the site as their own. You will need your own site to participate."},{"slug":"xh2027-and-soas-radio","title":"XH2027 and SOAS Radio","date":1499118638356,"synopsis":"This page will explain what we are currently doing with SOAS. It will relate that current work to changes in higher education systems that we hope to be celebrating in 2027, at the event Exponentially Human Twenty Twenty-Seven."},{"slug":"youre-new-here","title":"You're New Here","date":1498997595924,"synopsis":"There are four steps to making a home here once you have your own site. In other systems this would be like filling out your profile page. Do these steps in any order."}]