[{"slug":"changes-to-this-site","title":"Changes to this Site","date":1499016428941,"synopsis":"Follow  [[Changes to this Site]], or [[Changes to Fedwiki Sites]], to see what we are [[Currently Working On]]. Use [[Fedwiki Tools]] to author new content."},{"slug":"holochain","title":"Holochain","date":1514134906111,"synopsis":"Holographic storage for distributed applications. A holochain is a validating distributed hash table (DHT) where every node enforces validation rules on data against the signed chains where the data originated - [http://ceptr.org/projects/holochain ceptr.org]"},{"slug":"hosting-strategy","title":"Hosting Strategy","date":1501495942209,"synopsis":"Here we look at our latest thinking of hosting strategy for [[Thought Garden Projects]]."},{"slug":"hugo","title":"Hugo","date":1516122374221,"synopsis":"Hugo is a fast and modern [[static site]] generator written in Go, and designed to make website creation fun again. Websites built with Hugo are extremely fast and secure."},{"slug":"ipfs-cluster","title":"IPFS Cluster","date":1504627023419,"synopsis":"ipfs-cluster allows to replicate content (by pinning) in multiple IPFS nodes. This is alpha software, but may well be something we want to consider in terms of [[IPFS Hosting]] for the [[Anthropological Archive]]."},{"slug":"masonry-layout","title":"Masonry Layout","date":1514211855873,"synopsis":"Masonry is a [[grid layout]] based on columns. Unlike other grid layouts, it doesn’t have fixed height rows. Basically, Masonry layout optimizes the use of space inside the web page by reducing any unnecessary gaps. Without this type of layout, certain restrictions are required to maintain the structure of layout - [https://www.sitepoint.com/understanding-masonry-layout/ sitepoint.com]"},{"slug":"netlify","title":"Netlify","date":1515531513528,"synopsis":"Netlify can be used both from a web UI or by using command line tools. You can create unlimited domains with the free account. For $45 a month you get team sharing, administrator roles, visitor password control, and email and chat support."},{"slug":"omeka","title":"Omeka","date":1510711193473,"synopsis":"Omeka is a free, open source content management system for online digital collections. As a web application, it allows users to publish and exhibit cultural heritage objects, and extend its functionality with themes and plugins. A lightweight solution in comparison to traditional institutional repository software like DSpace and Fedora, Omeka has a focus on display and uses an unqualified Dublin Core metadata standard - [https://en.wikipedia.org/wiki/Omeka wikipedia]"},{"slug":"open-access-journal","title":"Open access journal","date":1515516764861,"synopsis":"Open access (OA) journals are scholarly journals that are available online to the reader \"without financial, legal, or technical barriers other than those inseparable from gaining access to the internet itself.\" They remove price barriers (e.g. subscription, licensing fees, pay-per-view fees) and most permission barriers (e.g. copyright and licensing restrictions). While open access journals are freely available to the reader, there are still costs associated with the publication and production of such journals. Some are subsidized, and some require paym"},{"slug":"open-access-scholarly-publishers-association","title":"Open Access Scholarly Publishers Association","date":1515516799950,"synopsis":"The Open Access Scholarly Publishers Association (OASPA) is a non-profit trade association representing the interests of open access journal publishers globally in all scientific, technical and scholarly disciplines - [https://en.wikipedia.org/wiki/Open_Access_Scholarly_Publishers_Association wikipedia]"},{"slug":"p5js","title":"p5.js","date":1512650852680,"synopsis":"p5.js looks like an excellent framework and community to work with for building [[simulation]]s into wiki."},{"slug":"platform-earth","title":"Platform Earth","date":1515531550064,"synopsis":"Platform.earth is a [[microservice]] platform for the commons."},{"slug":"polymer","title":"Polymer","date":1514308355066,"synopsis":"It took a few years and a couple of trips around the block, but Web Components have truly arrived: they’re natively supported in Chrome and Safari today, with other browsers joining the party soon."},{"slug":"polymer-cli","title":"Polymer CLI","date":1514308655410,"synopsis":"The command-line tool for Polymer projects and Web Components - [https://github.com/Polymer/polymer-cli github]"},{"slug":"polymer-library","title":"Polymer (library)","date":1514308666593,"synopsis":"[[Polymer]] is an open-source JavaScript library for building web applications using [[Web Components]]. The library is being developed by Google developers and contributors on GitHub. Modern design principles are implemented as a separate project using Google's Material Design design principles - [https://en.wikipedia.org/wiki/Polymer_(library) wikipedia]"},{"slug":"preprint-collaboration","title":"Preprint Collaboration","date":1512749160685,"synopsis":"As a growing number of biologists formally share their papers in online repositories before any peer review or journal publication, it’s often said that they are catching up with physicists, who have posted preprints in the online arXiv server since 1991. But biomedical scientists actually made a start earlier. [http://www.sciencemag.org/news/2017/08/biologists-forgotten-experiment-started-preprint-revolution-5-decades-ago science]"},{"slug":"prismicio","title":"prismic.io","date":1515530634515,"synopsis":"We provide tools to help you develop with your favorite technology. This will help you Quickstart, handle caching, preview and A/B testing easily - [https://prismic.io/docs] prismic.io]"},{"slug":"pubishing-strategies","title":"Pubishing Strategies","date":1511866842073,"synopsis":"What form of publishing is suited to [[deliberation]]? How do we publish [[Writing with Strangers]]? Here we research [[Publishing Technologies]], tools and philosophies and consider how we might best design new experiences for both the reader and the author."},{"slug":"publish-wiki-content","title":"Publish Wiki Content","date":1515530849364,"synopsis":"Wiki currently has no [[Read Only Wiki]] mode. A wiki is always editable in some sense or other - even when you do no own the wiki. This makes it problematic to share the content created in wiki to other users."},{"slug":"publishing","title":"Publishing","date":1514201610730,"synopsis":"Below are a collection of links imported from [[OneTab]]. You can view these links here - [https://www.one-tab.com/page/zdZ0dwPvQN2MtqUq9Z0mWw one-tab.com]:"},{"slug":"publishing-wiki","title":"Publishing Wiki","date":1514202871176,"synopsis":"Wiki is great for writing. It is a tool to organise and interweave our thoughts.Let's make it beautiful to publish content in new ways."},{"slug":"read-only-wiki","title":"Read Only Wiki","date":1491140008904,"synopsis":"Here we look at progress towards a version of wiki that is clean, and easy to read - a read-only wiki."},{"slug":"responsive-web-design","title":"Responsive Web Design","date":1514201667689,"synopsis":"[[Responsive Web Design]] is an approach to web design aimed at crafting sites to provide an optimal viewing and interaction experience—easy reading and navigation with a minimum of resizing, panning, and scrolling—across a wide range of devices (from desktop computer monitors to mobile phones) - [https://en.wikipedia.org/wiki/Responsive_web_design wikipedia]"},{"slug":"static-site","title":"Static Site","date":1514202223117,"synopsis":"A [[static web page]] (sometimes called a flat page or [[static site]]) is a web page that is delivered to the user exactly as stored, in contrast to dynamic web pages which are generated by a web application - [https://en.wikipedia.org/wiki/Static_web_page wikipedia]"},{"slug":"static-site-generation","title":"Static Site Generation","date":1515531542195,"synopsis":"Static site generation is a simple and effective modern way to create web sites. Advantages include reduced complexity, easier compliance, cheaper hosting, amongst other benefits."},{"slug":"static-themes","title":"Static Themes","date":1515537730442,"synopsis":"Here we collect curated lists of interesting static site themes and templates. You can find a wide range of pre-built themes on [https://themeforest.net/downloads themeforest.net]"},{"slug":"static-web-page","title":"Static web page","date":1514202163261,"synopsis":"A static web page (sometimes called a flat page or [[static site]]) is a web page that is delivered to the user exactly as stored, in contrast to dynamic web pages which are generated by a web application - [https://en.wikipedia.org/wiki/Static_web_page wikipedia]"},{"slug":"stencil","title":"Stencil","date":1514310732770,"synopsis":"[[Stencil]] is basically a compiler for [[web components]] and is the toolchain that [[Ionic]] is going to use to create it's next version of re-useable cross-platform components."},{"slug":"web-components","title":"Web Components","date":1514310640704,"synopsis":"Web Components are a set of features currently being added by the W3C to the HTML and DOM specifications that allow for the creation of reusable widgets or components in web documents and web applications."},{"slug":"webflow","title":"Webflow","date":1515537472524,"synopsis":"Webflow is a hosted static site design solution that combines the ability to collaborate on pure modern HTML5 [[responsive web design]] with the ability to download the resultant CSS, HTML5 and Javascript for hosting on your own [[static site]]s."},{"slug":"webflow-cms","title":"Webflow CMS","date":1515536851596,"synopsis":"[[Webflow]] looks a good solution to design responsive CSS that we can [[publish wiki content]] to. However it is relatively expensive, and there is currently no static site export for content stored in the CMS."},{"slug":"webflow-cms-api","title":"Webflow CMS API","date":1514208229159,"synopsis":"You can use the [[Webflow]] CMS API to add, update, delete, and publish content to you content hosted using the [[Webflow CMS]] - [https://developers.webflow.com/#items developers.webflow.com]"},{"slug":"webflow-interface","title":"Webflow interface","date":1515537336248,"synopsis":"Below are a collection of links imported from [[OneTab]]. You can view these links here - [https://www.one-tab.com/page/dKHEDkvvTL29lJXcMPnX_g one-tab.com]:"},{"slug":"welcome-visitors","title":"Welcome Visitors","date":1515531914710,"synopsis":"Here we gather notes and research regarding [[Pubishing Strategies]] for an [[Open Think Tank]]."}]