[{"slug":"archive","title":"Archive","date":1459337724529,"synopsis":"An archive is an accumulation of historical records or the physical place they are located. Archives contain primary source documents that have accumulated over the course of an individual or organization's lifetime, and are kept to show the function of that person or organization. Professional archivists and historians generally understand archives to be records that have been naturally and necessarily generated as a product of regular legal, commercial, administrative or social activities. They have been metaphorically defined as \"the secretions of an "},{"slug":"capn-proto","title":"Cap’n Proto","date":1435320490581,"synopsis":"Cap’n Proto is an insanely fast data interchange format and capability-based RPC system. Think JSON, except binary. Or think Protocol Buffers, except faster - [https://capnproto.org/index.html capnproto.org]"},{"slug":"changes-to-this-site","title":"Changes to this Site","date":1434641767059,"synopsis":"Below we list recent changes to this site only without also listing changes from the [[Neighbourhood]]:"},{"slug":"coping-with-dying","title":"Coping with Dying","date":1459538253374,"synopsis":"Dying is part of the experience of living, so it's best to make peace with it and accept that every living thing undergoes it at some point - [https://www.reddit.com/r/AskReddit/comments/1wzcaj/serious_how_do_you_cope_with_the_passing_of/ reddit]"},{"slug":"currently-working-on","title":"Currently Working On","date":1457345691987,"synopsis":"Here is a list of [[Recent Changes]] I consider important. View our experiments on the [[Scratch]] page. To clear stuff saved in your browser try [[Local Changes]]."},{"slug":"data-science-trello-board","title":"Data Science Trello Board","date":1450556617897,"synopsis":"Having collected data science resources for years, Thai has now updated his collection and placed them into a neat Trello list, open to all. [http://www.datasciencecentral.com/profiles/blogs/huge-trello-list-of-great-data-science-resources post] [https://trello.com/b/rbpEfMld/data-science trello]"},{"slug":"diversity","title":"Diversity","date":1437929841680,"synopsis":"Here I collect links and thoughts on the subject of \"diversity\". I've been surprised about how little is known about the [[Mathematics of Diversity]], and in particular [[Diversity Generation]]."},{"slug":"dna-storage","title":"DNA Storage","date":1460143848987,"synopsis":"A Technicolor scientist surrounded by the latest virtual reality technology inspects a vial containing a few droplets of water -- and one million copies of an old movie encoded into DNA - [http://www.afp.com/fr/news/4048623/ afp.com]"},{"slug":"e-o-wilson","title":"E. O. Wilson","date":1439111838947,"synopsis":"Wilson has been described as the \"world's most evolved biologist\" and even as \"the heir to Darwin\". He's a passionate naturalist and an absolute world authority on ants. Over his long career he's described 450 new species of ants."},{"slug":"education-for-all","title":"Education for All","date":1436693245799,"synopsis":"Education For All — The Student Story - a Youtube playlist on Al Jazeera English - [https://www.youtube.com/playlist?list=PLzGHKb8i9vTwsd7NUWiu5WTAIEq931nM7 youtube.com]"},{"slug":"fedwiki-tools","title":"Fedwiki Tools","date":1523477599939,"synopsis":"Here we list a few tools that are of particular use in managing and creating [[Fedwiki]] content. For a full list of transporters navigate to the site below:"},{"slug":"font-awesome","title":"Font Awesome","date":1448717186332,"synopsis":"Font Awesome gives you scalable vector icons that can instantly be customized — size, color, drop shadow, and anything that can be done with the power of CSS - [https://fortawesome.github.io/Font-Awesome/ github.io]"},{"slug":"foraging","title":"Foraging","date":1437307821140,"synopsis":"Foraging is searching for wild food resources. This page is where I log my attempts to find food, or places where I may find food in the future."},{"slug":"franco-battiato---la-cura","title":"Franco Battiato - La Cura","date":1459427290330,"synopsis":"Music video by Franco Battiato performing La Cura. (C) 1996 Universal Music Italia Srl. This work is relevant to [[La Cura]], and [[Salvatore]] is interested in working with hi on a performance?"},{"slug":"future-library","title":"Future Library","date":1453238884617,"synopsis":"Here we begin to describe a [[Library]] project that utilises decentralisation and Fedwiki to create [[Reading And Research Groups]] around real world content."},{"slug":"games-and-the-blockchain","title":"Games and the Blockchain","date":1439031315438,"synopsis":"Some random collections:"},{"slug":"giant-global-graph","title":"Giant Global Graph","date":1463906826780,"synopsis":"The following quote is from [http://dig.csail.mit.edu/breadcrumbs/node/215 timbl]:"},{"slug":"god---global-online-database","title":"GOD - global online database","date":1463907258967,"synopsis":"As it became apparent towards the end of the 90's that the dreams of wiki-like unification of diverse and hand crafted human thinking were being replaced by databases and search - this phrase became ever more pressing."},{"slug":"god-is-not-a-relational-database","title":"GOD is not a Relational Database","date":1450522668316,"synopsis":"This is a phrase that has been in my head for nearly 20 years. It keeps coming back. I find it amusing, important and true."},{"slug":"health-care","title":"Health care","date":1459427321934,"synopsis":"Health care or healthcare is the maintenance or improvement of health via the diagnosis, treatment, and prevention of disease, illness, injury, and other physical and mental impairments in human beings. Health care is delivered by health professionals (providers or practitioners) in allied health professions, chiropractic, physicians, dentistry, midwifery, nursing, medicine, optometry, pharmacy, psychology, and other health professions. It includes the work done in providing primary care, secondary care, and tertiary care, as well as in public health - ["},{"slug":"how-much-does-wikipedia-cost","title":"How Much Does Wikipedia Cost?","date":1457871564853,"synopsis":"You can see all the financial data here - [https://wikimediafoundation.org/wiki/Financial_reports wikimediafoundation.org]"},{"slug":"html5-audio","title":"HTML5 Audio","date":1501837225251,"synopsis":"HTML5 Audio is a subject of the HTML5 specification, investigating audio input, playback, synthesis, as well as speech to text in the browser - [https://en.wikipedia.org/wiki/HTML5_Audio wikipedia]"},{"slug":"html5-cross-browser-polyfills","title":"HTML5 Cross Browser Polyfills","date":1451561917157,"synopsis":"A page with 1 items."},{"slug":"insect-house","title":"Insect House","date":1467716294343,"synopsis":"VIMEO 171745511"},{"slug":"la-cura","title":"La Cura","date":1459427278615,"synopsis":"When artist [[Salvatore Iaconesi]] was diagnosed with brain cancer, he refused to be a passive patient — which, he points out, means \"one who waits.\" - [https://www.ted.com/talks/salvatore_iaconesi_what_happened_when_i_open_sourced_my_brain_cancer?language=en#t-1830 ted]"},{"slug":"language-pedants","title":"Language Pedants","date":1524126572480,"synopsis":"The idea that English should be logical really got going with the popular grammarians of the late 18th century: Englishman Robert Lowth (1710–87) and American-in-England Lindley Murray (1745–1826) in particular."},{"slug":"linkdump","title":"Linkdump","date":1453006338511,"synopsis":"[https://www.youtube.com/watch?v=dljNabciEGg Literate Devops with Emacs - YouTube]"},{"slug":"list-of-taken-words","title":"List of Taken Words","date":1454499594320,"synopsis":"Some words are taken. May be just in the circles I am part of, words like democracy, are used on such a regular basis that they don't mean anything."},{"slug":"little-known-marmot-facts","title":"Little Known Marmot Facts","date":1435228363285,"synopsis":"Marmots have been known since antiquity. Here we list some strange and little known Marmot Facts:"},{"slug":"load-balanced-dns-server","title":"Load-balanced DNS Server","date":1457865646730,"synopsis":"If a server does not reply as required, the server can be temporarily removed from the DNS pool, until it reports that it is once again operating within specs."},{"slug":"load-balanced-dns-servers","title":"Load-balanced DNS Servers","date":1457865996830,"synopsis":"A [[Load-balanced DNS Server]] is a modified DNS servers that can routinely poll mirrored servers for availability and load factor."},{"slug":"marmot","title":"Marmot","date":1435227944432,"synopsis":"Marmots are members of the squirrel (rodent) family. They are sufficiently different for our purposes to differentiate them from ground squirrels. You can think of a marmot as a large plump ground squirrel."},{"slug":"marmot-boodog","title":"Marmot Boodog","date":1435226491778,"synopsis":"With the opening of a marmot-hunting season, Marmot Boodog becomes a very popular and fun outdoor activity for Mongolians, especially men. Marmot hunting and boodog cooking is a prerogative of men - [http://www.e-mongol.com/mongolia_culture_cooking-recipes.htm#Marmot%20boodog mongol.com]"},{"slug":"marmot-recipes","title":"Marmot Recipes","date":1435227657805,"synopsis":"Lerner specifies that vodka is key to any Mongolian barbecue. It is consumed at every step so that by the time you get around to eating your marmot, the actual taste is not so much of an issue. And what does marmot taste like? One Web source says \"beefy.\" \"Like wild duck,\" insists another. Liars, we think. \"It tastes like rodent,\" - [http://www.hcn.org/issues/361/17432 hcn.org]"},{"slug":"media-snippets","title":"Media Snippets","date":1451561907031,"synopsis":"Here we take a look at how we can represent small sections of audio and video in Fedwiki using existing [[HTML5]] features of publicly accessible content."},{"slug":"mendeley-suggest","title":"Mendeley Suggest","date":1449592563246,"synopsis":"On our new “Suggest” page you’ll be getting improved article suggestions, driven by four different recommendation algorithms to support different scientific needs: popular, trending, and, relevant to all or recent documents in your library. [http://blog.mendeley.com/academic-features/new-research-features-on-mendeley-com/ post]"},{"slug":"moral-agents-club","title":"Moral Agent's Club","date":1449471711499,"synopsis":"Daniel Dennett acknowledges determinism but this alone does not prevent moral agents from assembling in a club with rules and punishments for their violations."},{"slug":"nefula","title":"Nefula","date":1459427302784,"synopsis":"We are privileged to be working with NeFuLa, whose extensive experience with big data visualisations and open culture (www.artisopensource.org) will enable us to craft and systematise these wide ranging inputs into a unique visual and mobile experience."},{"slug":"new-front-matter-to-science","title":"New Front Matter to Science","date":1449421844643,"synopsis":"Wikipedia as the Front Matter to All Research. A brown bag talk on scholarly citations on Wikipedia with Geoffrey Bilder (CrossRef) and Dario Taraborelli (Wikimedia Foundation)."},{"slug":"oraclize","title":"Oraclize","date":1438526955162,"synopsis":"Oraclize is a service by which you can have some bitcoin transactions take place based on the occurrence of some verifiable real-life event."},{"slug":"pareto-efficiency","title":"Pareto efficiency","date":1457347671775,"synopsis":"Pareto efficiency, or Pareto optimality, is a state of allocation of resources in which it is impossible to make any one individual better off without making at least one individual worse off - [https://en.wikipedia.org/wiki/Pareto_efficiency wikipedia]"},{"slug":"pareto-efficient","title":"Pareto Efficient","date":1457347763137,"synopsis":"Given an initial allocation of goods among a set of individuals, a change to a different allocation that makes at least one individual better off without making any other individual worse off is called a Pareto improvement. An allocation is defined as \"Pareto efficient\" or \"Pareto optimal\" when no further Pareto improvements can be made."},{"slug":"peter-diamond","title":"Peter Diamond","date":1457347922502,"synopsis":"Peter Arthur Diamond (born April 29, 1940) is an American economist known for his analysis of U.S. Social Security policy and his work as an advisor to the Advisory Council on Social Security in the late 1980s and 1990s. He was awarded the Nobel Memorial Prize in Economic Sciences in 2010, along with Dale T. Mortensen and Christopher A. Pissarides - [https://en.wikipedia.org/wiki/Peter_Diamond wikipedia]"},{"slug":"peter-principle","title":"Peter Principle","date":1448279544918,"synopsis":"The Peter principle is a concept in management theory formulated by Laurence J. Peter in which the selection of a candidate for a position is based on the candidate's performance in their current role, rather than on abilities relevant to the intended role. - [https://en.wikipedia.org/wiki/Peter_principle wikipedia]"},{"slug":"pheromone-of-salvation","title":"Pheromone of Salvation","date":1439111650447,"synopsis":"Mathematical models of natural selection have evolved in the decades I've been reading science, especially models of altruistic behavior as will be required if we are to leave a habitable planet to our grandchildren. What would have to be true of wiki if it were to be important in this cause?"},{"slug":"picoin","title":"PiCoin","date":1438838934678,"synopsis":"Imaging what a coin that is provably mined on a [[Raspberry Pi]] would look like."},{"slug":"price-comparison","title":"Price Comparison","date":1457346699108,"synopsis":"A 1971 paper by American economist [[Peter Diamond]] showed that even small \"search costs\", such as the time takes to walk down the street to see what is on offer at a rival shop, can seriously undermine [[Competition On Price]] - [http://www.economist.com/news/finance-and-economics/21657458-price-comparison-websites-should-help-lower-prices-left-unchecked-they-may economist]"},{"slug":"rebel-architecture","title":"Rebel Architecture","date":1436693681338,"synopsis":"A six-part documentary series from Al Jazeera profiling architects who are using design as a form of activism and resistance to tackle the world's urban, environmental and social crises - [http://www.filmsforaction.org/watch/rebel-architecture-2014/ filmsforaction.org]"},{"slug":"review-of-student-video","title":"Review of Student Video","date":1438354164767,"synopsis":"Andrew Lih asked first year journalism students to shoot and edit short video stories using the [[BBC Five Shot]] formula. Here he reviews their work."},{"slug":"round-robin-dns","title":"Round-robin DNS","date":1457865603262,"synopsis":"Round Robin DNS is a technique of load distribution, load balancing, or fault-tolerance provisioning multiple, redundant web servers, by managing the Domain Name System's ([[DNS]]) responses to address requests from client computers according to an appropriate statistical model - [https://en.wikipedia.org/wiki/Round-robin_DNS wikipedia]"},{"slug":"scoped-negation-as-failure","title":"Scoped Negation As Failure","date":1463906456227,"synopsis":"Some interesting readings on logic and negation. This touches on (surprisingly), issues related to the blockchain, freedom of will, and [[building utopia]]."},{"slug":"scratch","title":"Scratch","date":1429210147088,"synopsis":"Uploaded image"},{"slug":"sdcf-masters-of-the-stage","title":"SDCF Masters of the Stage","date":1458910259429,"synopsis":"Rare insights into the working process of America's most seminal directors and choreographers are the focus of Masters of the Stage, a podcast series produced by Stage Directors and Choreographers Workshop Foundation (SDCF) - [https://www.tdf.org/nyc/110/SDC-Podcast-Series tdf.org]"},{"slug":"share-extensions","title":"Share Extensions","date":1438858159505,"synopsis":"How do we extend sharing and bring in new content into the Federation to enable sharing?"},{"slug":"the-federation","title":"The Federation","date":1459339499146,"synopsis":"Here we describe the The Federation. We should use this term wisely. It describes quite clearly the social aspects of this project, while also pointing gently towards [[Star Trek]] and the future of the [[Decentralised Web]]."},{"slug":"theatre-conversations","title":"Theatre Conversations","date":1459353771214,"synopsis":"Many theatres host events to go with a production in which the Director and / or cast take place in a conversation about the piece being performed or theatre in general. Here we look at how we might alter or extend this format."},{"slug":"truth-in-code","title":"Truth in Code","date":1439107012504,"synopsis":"/bin/true is a script which just returns true so you can do something like - [http://www.quora.com/What-is-the-dumbest-code-ever-made-that-has-become-famous quora.com]"},{"slug":"utopia-partners","title":"Utopia Partners","date":1435604146027,"synopsis":"A list of partners involved in Building Utopia."},{"slug":"welcome-visitors","title":"Welcome Visitors","date":1524126228612,"synopsis":"NEIGHBORHOOD no"},{"slug":"what-if-we-trusted-you-jerry-michalski-at-tedxcopenhagen-2012","title":"What if we trusted you?: Jerry Michalski at TEDxCopenhagen 2012","date":1459423678830,"synopsis":"Jerry is a friend of [[Eugenio Battaglia]], with an interest in education, and knowledge mapping. he has been mapping his brain since 2004 - [http://jerrysbrain.com/ jerrysbrain.com]"},{"slug":"wilsons-life-scientific","title":"Wilson's Life Scientific","date":1439111800568,"synopsis":"Wilson talks to Jim al-Khalili about his life scientific. [http://www.bbc.co.uk/programmes/b0639kzv bbc]"},{"slug":"zero-knowledge","title":"Zero Knowledge","date":1439024554346,"synopsis":"In cryptography, a zero-knowledge proof or zero-knowledge protocol is a method by which one party (the prover) can prove to another party (the verifier) that a given statement is true, without conveying any information apart from the fact that the statement is indeed true - [https://en.wikipedia.org/wiki/Zero-knowledge_proof wikipedia]"}]