[{"slug":"2027-celebration","title":"2027 Celebration","date":1497546530060,"synopsis":"*Ten years on from writing this in 2017, what would I love to be celebrating in 2027 in terms of Humanity's advancement?*"},{"slug":"about-html-plugin","title":"About HTML Plugin","date":1460861990632,"synopsis":"The HTML plugin allows you to format text using HTML tags. The text you write is checked to be sure it won't interfere with other websites where it might appear."},{"slug":"collective-intelligence-and-inspirations","title":"Collective Intelligence and Inspirations","date":1498499214788,"synopsis":"An ever-evolving list of FASST OS influences include:"},{"slug":"fasst-os","title":"FASST OS","date":1497519096221,"synopsis":"# An experiment..."},{"slug":"feast","title":"FEAST","date":1489588555789,"synopsis":"[[FEAST]] is a global decentralised conference and music festival, connected by radio. It is a celebration of local culture, with communities connected globally through conversation, sound and music."},{"slug":"field-guide-to-the-federation","title":"Field Guide to the Federation","date":1488335368485,"synopsis":"We show you what we find interesting in the federation and suggest how you can make yourself at home here."},{"slug":"future-ready-city","title":"Future Ready City","date":1498038048749,"synopsis":"What if there were Future Ready Societal Accelerators in every City and Town? Consciously combining human, artificial and natural intelligence, blended finance and the collective genius of diverse populations, what generative possibilities might be realised for inclusive flourishing futures?"},{"slug":"gavin-peacock","title":"Gavin Peacock","date":1499119296630,"synopsis":"Born in the 1960s in South West London into an \"ordinary\" working household. Nothing traumatic that I can recall about my childhood, and I left school at 18 after my \"A\" Levels and fell straight into banking. Deep down, I didn't really have a strong sense of what I wanted to do, and where my brightest \"talents\" might lie."},{"slug":"geniusos","title":"GeniusOS","date":1497382423372,"synopsis":""},{"slug":"holacracy-of-one","title":"Holacracy of One","date":1498157891206,"synopsis":"At the end of 2016 George Por posted an article called [http://www.enliveningedge.org/columns/mapping-a-lifework/ Mapping a LifeWork] which drew some of its inspiration from the workings of [http://www.holacracy.org/how-it-works/ Holacracy]. This evolving article attempts to map out my own “Circle of LifeWork” or “Holacracy of One”, seeing myself as a multi-faceted, multi-potential “human organization” of wholes within wholes…"},{"slug":"how-to-wiki","title":"How To Wiki","date":1488041103204,"synopsis":"Here we describe how to use the web interface to the federated wiki. Read [[About Federated Wiki]] to learn about the project. If you are just starting to write in your first wiki then read the [[Field Guide to the Federation]]."},{"slug":"learning-passport","title":"Learning Passport","date":1503144644206,"synopsis":"Here I research the idea of creating a portable, secure, learning passport."},{"slug":"possibility-base","title":"Possibility Base","date":1497185503622,"synopsis":"The site where humans first landed and set foot upon another celestial body is called Tranquility Base. Of course, we are talking about the Moon, and the year was 1969."},{"slug":"possibility-channel","title":"Possibility Channel","date":1498210107598,"synopsis":"The amount of data and information being generated every day around the world is mind-boggling. Despite our extraordinary technological capabilities, so many ideas, people, projects and stories that could benefit very many lives, still get lost in the \"noise\"."},{"slug":"possibility-crew","title":"Possibility Crew","date":1497186195038,"synopsis":"My FASST co-experimenter, PM, sees one of her \"roles\" as being an \"explorer in the landscape of change\". I like the notion of these \"explorers\" being \"Possibility Crew\" who form collaborative groups and teams to realise new possibilities at local and larger scales."},{"slug":"recent-changes","title":"Recent Changes","date":1362955694011,"synopsis":"Here we list neighborhood pages with those most recently changed listed first. See also [[Local Changes]]."},{"slug":"wealth-studios","title":"Wealth Studios","date":1497214116748,"synopsis":"This is a new venture that has effectively been decades in the making - I think of it as a \"societal innovation enterprise and inclusive wealthmaking-placemaking collaborative platform\"."},{"slug":"welcome-visitors","title":"Welcome Visitors","date":1503144171024,"synopsis":"Welcome to this [[Federated Wiki]] site of [[Gavin Peacock]]. From this site and its various internal and external links you can find out more about what I'm doing and why I'm doing it. Do feel free to contact me via my home site [http://wealthstudios.com/]."},{"slug":"who-and-why-gavin-peacock","title":"Who and Why Gavin Peacock?","date":1498736717065,"synopsis":"Born in the 1960s in South West London into an \"ordinary\" working household. Nothing \"traumatic\" that I can recall about my childhood, and I left school at 18 after my \"A\" Levels and fell straight into banking because I didn't know what I really wanted to do, and where my strengths might lie."}]