[{"slug":"-a-history-of-the-brain---bbc-radio-4-extra","title":" A History of the Brain - BBC Radio 4 Extra","date":1476359427069,"synopsis":"In Episode 3: [[The Origin of Common Sense]], the focus is on Ancient Rome with Galen's 'animal spirits' gently inflating the ventricles and making thought possible, and on how early Christian scholarship placed the soul in the brain's ventricles - [http://www.bbc.co.uk/programmes/b016x234 bbc]"},{"slug":"-al-ghazali","title":" Al-Ghazali","date":1467825282121,"synopsis":"Melvyn Bragg and his guests discuss the life and work of Al-Ghazali, a major philosopher and theologian of the late 11th century. Born in Persia, he was one of the most prominent intellectuals of his age, working in such centres of learning as Baghdad, Damascus and Jerusalem. He is now seen as a key figure in the development of Islamic thought, not just refining the theology of Islam but also building on the existing philosophical tradition inherited from the ancient Greeks. - [http://www.bbc.co.uk/programmes/b055j9rv bbc]"},{"slug":"-altruism","title":" Altruism","date":1467796223046,"synopsis":"So how does this square with altruism? If both mankind and the natural world are selfishly seeking to promote their own survival and advancement, how can we explain being kind to others, sometimes at our own expense?"},{"slug":"-bbc-inside-science---bbc-radio-4","title":" BBC Inside Science - BBC Radio 4","date":1472461773963,"synopsis":"What should we be looking for when searching for life on other planets beyond our solar system? Scientists urgently need to come to a consensus on this as a new suite of telescopes soon begins detecting. The space agency NASA has put together a virtual institute called The Nexus for Exoplanet System Science, and they've just met to work out how we should be looking for bio signatures - on the burgeoning catalogue of worlds beyond the Solar System. Adam Rutherford hears from Sarah Rugheimer, an astrobiologist from the University of St Andrews, on why the "},{"slug":"-discovery---bbc-world-service","title":" Discovery - BBC World Service","date":1469061009609,"synopsis":"\"I'm determined to prove botany is not the 'Cinderella of science'\". That is what Professor Kathy Willis, director of Science at the Royal Botanic Garden in Kew, told the Independent in 2014. In the two years since she took on the job at Kew she has been faced with a reduction in government funding. So, Kathy Willis has been rethinking the science that is to be done by the staff of the Gardens and has been criticised for her decisions. - [http://www.bbc.co.uk/programmes/p03855rk bbc]"},{"slug":"-fidel-castro-takes-havana","title":" Fidel Castro Takes\nHavana","date":1467960710846,"synopsis":"In January 1959 left-wing revolutionaries marched triumphantly into the Cuban capital, ending decades of rule by the US-backed dictator Fulgencio Batista. We hear from Carlos Alzugaray, then a 15-year-old school boy, who was among the crowds that turned out to watch the rebel tanks roll into town. - [http://www.bbc.co.uk/programmes/p03d78fs bbc]"},{"slug":"-guilt","title":" Guilt","date":1467802908248,"synopsis":"Guilt is a legal category but also a psychological state and a moral idea - [http://www.bbc.co.uk/programmes/b0084kd8 bbc]"},{"slug":"-in-our-time---bbc-radio-4","title":" In Our Time - BBC Radio 4","date":1490042135169,"synopsis":"A page with 0 items."},{"slug":"-kathy-willis","title":" Kathy Willis","date":1467973887153,"synopsis":"\"I'm determined to prove botany is not the 'Cinderella of science'\". That's what Professor Kathy Willis, Director of Science at the Royal Botanic Garden in Kew, told the Independent in 2014 - [http://www.bbc.co.uk/programmes/b06nnqdl bbc]"},{"slug":"-more-or-less-behind-the-stats---bbc-radio-4","title":" More or Less: Behind the Stats - BBC Radio 4","date":1498306542099,"synopsis":"The results of the general election are in - but what do they mean? Did more young people vote than expected? Have we now got a more diverse parliament? How many extra votes would Jeremy Corbyn have needed to become Prime Minister - these are just some of the claims and questions that have been floating around on social media and in the press. Tim Harford and the team are going to analyse, add context and try and find answers. - [http://www.bbc.co.uk/programmes/p056b7l1 bbc]"},{"slug":"-seriously---bbc-radio-4","title":" Seriously... - BBC Radio 4","date":1490377050790,"synopsis":"The producer is Polly Weston."},{"slug":"-sovereignty","title":" Sovereignty","date":1467825153680,"synopsis":"Melvyn Bragg and guests discuss the history of the idea of Sovereignty, the authority of a state to govern itself and the relationship between the sovereign and the people. These ideas of external and internal sovereignty were imagined in various ways in ancient Greece and Rome, and given a name in 16th Century France by the philosopher and jurist Jean Bodin in his Six Books of the Commonwealth, where he said (in an early English translation) 'Maiestie or Soveraigntie is the most high, absolute, and perpetuall power over the citisens and subiects in a Co"},{"slug":"-start-the-week---bbc-radio-4","title":" Start the Week - BBC Radio 4","date":1470053810905,"synopsis":"Picture of James Lovelock provided by the Science Museum - [http://www.bbc.co.uk/programmes/b0415h9t bbc]"},{"slug":"-the-life-scientific---bbc-radio-4","title":" The Life Scientific - BBC Radio 4","date":1498164587593,"synopsis":"To the untrained eye, a plant's existence may seem rather uneventful. It spends its days rooted to the spot, seemingly at the mercy of its environment. - [http://www.bbc.co.uk/programmes/b08q5wxx bbc]"},{"slug":"-the-nuclear-spy-alan-nunn-may","title":" The Nuclear Spy Alan Nunn\nMay","date":1467959543261,"synopsis":"In 1945 the English physicist was exposed as a nuclear spy for the Soviet Union. [[Alan Nunn May]] had been working on Britain's top-secret nuclear project during WW2. Witness hears from his step-son, Paul Broda. - [http://www.bbc.co.uk/programmes/p035smm0 bbc]"},{"slug":"-the-sale-of-london-bridge","title":" The Sale of London\nBridge","date":1467959523017,"synopsis":"In July of 1967 London Bridge was put up for sale. It was sold to an American millionaire who had it dismantled and transported to the USA where it was rebuilt, stone by stone, in Arizona. - [http://www.bbc.co.uk/programmes/p03ztvzf bbc]"},{"slug":"-utilitarianism","title":" Utilitarianism","date":1467825375686,"synopsis":"A moral theory that emphasises ends over means, Utilitarianism holds that a good act is one that increases pleasure in the world and decreases pain. The tradition flourished in the eighteenth and nineteenth centuries with Jeremy Bentham and John Stuart Mill, and has antecedents in ancient philosophy. According to Bentham, happiness is the means for assessing the utility of an act, declaring \"it is the greatest happiness of the greatest number that is the measure of right and wrong.\" Mill and others went on to refine and challenge Bentham's views and to d"},{"slug":"-witness---bbc-world-service","title":" Witness - BBC World Service","date":1469536824643,"synopsis":"A page with 0 items."},{"slug":"2016-paralympic-games","title":"2016 Paralympic Games","date":1468834464466,"synopsis":"The 2016 Summer Olympics, officially known as the Games of the XXXI Olympiad, and commonly known as Rio 2016, is a major international multi-sport event in the tradition of the Olympic Games due to take place in Rio de Janeiro, Brazil, from 5 to 21 August 2016 - [https://en.wikipedia.org/wiki/2016_Summer_Olympics wikipedia]"},{"slug":"2016-summer-olympics","title":"2016 Summer Olympics","date":1468613199632,"synopsis":"The 2016 Summer Olympics, officially known as the Games of the XXXI Olympiad, and commonly known as Rio 2016, is a major international multi-sport event in the tradition of the Olympic Games due to take place in Rio de Janeiro, Brazil, from 5 to 21 August 2016 - [https://en.wikipedia.org/wiki/2016_Summer_Olympics wikipedia]"},{"slug":"60-words","title":"60 Words","date":1472111743499,"synopsis":"How one sentence -- just 60 words written in the hours after the September 11 attacks -- became the legal foundation for the \"war on terror.\" - [http://www.radiolab.org/story/60-words/?utm_source=sharedUrl&utm_medium=metatag&utm_campaign=sharedUrl radiolab.org]"},{"slug":"74-seconds","title":"74 Seconds","date":1497778171909,"synopsis":"74 Seconds tells the story of a July 2016 traffic stop that ended with the world watching a man die, live on their phones. This is the story of that man, Philando Castile, and the officer who is about to go on trial for his death, Jeronimo Yanez - [https://player.fm/series/74-seconds player.fm]"},{"slug":"a-beautiful-death","title":"A Beautiful Death","date":1471504424301,"synopsis":"Here we look at the last moments of life and ask ourselves how we would like to leave."},{"slug":"a-bug-in-three-acts","title":"A Bug in Three Acts","date":1418312909508,"synopsis":"I was pleased to have found an obscure bug that had created much fear and suffering. By obscure I mean hard to explain in the way that I know it. Here I reflect with an analogy to theatre."},{"slug":"a-new-citizenship","title":"A New Citizenship","date":1468086242850,"synopsis":"Professor [[Michael Sandel]] delivers four lectures about the prospects of a new politics of the common good. The series is presented and chaired by Sue Lawley. - [http://www.bbc.co.uk/programmes/b00l59hf bbc]"},{"slug":"a-thousand-plateaus","title":"A Thousand Plateaus","date":1466330504662,"synopsis":"A Thousand Plateaus: Capitalism and Schizophrenia (French: Mille plateaux) is a 1980 philosophy book by French authors [[Gilles Deleuze]] and [[Félix Guattari]], respectively a philosopher and a psychoanalyst  - [https://en.wikipedia.org/wiki/A_thousand_plateaus wikipedia]"},{"slug":"absolute-hospitality","title":"Absolute Hospitality","date":1421422797783,"synopsis":"For Derrida, hospitality is the basis for both culture and ethics. But at the heart of hospitality is a paradox. In order to be meaningful, it has to be limited: a gift that could be withheld, because the host is the one who controls and limits access to the home."},{"slug":"abstract-nonsense","title":"Abstract nonsense","date":1466359636164,"synopsis":"In mathematics, abstract nonsense, general abstract nonsense, and general nonsense are terms used facetiously by some mathematicians to describe certain kinds of arguments and methods related to category theory - [https://en.wikipedia.org/wiki/Abstract_nonsense wikipedia]"},{"slug":"actor-network-theory","title":"Actor Network Theory","date":1428897726587,"synopsis":"Actor-network theory (ANT) is an approach to social theory and research, originating in the field of science studies, which treats objects as part of social networks - [https://en.wikipedia.org/wiki/Actor%E2%80%93network_theory wikipedia]"},{"slug":"adam-curtis","title":"Adam Curtis","date":1496672025321,"synopsis":"Kevin Adam Curtis (born 1955) is an English documentary film-maker. Curtis says that his favourite theme is \"power and how it works in society\", and his works explore areas of sociology, psychology, philosophy and political history. Curtis describes his work as journalism that happens to be expounded via the medium of film. His films have won four BAFTAs. He has been closely associated with the BBC throughout his career - [https://en.wikipedia.org/wiki/Adam_Curtis wikipedia]"},{"slug":"adversarial-system","title":"Adversarial system","date":1469534721009,"synopsis":"The adversarial system or adversary system is a legal system used in the common law countries where two advocates represent their parties' positions before an impartial person or group of people, usually a jury or judge, who attempt to determine the truth of the case. It is in contrast to the inquisitorial system used in some civil law systems (i.e. those deriving from Roman law or the Napoleonic code) where a judge or group of judges investigates the case - [https://en.wikipedia.org/wiki/Adversarial_system wikipedia]"},{"slug":"age-of-entanglement","title":"Age of Entanglement","date":1457710242683,"synopsis":"As our technological and institutional creations have become more complex, our relationship to them has changed. We now relate to them as we once related to nature. The Enlightenment is Dead, Long Live the Entanglement."},{"slug":"agile-v-wiki-v-open","title":"Agile v. Wiki v. Open","date":1427289347561,"synopsis":"I consider the dimensions upon which three methods compare. In my mind they are all the same thing but I tease apart the differences in this 2009 keynote."},{"slug":"alan-nunn-may","title":"Alan Nunn May","date":1467959626542,"synopsis":"Alan Nunn May (2 May 1911 – 12 January 2003) was a British physicist, and a confessed and convicted Soviet spy, who supplied secrets of British and United States atomic research to the Soviet Union during World War II - [https://en.wikipedia.org/wiki/Alan_Nunn_May wikipedia]"},{"slug":"alexander-bogdanov","title":"Alexander Bogdanov","date":1436306571193,"synopsis":"Alexander Bogdanov was a Russian physician, philosopher, science fiction writer, and revolutionary of Belarusian ethnicity - [https://en.wikipedia.org/wiki/Alexander_Bogdanov wikipedia]"},{"slug":"algirdas-julien-greimas","title":"Algirdas Julien Greimas","date":1425162028850,"synopsis":"Algirdas Julien Greimas, was a French-Lithuanian literary scientist, known among other things for the Greimas Square. He is, along with [[Roland Barthes]], considered the most prominent of the French semioticians."},{"slug":"alpheidae","title":"Alpheidae","date":1468836454347,"synopsis":"Alpheidae is a family of caridean snapping shrimp characterized by having asymmetrical claws, the larger of which is typically capable of producing a loud snapping sound. Other common names of these species include pistol shrimp or alpheid shrimp - [https://en.wikipedia.org/wiki/Alpheidae wikipedia]"},{"slug":"altruism","title":"Altruism","date":1473167409613,"synopsis":"The term altruism was coined by the 19th century sociologist [[Auguste Comte]] and is derived from the Latin “alteri” or \"the others”. It describes an unselfish attention to the needs of others - [http://www.bbc.co.uk/programmes/p0038x9c bbc]"},{"slug":"an-equation-for-good","title":"An Equation for Good","date":1473166845967,"synopsis":"In a brief snippet from a conversation Robert had with [[Richard Dawkins]] at the 92 Street Y in New York City, we learn that natural selection is often a brutal arms race, inherently full of suffering and cruelty. But if Darwin's big idea is really predicated on pain and selfishness, why does selflessness exist?"},{"slug":"anarcho-capitalism","title":"Anarcho-capitalism","date":1468059617364,"synopsis":"Anarcho-capitalism is a political philosophy that advocates the elimination of the state in favor of individual sovereignty, private property, and free markets. Anarcho-capitalists believe that in the absence of statute (law by decree or legislation), society would improve itself through the discipline of the free market (or what its proponents describe as a \"voluntary society\") - [https://en.wikipedia.org/wiki/Anarcho-capitalism wikipedia]"},{"slug":"animal-farm","title":"Animal Farm","date":1476446471751,"synopsis":"Animal Farm is an allegorical and dystopian novella by George Orwell, first published in England on 17 August 1945. According to Orwell, the book reflects events leading up to the Russian Revolution of 1917 and then on into the Stalinist era of the Soviet Union - [https://en.wikipedia.org/wiki/Animal_Farm wikipedia]"},{"slug":"ann-druyen-on-the-space-episode","title":"Ann Druyen on the Space episode","date":1474272123635,"synopsis":"In the Space episode Ann Druyan, widow of [[Carl Sagan]], told us a story about the [[Voyager program]], true love, and golden record that travels through space - [http://www.radiolab.org/story/91850-ann-druyen-on-the-space-episode/?utm_source=sharedUrl&utm_medium=metatag&utm_campaign=sharedUrl radiolab.org]"},{"slug":"anthropic-principle","title":"Anthropic principle","date":1471007366423,"synopsis":"The anthropic principle (from Greek anthropos, meaning \"human\") is the philosophical consideration that observations of the Universe must be compatible with the conscious and sapient life that observes it - [https://en.wikipedia.org/wiki/Anthropic_principle wikipedia]"},{"slug":"anthropology","title":"Anthropology","date":1468758488053,"synopsis":"Anthropology is the study of various aspects of humans within societies of the past and present. Social anthropology and cultural anthropology study the norms and values of societies. Linguistic anthropology studies how language affects social life. Biological or physical anthropology studies the biological development of humans - [https://en.wikipedia.org/wiki/Anthropology wikipedia]"},{"slug":"anti-oedipus","title":"Anti-Oedipus","date":1466336983340,"synopsis":"Anti-Oedipus: Capitalism and Schizophrenia (French: Capitalisme et schizophrénie. L'anti-Œdipe) is a 1972 book by French authors Gilles Deleuze and Félix Guattari, respectively a philosopher and a psychoanalyst. It is the first volume of Capitalism and Schizophrenia, the second being A Thousand Plateaus (1980) - [https://en.wikipedia.org/wiki/Anti_Oedipus wikipedia]"},{"slug":"are-humans-transitioning-as-a-species-podcast","title":"Are humans transitioning as a species? podcast","date":1470590873415,"synopsis":"Will our great-grandchildren effectively be a different species from us? - [https://www.theguardian.com/science/audio/2015/nov/27/evolution-are-humans-transitioning-as-species-science-weekly-podcast bbc]"},{"slug":"are-we-code","title":"Are We Code","date":1278696477000,"synopsis":"Several pages on wiki suggest that peoples' minds are made of code. This seems highly unlikely, and even stronger than the strongest [[Strong Ai]] claims. But then again, if peoples' minds aren't made of code, what are they made of? [[Neural Networks]] have failed even worse than the non-connectionist versions of AI."},{"slug":"are-we-living-in-a-simulation","title":"Are We Living In A Simulation?","date":1501944535090,"synopsis":"Are we living in a simulation? Elon Musk thinks we definitely could be, and it seems he is not alone. The idea that we might simply be products of an advanced post-human civilisation, that are simply running a simulation of our universe and everything it contains, has taken hold over the last few years. Brian Cox and Robin Ince are joined on stage by comedian Phill Jupitus, Philosopher Professor Nick Bostrom and Neuroscientist Professor Anil Seth to ask what the chances are that are living in some Matrix like, simulated world and more importantly, how wo"},{"slug":"argument-interchange-format","title":"Argument Interchange Format","date":1470315369371,"synopsis":"The Argument Interchange Format, AIF, is an international effort to develop a representational mechanism for exchanging argument resources between research groups, tools, and domains using a semantically rich language. AIF-RDF is the extended ontology represented in the [[Resource Description Framework]] Schema (RDFS) semantic language. Though AIF is still something of a moving target, it is settling down. - [https://en.wikipedia.org/wiki/Argument_map#Argument_Interchange_Format wikipedia]"},{"slug":"argument-map","title":"Argument map","date":1471262644122,"synopsis":"In informal logic and philosophy, an argument map or argument diagram is a visual representation of the structure of an argument - [https://en.wikipedia.org/wiki/Argument_map wikipedia]"},{"slug":"art","title":"Art","date":1468834112411,"synopsis":"Art is hard to define. It is easier to define negatively than it is positively. I don't feel that art is distinct in any essential way from other forms of creative work, whether it is product design, science or mathematics. Rather it is negatively designed in terms of it's business model, a form of social trickery, that creates a space for some fantastic and vital experiments. Art is a way to get stupid people to have interesting thoughts (and to pay for them)."},{"slug":"assemblies","title":"Assemblies","date":1426103923021,"synopsis":"An assembly as we define it here is a gathering of people which has some form of legal representation. These legal gatherings form part of a larger networked whole, which in turn has a legal status with a mandate derived from its distributed parts."},{"slug":"attack-or-defence","title":"Attack or Defence","date":1472803499101,"synopsis":"A collection of ideas and media on the age old arms race - [https://en.wikipedia.org/wiki/Arms_race] wikipedia]"},{"slug":"augmentation-ethics","title":"Augmentation Ethics","date":1467761942122,"synopsis":"As we augment our bodies and our societies"},{"slug":"augusto-boal","title":"Augusto Boal","date":1429367413599,"synopsis":"Augusto Boal was a Brazilian theatre director, writer and politician. He was the founder of Theatre of the Oppressed, a theatrical form originally used in radical popular education movements - [https://en.wikipedia.org/wiki/Augusto_Boal wikipedia]"},{"slug":"basic-income","title":"Basic income","date":1466959128429,"synopsis":"An unconditional basic income (also called basic income, basic income guarantee, universal basic income, universal demogrant, or citizen's income) is a form of social security system in which all citizens or residents of a country regularly receive an unconditional sum of money, either from a government or some other public institution, in addition to any income received from elsewhere - [https://en.wikipedia.org/wiki/Basic_income wikipedia]"},{"slug":"bbc-radio-4","title":"BBC Radio 4","date":1467961624055,"synopsis":"BBC Radio 4 is a radio station owned and operated by the British Broadcasting Corporation (BBC) that broadcasts a wide variety of spoken-word programmes including news, drama, comedy, science and history. It replaced the BBC Home Service in 1967. The station is broadcast from the BBC's headquarters at Broadcasting House, London - [https://en.wikipedia.org/wiki/BBC_Radio_4 wikipedia]"},{"slug":"bbc-transport","title":"BBC Transport","date":1498155219126,"synopsis":"This [[Transport]] allows you to create a fedwiki [[ghost page]] from the data displayed on [[BBC Radio]] site or form a BBC radio podccast."},{"slug":"becoming-an-activist","title":"Becoming an Activist","date":1420950114968,"synopsis":"In the '80s I became aware that my research offered a better way to program. So I set out to change the world. See [[Live the Story]] for my experience in patterns."},{"slug":"bernard-lietaer","title":"Bernard Lietaer","date":1494459105771,"synopsis":"Bernard Lietaer (born in 1942 in Lauwe, Belgium) is a civil engineer, economist, author and professor. He studies monetary systems and promotes the idea that communities can benefit from creating their own local or complementary currency, which circulate parallel with national currencies - [https://en.wikipedia.org/wiki/Bernard_Lietaer wikipedia]"},{"slug":"bertrand-russell","title":"Bertrand Russell","date":1468833339594,"synopsis":"Bertrand Arthur William Russell, 3rd Earl Russell, OM, FRS (/ˈrʌsəl/; 18 May 1872 – 2 February 1970) was a British philosopher, logician, mathematician, historian, writer, social critic, political activist and Nobel laureate. At various points in his life he considered himself a liberal, a socialist, and a pacifist, but he also admitted that he had \"never been any of these things, in any profound sense\". He was born in Monmouthshire into one of the most prominent aristocratic families in the United Kingdom - [https://en.wikipedia.org/wiki/Bertrand_Russel"},{"slug":"best-practices-in-hospital-design","title":"Best Practices in Hospital Design","date":1427781039691,"synopsis":"This site allows you to see, apply, revise and add to best practice patterns in design of hospital patient environments.  You'll get the collaborative and real-time power of Wiki, along with extensive links to peer-reviewed research."},{"slug":"beware-the-machines","title":"Beware the Machines","date":1469882905209,"synopsis":"Should we beware the machines? Professor Stephen Hawking has warned the rise of Artificial Intelligence could mean the end of the human race. He's joined other renowned scientists urging computer programmers to focus not just on making machines smarter, but also ensuring they promote the good and not the bad."},{"slug":"bicameral-mind","title":"Bicameral Mind","date":1470900678443,"synopsis":"Bicameralism (the philosophy of \"two-chamberedness\") is a hypothesis in psychology that argues that the human mind once assumed a state in which cognitive functions were divided between one part of the brain which appears to be \"speaking\", and a second part which listens and obeys (a bicameral mind) - [https://en.wikipedia.org/wiki/Bicameralism_(psychology) wikipedia]"},{"slug":"bicameralism-psychology","title":"Bicameralism (psychology)","date":1470900355259,"synopsis":"Bicameralism (the philosophy of \"two-chamberedness\") is a hypothesis in psychology that argues that the human mind once assumed a state in which cognitive functions were divided between one part of the brain which appears to be \"speaking\", and a second part which listens and obeys—a bicameral mind - [https://en.wikipedia.org/wiki/Bicameralism_(psychology) wikipedia]"},{"slug":"big-bang","title":"Big Bang","date":1471007290633,"synopsis":"The Big Bang theory is the prevailing cosmological model for the universe from the earliest known periods through its subsequent large-scale evolution - [https://en.wikipedia.org/wiki/Big_Bang wikipedia]"},{"slug":"big-unknowns","title":"Big Unknowns","date":1470558461268,"synopsis":"Here we look at some big unanswered questions in science:"},{"slug":"big-unknowns-is-our-universe-infinite---podcast","title":"Big unknowns: is our universe infinite? - podcast","date":1470558418685,"synopsis":"Does our universe go on forever? Or does it have boundaries? And what clues can science uncover? Join us for a journey into the unknown - [https://www.theguardian.com/science/audio/2016/jul/29/big-unknowns-is-our-universe-infinite-podcast bbc]"},{"slug":"big-unknowns-what-is-consciousness---podcast","title":"Big unknowns: what is consciousness? - podcast","date":1470558201217,"synopsis":"What does it mean to be you? And how can science unpick the age-old debates around conscious experience? Join us for a journey into the unknown - [https://www.theguardian.com/science/audio/2016/aug/05/big-unknowns-what-is-consciousness-podcast bbc]"},{"slug":"bigger-than-bacon","title":"Bigger Than Bacon","date":1468827379603,"synopsis":"[[The Giant Bubble Thing]]. All about bubbles - enormous bubbles, tiny bubbles, shrimp, [[World War 2]] and patents. - [http://www.radiolab.org/story/bigger-bacon/?utm_source=sharedUrl&utm_medium=metatag&utm_campaign=sharedUrl radiolab.org]"},{"slug":"bike-patterns","title":"Bike Patterns","date":1385322180639,"synopsis":"Each pattern addresses a particular kind of challenge that often occurs for bicycles, and offers a practical way of making a safer, easier path for bikes.  Links are included to other resources, specifications and other technical information, including research."},{"slug":"bio-commons","title":"Bio-Commons","date":1432753351994,"synopsis":"In this whitepaper the results of the scenario thinking workshop and brainstorm discussions on the topic of the [[Bio-Commons]] are presented. As a way to realize these concepts, a hypothetical licensing model termed [[Bio-Commons]] (in analogy to the [[Creative Commons]]) was discussed."},{"slug":"bird-of-paradise","title":"Bird-of-paradise","date":1468063837604,"synopsis":"The birds-of-paradise are members of the family Paradisaeidae of the order Passeriformes. The majority of species are found in eastern Indonesia, Papua New Guinea, and eastern Australia. The family has 42 species in 15 genera. The members of this family are perhaps best known for the plumage of the males of the sexually dimorphic species (the majority), in particular the highly elongated and elaborate feathers extending from the beak, wings, tail or head. For the most part they are confined to dense rainforest habitat. The diet of all species is dominate"},{"slug":"black-box","title":"Black Box","date":1471338060427,"synopsis":"This hour, we examine three very different kinds of black boxesthose peculiar spaces where its clear whats going in, we know whats coming out, but what happens in-between is a mystery - [http://www.radiolab.org/story/black-box/?utm_source=sharedUrl&utm_medium=metatag&utm_campaign=sharedUrl radiolab.org]"},{"slug":"blockchain-party","title":"Blockchain Party","date":1430299475114,"synopsis":"My first serious interest in Blockchain technology was when I realised how it could be directly applied to [[Liquid Democracy]]. It is idealinfrastructure for the types of distributed multilayered democratic systems that are needed in society."},{"slug":"book-from-the-ground","title":"Book from the Ground","date":1427364170256,"synopsis":"Book from the Ground is an artwork and book published by MIT Press, which uses visual symbols collected over seven years, to tell a story in a visual language ([[Pictograph]] anyone can understand - [http://mitpress.mit.edu/books/book-ground mitpress.mit.edu]"},{"slug":"bookland","title":"Bookland","date":1426030654642,"synopsis":"[[Bookland]] is a good example of how the automatic clustering and then mapping of relationships can have real significance."},{"slug":"borders","title":"Borders","date":1457449529424,"synopsis":"Here we begin to collect some notes and ideas about borders."},{"slug":"bots-of-conviction","title":"Bots of Conviction","date":1492511064163,"synopsis":"Protest bots, or \"bots of conviction\" are canvassed by Mark Sample in a medium post and talk. [https://medium.com/@samplereality/a-protest-bot-is-a-bot-so-specific-you-cant-mistake-it-for-bullshit-90fe10b7fbaa link]"},{"slug":"brazen-head","title":"Brazen head","date":1468595144294,"synopsis":"A brazen head, brass, or bronze head was a legendary automaton in the early modern period whose ownership was ascribed to late medieval scholars who had developed a reputation as wizards, such as Roger Bacon. Made of brass or bronze, the male head was variously mechanical or magical. Like Odin's head of Mimir in Norse paganism, it was reputed to be able to correctly answer any question put to it, although it was sometimes restricted to \"yes\" or \"no\" answers. Thomas Browne considered them to be misunderstanding of the scholars' alchemical work, while Borl"},{"slug":"bret-victor","title":"Bret Victor","date":1469879485974,"synopsis":"Bret Victor worked at Apple (2007-2010) as a member of the “HID Proto” future-interface prototyping team, designing UI concepts for experimental hardware platforms."},{"slug":"bretton-woods-conference","title":"Bretton Woods Conference","date":1494459068961,"synopsis":"The Bretton Woods Conference, formally known as the United Nations Monetary and Financial Conference, was the gathering of 730 delegates from all 44 Allied nations at the Mount Washington Hotel, situated in Bretton Woods, New Hampshire, United States, to regulate the international monetary and financial order after the conclusion of World War II - [https://en.wikipedia.org/wiki/Bretton_Woods_Conference wikipedia]"},{"slug":"brexit","title":"Brexit","date":1471679827305,"synopsis":"Brexit is the forthcoming withdrawal of the United Kingdom (UK) from the European Union (EU). In the June 2016 referendum, 52% voted to leave the EU, leading into a complex separation process implying political and economic changes for the UK and other countries. The timetable for withdrawal has not yet been firmly established - [https://en.wikipedia.org/wiki/Brexit wikipedia]"},{"slug":"brexit-and-democracy","title":"Brexit And Democracy","date":1471677227726,"synopsis":"Some highlights of the video debate. Emotions, genes and facts."},{"slug":"bruno-latour","title":"Bruno Latour","date":1470389020098,"synopsis":"Bruno Latour is a philosopher of science and sympathetic critic of [[Deep Ecology]], which he seeks to replace with a [[Political Ecology]]. I sometimes blog about these things over at [http://parliamentofthings.org parliamentofthings.org]."},{"slug":"bureaucracy","title":"Bureaucracy","date":1501055875727,"synopsis":"Bureaucracy () is a term that refers to both a body of non-elective government officials and an administrative policy-making group. Historically, a bureaucracy was a government administration managed by departments staffed with non-elected officials. Today, bureaucracy is the administrative system governing any large institution. The public administration in many countries is an example of a bureaucracy - [https://en.wikipedia.org/wiki/Bureaucracy wikipedia]"},{"slug":"camino-de-santiago","title":"Camino de Santiago","date":1419092364935,"synopsis":"The Camino is a well-known medieval pilgrimage in the Catholic faith that attracts a wide range of people to walk it almost continuously."},{"slug":"capitalism","title":"Capitalism","date":1473756053506,"synopsis":"Capitalism is an economic system based on private ownership of the means of production and their operation for profit. Characteristics central to capitalism include private property, capital accumulation, wage labor, voluntary exchange, a price system, and competitive markets - [https://en.wikipedia.org/wiki/Capitalism wikipedia]"},{"slug":"capitalism-and-schizophrenia","title":"Capitalism and Schizophrenia","date":1466330541022,"synopsis":"Capitalism and Schizophrenia (French: Capitalisme et Schizophrénie) is a two-volume theoretical work by the French authors Gilles Deleuze and Félix Guattari, respectively a philosopher and a psychoanalyst. Its volumes, published eight years apart, are Anti-Oedipus (1972, trans. 1977) and A Thousand Plateaus (1980, trans. 1987). Deleuze's translator Brian Massumi observes that the books differ drastically in tone, content, and composition - [https://en.wikipedia.org/wiki/Capitalism_and_schizophrenia wikipedia]"},{"slug":"carl-sagan","title":"Carl Sagan","date":1474271950249,"synopsis":"Carl Edward Sagan (/ˈseɪɡən/; November 9, 1934 – December 20, 1996) was an American astronomer, cosmologist, astrophysicist, astrobiologist, author, science popularizer, and science communicator in astronomy and other natural sciences. He is best known for his work as a science popularizer and communicator. His best known scientific contributions is research on extraterrestrial life, including experimental demonstration of the production of amino acids from basic chemicals by radiation. Sagan assembled the first physical messages sent into space: the Pio"},{"slug":"caroline-elkins","title":"Caroline Elkins","date":1468655531175,"synopsis":"Caroline Elkins (born 1969) is a professor of history and African and African American Studies at Harvard University, and the founding director of Harvard's Center for African Studies. Her most noted publication, Imperial Reckoning: The Untold Story of Britain's Gulag in Kenya (2005) won the 2006 Pulitzer Prize for General Nonfiction - [https://en.wikipedia.org/wiki/Caroline_Elkins wikipedia]"},{"slug":"cascade-of-roofs","title":"Cascade Of Roofs","synopsis":". . . this pattern helps complete the <span>[[Building Complex]]</span>, <span>[[Number Of Stories]]</span>, <span>[[Main Building]]</span>, and <span>[[Wings Oflight]]</span>, and it can also be used to help create these patterns. If you are designing a building from scratch, these larger patterns have already helped you to decide how high your buildings are; and they have given you a rough layout, in wings, with an idea of what spaces there are going to be in each floor of the wings. Now we come to the stage where it is necessary to visualize the build"},{"slug":"catcall-research-methods","title":"Catcall Research Methods","date":1415982408785,"synopsis":"The recent \"catcalling\" video is a good demonstration of why research methods matter for everyone, not just scientists. Increasingly the public is presented with data that has the appearance and tone of science, but lacks the rigor.  This can lead to misunderstandings of what data means. (See Zeynep Tufekci's post:[https://medium.com/message/that-catcalling-video-and-why-research-methods-is-such-an-exciting-topic-really-32223ac9c9e8 html])"},{"slug":"category-theory","title":"Category Theory","date":1466359660350,"synopsis":"Category theory formalizes mathematical structure and its concepts in terms of a collection of objects and of arrows (also called morphisms). A category has two basic properties: the ability to compose the arrows associatively and the existence of an identity arrow for each object. The language of category theory has been used to formalize concepts of other high-level abstractions such as sets, rings, and groups - [https://en.wikipedia.org/wiki/Category_Theory wikipedia]"},{"slug":"cavitation","title":"Cavitation","date":1469026589968,"synopsis":"Cavitation is the formation of vapour cavities in a liquid – i.e. small liquid-free zones (\"bubbles\" or \"voids\") – that are the consequence of forces acting upon the liquid. It usually occurs when a liquid is subjected to rapid changes of pressure that cause the formation of cavities where the pressure is relatively low. When subjected to higher pressure, the voids implode and can generate an intense shock wave - [https://en.wikipedia.org/wiki/Cavitation wikipedia]"},{"slug":"cellmates","title":"Cellmates","date":1467975200464,"synopsis":"Theres a black hole in the middle of the history of life: how did we go from tiny bags of chemicals to the vast menagerie of creatures we see around us? - [http://www.radiolab.org/story/cellmates/?utm_source=sharedUrl&utm_medium=metatag&utm_campaign=sharedUrl radiolab.org]"},{"slug":"changes-to-this-site","title":"Changes to this Site","date":1434641767059,"synopsis":"Below we list recent changes to this site only without also listing changes from the [[Neighbourhood]]:"},{"slug":"charrette","title":"Charrette","date":1469024572695,"synopsis":"A charrette, often Anglicized to charette or charet and sometimes called a design charrette, is an intense period of design or planning activity - [https://en.wikipedia.org/wiki/Charrette wikipedia]"},{"slug":"chose-in-action","title":"Chose in Action","date":1425144770620,"synopsis":"A \"chose in action\" is essentially a right to sue. It is an intangible personal property right recognized and protected by the law, that has no existence apart from the recognition given by the law, and that confers no present possession of a tangible object. Another term is a [[Thing in Action]] - [https://en.wikipedia.org/wiki/Chose Wikipedia]."},{"slug":"citation-index","title":"Citation Index","date":1426177908222,"synopsis":"A citation index is a kind of bibliographic database, an index of citations between publications, allowing the user to easily establish which later documents cite which earlier documents."},{"slug":"citations-obsolete","title":"Citations Obsolete?","date":1429718583008,"synopsis":"I wonder, are academic citations obsolete in the presence of big data?"},{"slug":"climate-engineering","title":"Climate engineering","date":1472461744325,"synopsis":"Climate engineering, commonly referred to as geoengineering, also known as climate intervention, is the deliberate and large-scale intervention in the Earth’s climatic system with the aim of limiting adverse climate change. Climate engineering is an umbrella term for two types of measures: carbon dioxide removal and solar radiation management. Carbon dioxide removal addresses the cause of climate change by removing one of the greenhouse gases (carbon dioxide) from the atmosphere. Solar radiation management attempts to offset effects of greenhouse gases b"},{"slug":"collaborative-research-in-science","title":"Collaborative Research in Science","date":1470907454362,"synopsis":"Here we look at the importance and issue of collaborative research in science."},{"slug":"collaborative-software","title":"Collaborative software","date":1470314383777,"synopsis":"Collaborative software or groupware is an application software designed to help people involved in a common task to achieve their goals. One of the earliest definitions of collaborative software is 'intentional group processes plus software to support them.' - [https://en.wikipedia.org/wiki/Collaborative_software wikipedia]"},{"slug":"colors","title":"Colors","date":1472801079366,"synopsis":"Radiolab rips the rainbow a new one - [http://www.radiolab.org/story/211119-colors/?utm_source=sharedUrl&utm_medium=metatag&utm_campaign=sharedUrl radiolab.org]"},{"slug":"commodity-sculpture","title":"Commodity Sculpture","date":1428692957991,"synopsis":"In the 1980s, a variation of found art emerged called commodity sculpture where commercially mass-produced items would be arranged in the art gallery as sculpture. The focus of this variety of sculpture was on the marketing, display of products. These artists included Jeff Koons, Haim Steinbach, and Ashley Bickerton (who later moved on to do other kinds of work)."},{"slug":"common-law","title":"Common Law","date":1468055739834,"synopsis":"In [[Law, Legislation and Liberty]], [[Friedrich Hayek]] distinguishes two types of law: the law that is consciously created through the political process, which he calls the law of legislation, and the unplanned law that evolves out of the settlement of interpersonal disputes, which he calls the law of liberty."},{"slug":"communication-as-techne","title":"Communication as techne","date":1472803563512,"synopsis":"Techne is also a part of communication, and affects how human cultures interact. When people speak to one another, they apply their knowledge of social interactions, verbal and nonverbal cues, and their shared language to the skill of speaking. It is both personal and social, everybody has their own personal techne around their speech based on learned experiences and personal tics, and very social in that communities all communicate amongst each other on the interpersonal and large scale - [https://en.wikipedia.org/wiki/Techne#Communication_as_techne wik"},{"slug":"communitarianism","title":"Communitarianism","date":1468085652448,"synopsis":"Communitarianism is a philosophy that emphasizes the connection between the individual and the community. Although the community might be a family unit, communitarianism usually is understood, in the wider, philosophical sense, as a collection of interactions, among a community of people in a given place (geographical location), or among a community who share an interest or who share a history - [https://en.wikipedia.org/wiki/Communitarianism wikipedia]"},{"slug":"compendium-software","title":"Compendium (software)","date":1470316009292,"synopsis":"Compendium is a computer program and social science tool that facilitates the mapping and management of ideas and arguments. The software provides a visual environment that allows people to structure and record collaboration as they discuss and work through 'wicked problems' - [https://en.wikipedia.org/wiki/Compendium_(software) wikipedia]"},{"slug":"competition-in-america","title":"Competition in America","date":1469881819065,"synopsis":"Elizabeth Warren's keynote address about industry consolidation described monopolistic corporate power that is “hiding in plain sight all across the American economy and threatens our markets, threatens our economy, and threatens our democracy.”"},{"slug":"complementary-currency","title":"Complementary currency","date":1494458978271,"synopsis":"A complementary currency is a currency or medium of exchange which is not a national currency, but which is thought of as supplementing or complementing national currencies. :3 :2 Complementary currencies are usually not legal tender and their use is based on agreement between the parties exchanging the currency. According to Jérôme Blanc of Laboratoire d'Économie de la Firme et des Institutions, complementary currencies aim to protect, stimulate or orientate the economy.:7 They may also be used to advance particular social, environmental, or political g"},{"slug":"concept-draft","title":"Concept Draft","date":1431533110805,"synopsis":"Below is the hyperlinked text from the original proposal which can be found here - [https://docs.google.com/document/d/1puG_Pzv7DsP5woNjfrdmGNuCjSxhDLHDRHQavuJcMH4/edit?usp=sharing docs.google.com]"},{"slug":"concepts-of-category-theory","title":"Concepts of Category Theory","date":1466359763036,"synopsis":"Categories represent abstraction of other mathematical concepts - [https://en.wikipedia.org/wiki/Category_Theory#Basic_concepts wikipedia]"},{"slug":"confidence-trick","title":"Confidence trick","date":1470597961924,"synopsis":"A confidence trick (synonyms include confidence game, confidence scheme, ripoff, scam and stratagem) is an attempt to defraud a person or group after first gaining their confidence, used in the classical sense of trust. Confidence tricks exploit characteristics of the human psyche such as dishonesty, honesty, vanity, compassion, credulity, irresponsibility, naïveté and greed - [https://en.wikipedia.org/wiki/Confidence_trick wikipedia]"},{"slug":"confirmation-hearings","title":"Confirmation Hearings","date":1491130649911,"synopsis":"In modern times, the confirmation process has attracted considerable attention from special-interest groups, many of which lobby ([[lobbying]]) senators to confirm or to reject a nominee, depending on whether the nominee's track record aligns with the group's views. The Senate Judiciary Committee conducts hearings, questioning nominees to determine their suitability. By convention, nominees avoid revealing too much about their views on the Constitution. At the close of confirmation hearings, the Committee votes on whether the nomination should go to the "},{"slug":"connected-colors","title":"Connected Colors","date":1470235848659,"synopsis":"[[Connected Colors]] which was planned and produced with the technical direction by media artist Nobumichi Asai (WOW), conceptualizes the coexistence of life. The motif is centered on the colors of nature, and is an expression of electric make-up in the form of various colors intermingling and harmonizing."},{"slug":"consciousness","title":"Consciousness","date":1470558203530,"synopsis":"Consciousness is the state or quality of awareness, or, of being aware of an external object or something within oneself - [https://en.wikipedia.org/wiki/Consciousness wikipedia]"},{"slug":"constructing-explanations","title":"Constructing Explanations","date":1501835949173,"synopsis":"We seek explanation for what a system does and why. [[Microservices]] complicate this aspiration when mixed technologies have been assembled over years by evolving teams for changing business purpose."},{"slug":"contractual-society","title":"Contractual society","date":1468059357839,"synopsis":"The society envisioned by anarcho-capitalists has been called the ''Contractual Society''&nbsp;– \"... a society based purely on voluntary action, entirely unhampered by violence or threats of violence.\"<ref name=\"Rothbard-1962\"/>&nbsp;– in which anarcho-capitalists assert the system relies on voluntary agreements (contracts) between individuals as the legal framework. It is difficult to predict precisely what the particulars of this society will look like because of the details and complexities of contracts - [https://en.wikipedia.org/wiki/Anarcho_Capita"},{"slug":"controversies-about-stalin","title":"Controversies about Stalin","date":1459273497031,"synopsis":"There are conflicting accounts of Stalin's birth ([[Stalin before the Revolution]]), who before coming to power in 1922 listed his birth year in various documents as 1878 - [https://en.wikipedia.org/wiki/Joseph_stalin#Controversies_about_Stalin wikipedia]"},{"slug":"conversational-space","title":"Conversational Space","date":1453205784823,"synopsis":"Here we describe the architecture of conversation, in a system or design perspective, not as a singular temporal event but as a network process that occurs across time and space."},{"slug":"conways-game-of-life","title":"Conway's Game of Life","date":1468758530662,"synopsis":"The Game of Life, also known simply as Life, is a cellular automaton devised by the British mathematician John Horton Conway in 1970 - [https://en.wikipedia.org/wiki/Conway's_game_of_life wikipedia]"},{"slug":"copyleft-and-data","title":"Copyleft and Data","date":1475078637966,"synopsis":"Databases are a very poor fit for any licensing scheme, like copyleft, that is intended to encourage use by the entire world but also wants to place requirements on that use. This is because of broken legal systems and the way data is used. Projects considering copyleft, or even mere attribution, for data, should consider other approaches instead. [http://lu.is/blog/2016/09/12/copyleft-and-data-database-law-as-poor-platform/ post]"},{"slug":"corruption","title":"Corruption","date":1473163549591,"synopsis":"Here we look at corruption, and collect some ideas, science and stories around the topic."},{"slug":"cosmology","title":"Cosmology","date":1471008268779,"synopsis":"Cosmology (from the Greek κόσμος, kosmos \"world\" and -λογία, -logia \"study of\"), is the study of the origin, evolution, and eventual fate of the universe. Physical cosmology is the scholarly and scientific study of the origin, evolution, large-scale structures and dynamics, and ultimate fate of the universe, as well as the scientific laws that govern these realities - [https://en.wikipedia.org/wiki/Cosmology wikipedia]"},{"slug":"cost-of-living","title":"Cost of Living","date":1469119094725,"synopsis":"Here we look at cost of living."},{"slug":"creative-space","title":"Creative Space","date":1426103891295,"synopsis":"As a [[Creative Space]] an assembly may have such roles, but may well choose to run things completely differently. Minutes may be videoed, and live streamed to the assemblies web site."},{"slug":"criticism-of-meme-theory","title":"Criticism of meme theory","date":1470128336863,"synopsis":"An objection to the study of the evolution of memes in genetic terms (although not to the existence of memes) involves a perceived gap in the gene/meme analogy: the cumulative evolution of genes depends on biological selection-pressures neither too great nor too small in relation to mutation-rates. There seems no reason to think that the same balance will exist in the selection pressures on memes.<ref> p.333 - [https://en.wikipedia.org/wiki/Meme#Criticism_of_meme_theory wikipedia]"},{"slug":"criticisms-of-anarcho-capitalism","title":"Criticisms of anarcho-capitalism","date":1468059586370,"synopsis":"'''Criticisms of anarcho-capitalism''' include moral ([[morality]]) criticisms, pragmatic criticisms, the argument that anarcho-capitalism could not be maintained, and the argument that a society can be anarchist ([[anarchism]]) or capitalist ([[capitalism]]), but not both, based on their rejection of the \"neo-anarchist\" definition of anarchism - [https://en.wikipedia.org/wiki/Anarcho_Capitalism#Criticisms_of_anarcho-capitalism wikipedia]"},{"slug":"cryptolocker","title":"CryptoLocker","date":1468155637840,"synopsis":"CryptoLocker is a ransomware trojan which targeted computers running Microsoft Windows, believed to have first been posted to the Internet on 5 September 2013 - [https://en.wikipedia.org/wiki/CryptoLocker wikipedia]"},{"slug":"currently-working-on","title":"Currently Working On","date":1501074671526,"synopsis":"Here is a list of [[Recent Changes]] I consider important. View our experiments on the [[Scratch]] page. To clear stuff saved in your browser try [[Local Changes]]."},{"slug":"curse-of-popularity","title":"Curse of Popularity","date":1443455372464,"synopsis":"We enjoy the attention that comes with popularity but attention seekers crowd out the contributors we hope to meet. We propose conversation on a time scale unattractive to the insincere."},{"slug":"cybernetic-capitalism","title":"Cybernetic Capitalism","date":1454434263521,"synopsis":"Cybernetic capitalism is a term used in order to distinguish a group of theories, or, positions, on the Left that attempt to theorize the nature of the new capitalism - - [http://connection.ebscohost.com/c/articles/47573608/cybernetic-capitalism-informationalism-cognitive-labor ebscohost.com]"},{"slug":"cybernetic-totalitarianism","title":"Cybernetic Totalitarianism","date":1454406293580,"synopsis":"Cybernetic totalitarianism is the word I used instead of cybernetic capitalism, to get rid of left/right load that I didn't need in the context."},{"slug":"cybernetics","title":"Cybernetics","date":1501440882388,"synopsis":"Cybernetics is a transdisciplinary approach for exploring regulatory systems, their structures, constraints, and possibilities. In the 21st century, the term is often used in a rather loose way to imply \"control of any system using technology.\" - [https://en.wikipedia.org/wiki/Cybernetics wikipedia]"},{"slug":"dag","title":"DAG","date":1470994672258,"synopsis":"In mathematics and computer science, a directed acyclic graph (DAG), is a finite directed graph with no directed cycles - [https://en.wikipedia.org/wiki/Directed_Acyclic_Graph wikipedia]"},{"slug":"daisy-world","title":"Daisy World","date":1465481194764,"synopsis":"Daisy World is loosely modelled on [[James Lovelock]]'s [[Daisyworld]], but based in Minecraft where we can make use of the extensive environmental infrastructure of [[Biomes]], [[Plants]] and [[Animals]]."},{"slug":"danelaw","title":"Danelaw","date":1425066035600,"synopsis":"A page with 0 items."},{"slug":"dao","title":"DAO","date":1426614678666,"synopsis":"A Decentralized Autonomous Organization (often abbreviated \"DAO\"; sometimes referred to as a Fully Automated Business Entity or Distributed Autonomous Corporation/Distributed Autonomous Company, often abbreviated \"FAB\" or \"DAC\") is a decentralized network of narrow-AI autonomous agents which perform an output-maximizing production function and which divides its labor into computationally intractable tasks (which it incentivizes humans to do) and tasks which it performs itself."},{"slug":"dark-matter","title":"Dark matter","date":1471005852738,"synopsis":"Dark matter is an unidentified type of matter comprising approximately 27% of the mass and energy in the observable universe that is not accounted for by dark energy, baryonic matter (ordinary matter), and neutrinos - [https://en.wikipedia.org/wiki/Dark_matter wikipedia]"},{"slug":"darkode","title":"Darkode","date":1468681395022,"synopsis":"We shine a light into the darkcorners of the internet to see the world from the perspectiveof both cyber crime victims and perpetrators - [http://www.radiolab.org/story/darkode/?utm_source=sharedUrl&utm_medium=metatag&utm_campaign=sharedUrl radiolab.org]"},{"slug":"david-and-the-wire","title":"David and the Wire","date":1468758476855,"synopsis":"David Weinberg was stuck.Until he started recording every waking minute of his life - [http://www.radiolab.org/story/david-and-wire/?utm_source=sharedUrl&utm_medium=metatag&utm_campaign=sharedUrl radiolab.org]"},{"slug":"david-bovill","title":"David Bovill","date":1427311599137,"synopsis":"My name is David Bovill, and I'm a long term advocator and experimenter with [[Liquid Democracy]]. My nickname (and handle on twitter) is [https://twitter.com/fortyfoxes @fortyfoxes]."},{"slug":"dead-reckoning","title":"Dead Reckoning","date":1471627176362,"synopsis":"From a duel with the world's deadliest disease to a surprising peek into the way doctors think about [[Death]], in this hour Radiolab tries to reckon with the grim reaper - [http://www.radiolab.org/story/dead-reckoning/?utm_source=sharedUrl&utm_medium=metatag&utm_campaign=sharedUrl radiolab.org]"},{"slug":"death","title":"Death","date":1471627274436,"synopsis":"Death is the termination of all biological functions that sustain an organism - [https://en.wikipedia.org/wiki/Death wikipedia]"},{"slug":"deathwatch-beetle","title":"Deathwatch beetle","date":1468936099618,"synopsis":"The deathwatch beetle, Xestobium rufovillosum, is a woodboring beetle. The adult beetle is 7 millimetres (0.28 in) long, while the xylophagous larvae are up to 11 mm (0.43 in) long - [https://en.wikipedia.org/wiki/Deathwatch_beetle wikipedia]"},{"slug":"debatable","title":"Debatable","date":1468063890890,"synopsis":"How an outsiderbecame the vanguard of a movement that made everything about debate debatable - [http://www.radiolab.org/story/debatable/?utm_source=sharedUrl&utm_medium=metatag&utm_campaign=sharedUrl radiolab.org]"},{"slug":"debatable---radiolab","title":"Debatable - Radiolab","date":1467970081018,"synopsis":"How an outsider became the vanguard of a movement that made everything about debate debatable. - [http://www.radiolab.org/story/debatable/ bbc]"},{"slug":"decay","title":"Decay","date":1472802324091,"synopsis":"Here we collect some ideas and quotes about the process of decay. This relates to the themes of cancer, entropy, defence and immunity."},{"slug":"decentralised-web","title":"Decentralised Web","date":1466879342905,"synopsis":"A number of projects – such as [[Ethereum]], [[ZeroNet]] and the [[SAFE Network]]—aspire to create ways to build websites and applications that don’t depend on a single server or company to keep running  - [http://www.wired.com/2016/06/inventors-internet-trying-build-truly-permanent-web/ wired.com]"},{"slug":"deception","title":"Deception","date":1471331667973,"synopsis":"Deception, beguilement, deceit, bluff, mystification, and subterfuge is the act of propagating beliefs in things that are not true, or not the whole truth (as in half-truths or omission). Deception can involve dissimulation, propaganda, and sleight of hand, as well as distraction, camouflage, or concealment. There is also self-deception, as in bad faith - [https://en.wikipedia.org/wiki/Deception wikipedia]"},{"slug":"decision-making-space","title":"Decision Making Space","date":1491732745953,"synopsis":"A page with 1 items."},{"slug":"decision-theory","title":"Decision Theory","date":1433584084718,"synopsis":"Decision theory or theory of choice is concerned with identifying the values, uncertainties and other issues relevant in a given decision, its rationality, and the resulting optimal decision - [http://en.wikipedia.org/wiki/Decision_theory wikipedia]"},{"slug":"deep-democracy","title":"Deep Democracy","date":1454022772717,"synopsis":"Is a form of [[democracy]] that goes further than voting."},{"slug":"deep-ecology","title":"Deep Ecology","date":1454086292561,"synopsis":"Deep ecology is one of the principal schools in contemporary environmental philosophy. The term was first used by the Norwegian philosopher Arne Naess in 1972 in his paper \"The Shallow and the Deep, Long-Range Ecology Movement.\""},{"slug":"deity-mode-of-speech","title":"Deity Mode of Speech","date":1429421025421,"synopsis":"Kellogg and Bourland use the term [[Deity Mode of Speech]] to refer to misuse of the verb to be, which \"allows even the most ignorant to transform their opinions magically into god-like pronouncements on the nature of things\"."},{"slug":"democracy","title":"Democracy","date":1491770935617,"synopsis":"Democracy is a system of government in which all the people of a state or polity are involved in making decisions about its affairs, typically by voting to elect representatives to a parliament or similar assembly."},{"slug":"democracy-activity","title":"Democracy Activity","date":1519813924089,"synopsis":"View all activity from [[Democracy Sites]] listed in the roster below:"},{"slug":"democracy-in-europe-movement-2025","title":"Democracy in Europe Movement 2025","date":1501345042408,"synopsis":"The Democracy in Europe Movement 2025, or DiEM25, is a Pan-European political movement launched in 2015 by former Greek finance minister Yanis Varoufakis."},{"slug":"descartes","title":"Descartes","date":1434544830300,"synopsis":"Descartes tells us that our thought is the only sure evidence that we are anything at all."},{"slug":"description-and-explanation","title":"Description and Explanation","date":1425140836478,"synopsis":"Below are some interesting scraps to explore regarding the difference between (causal) explanation and description."},{"slug":"dialogic","title":"Dialogic","date":1427134705481,"synopsis":"The dialogic work carries on a continual dialogue with other works of literature and other authors. It does not merely answer, correct, silence, or extend a previous work, but informs and is continually informed by the previous work. Dialogic literature is in communication with multiple works - [https://en.wikipedia.org/wiki/Dialogic wikipedia]"},{"slug":"dialogic-vs-dialectic","title":"Dialogic vs Dialectic","date":1427134370809,"synopsis":"Sociologist Richard Sennett has stated that the distinction between [[Dialogic]] and [[Dialectic]] is fundamental to understanding human communication. Sennett says that dialectic deals with the explicit meaning of statements, and tends to lead to closure and resolution - [https://en.wikipedia.org/wiki/Dialogic#Distinction_between_dialogic_and_dialectic wikipedia]"},{"slug":"diem25","title":"DiEM25","date":1507904056165,"synopsis":"The Democracy in Europe Movement 2025, or DiEM25, is a Pan-European political movement launched in 2015 by former Greek finance minister [[Yanis Varoufakis]]."},{"slug":"digital-human","title":"Digital Human","date":1467702959274,"synopsis":"Aleks Krotoski explores the digital world in this Radio 4 Podcast - [http://www.bbc.co.uk/programmes/b01n7094/episodes/downloads bbc]"},{"slug":"directed-acyclic-graph","title":"Directed Acyclic Graph","date":1470994591666,"synopsis":"In mathematics and computer science, a directed acyclic graph (DAG), is a finite directed graph with no directed cycles - [https://en.wikipedia.org/wiki/Directed_Acyclic_Graph wikipedia]"},{"slug":"disciplined-thinking","title":"Disciplined Thinking","date":1468168387807,"synopsis":"Figuring out how to make the act of decision-making “commensurate with the complexity and importance of the stakes” is a huge problem, in Kahneman’s view, to which the business world does not devote much thought.  [http://knowledge.wharton.upenn.edu/article/nobel-winner-daniel-kahnemans-strategy-firm-can-think-smarter/ post]"},{"slug":"dissertation-over-discourse","title":"Dissertation Over Discourse","date":1426259384403,"synopsis":"A play on words meaning, of course, that [[Document Mode]] is more important than [[Thread Mode]] but suggesting also to put [[Summaries On Top Discussion Below]]."},{"slug":"dissociative-identity-disorder","title":"Dissociative identity disorder","date":1474271621982,"synopsis":"Dissociative identity disorder (DID), previously known as multiple [[personality]] disorder (MPD), is a mental disorder characterized by at least two distinct and relatively enduring identities or dissociated personality states that alternately show in a person's behavior, accompanied by memory impairment for important information not explained by ordinary forgetfulness. These symptoms are not accounted for by substance abuse, seizures, other medical conditions, nor by imaginative play in children. Diagnosis is often difficult as there is considerable co"},{"slug":"distributed-autonomous-organisation","title":"Distributed Autonomous Organisation","date":1426609147632,"synopsis":"A distributed autonomous organisation is"},{"slug":"diy","title":"DIY","date":1471875679870,"synopsis":"An interesting and moving story about [[Autism]], and other topics."},{"slug":"donation-and-mutation","title":"Donation and Mutation","date":1474633022717,"synopsis":"Another beautiful story from [[RadioLab]]. The first one realties to the value of knowledge, medicine and life - connecting human values and ethics to science in a way that is hard to capture without such a great narrative."},{"slug":"drawing-graphs-as-maps","title":"Drawing Graphs as Maps","date":1426030752554,"synopsis":"The visualisation of complex multidimensional relationships as geographic maps is a powerful way to combine notions of clustering and topological relationships in an intuitive and playful way."},{"slug":"dreamland","title":"Dreamland","date":1492255983353,"synopsis":"Dreamland was a swimming pool in Portland Ohio"},{"slug":"dunbars-number","title":"Dunbar's number","date":1470556954901,"synopsis":"Dunbar's number is a suggested cognitive limit to the number of people with whom one can maintain stable social relationships. These are relationships in which an individual knows who each person is and how each person relates to every other person. This number was first proposed in the 1990s by British anthropologist Robin Dunbar, who found a correlation between primate brain size and average social group size. By using the average human brain size and extrapolating from the results of primates, he proposed that humans can comfortably maintain only 150 "},{"slug":"dvorak","title":"Dvorak","date":1433282923261,"synopsis":"Dvorak is a customizable card game that begins with a deck of blank index cards. These index cards (or pieces of paper or cardboard) are written and drawn upon by players before or during the game  - [https://en.wikipedia.org/wiki/Dvorak_%28game%29 wikipedia]"},{"slug":"e-o-wilson","title":"E. O. Wilson","date":1512665007769,"synopsis":"Known to many as the founding father of socio-biology, E O Wilson is a big hitter in the world of evolutionary theory. But, recently he's criticised what's popularly known as The Selfish Gene theory of evolution that he once worked so hard to promote (and that now underpins the mainstream view on evolution)."},{"slug":"e-prime","title":"E-Prime","date":1428657017441,"synopsis":"E-Prime is a prescriptive version of the English language, which excludes all forms of the verb to be. Some scholars advocate using E-Prime as a device to clarify thinking and strengthen writing - [https://en.wikipedia.org/wiki/E-Prime wikipedia]"},{"slug":"eleusis","title":"Eleusis","date":1431600668305,"synopsis":"[[Eleusis]] is a multi-genre card game where one player chooses a secret rule to determine which cards can be played on top of others, and the other players attempt to determine the rule using inductive logic - [https://en.wikipedia.org/wiki/Eleusis_%28card_game%29 wikipedia]"},{"slug":"emma-goldman","title":"Emma Goldman","date":1466767832617,"synopsis":"Emma Goldman (June 27 [O.S. June 15], 1869 – May 14, 1940) was an anarchist known for her political activism, writing, and speeches. She played a pivotal role in the development of anarchist political philosophy in North America and Europe in the first half of the 20th century - [https://en.wikipedia.org/wiki/Emma_Goldman wikipedia]"},{"slug":"entelechia","title":"Entelechia","date":1425159374405,"synopsis":"Entelechy, in Greek entel√©cheia, was coined by Aristotle and transliterated in Latin as entelechia - [https://en.wikipedia.org/wiki/Potentiality_and_actuality#Entelechy_or_entelechia wikipedia]."},{"slug":"epigenetics","title":"Epigenetics","date":1470590840690,"synopsis":"In the science of genetics, epigenetics is the study of cellular and physiological phenotypic trait variations that result from external or environmental factors that switch genes on and off and affect how cells express genes - [https://en.wikipedia.org/wiki/Epigenetics wikipedia]"},{"slug":"episteme","title":"Episteme","date":1471702384874,"synopsis":"Episteme means knowledge, as in \"justified true belief\" in the terminology of the philosopher Plato. It is etymologically derived from the Ancient Greek word ἐπιστήμη for knowledge or science, which comes from the verb ἐπίσταμαι, \"to know\". Episteme as knowledge contrasts doxa, Plato's term for common belief or opinion. Episteme is distinguished from techne, which is knowledge in an applied way as in a craft. The word epistemology, means the study of knowledge, and is derived from episteme - [https://en.wikipedia.org/wiki/Episteme wikipedia]"},{"slug":"episteme-and-techne","title":"Episteme and Techne","date":1471702315048,"synopsis":"[[Epistêmê]] is the Greek word most often translated as [[Knowledge]], while [[Technê]] is translated as either craft or art."},{"slug":"ethics","title":"Ethics","date":1498658922008,"synopsis":"Ethics or [[moral philosophy]] is a branch of philosophy that involves systematizing, defending, and recommending concepts of right and wrong conduct."},{"slug":"ethnomethodology","title":"Ethnomethodology","date":1425158564421,"synopsis":"Ethnomethodology is a method for understanding the social orders people use to make sense of the world through analysing their accounts and descriptions of their day-to-day experiences - [https://en.wikipedia.org/wiki/Ethnomethodology wikipedia]."},{"slug":"european-new-deal","title":"European New Deal","date":1507903885879,"synopsis":"DiEM25’s European New Deal offers a comprehensive economic and social agenda for the whole of Europe, including the Eurozone, EU members not in the Eurozone, and even European countries outside the EU."},{"slug":"evolution-of-sex","title":"Evolution of Sex","date":1460754414815,"synopsis":"Many protists reproduce sexually, as do the multicellular plants, animals, and fungi. In the eukaryotic fossil record, sexual reproduction first appeared by 1.2 billion years ago in the Proterozoic Eon."},{"slug":"evolutionary-black-hole","title":"Evolutionary Black Hole","date":1468834527979,"synopsis":"The biggest hole in our understanding of life - both in science and in philosophy, politics and ethics is the question of how and why diversity is generated."},{"slug":"evolutionary-language","title":"Evolutionary Language","date":1509727428874,"synopsis":"Here I should start to write and record ideas about what constitutes and \"evolutionary language\" as distinct from other forms of language."},{"slug":"exclusionary-rule","title":"Exclusionary rule","date":1469534640390,"synopsis":"The exclusionary rule is a legal principle in the United States, under constitutional law, which holds that evidence collected or analyzed in violation of the defendant's constitutional rights is sometimes inadmissible for a criminal prosecution in a court of law. This may be considered an example of a prophylactic rule formulated by the judiciary in order to protect a constitutional right. The exclusionary rule may also, in some circumstances at least, be considered to follow directly from the constitutional language, such as the Fifth Amendment's comma"},{"slug":"eye-in-the-sky","title":"Eye in the Sky","date":1468666180062,"synopsis":"Ross McNutt has a superpower  he can zoom in on everyday life, then rewind and fast-forward to solve crimes in a shutter-flash. But should he? - [http://www.radiolab.org/story/eye-sky/?utm_source=sharedUrl&utm_medium=metatag&utm_campaign=sharedUrl radiolab.org]"},{"slug":"factoid","title":"Factoid","date":1492249399200,"synopsis":"The term factoid can, in common usage, mean either a false or spurious statement presented as a fact, as well as a true, if brief or trivial, item of news or information."},{"slug":"fake-news","title":"Fake news","date":1492256245271,"synopsis":"Fake news is a type of hoax or deliberate spread of misinformation (false information), be it via the traditional print or broadcasting news media or via Internet-based social media."},{"slug":"family-resemblance","title":"Family resemblance","date":1468834205038,"synopsis":"Family resemblance (German: Familienähnlichkeit) is a philosophical idea made popular by [[Ludwig Wittgenstein]], with the best known exposition given in his posthumously published book Philosophical Investigations (1953) - [https://en.wikipedia.org/wiki/Family_resemblance wikipedia]"},{"slug":"fathers","title":"Fathers","date":1497787649730,"synopsis":"He we collect links about fathers, and paternalism."},{"slug":"fear-of-strangers","title":"Fear of Strangers","date":1470556979841,"synopsis":"The [[Guardian Podcast]] looks at the science of the [[Fear of Strangers]]. Is there a biological basis for human division? And can science help us bridge the divide when conflicts arise? - [https://www.theguardian.com/science/audio/2016/jul/22/us-and-them-are-we-biologically-primed-to-fear-outsiders bbc]"},{"slug":"federated-wiki","title":"Federated Wiki","date":1424469802551,"synopsis":"We publish federated wiki software as a Node.js package ready to run on a variety of platforms. This is usefully run on a personal laptop or an industrial server in the cloud. Most people get started by joining a community and launching sites and/or servers with their help. The server software supports a multi-tenant \"farm\" option useful for small groups or heavy users. [https://www.npmjs.com/package/wiki npm]"},{"slug":"fedwiki-tools","title":"Fedwiki Tools","date":1501663853164,"synopsis":"Here we list a few tools that are of particular use in managing and creating [[Fedwiki]] content."},{"slug":"feelings-vs-fact","title":"Feelings vs Fact","date":1470597669673,"synopsis":"As a political candidate I'll go with how people feel and I'll let you go with the theoreticians - [[Newt Gingrich]]"},{"slug":"filibuster","title":"Filibuster","date":1473755880789,"synopsis":"A filibuster (from EModE, c. 1580: flibutor, \"pirate\" ) is a parliamentary procedure where debate over a proposed piece of legislation is extended, allowing one or more members to delay or entirely prevent a vote on the proposal. It is sometimes referred to as \"talking out a bill\" or \"talking a bill to death\" and characterized as a form of obstruction in a legislature or other decision-making body - [https://en.wikipedia.org/wiki/Filibuster wikipedia]"},{"slug":"filter-bubble","title":"Filter bubble","date":1470048224058,"synopsis":"A filter bubble is a result of a personalized search in which a website algorithm selectively guesses what information a user would like to see based on information about the user (such as location, past click behavior and search history) and, as a result, users become separated from information that disagrees with their viewpoints, effectively isolating them in their own cultural or ideological bubbles. Prime examples are Google Personalized Search results and Facebook's personalized news stream. The term was coined by internet activist Eli Pariser in h"},{"slug":"finsbury-park","title":"Finsbury Park","date":1468858665156,"synopsis":"Finsbury Park is a public park in the ward of the London neighbourhood of Harringay. It is in the area formerly covered by the historic parish of Hornsey, succeeded by the Municipal Borough of Hornsey. It was one of the first of the great London parks laid out in the Victorian era. The park borders the districts of Finsbury Park, Harringay, Stroud Green and Manor House - [https://en.wikipedia.org/wiki/Finsbury_Park wikipedia]"},{"slug":"flavours-of-money","title":"Flavours of Money","date":1426076902001,"synopsis":"Money and votes are just two examples of token exchange games, from a palette of an infinitely more diverse range of similar games - [http://blog.parliamentofthings.org/flavours-of-money/ parliamentofthings.org]"},{"slug":"flix-guattari","title":"Félix Guattari","date":1466330504664,"synopsis":"Pierre-Félix Guattari; April 30, 1930 – August 29, 1992) was a French psychotherapist, philosopher, semiologist, and militant."},{"slug":"fluxus-cannot-save-the-world","title":"\"Fluxus cannot save the world.\"","date":1453377722494,"synopsis":"What hacking has to do with avantgarde art of the 1960ies"},{"slug":"fluxx","title":"Fluxx","date":1433282777411,"synopsis":"Fluxx is a card game, played with a specially designed deck. It is different from most other card games, in that the rules and the conditions for winning are altered throughout the game, via cards played by the players - [https://en.wikipedia.org/wiki/Fluxx wikipedia]"},{"slug":"forking-as-cultural-feature","title":"Forking as (Cultural) Feature","date":1420259510046,"synopsis":"Klint Finley has written about [[Ward Cunningham]]'s work on a federated wiki, linking ideas around Fedwiki to Github, whose strapline is \"Build software better, together\". [http://www.wired.com/2012/07/wiki-inventor/ html]"},{"slug":"forms-of-money","title":"Forms of Money","date":1466959317307,"synopsis":"Here we look at the various forms and types of money and money creation that are possible."},{"slug":"forum-theatre","title":"Forum Theatre","date":1496659355722,"synopsis":"Forum theatre is a type of theatre created by the innovative and influential practitioner Augusto Boal as part of what he calls [https://en.wikipedia.org/wiki/Theatre_of_the_Oppressed  Theatre of the Oppressed]"},{"slug":"frame-artificial-intelligence","title":"Frame (artificial intelligence)","date":1471727814805,"synopsis":"Frames were proposed by Marvin Minsky in his 1974 article \"A Framework for Representing Knowledge.\" A frame is an artificial intelligence data structure used to divide knowledge into substructures by representing \"stereotyped situations.\" Frames are the primary data structure used in artificial intelligence Frame languages - [https://en.wikipedia.org/wiki/Frame_(artificial_intelligence) wikipedia]"},{"slug":"framework-for-argument","title":"Framework For Argument","date":1471262682003,"synopsis":"What is a framework for argument? how does it relate to a constitution?"},{"slug":"free-culture-movement","title":"Free culture movement","date":1470236934037,"synopsis":"The free culture movement is a social movement that promotes the freedom to distribute and modify creative works in the form of free content or open content by using the Internet and other forms of media - [https://en.wikipedia.org/wiki/Free_culture_movement wikipedia]"},{"slug":"free-will","title":"Free will","date":1498642292283,"synopsis":"Free will is the ability to choose between different possible courses of action unimpeded. It is closely linked to the concepts of responsibility, praise, guilt, sin, and other judgments which apply only to actions that are freely chosen. It is also connected with the concepts of advice, persuasion, deliberation, and prohibition. Traditionally, only actions that are freely willed are seen as deserving credit or blame. There are numerous different concerns about threats to the possibility of free will, varying by how exactly it is conceived, which is a ma"},{"slug":"friedrich-hayek","title":"Friedrich Hayek","date":1468055325197,"synopsis":"Friedrich Hayek CH (8 May 1899 – 23 March 1992), born in Austria-Hungary was an Austrian and British economist and philosopher best known for his defence of classical liberalism - [https://en.wikipedia.org/wiki/Friedrich_Hayek wikipedia]"},{"slug":"friedrich-nietzsche","title":"Friedrich Nietzsche","date":1468833622246,"synopsis":"Friedrich Wilhelm [[Nietzsche]] (15 October 1844 – 25 August 1900) was a German philosopher, cultural critic, poet and Latin and Greek scholar whose work has exerted a profound influence on Western philosophy and modern intellectual history - [https://en.wikipedia.org/wiki/Friedrich_Nietzsche wikipedia]"},{"slug":"from-tree-to-shining-tree","title":"From Tree to Shining Tree","date":1469975952360,"synopsis":"Forests feel like a place of great stillness but dig deeper and theres a hidden world beneath your feet as busy and complicated as a city - [http://www.radiolab.org/story/from-tree-to-shining-tree/?utm_source=sharedUrl&utm_medium=metatag&utm_campaign=sharedUrl radiolab.org]"},{"slug":"functors","title":"Functors","date":1466359694199,"synopsis":"A category is ''itself'' a type of mathematical structure, so we can look for \"processes\" which preserve this structure in some sense; such a process is called a [[functor]]."},{"slug":"funding-journalism","title":"Funding Journalism","date":1491134708312,"synopsis":"Here we take a look at the status and future of funding journalism."},{"slug":"future-you","title":"Future You","date":1470127947808,"synopsis":"A future you is someone who is like you but different in important ways. This person may well know more than you do, but equally may have forgotten many things. In particular they are likely to have forgotten the context in which you are reading or writing your thoughts."},{"slug":"game","title":"Game","date":1471177363532,"synopsis":"A game is structured form of play, usually undertaken for enjoyment and sometimes used as an educational tool. Games are distinct from work, which is usually carried out for remuneration, and from art, which is more often an expression of aesthetic or ideological elements. However, the distinction is not clear-cut, and many games are also considered to be work (such as professional players of spectator sports or games) or art (such as jigsaw puzzles or games involving an artistic layout such as Mahjong, solitaire, or some video games) - [https://en.wikip"},{"slug":"game-of-life","title":"Game Of Life","date":1468758530667,"synopsis":"The Game of Life, also known simply as LIFE, is a board game originally created in 1860 by Milton Bradley, as The Checkered Game of Life (and later produced by the Milton Bradley Company of Springfield, Massachusetts) - [http://www.newyorker.com/magazine/2007/05/21/the-meaning-of-life newyorker.com]"},{"slug":"game-semantics","title":"Game semantics","date":1466348903072,"synopsis":"Game semantics (German: dialogische Logik, translated as dialogical logic) is an approach to formal semantics that grounds the concepts of truth or validity on game-theoretic concepts, such as the existence of a winning strategy for a player, somewhat resembling Socratic dialogues or medieval theory of Obligationes - [https://en.wikipedia.org/wiki/Game_semantics wikipedia]"},{"slug":"game-theory","title":"Game Theory","date":1433584201033,"synopsis":"Game theory is the study of strategic decision making."},{"slug":"games","title":"Games","date":1471177420688,"synopsis":"A game is structured form of play, usually undertaken for enjoyment and sometimes used as an educational tool. Games are distinct from work, which is usually carried out for remuneration, and from art, which is more often an expression of aesthetic or ideological elements. However, the distinction is not clear-cut, and many games are also considered to be work (such as professional players of spectator sports or games) or art (such as jigsaw puzzles or games involving an artistic layout such as Mahjong, solitaire, or some video games) - [https://en.wikip"},{"slug":"gated-community","title":"Gated community","date":1457696338221,"synopsis":"In its modern form, a gated community (or walled community) is a form of residential community or housing estate containing strictly controlled entrances for pedestrians, bicycles, and automobiles, and often characterized by a closed perimeter of walls and fences - [https://en.wikipedia.org/wiki/Gated_community wikipedia]"},{"slug":"genetic-diversity","title":"Genetic diversity","date":1471611283709,"synopsis":"Genetic diversity is the total number of genetic characteristics in the genetic makeup of a species. It is distinguished from genetic variability, which describes the tendency of genetic characteristics to vary - [https://en.wikipedia.org/wiki/Genetic_diversity wikipedia]"},{"slug":"geoengineering","title":"Geoengineering","date":1472462054548,"synopsis":"Climate engineering, commonly referred to as geoengineering, also known as climate intervention, is the deliberate and large-scale intervention in the Earth’s climatic system with the aim of limiting adverse climate change."},{"slug":"gilles-deleuze","title":"Gilles Deleuze","date":1466331436260,"synopsis":"Gilles Deleuze; 18 January 1925 – 4 November 1995) was a French philosopher who, from the early 1960s until his death, wrote on philosophy, literature, film, and fine art   - [https://en.wikipedia.org/wiki/Gilles_deleuze wikipedia]"},{"slug":"gleaners","title":"Gleaners","date":1498650363162,"synopsis":"Gleaners are people who go out and forage for pieces of information, outside of the community. They recycle knowledge from a range of sources, making it their own."},{"slug":"gmap-algorithm","title":"GMap Algorithm","date":1426024628476,"synopsis":"GMap is an algorithm for visualizing graphs as maps. GMap (see also [[GvMap Algorithm]]), is a practical tool for visualizing relational data with geographic-like maps. It aims to capture the underlying structural information, clustering, and neighborhoods of complex data  - [http://www.graphviz.org/Documentation/GHK09.pdf pdf]"},{"slug":"governance","title":"Governance","date":1448544950275,"synopsis":"Why is it that in so many hierarchical institutions authority is separated from competence? Why do so many such systems continue to exist?"},{"slug":"gradually-then-suddenly","title":"Gradually, Then Suddenly","date":1427314452726,"synopsis":"One argument favored by education futurists is that while things have changed little in the past century they may change quickly when we least expect it. AI is often cited as a possible trigger. A Hemingway quote from The Sun Also Rises provides the title and context for this idea. (Topics: Artificial Intelligence, Disruption, Education Narratives)."},{"slug":"gravitational-singularity","title":"Gravitational singularity","date":1460754372417,"synopsis":"A gravitational singularity or spacetime singularity is a location where the quantities that are used to measure the gravitational field of a celestial body become infinite in a way that does not depend on the coordinate system. These quantities are the scalar invariant curvatures of spacetime, which includes a measure of the density of matter. The laws of normal spacetime could not exist within a singularity - [https://en.wikipedia.org/wiki/Gravitational_singularity wikipedia]"},{"slug":"greed-is-good","title":"Greed is Good","date":1445592335769,"synopsis":"This is a beautifully argued, and straight forward elucidation of the argument that greed is good as a driving force of capitalism."},{"slug":"green-politics","title":"Green Politics","date":1426510053893,"synopsis":"A page with 1 items."},{"slug":"guardian-podcast","title":"Guardian Podcast","date":1470556904468,"synopsis":"There are a number of good podcasts from the British newspaper Guardian. We've made a start at adding these (\"science only for now\") to the [[podcast-transport]]."},{"slug":"guatemala","title":"Guatemala","date":1469534407658,"synopsis":"Guatemala (/ˌɡwɑːtᵻˈmɑːləˌ ɡwæ-ˌ ɡɑː-/ GWAH-tə-MAH-lə, GWAT-ə-MAH-lə or GAH-tə-MAH-lə; Spanish: [gwateˈmala]), officially the Republic of Guatemala (Spanish: República de Guatemala), is a country in Central America bordered by Mexico to the north and west, the Pacific Ocean to the southwest, Belize to the northeast, the Caribbean to the east, Honduras to the east and El Salvador to the southeast. With an estimated population of around 15.8 million, it is the most populous state in Central America. A representative democracy, Guatemala's capital and large"},{"slug":"guilt-emotion","title":"Guilt (emotion)","date":1467803387876,"synopsis":"Guilt is a cognitive or an emotional experience that occurs when a person believes or realizes—accurately or not—that he or she has compromised his or her own standards of conduct or has violated a moral standard and bears significant responsibility for that violation. It is closely related to the concept of remorse - [https://en.wikipedia.org/wiki/Guilt_(emotion) wikipedia]"},{"slug":"gun-control-could-help-prevent-suicides","title":"Gun Control Could Help Prevent Suicides","date":1498591424204,"synopsis":"[[Most Suicides Are Impulsive]] and access to guns may make suicide far more successful."},{"slug":"gun-divide","title":"Gun Divide","date":1444073820704,"synopsis":"Record numbers of mass shhotings have corresponded with a polarization of views on guns."},{"slug":"guns-in-america","title":"Guns In America","date":1467279729319,"synopsis":"Here we gather information about guns, statistics, and gun laws in USA."},{"slug":"guy-debord","title":"Guy Debord","date":1471257909210,"synopsis":"Guy Louis Debord (French: [gi dəbɔʁ]; December 28, 1931 – November 30, 1994) was a French Marxist theorist, writer, filmmaker, member of the Letterist International, founder of a Letterist faction, and founding member of the Situationist International (SI). He was also briefly a member of Socialisme ou Barbarie - [https://en.wikipedia.org/wiki/Guy_Debord wikipedia]"},{"slug":"gvmap-algorithm","title":"GvMap Algorithm","date":1426026447772,"synopsis":"GvMap is an algorithm for visualizing graphs as maps. It is part of the [[Graphviz]] library, and was originally called the [[GMap Algorithm]]."},{"slug":"hacker-beach","title":"Hacker Beach","date":1448714205784,"synopsis":"Hacker Beach is a month-long, spontaneous, self-organized gathering of hackers and like-minded people on a tropical island (or coast). It happens every year in January - [https://hackerbeach.org/about/ hackerbeach.org]"},{"slug":"hacking-social-impact","title":"Hacking Social Impact","date":1427655267578,"synopsis":"I was invited to present at a conference promising to bring together in a dynamic and collaborative environment the leaders in social impact, business, and venture capital investment innovation. [http://socialventuresociety.org/unconference/ website] [http://us6.campaign-archive2.com/?u=adeb969bbfd2716b2416778ac&id=93902578be details]"},{"slug":"haldane-principle","title":"Haldane principle","date":1470904901925,"synopsis":"In British research policy, the Haldane principle is the idea that decisions about what to spend research funds on should be made by researchers rather than politicians. It is named after Richard Burdon Haldane, who in 1904 and from 1909 to 1918 chaired committees and commissions which recommended this policy - [https://en.wikipedia.org/wiki/Haldane_principle wikipedia]"},{"slug":"hannah-arendt","title":"Hannah Arendt","date":1490042181778,"synopsis":"Johanna \"Hannah\" Arendt (14 October 1906 – 4 December 1975) was a German-born Jewish American political theorist - [https://en.wikipedia.org/wiki/Hannah_Arendt wikipedia]"},{"slug":"hanslope-park","title":"Hanslope Park","date":1468652455343,"synopsis":"Hanslope Park is located about half a mile south-east of the village of Hanslope in the Borough of Milton Keynes. Once the manorial estate of the village, it is now owned by the UK Foreign and Commonwealth Office, and is home to Her Majesty's Government Communications Centre ('HMGCC') - [https://en.wikipedia.org/wiki/Hanslope_Park wikipedia]"},{"slug":"hard-knock-life","title":"Hard Knock Life","date":1468936070056,"synopsis":"This Valentine's Day, a mysterious tap tap tapping leads us into a world of sex, death, and head-banging - [http://www.radiolab.org/story/hard-knock-life/?utm_source=sharedUrl&utm_medium=metatag&utm_campaign=sharedUrl radiolab.org]"},{"slug":"harmony","title":"Harmony","date":1471674469457,"synopsis":"In music, harmony is the use of simultaneous pitches (tones, notes), or chords - [https://en.wikipedia.org/wiki/Harmony wikipedia]"},{"slug":"health-spending","title":"Health Spending","date":1471703520961,"synopsis":"The US stands out as an outlier: the US spends far more on health than any other country, yet the life expectancy of the American population is not longer but actually shorter than in other countries that spend far less - [https://www.ineteconomics.org/ideas-papers/blog/the-link-between-health-spending-and-life-expectancy-the-us-is-an-outlier?p=ideas-papers%2Fblog%2Fthe-link-between-health-spending-and-life-expectancy-the-us-is-an-outlier ineteconomics.org]"},{"slug":"hearing-voices","title":"Hearing Voices","date":1471675480165,"synopsis":"Here we collect stories and experiences of people we have know that hear voices:"},{"slug":"helicopter-money","title":"Helicopter money","date":1466958284269,"synopsis":"Helicopter money has been proposed as an alternative to Quantitative Easing (QE) when interest rates are close to zero and the economy remains weak or enters recession - [https://en.wikipedia.org/wiki/Helicopter_money wikipedia]"},{"slug":"heterarchy","title":"Heterarchy","date":1446257664409,"synopsis":"A heterarchy is a system of organization where the elements of the organization are unranked (non-hierarchical) or where they possess the potential to be ranked a number of different ways."},{"slug":"high-frequency-trading","title":"High-frequency trading","date":1473071436711,"synopsis":"High-frequency trading (HFT) is a type of algorithmic trading characterized by high speeds, high turnover rates, and high order-to-trade ratios that leverages high-frequency financial data and electronic trading tools - [https://en.wikipedia.org/wiki/High-frequency_trading wikipedia]"},{"slug":"history-of-nomadism","title":"History of Nomadism","date":1425216444899,"synopsis":"Nomadism has an interesting and relevant history for todays [[Digital Nomads]]. [[Journeyman]] date back to medieval times, and are still common in Germany and France."},{"slug":"history-of-the-brain","title":"History of the Brain","date":1476359433992,"synopsis":"Dr Geoff Bunn's 10 part [[History of the Brain]] is a journey through 5000 years of our understanding of this complex organ in our heads. From Neolithic times to the present day, he reveals the contemporary beliefs about what the brain is for and how it fulfils its functions. - [http://www.bbc.co.uk/programmes/b016x234 bbc]"},{"slug":"holacracy","title":"Holacracy","date":1467883301158,"synopsis":"Holacracy is a specific social technology or system of organizational governance developed by HolacracyOne, LLC in which authority and decision-making are distributed throughout a holarchy of self-organizing teams rather than being vested in a management hierarchy. Holacracy has been adopted in for-profit and non-profit organizations in Australia, France, Germany, New Zealand, Switzerland, the United Kingdom, and the United States - [https://en.wikipedia.org/wiki/Holacracy wikipedia]"},{"slug":"holocene","title":"Holocene","date":1470899182590,"synopsis":"The Holocene (pronunciation: /ˈhɒləˌsiːn, ˈhoʊ-/) is the geological epoch that began after the Pleistocene at approximately 9,700 BCE and continues to the present. The term \"Recent\" (usually capitalised) has often been used as an exact synonym of \"Holocene\", although this usage is discouraged in 21st-century work. The Holocene is part of the Quaternary period. Its name comes from the Greek words ὅλος (holos, whole or entire) and καινός (kainos, new), meaning \"entirely recent\". It has been identified with the current warm period, known as MIS 1, and can b"},{"slug":"homelessness","title":"Homelessness","date":1457547333039,"synopsis":"Homelessness is the condition of people without a regular dwelling. People who are homeless are most often unable to acquire and maintain regular, safe, secure and adequate housing, or lack \"fixed, regular, and adequate night-time residence\" - [https://en.wikipedia.org/wiki/Homelessness wikipedia]"},{"slug":"homo-ludens","title":"Homo Ludens","date":1433607682435,"synopsis":"Homo Ludens or \"Man the Player\" is a book written in 1938 by Dutch historian and cultural theorist Johan Huizinga. It discusses the importance of the play element of culture and society. Huizinga suggests that play is primary to and a necessary (though not sufficient) condition of the generation of culture - [https://en.wikipedia.org/wiki/Homo_Ludens#IV._Play_and_law wikipedia]"},{"slug":"housing-first","title":"Housing First","date":1457451210600,"synopsis":"Housing First is a project based on the belief that the factors that make a person homeless can be better addressed once they have a home - [http://www.huffingtonpost.ca/2015/08/13/housing-first-federal-election_n_7949510.html huffingtonpost.ca]"},{"slug":"how-beer-saved-the-world","title":"How Beer Saved the World","date":1492278481342,"synopsis":"Did you know that Beer was critical to the birth of civilization? That?s right - Beer. Scientists and historians line up to tell the amazing, untold story of how beer helped create maths, poetry, Pyramids, modern medicine, labor laws and America."},{"slug":"humans-and-pair-bonding","title":"Humans and pair bonding","date":1468065794451,"synopsis":"Humans can experience some or all of the above-mentioned varieties of pair bonds in their lifetime.  These bonds can be: temporary or last a lifetime, same-sex or cross-gender, and same age or with different age groups."},{"slug":"humans-prefer-robot-bosses","title":"Humans Prefer Robot Bosses","date":1498643357221,"synopsis":"Surprisingly people like to be told what to do by robots."},{"slug":"humberto-maturana","title":"Humberto Maturana","date":1431533110819,"synopsis":"Humberto Maturana is a Chilean biologist and philosopher. Many consider him a member of a group of second-order [[Cybernetics]] theoreticians such as Heinz von Foerster, Gordon Pask, Herbert Brün and Ernst von Glasersfeld."},{"slug":"hundred-county-division","title":"Hundred (county division)","date":1424357165898,"synopsis":"A hundred is a geographic division formerly used in England, Wales, South Australia, and some parts of the United States, to divide a larger region into smaller administrative divisions; similar divisions were made in Denmark, Southern Schleswig, Sweden, Finland, Estonia and Norway - [https://en.wikipedia.org/wiki/Hundred_%28county_division%29 Wikipedia]."},{"slug":"hundred-court","title":"Hundred Court","date":1424357209073,"synopsis":"The role of the [[Hundred Court]] was described in the [[Dooms]] (laws) of [[King Edgar]]. Over time, the principal functions of the hundred became the administration of law and the keeping of the peace - [https://en.wikipedia.org/wiki/Hundred_%28county_division%29#Hundred_courts Wikipedia]."},{"slug":"hundred-eolder","title":"Hundred Eolder","date":1424356491332,"synopsis":"The Hundredman or Hundred Eolder was responsible for justice and supplying military troops, as well as leading its forces. The office was not hereditary, but by the 10th century the office holder was selected from among a few outstanding families."},{"slug":"i-am-the-machine","title":"I Am The Machine","date":1471522455386,"synopsis":"Here we gather some media and stories about man and machine."},{"slug":"i-dont-have-to-answer-that","title":"I Don't Have To Answer That","date":1469021495451,"synopsis":"This is a fascinating and important podcast about the relationship of truth, trust, character, and sexuality in relation to political leadership."},{"slug":"i-havent-been-myself-lately","title":"I haven't been myself lately","date":1474187659838,"synopsis":"Robert Sapolsky, a Neuroscience Professor at Stanford University, relates how porous the boundary can be between two distinct selves, and how maybe this is a perfectly healthy phenomenon. Read more: Robert Sapolsky's The Trouble with Testosterone: And Other Essays On The Biology Of The Human Predicament - [http://www.radiolab.org/story/91499-i-havent-been-myself-lately/?utm_source=sharedUrl&utm_medium=metatag&utm_campaign=sharedUrl radiolab.org]"},{"slug":"icelandic-alingi","title":"Icelandic Al√æingi","date":1424353866196,"synopsis":"The Al√æingi (anglicised as Althing or Althingi) is the national parliament (literally: \"[the] all-thing\", or general assembly) of Iceland - [https://en.wikipedia.org/wiki/Thing_%28assembly%29 Wikipedia]."},{"slug":"idea-fracking","title":"Idea Fracking","date":1419386354567,"synopsis":""},{"slug":"idea-mine","title":"Idea Mine","date":1470128746487,"synopsis":"[[Idea mining]] is a process in which we extract out of a text, video, or other piece of media an important or (from our own personal perspective) an interesting concept."},{"slug":"idea-mining","title":"Idea Mining","date":1470128895116,"synopsis":"Idea mining is a process in which we extract out of a text, video, or other piece of media an important or (from our own personal perspective) an interesting concept."},{"slug":"if-voting-changed-anything","title":"If Voting Changed Anything","date":1466767825847,"synopsis":"Does voting change anything? Can it? Should it?"},{"slug":"if-you-fall-in-love-with-a-machine","title":"If you fall in love with a machine","date":1426963845920,"synopsis":"\"If you fall in love with a machine there is something wrong with your love life.\" (Lewis Mumford [[Art and Technics]] 81)"},{"slug":"incentives-of-war","title":"Incentives Of War","date":1491732968529,"synopsis":"Here we look at some innovations and factors in how war and soldiers are incentivised."},{"slug":"incentivising-sharing","title":"Incentivising Sharing","date":1496664301700,"synopsis":"Here we explore our current publishing structures and how these can be modified to incentivise sharing."},{"slug":"incremental-caging","title":"Incremental Caging","date":1419290701371,"synopsis":"In [[The Human Reprsentation of Thought]] Bret Victor points out technological incrementalism's problem -- it finds certain \"veins of human capability\" and drills further and further into those, leaving the \"rest of the landscape untouched\":"},{"slug":"inequality","title":"Inequality","date":1433397957804,"synopsis":"Four times as much public money goes to the wealthiest 20% of Americans in mortgage-interest deductions than is spend on social housing for the poorest fifth."},{"slug":"inner-voices","title":"Inner Voices","date":1471675192600,"synopsis":"How the voices in our heads shape us, for better and for worse - [http://www.radiolab.org/story/301401-inner-voices/?utm_source=sharedUrl&utm_medium=metatag&utm_campaign=sharedUrl radiolab.org]"},{"slug":"institute-of-art--ideas","title":"Institute of Art & Ideas","date":1506805874757,"synopsis":"<video src=\"http://iai.tv/assets/videos/linked/HTLGI2015_85_AftertheEndofTruthHD.mp4\" width=100% controls></video>"},{"slug":"integrated-information-theory","title":"Integrated information theory","date":1466449483054,"synopsis":"Integrated information theory (IIT) attempts to explain what consciousness is and why it might be associated with certain physical systems  - [https://en.wikipedia.org/wiki/Integrated_information_theory wikipedia]"},{"slug":"international-consortium-of-investigative-journalists","title":"International Consortium of Investigative Journalists","date":1469733033978,"synopsis":"The International Consortium of Investigative Journalists (ICIJ) is a Washington-based international network launched in 1997 by the Center for Public Integrity which includes 165 investigative journalists in over 65 countries who work together on \"issues such as \"cross-border crime, corruption, and the accountability of power.\" For over twenty five years the ICIJ has exposed smuggling and tax evasion by multinational tobacco companies (2000), \"by organized crime syndicates; investigated private military cartels, asbestos companies, and climate change lo"},{"slug":"internet-of-people","title":"Internet of People","date":1507904749609,"synopsis":"Our goal with this initiative is to create a compelling counter-narrative to Silicon Valley’s surveillance capitalism. To that end, we are drafting a progressive technology policy aimed at achieving three key objectives:"},{"slug":"interplay-of-institutions","title":"Interplay of Institutions","date":1453379154176,"synopsis":"The irrationality of the interplay of institutions is a phrase I irst heard mentioned by [[Leo Findeisen]] at [[#32c3]] (see the clip below):"},{"slug":"inventing-particles","title":"Inventing Particles","date":1472394059437,"synopsis":"Here we explore how easy it is to invent a particle to explain experimental results."},{"slug":"irrational-number","title":"Irrational number","date":1470052900944,"synopsis":"In mathematics, an irrational number is a real number that cannot be expressed as a ratio of integers, i.e. as a fraction. Therefore, irrational numbers, when written as decimal numbers, do not terminate, nor do they repeat. For example, the number π starts with 3.14159265359, but no finite number of digits can represent it exactly and it does not end in a segment that repeats itself infinitely often. The same can be said for any irrational number - [https://en.wikipedia.org/wiki/Irrational_number wikipedia]"},{"slug":"irrational-numbers","title":"Irrational Numbers","date":1470053545764,"synopsis":"Here we imagine a thought experiment in which the human understanding of number in physics and mathematics was completely different - where we could easily and clearly think in precise mathematical terms about systems and emergent properties, but had almost no ability to count and manipulate the things we currently apply numbers to."},{"slug":"is-faireness-a-bug","title":"Is Faireness A Bug?","date":1466350289488,"synopsis":"The title may not make sense, but it's catchy. Here we look at the issue od [[Decidability]] and human action - which may be a better title."},{"slug":"is-technology-killing-capitalism","title":"Is Technology Killing Capitalism?","date":1471703158329,"synopsis":"In this broad ranging interview INET Senior Economist Pia Malaney sits down with Eric Weinstein - mathematician, economist, Managing Director of Thiel Capital (as well as her co-author and husband) to discuss these and other issues."},{"slug":"issue-based-information-system","title":"Issue-Based Information System","date":1470316025725,"synopsis":"Issue-Based Information System or IBIS for short, is a [[Structured Conversation Platform]] with its roots in [[Urban Planning]]."},{"slug":"jacques-lacan","title":"Jacques Lacan","date":1467803304705,"synopsis":"Jacques Marie Émile Lacan (/ləˈkɑːn/; French: [ʒak lakɑ̃]; 13 April 1901 – 9 September 1981), known simply as Jacques Lacan, was a French psychoanalyst and psychiatrist who has been called \"the most controversial psycho-analyst since Freud\". Giving yearly seminars in Paris from 1953 to 1981, Lacan influenced many leading French intellectuals in the 1960s and the 1970s, especially those associated with post-structuralism. His ideas had a significant impact on post-structuralism, critical theory, linguistics, 20th-century French philosophy, film theory and"},{"slug":"jane-mcgonigal","title":"Jane McGonigal","date":1519638193784,"synopsis":"Jane McGonigal (born October 21, 1977) is an American game designer and author who advocates the use of mobile and digital technology to channel positive attitudes and collaboration in a real world context - [https://en.wikipedia.org/wiki/Jane_McGonigal wikipedia]"},{"slug":"jeremy-corbyn","title":"Jeremy Corbyn","date":1469021895658,"synopsis":"Jeremy Bernard Corbyn (/ˈkɔːrbɪn/; born 26 May 1949) is a British politician who is the Leader of the Labour Party and Leader of the Opposition. He has been the Member of Parliament (MP) for Islington North since 1983 and was elected Labour Leader in 2015. Ideologically, he identifies as a democratic socialist - [https://en.wikipedia.org/wiki/Jeremy_Corbyn wikipedia]"},{"slug":"jevons-paradox","title":"Jevons Paradox","date":1433529879020,"synopsis":"In economics, the Jevons paradox occurs when technological progress increases the efficiency with which a resource is used (reducing the amount necessary for any one use), but the rate of consumption of that resource rises because of increasing demand - [https://en.wikipedia.org/wiki/Jevons_paradox wikipedia]"},{"slug":"johan-gielis","title":"Johan Gielis","date":1470909645432,"synopsis":"The superformula is a generalization of the superellipse and was proposed by Johan Gielis around 2000. Gielis suggested that the formula can be used to describe many complex shapes and curves that are found in nature. Gielis holds a patent related to the synthesis of patterns generated by the superformula - [https://en.wikipedia.org/wiki/Superformula wikipedia]"},{"slug":"joker","title":"Joker","date":1429368344072,"synopsis":"Joker/Jester/Facilitator/Difficultator"},{"slug":"jos-carlos-maritegui","title":"José Carlos Mariátegui","date":1489760046980,"synopsis":"José Carlos Mariátegui La Chira (14 June 1894 – 16 April 1930) was a Peruvian journalist, political philosopher, and activist. A prolific writer before his early death at age 35, he is considered one of the most influential Latin American socialists of the 20th century - [https://en.wikipedia.org/wiki/Jos%C3%A9_Carlos_Mari%C3%A1tegui wikipedia]"},{"slug":"journeyman","title":"Journeyman","date":1425429794470,"synopsis":"A journeyman (Wandergeselle in German), is an individual who has completed an apprenticeship and is fully educated in a trade or craft, but not yet a master - [https://en.wikipedia.org/wiki/Journeyman wikipedia]"},{"slug":"jurisdiction","title":"Jurisdiction","date":1471262284442,"synopsis":"Why do we even need states? What's a state. How do we run a country [[Without a King?]] Another great podcast from [[Radiolab]] featuring a bizarre [[Supreme Court]] case concerning the International [[Chemical Weapons Treaty]]."},{"slug":"karl-popper","title":"Karl Popper","date":1469276327353,"synopsis":"Sir Karl Raimund Popper CH FBA FRS (28 July 1902 – 17 September 1994) was an Austrian-British philosopher and professor. He is generally regarded as one of the greatest philosophers of science of the 20th century - [https://en.wikipedia.org/wiki/Karl_Popper wikipedia]"},{"slug":"kaschenism","title":"Kaschenism","date":1498197024300,"synopsis":"Also, Kaschenists, who appeared earlier than the well-known \"padonki\" subculture, contributed much to padonkaffsky jargon, and many of the early \"padonki\" were former Kaschenists."},{"slug":"kashchenism","title":"Kashchenism","date":1498196994700,"synopsis":"Kaschenism is a specific style of conversation in forums, blogs, Fido echos, etc. used by some people in Russian FidoNet and Internet. Its main feature is provocativeness and mockery while being formally polite."},{"slug":"kenya-national-archives","title":"Kenya National Archives","date":1468653952670,"synopsis":"Kenya National Archives and Documentation Services (KNADS) is situated at the edge of the central business district in downtown Nairobi along Moi Avenue next to Ambassadeur Hotel - [https://en.wikipedia.org/wiki/Kenya_National_Archives wikipedia]"},{"slug":"kikuyu-people","title":"Kikuyu people","date":1468654360718,"synopsis":"The Kikuyu are the largest ethnic group in Kenya. They speak the Bantu Kikuyu language as a mother tongue. The term Kikuyu is the Swahili form of the native pronunciation Gĩkũyũ. Group members refer to themselves as the Agĩkũyũ,Nyúmba ya múmbi. Gĩkũyũ literally means a huge sycamore tree and Agĩkũyũ thus literally refers to the children of the huge sycamore - [https://en.wikipedia.org/wiki/Kikuyu_people wikipedia]"},{"slug":"klaus-lackner","title":"Klaus Lackner","date":1477149488741,"synopsis":"Klaus S. Lackner is the director of the Center for Negative Carbon Emissions (CNCE) and a professor in School of Sustainable Engineering and the Built Environment at Arizona State University."},{"slug":"knowledge-transfer","title":"Knowledge Transfer","date":1426165044157,"synopsis":"How do pieces of knowledge find each other? How can we make it easier for scientists and policy makers to sport new areas of scientific exploration, or interdiciplinary research?"},{"slug":"koch-brothers","title":"Koch Brothers","date":1498547362799,"synopsis":"See [[Koch family]]."},{"slug":"koch-family","title":"Koch family","date":1498547305336,"synopsis":"The Koch family ( KOKE) is an American family engaged in business, most noted for their political activities and control of Koch Industries, the second-largest privately owned company in the United States (with 2013 revenues of $115 billion). The family business was started by Fred C. Koch, who developed a new cracking method for the refinement of heavy crude oil into gasoline. Fred's four sons litigated against each other over their interests in the business during the 1980s and 1990s - [https://en.wikipedia.org/wiki/Koch_family wikipedia]"},{"slug":"landsgemeinde","title":"Landsgemeinde","date":1424360951027,"synopsis":"The Landsgemeinde or \"cantonal assembly\" is one of the oldest forms of [[Direct Democracy]].  Formerly practised in eight [[Cantons of Switzerland]], for practical reasons, the Landsgemeinde has been abolished in all but two [https://en.wikipedia.org/wiki/Landsgemeinde Wikipedia]."},{"slug":"latitude","title":"Latitude","date":1466697574433,"synopsis":"In geography, latitude (φ) is a geographic coordinate that specifies the north–south position of a point on the Earth's surface - [https://en.wikipedia.org/wiki/Latitude wikipedia]"},{"slug":"law-and-artificial-intelligence","title":"Law and artificial intelligence","date":1469882943192,"synopsis":"Clive Anderson ask how our legal system will cope in a fast-approaching world of autonomous cars, care-bots and other machines using artificial intelligence to make judgments normally made by humans. - [http://www.bbc.co.uk/programmes/b04wwgz9 bbc]"},{"slug":"law-and-order-and-the-use-of-violence","title":"Law and order and the use of violence","date":1468059488027,"synopsis":"Different anarcho-capitalists propose different forms of anarcho-capitalism, and one area of disagreement is in the area of law. Morris and Linda Tannehill, in ''[[The Market for Liberty]]'', object to any statutory ([[statute]]) law whatsoever. They argue that all one has to do is ask if one is aggressing against another (see [[tort]] and contract law) in order to decide if an act is right or wrong. However, Rothbard, while also supporting a natural prohibition on force and fraud, supports the establishment of a mutually agreed-upon centralized libertar"},{"slug":"laws-of-form","title":"Laws of Form","date":1428657134155,"synopsis":"Laws of Form is a book by G. Spencer-Brown, published in 1969, that straddles the boundary between mathematics and philosophy - [https://en.wikipedia.org/wiki/Laws_of_Form wikipedia]"},{"slug":"lawspeaker","title":"Lawspeaker","date":1424358698083,"synopsis":"A lawspeaker is a unique Scandinavian legal office. It has its basis in a common Germanic oral tradition, where wise men were asked to recite the law, but it was only in Scandinavia that the function evolved into an office. Two of the most famous lawspeakers are Snorri Sturluson and √ûorgn√Ωr the Lawspeaker."},{"slug":"legal-knowledge-interchange-format","title":"Legal Knowledge Interchange Format","date":1470316101530,"synopsis":"The Legal Knowledge Interchange Format (LKIF), developed in the European ESTRELLA project,[http://www.estrellaproject.org/ Estrella project website] is an XML schema for rules and arguments, designed with the goal of becoming a standard for representing and interchanging policy, legislation and cases, including their justificatory arguments, in the legal domain. LKIF builds on and uses the [[Web Ontology Language]] (OWL) for representing concepts and includes a reusable basic ontology of legal concepts - [https://en.wikipedia.org/wiki/Argument_map#legal_"},{"slug":"legislative-theatre","title":"Legislative Theatre","date":1429365294847,"synopsis":"Legislative Theatre is an extension of Augusto Boal's [[Forum Theatre]] techniques and functions to determine the need for, create, and enact laws. Beyond community building and issue awareness. Legislative Theatre uses theatrical techniques to create concrete and specific socio-political impact."},{"slug":"les-glaneurs-et-la-glaneuse","title":"Les Glaneurs et la Glaneuse","date":1427369837725,"synopsis":"Les glaneurs et la glaneuse (2000), translated literally as \"the gleaners and the female gleaner\", is a French documentary film by Agn√®s Varda that features various kinds of gleaning. It is a great example of the beauty, \"waste\" and social disregard of human potential."},{"slug":"lev-vygotsky","title":"Lev Vygotsky","date":1471674974870,"synopsis":"Lev Semyonovich Vygotsky (November 17 1896 – June 11, 1934) was a Soviet psychologist, the founder of a theory of human cultural and bio-social development commonly referred to as cultural-historical psychology, and leader of the Vygotsky Circle - [https://en.wikipedia.org/wiki/Lev_Vygotsky wikipedia]"},{"slug":"liberland","title":"Liberland","date":1466328144606,"synopsis":"Liberland, officially the Free Republic of Liberland, is a self-proclaimed micronation claiming a parcel of disputed land on the western bank of the Danube river, between Croatia and Serbia. It was first proclaimed on 13 April 2015 by Czech libertarian politician and activist Vít Jedlička - [https://en.wikipedia.org/wiki/Liberland wikipedia]"},{"slug":"lifes-limit","title":"Life's Limit","date":1473163716295,"synopsis":"Until Leonard Hayflick came along, everyone thought cells were immortal. That they'd divide over and over again, forever."},{"slug":"limun","title":"LIMUN","date":1427320374571,"synopsis":"The London International [[Model United Nations]] (LIMUN) is a charitable organization, that hosts an annual three-day Model United Nations conference in London, United Kingdom, since 2000 - [https://en.wikipedia.org/wiki/London_International_Model_United_Nations#Trustees.2C_Secretariat_and_Logistics_Staff wikipedia]"},{"slug":"linked-data","title":"Linked Data","date":1427500252554,"synopsis":"In computing, linked data (often capitalized as Linked Data) describes a method of publishing structured data so that it can be interlinked and become more useful through semantic queries - [https://en.wikipedia.org/wiki/Linked_data wikipedia]"},{"slug":"liquid-democracy","title":"Liquid Democracy","date":1492511188010,"synopsis":"Liquid Democracy is a combination of [[Direct Democracy]], and [[Representative Democracy]]. It aims to create a more flexible and fluid way for people to express their [[Democratic Preference]]."},{"slug":"liquid-desire","title":"Liquid Desire","date":1494458860211,"synopsis":"I'm not sure where I first heard this phrase, but it comes out of the [[Complementary Currency]] field. It's an answer to the question of what meaning or value money captures in society or the individual."},{"slug":"list-of-undecidable-problems","title":"List of undecidable problems","date":1466347862920,"synopsis":"In computability theory, an undecidable problem is a type of computational problem that requires a yes/no answer, but where there cannot possibly be any computer program that always gives the correct answer; that is any possible program would sometimes give the wrong answer or run forever without giving any answer. More formally, an undecidable problem is a problem whose language is not a recursive set; see decidability. There are uncountably many undecidable problems, so the list below is necessarily incomplete. Though undecidable languages are not recu"},{"slug":"live-the-story","title":"Live the Story","date":1420950244043,"synopsis":"I learned a few things [[Becoming an Activist]] that I relate here in the form of patterns. I elaborate on one or two from each section."},{"slug":"long-thin-house","title":"Long Thin House","synopsis":". . . for a very small house or office the pattern of <span>[[Positive Outdoor Space]]</span> is almost automatically solved - no one would imagine that the house should be more than 25 feet wide. But in such a house or office there are strong reasons to make the building even longer and thinner still. This pattern was originally formulated by Christie Coffin."},{"slug":"longitude","title":"Longitude","date":1466697628575,"synopsis":"Longitude, is a geographic coordinate that specifies the east-west position of a point on the Earth's surface - [https://en.wikipedia.org/wiki/Longitude wikipedia]"},{"slug":"love-dart","title":"Love dart","date":1468065406376,"synopsis":"A love dart (also known as a gypsobelum) is a sharp, calcareous or chitinous dart which some hermaphroditic land snails and slugs create. Love darts are made in sexually mature animals only, and are used as part of the sequence of events during courtship, before actual mating takes place. Darts are quite large compared to the size of the animal: in the case of the semi-slug genus Parmarion, the length of a dart can be up to one fifth that of the semi-slug's foot - [https://en.wikipedia.org/wiki/Love_dart wikipedia]"},{"slug":"ludwig-wittgenstein","title":"Ludwig Wittgenstein","date":1470126301298,"synopsis":"Ludwig Josef Johann Wittgenstein ]; 26 April 1889 – 29 April 1951) was an Austrian-British philosopher who worked primarily in logic, the philosophy of mathematics, the philosophy of mind, and the philosophy of language - [https://en.wikipedia.org/wiki/Ludwig_wittgenstein wikipedia]"},{"slug":"magical-realism","title":"Magical Realism","date":1430551151147,"synopsis":"There is way of magic that is both ancient and new. It's newness lies in the application of technology to law, but this is not new, this is as old as story telling."},{"slug":"mao","title":"Mao","date":1431599635795,"synopsis":"[[Mao]] is a card game of the shedding family, in which the aim is to get rid of all of the cards in hand without breaking certain unspoken rules - [https://en.wikipedia.org/wiki/Mao_%28card_game%29 wikipedia]"},{"slug":"mass-shooting-correlations","title":"Mass Shooting Correlations","date":1444149433860,"synopsis":"Gun ownership in a given state is associated with more mass killings and suicides."},{"slug":"master-craftsman","title":"Master Craftsman","date":1431090616567,"synopsis":"A page with 1 items."},{"slug":"master-of-the-universe","title":"Master of the Universe","date":1473070935375,"synopsis":"Lene Vestergaard Hau has found a way to harness the one thing we all thought -- by its very nature -- was unbeatable - [http://www.radiolab.org/story/267126-master-universe/?utm_source=sharedUrl&utm_medium=metatag&utm_campaign=sharedUrl radiolab.org]"},{"slug":"material-semiotic-method","title":"Material-semiotic Method","date":1425160999422,"synopsis":"This means that it maps relations that are simultaneously material (between things) and semiotic (between concepts). It assumes that many relations are both material and semiotic - [https://en.wikipedia.org/wiki/Actor%E2%80%93network_theory#A_material-semiotic_method wikipedia]."},{"slug":"mau-mau","title":"Mau Mau","date":1468655556732,"synopsis":"This is the story of a few documents that tumbled out ofthe secret archives of the biggest empire the world has ever known, offering a glimpse of histories waiting to be rewritten - [http://www.radiolab.org/story/mau-mau/?utm_source=sharedUrl&utm_medium=metatag&utm_campaign=sharedUrl radiolab.org]"},{"slug":"mau-mau-uprising","title":"Mau Mau Uprising","date":1468656592320,"synopsis":"The Mau Mau Uprising, also known as the Mau Mau Rebellion, Mau Mau Revolt, or Kenya Emergency, was a military conflict that took place in British Kenya between 1952 and 1960. It involved [[Kikuyu people]] -dominated groups summarily called Mau Mau, the white settlers, and elements of the British Army, including local Kenya Regiment, mostly consisting of the British, auxiliaries, and anti-Mau Mau Gĩkũyũ - [https://en.wikipedia.org/wiki/Mau_Mau_Uprising wikipedia]"},{"slug":"maven-index","title":"Maven Index","date":1426175911553,"synopsis":"A [[Maven Index]] is a reputation metric derived from the success of an individual in knowledgeably assessing the quality of other peoples scientific work."},{"slug":"medicare-united-states","title":"Medicare (United States)","date":1469536922083,"synopsis":"In the United States, Medicare is a national social insurance program, administered by the U.S. federal government since 1966, currently using about 30 private insurance companies across the United States. Medicare provides health insurance for Americans aged 65 and older who have worked and paid into the system. It also provides health insurance to younger people with disabilities, end stage renal disease and amyotrophic lateral sclerosis - [https://en.wikipedia.org/wiki/Medicare_(United_States) wikipedia]"},{"slug":"medieval-institutions","title":"Medieval Institutions","date":1470907462169,"synopsis":"Here we look at what is arguably the greatest problem and threat to the future of humanity, as best expressed by the father of [[sociobiology]] [[E O Wilson]]"},{"slug":"meme","title":"Meme","date":1470128771828,"synopsis":"A meme is \"an idea, behaviour, or style that spreads from person to person within a culture\". A meme acts as a unit for carrying cultural ideas, symbols, or practices that can be transmitted from one mind to another through writing, speech, gestures, rituals, or other imitable phenomena with a mimicked theme - [https://en.wikipedia.org/wiki/Meme wikipedia]"},{"slug":"memetic-writing","title":"Memetic Writing","date":1470994186794,"synopsis":"How do you write differently to capture an idea in a way that it can travel, move, and recombine with other ideas? Here we look at what elements we might combine and technically how we might structure this \"writing\"."},{"slug":"merkle-tree","title":"Merkle tree","date":1470994630082,"synopsis":"In cryptography and computer science, a hash tree or Merkle tree is a tree in which every non-leaf node is labelled with the hash of the labels or values (in case of leaves) of its child nodes. Hash trees allow efficient and secure verification of the contents of large data structures. Hash trees are a generalization of hash lists and hash chains - [https://en.wikipedia.org/wiki/Merkle_Tree wikipedia]"},{"slug":"metastability","title":"Metastability","date":1469643364130,"synopsis":"Metastability denotes the phenomenon when a system spends an extended time in a configuration other than the system's state of least energy. During a metastable state of finite lifetime all state-describing parameters reach and hold stationary values. While in isolation: - [https://en.wikipedia.org/wiki/Metastability wikipedia]"},{"slug":"michael-j-sandel","title":"Michael J. Sandel","date":1468080064566,"synopsis":"<div style='padding: 12px; background:#eee; width:96%; align=centered;'>"},{"slug":"michael-sandel","title":"Michael Sandel","date":1468086006660,"synopsis":"Michael J. Sandel (born March 5, 1953) is an American political philosopher and a professor at Harvard University. He is best known for the Harvard course \"Justice\" and for his critique of John Rawls' A Theory of Justice in his first book, Liberalism and the Limits of Justice (1982) - [https://en.wikipedia.org/wiki/Michael_J._Sandel wikipedia]"},{"slug":"michel-foucault","title":"Michel Foucault","date":1491136472429,"synopsis":"Michel Foucault (October 1926 – 25 June 1984) was a French philosopher, historian of ideas, social theorist, philologist and literary critic  - [https://en.wikipedia.org/wiki/Michel_Foucault wikipedia]"},{"slug":"michelangelo","title":"Michelangelo","date":1476357215274,"synopsis":"Michelangelo di Lodovico Buonarroti Simoni (Italian: [mikeˈlandʒelo ˈdi lodoˈviko buonaˈrɔti siˈmɔni]; 6 March 1475 – 18 February 1564) was an Italian sculptor, painter, architect, and poet of the High Renaissance who exerted an unparalleled influence on the development of Western art. Considered to be the greatest living artist during his lifetime, he has since also been described as one of the greatest artists of all time. Despite making few forays beyond the arts, his versatility in the disciplines he took up was of such a high order that he is often "},{"slug":"micro-grants","title":"Micro-Grants","date":1427781657371,"synopsis":"Micro-Grants help to fund incremental projects"},{"slug":"micronation","title":"Micronation","date":1466328224211,"synopsis":"A micronation, sometimes referred to as a model country or new country project, is an entity that claims to be an independent nation or state but is not officially recognized by world governments or major international organizations - [https://en.wikipedia.org/wiki/Micronations wikipedia]"},{"slug":"military-venture-capital","title":"Military Venture Capital","date":1428599598062,"synopsis":"A great talk, and a great story about military involvement in the long term finance of [[Silicon Valley]]."},{"slug":"million-dollar-microsecond","title":"Million Dollar Microsecond","date":1473071461949,"synopsis":"A high frequency trader might do about 1,000 trades a minute as of 2015. In the 1990's the average time it took to execute a trade was about 11 seconds. Jad visits the inhumanly fast world of modern-day, high-speed trading with NPR's David Kestenbaum - [http://www.radiolab.org/story/267195-million-dollar-microsecond/?utm_source=sharedUrl&utm_medium=metatag&utm_campaign=sharedUrl radiolab.org]"},{"slug":"mitochondria","title":"Mitochondria","date":1467975461224,"synopsis":"The [[mitochondrion]] (plural mitochondria) is a double membrane-bound organelle found in all eukaryotic organisms, although some cells in some organisms may lack them (e.g. Red blood cells) - [https://en.wikipedia.org/wiki/Mitochondrion wikipedia]"},{"slug":"mitochondrion","title":"Mitochondrion","date":1467975302491,"synopsis":"The mitochondrion (plural [[Mitochondria]]) is a double membrane-bound organelle found in all eukaryotic organisms, although some cells in some organisms may lack them (e.g. Red blood cells). A number of organisms have reduced or transformed their mitochondria into other structures. To date, only one eukaryote is known to have completely lost its mitochondria. The word mitochondrion comes from the Greek μίτος, mitos, i.e. \"thread\", and χονδρίον—, chondrion, i.e. \"granule\" or \"grain-like\" - [https://en.wikipedia.org/wiki/Mitochondrion wikipedia]"},{"slug":"mmir","title":"Mímir","date":1468595194062,"synopsis":"Mímir (Old Norse \"The rememberer, the wise one\") or Mim is a wisdom deity in Norse mythology. He is closely associated with a magical well of knowledge that bears his name, the Mímisbrunnr. At the conclusion of the Æsir-Vanir War he was sent to the Vanir along with the god Hœnir as part of a peaceful hostage exchange. Fearing trickery from the Aesir because of Hœnir's foolishness, the Vanir beheaded Mímir and returned his head to Asgard. In order to keep Mímir's wisdom, Odin preserved his head with magic so it could continue to provide knowledge and coun"},{"slug":"model-united-nations","title":"Model United Nations","date":1427320283383,"synopsis":"Model United Nations, also known as Model UN or MUN, is an educational simulation in which students learn about [[Diplomacy]], [[International Relations]], and the [[United Nations]]."},{"slug":"monad-functional-programming","title":"Monad (functional programming)","date":1466358703317,"synopsis":"In functional programming, a monad is a structure that represents computations defined as sequences of steps: a type with a monad structure defines what it means to chain operations, or nest functions of that type together. This allows the programmer to build pipelines that process data in a series of steps (also called actions), in which each action is decorated with additional processing rules provided by the monad - [https://en.wikipedia.org/wiki/Monad_(functional_programming) wikipedia]"},{"slug":"moral-agents-club","title":"Moral Agent's Club","date":1449471711499,"synopsis":"Daniel Dennett acknowledges determinism but this alone does not prevent moral agents from assembling in a club with rules and punishments for their violations."},{"slug":"morality","title":"Morality","date":1498657495711,"synopsis":"Morality (from the Latin moralitas \"manner, character, proper behavior\") is the differentiation of intentions, decisions, and actions between those that are distinguished as proper and those that are improper - [https://en.wikipedia.org/wiki/Morality wikipedia]"},{"slug":"most-suicides-are-impulsive","title":"Most Suicides Are Impulsive","date":1442858035464,"synopsis":"The great myth of suicide is that it represents a bottom reached after months of inexorable decline, and that a person who fails to commit suicide on one occasion would later succeed on another. In reality, while there are underlying factors, most suicides are impulsive, and if means are not available the urge will pass. [http://www.vox.com/2015/7/30/9068255/suicide-impulsive-gun-control post]"},{"slug":"mush","title":"MUSH","date":1431599537301,"synopsis":"In multiplayer online games, a [[MUSH]] (often expanded as Multi-User Shared Hallucination) is a text-based online social medium to which multiple users are connected at the same time - [https://en.wikipedia.org/wiki/MUSH wikipedia]"},{"slug":"my-neighbourhood","title":"My Neighbourhood","date":1427155634882,"synopsis":"This is a list of sites of relevant to [[LiveCode]]. You may also be interested in [[David's Sites]] or [[Technology Sites]] for related catalogues:"},{"slug":"narrative-chart","title":"Narrative Chart","date":1427227600069,"synopsis":"The narrative chart is an attempt at providing an alternative view of how a page has evolved within the federation. While it is still a work in progress, an early version is available but there are no automatic links yet."},{"slug":"nash-equilibrium","title":"Nash Equilibrium","date":1433584150688,"synopsis":"In game theory, the Nash equilibrium is a solution concept of a non-cooperative game involving two or more players, in which each player is assumed to know the equilibrium strategies of the other players, and no player has anything to gain by changing only their own strategy - [http://en.wikipedia.org/wiki/Nash_equilibrium wikipedia]"},{"slug":"natural-doors-and-windows","title":"Natural Doors And Windows","synopsis":". . . imagine that you are now standing in the built-up frame of a partly constructed building, with the columns and beams in place - <span>[[Box Columns]]</span>, <span>[[Perimeter Beams]]</span>. You know roughly where you want doors and windows from <span>[[Zen View]]</span>, <span>[[Street Windows]]</span>, <span>[[Window Place]]</span>, <span>[[Windows Overlooking Life]]</span>, <span>[[Corner Doors]]</span>. Now you can settle on the exact positions of the frames."},{"slug":"negative-income-tax","title":"Negative income tax","date":1466959310762,"synopsis":"In economics, a negative income tax (NIT) is a progressive income tax system where people earning below a certain amount receive supplemental pay from the government instead of paying taxes to the government. Such a system has been discussed by economists but never fully implemented. It was developed by British politician Juliet Rhys-Williams in the 1940s and later by United States free-market economist Milton Friedman - [https://en.wikipedia.org/wiki/Negative_income_tax wikipedia]"},{"slug":"nietzsche","title":"Nietzsche","date":1490049505731,"synopsis":"Friedrich Wilhelm Nietzsche was a German philosopher, cultural critic, poet, composer, and Latin and Greek scholar."},{"slug":"no-robots-were-harmed-in-the-making-of-this-video","title":"No robots were harmed in the making of this video","date":1427379103427,"synopsis":"In Science Fiction, a robot is often a machine that looks like a human or other animate being and can do what they do. When the fiction preceded the technology, there was often a human being inside the dalek."},{"slug":"nomic","title":"Nomic","date":1431587628829,"synopsis":"Nomic is a game created in 1982 by philosopher Peter Suber in which the rules of the game include mechanisms for the players to change those rules, usually beginning through a system of democratic voting - [https://en.wikipedia.org/wiki/Nomic wikipedia]"},{"slug":"nomic-games","title":"Nomic Games","date":1433282935856,"synopsis":"There are a set of games in which a major part of the game-play involves the ability of players to change the rules. Here we collect examples of these games that we can learn from, and propose new ones."},{"slug":"of-coffeehouses-and-salons","title":"Of coffeehouses and salons","date":1425176841212,"synopsis":"This wee think piece (ward, note, page, scribble - note to self need a term that stands for all possible names in a FedWiki) was prompted by Mike's thoughts on the Fri/Sat hangout. It struck me and I tried to capture a bit of it in [[reflections on a friday saturday hangout]] but thought it needed a bit more elaboration."},{"slug":"on-the-genealogy-of-morality","title":"On The Genealogy of Morality","date":1490049422602,"synopsis":"Melvyn Bragg and guests discuss [[Nietzsche]]'s [[On The Genealogy of Morality]] - A Polemic, which he published in 1887 towards the end of his working life and in which he considered the price humans have paid, and were still paying, to become civilised."},{"slug":"ontology","title":"Ontology","date":1470996407446,"synopsis":"Ontology is the philosophical study of the nature of being, becoming, existence or reality as well as the basic categories of being and their relations - [https://en.wikipedia.org/wiki/Ontology wikipedia]"},{"slug":"ontology-v-stigmergy","title":"Ontology v. Stigmergy","date":1500383124929,"synopsis":"By day I struggle to bring order to increasing complex and disorganized information while on nights and weekends I let [[Collaborative Link]]s do this work for me."},{"slug":"open-science","title":"Open Science","date":1426176245613,"synopsis":"Open science is the movement to make scientific research, data and dissemination accessible to all levels of an inquiring society, amateur or professional."},{"slug":"open-simulation-archive","title":"Open Simulation Archive","date":1426181466857,"synopsis":"[[Open Simulation Archive]] is an open archive of 3D science models and simulations. This ‚Äúbiomedical 3D warehouse‚Äù would be the science equivalent to Google Warehouse."},{"slug":"organisational-structures","title":"Organisational Structures","date":1426608041987,"synopsis":"Here we document a range of organisational structure - [[Design Patterns]] for organisations."},{"slug":"origin-of-speech","title":"Origin of speech","date":1471596634965,"synopsis":"The origin of speech in Homo sapiens is a widely debated and controversial topic. The problems relate to humans' unprecedented use of the tongue, lips and vocal organs as instruments of communication. Other animals vocalise, but do not use the tongue to modulate sounds - [https://en.wikipedia.org/wiki/Origin_of_speech wikipedia]"},{"slug":"pages-as-public-spaces","title":"Pages as Public Spaces","date":1475589338018,"synopsis":"What I'm trying to do here is to create a rhetorical situation what will help writers get themselves organized and help them create content that can be better built on than we've seen before. The idea of Pages as Public Spaces may or may not work."},{"slug":"pair-bond","title":"Pair bond","date":1468065574787,"synopsis":"In biology, a pair bond is the strong affinity that develops in some species between a pair consisting of a male and female, or in some cases as a same-sex pairing, potentially leading to producing offspring and/or a lifelong bond. Pair-bonding is a term coined in the 1940s that is frequently used in sociobiology and evolutionary biology circles. The term often implies either a lifelong socially monogamous relationship or a stage of mating interaction in socially monogamous species. It is sometimes used in reference to human relationships - [https://en.w"},{"slug":"paleofuture","title":"Paleofuture","date":1425744889976,"synopsis":"Paleofuture (the history of the future) is a term that Matt Novak uses to descibe the visions of the future from the past - [http://paleofuture.gizmodo.com gizmodo.com]"},{"slug":"paleontology","title":"Paleontology","date":1470899146384,"synopsis":"Paleontology or palaeontology is the scientific study of life that existed prior to, and sometimes including, the start of the [[Holocene]] Epoch (roughly 11,700 years before present) - [https://en.wikipedia.org/wiki/Paleontology wikipedia]"},{"slug":"panama-papers","title":"Panama Papers","date":1469734888972,"synopsis":"The Panama Papers are 11.5 million leaked documents that detail financial and attorney–client information for more than 214,488 offshore entities. The leaked documents were created by Panamanian law firm and corporate service provider Mossack Fonseca; some date back to the 1970s - [https://en.wikipedia.org/wiki/Panama_Papers wikipedia]"},{"slug":"panopticon","title":"Panopticon","date":1491144752811,"synopsis":"The Panopticon is a type of institutional building designed by the English philosopher and social theorist Jeremy Bentham in the late 18th century - [https://en.wikipedia.org/wiki/Panopticon wikipedia]"},{"slug":"paparazzi","title":"Paparazzi","date":1469021766084,"synopsis":"Paparazzi (US /pɑːpəˈrɑːtsi/, UK /pæpəˈrætsi/; Italian: [papaˈrattsi]; singular: masculine paparazzo [papaˈrattso] or feminine paparazza [papaˈrattsa]) are independent photographers who take pictures of athletes, entertainers, politicians, and other celebrities, typically while going about their usual life routines - [https://en.wikipedia.org/wiki/Paparazzi wikipedia]"},{"slug":"paper-thoughts","title":"Paper Thoughts","date":1473610958870,"synopsis":"Bret Victor is interviewed by John Pavlus, and discusses why computers have failed to live up to their potential. At the core, the problem is that we continue to follow outmoded print paradigms that hinder our ability to thrive in a digital age. [https://medium.com/re-form/the-utopian-ui-architect-34dead42a28 article]"},{"slug":"parallel-thinking","title":"Parallel thinking","date":1469534587471,"synopsis":"Parallel thinking is a term coined and implemented by Edward de Bono. Parallel thinking is described as a constructive alternative to \"adversarial thinking\", debate and in general the approach the GG3 (Greek gang of three) has been known to advocate. In general parallel thinking is a further development of the well known lateral thinking processes, focusing even more on explorations—looking for what can be rather than for what is - [https://en.wikipedia.org/wiki/Parallel_thinking wikipedia]"},{"slug":"parallel-worlds","title":"Parallel Worlds","date":1429361191947,"synopsis":"See [[Creation of Many Worlds]]"},{"slug":"parasites","title":"Parasites","date":1469612902033,"synopsis":"Tales of lethargic farmers, zombie cockroaches, and even mind-controlled humans (kinda, maybe) - [http://www.radiolab.org/story/91689-parasites/?utm_source=sharedUrl&utm_medium=metatag&utm_campaign=sharedUrl radiolab.org]"},{"slug":"parasitic-conference","title":"Parasitic Conference","date":1470926700767,"synopsis":"A parasitic conference is a conference that takes place, feeds off, and is dependent on an existing conference. It is in a sense a popup conference that can take place at informal venues, or be structured as part of an existing conference in which participants discuss the topics and themes taking place in the host conference."},{"slug":"parasitism","title":"Parasitism","date":1469609951737,"synopsis":"In biology/ecology, parasitism is a non-mutual symbiotic relationship between species, where one species, the parasite, benefits at the expense of the other, the host. Traditionally parasite (in biological usage) referred primarily to organisms visible to the naked eye, or macroparasites (such as helminths). Parasites can be microparasites, which are typically smaller, such as protozoa, viruses, and bacteria. Examples of parasites include the plants mistletoe and cuscuta, and animals such as hookworms - [https://en.wikipedia.org/wiki/Parasitism wikipedia"},{"slug":"parliament-of-things","title":"Parliament of Things","date":1492507269988,"synopsis":"[[Bruno Latour]] is the philosopher behind the title of this wiki. On this wiki we [[Idea Mine]] a range of disciplines around the notion that science, law, media and politics can be remixed in new and potentially fruitful ways."},{"slug":"paul-clarke","title":"Paul Clarke","date":1471674419846,"synopsis":"Paul has a 15-year background in public service information, having worked in most of the large government departments and across local authorities on technology and business change programmes."},{"slug":"paxos","title":"Paxos","date":1466347007579,"synopsis":"Here we write about [[Paxos (computer science)]] and not the lovely Greek Island - although there is a connection (see below)."},{"slug":"peer-review-scam","title":"Peer Review Scam","date":1417546629857,"synopsis":"Nature News: Publishing: The peer-review scam."},{"slug":"peoples-quantitative-easing","title":"People's Quantitative Easing","date":1466959225486,"synopsis":"People's Quantitative Easing (PQE) was a policy announced by Jeremy Corbyn during the 2015 Labour leadership election which would require the Bank of England to create money to finance government investment. It attracted much media coverage, with some calling it \"economically illiterate\", while others defended the policy - [https://en.wikipedia.org/wiki/People's_quantitative_easing wikipedia]"},{"slug":"performance","title":"Performance","date":1429359737601,"synopsis":"Building Utopia project uses performance from both: artistic and social science perspective. The aspect of performing [[Utopia Legislation]] borrowing from [[Augusto Boal]]'s [[Legislative Theatre]]."},{"slug":"personality","title":"Personality","date":1474271687977,"synopsis":"Personality is a set of individual differences that are affected by the development of an individual: values, attitudes, personal memories, social relationships, habits, and skills. Different personality theorists present their own definitions of the word based on their theoretical positions - [https://en.wikipedia.org/wiki/Personality wikipedia]"},{"slug":"peter-taylor-on-snowden","title":"Peter Taylor on Snowden","date":1470179456109,"synopsis":"An Interview with Edward Snowden by 30 year veteran reporter Peter Taylor. The Documentary. [http://www.bbc.co.uk/programmes/p034nm9l bbc]"},{"slug":"philosophy-of-science","title":"Philosophy of science","date":1471007463477,"synopsis":"Philosophy of science is a branch of philosophy concerned with the foundations, methods, and implications of science. The central questions of this study concern what qualifies as science, the reliability of scientific theories, and the ultimate purpose of science. This discipline overlaps with metaphysics, ontology, and epistemology, for example, when it explores the relationship between science and truth - [https://en.wikipedia.org/wiki/Philosophy_of_science wikipedia]"},{"slug":"plasma","title":"Plasma","date":1476370296006,"synopsis":"On the grand scale, plasma is what the Sun is made from and, when we look into the night sky, almost everything we can see with the naked eye is made of plasma."},{"slug":"platos-republic","title":"Plato's Republic","date":1429272822225,"synopsis":"Was he serious?  That this was a Utopia?  No creatives - no change allowed, because everything is already perfection.  That seems to me to be an absolutely essential mistake.  The whole essence of things human is that we NEVER achieve perfection.  Our best efforts must embrace the possibility of change."},{"slug":"podcast-transport","title":"Podcast Transport","date":1498167658160,"synopsis":"# Podcast Transport"},{"slug":"political-conversation","title":"Political Conversation","date":1468079445124,"synopsis":"How to turn the political conversation around"},{"slug":"political-ecology","title":"Political Ecology","date":1425157624816,"synopsis":"Political ecology is the study of the relationships between political, economic and social factors with environmental issues and changes. Political ecology differs from apolitical ecological studies by politicizing environmental issues and phenomena - [https://en.wikipedia.org/wiki/Political_ecology Wikipedia]."},{"slug":"political-fedwiki-sites","title":"Political Fedwiki Sites","date":1429208635437,"synopsis":"Here we list people and sites that have an interest in politics and group decision making, and write using Fedwiki:"},{"slug":"political-freedom","title":"Political freedom","date":1469280261619,"synopsis":"Political freedom (also known as a political autonomy or political agency) is a central concept in history and political thought and one of the most important features of democratic societies. It was described as freedom from oppression or coercion, the absence of disabling conditions for an individual and the fulfillment of enabling conditions, or the absence of life conditions of compulsion, e.g. economic compulsion, in a society. Although political freedom is often interpreted negatively as the freedom from unreasonable external constraints on action,"},{"slug":"politics--psychoanalysis","title":"Politics & Psychoanalysis","date":1469282156624,"synopsis":"Melvyn Bragg and guests discuss the impact of politics on psychoanalysis. The 20th century saw the birth and rise of psychoanalysis. Sigmund Freud led people to think about how the mind functioned and how our behaviour might be understood through the process of working with a psychoanalyst, either one-to-one or in a group."},{"slug":"politics-of-nature","title":"Politics of Nature","date":1425155310369,"synopsis":"Politics of Nature: How to Bring the Sciences Into Democracy - is an influential book by the French theorist and philosopher of science [[Bruno Latour]] - [https://en.wikipedia.org/wiki/Politics_of_Nature Wikipedia]."},{"slug":"politics-of-the-common-good","title":"Politics of the Common Good","date":1468086026094,"synopsis":"Professor [[Michael Sandel]] makes the case for a moral and civic renewal in democratic politics. Recorded at George Washington University in Washington DC, he calls for a new politics of the common good and says that we need to think of ourselves as citizens, not just consumers."},{"slug":"pop-up-community","title":"Pop-Up Community","date":1475589379316,"synopsis":"We consider the fastest way to get a wiki community going over local wifi and then leave them with something they can share. We anticipate zero-conf, ipfs, electron and thumb drives as enabling technology."},{"slug":"poparazzi","title":"poparazzi","date":1469018922987,"synopsis":"This is a fascinating and important podcast about the relationship of truth, trust, character, and sexuality in relation to political leadership."},{"slug":"positive-outdoor-space","title":"Positive Outdoor Space","date":1428599290836,"synopsis":". . . in making <span>[[South Facing Outdoors]]</span> you must both choose the place to build, and also choose the place for the outdoors. You cannot shape the one without the other. This pattern gives you the geometric character of the outdoors; the next one <span>[[Wings Oflight]]</span> - gives you the complementary shape of the indoors."},{"slug":"post-democracy","title":"Post-Democracy","date":1421824635173,"synopsis":"[http://markcarrigan.net/2015/01/11/what-will-post-democracy-look-like/ Interesting post by Mark Carrigan] that mirrors a couple of recent conversations I've had on similar topics e.g. the illusion of democratic functions when money buys the ability to set the agenda."},{"slug":"power-of-fork","title":"Power of Fork","date":1429360730084,"synopsis":"In software engineering, a project fork happens when developers take a copy of source code from one software package and start independent development on it, creating a distinct and separate piece of software. The term often implies not merely a development branch, but a split in the developer community, a form of schism."},{"slug":"prague-spring","title":"Prague Spring","date":1467739765797,"synopsis":"The Prague Spring was a period of political liberalization in Czechoslovakia during the era of its domination by the Soviet Union after World War II. It began on 5 January 1968, when reformist Alexander Dubček was elected First Secretary of the Communist Party of Czechoslovakia (KSČ), and continued until 21 August when the Soviet Union and other members of the Warsaw Pact invaded the country to halt the reforms - [https://en.wikipedia.org/wiki/Prague_Spring wikipedia]"},{"slug":"prejudice","title":"Prejudice","date":1497779185530,"synopsis":"Here we begin to collect podcasts, stories and science about prejudice."},{"slug":"prime-meridian","title":"Prime Meridian","date":1466697685912,"synopsis":"A prime meridian is a meridian (a line of [[longitude]]) in a geographical coordinate system at which longitude is defined to be 0° - [https://en.wikipedia.org/wiki/Prime_Meridian wikipedia]"},{"slug":"principality-of-hutt-river","title":"Principality of Hutt River","date":1466328168515,"synopsis":"The Principality of Hutt River, previously known as the Hutt River Province, is the oldest micronation in Australia. The principality claims to be an independent sovereign state and to have achieved legal status on 21 April 1970, although it remains unrecognised by Australia and other nations. The principality is located 517 km (354 mi) north of Perth, near the town of Northampton in the state of Western Australia. If considered independent, it is an enclave of Australia. It is a regional tourist attraction - [https://en.wikipedia.org/wiki/Principality_o"},{"slug":"principality-of-sealand","title":"Principality of Sealand","date":1466328045569,"synopsis":"The Principality of Sealand is an unrecognised micronation that claims Roughs Tower, an offshore platform located in the North Sea approximately 12 kilometres (7.5 mi) off the coast of Suffolk, England, as its territory. Roughs Tower is a disused Maunsell Sea Fort, originally called HM Fort Roughs, built as an anti-aircraft defensive gun platform by the British during World War II - [https://en.wikipedia.org/wiki/Principality_of_sealand wikipedia]"},{"slug":"principality-of-seborga","title":"Principality of Seborga","date":1466328119315,"synopsis":"The Principality of Seborga is a micronation or a fantasy state, that claims a 14 km2 stretch of area located in the northwestern Italian Province of Imperia in Liguria, near the French border; and about 35 km (23 mi) from Monaco. The principality is in coexistence with, and claims the territory of, the town of Seborga - [https://en.wikipedia.org/wiki/Principality_of_seborga wikipedia]"},{"slug":"prisoners-dilemma","title":"Prisoner's dilemma","date":1471595378848,"synopsis":"The prisoner's dilemma is a standard example of a game analyzed in game theory that shows why two completely \"rational\" individuals might not cooperate, even if it appears that it is in their best interests to do so - [https://en.wikipedia.org/wiki/Prisoner%27s_dilemma wikipedia]"},{"slug":"private-language-argument","title":"Private language argument","date":1470129093481,"synopsis":"The private language argument is a philosophical argument introduced by [[Ludwig Wittgenstein]] in his later work, especially in the Philosophical Investigations. The argument was central to philosophical discussion in the second half of the 20th century, and continues to arouse interest. The argument is supposed to show that the idea of a language understandable by only a single individual is incoherent - [https://en.wikipedia.org/wiki/Private_language_argument wikipedia]"},{"slug":"procedural-generation","title":"Procedural generation","date":1472805793013,"synopsis":"In computing, procedural generation is a method of creating data algorithmically as opposed to manually. In computer graphics it is also called random generation and is commonly used to create textures and 3D models - [https://en.wikipedia.org/wiki/Procedural_generation wikipedia]"},{"slug":"profiling-voters","title":"Profiling Voters","date":1494181189082,"synopsis":"Psychologist Michal Kosinski developed a method to analyze people in minute detail based on their Facebook activity. Did a similar tool help propel Donald Trump to victory? Two reporters from Zurich-based Das Magazin went data-gathering. [http://motherboard.vice.com/read/big-data-cambridge-analytica-brexit-trump post]"},{"slug":"progressive-agenda-for-europe","title":"Progressive Agenda for Europe","date":1507904252284,"synopsis":"[[DiEM25]] will develop common whitepapers for seven pillars:"},{"slug":"project-cybersyn","title":"Project Cybersyn","date":1501440819937,"synopsis":"Project Cybersyn was a Chilean project from 1971–1973 during the presidency of Salvador Allende aimed at constructing a distributed decision support system to aid in the management of the national economy. The project consisted of four modules: an economic simulator, custom software to check factory performance, an operations room, and a national network of telex machines that were linked to one mainframe computer - [https://en.wikipedia.org/wiki/Project_Cybersyn wikipedia]"},{"slug":"project-hieroglyph","title":"Project Hieroglyph","date":1454867643703,"synopsis":"Project from ASU that pairs science fiction writers with ASU thinkers to imagine positive futures. [link](http://hieroglyph.asu.edu/)"},{"slug":"proof-of-god","title":"Proof Of God","date":1472394280100,"synopsis":"Here we look at a strange type of theory that I've been mulling over for a number of years that looks poetically at [[Cosmology]], the [[Big Bang]]. the [[Anthropic Principle]] and the [[Philosophy of Science]]."},{"slug":"property-law","title":"Property law","date":1459267146625,"synopsis":"Property law is the area of law that governs the various forms of ownership and tenancy in real property (land as distinct from personal or movable possessions) and in personal property, within the common law legal system. In the civil law system, there is a division between movable and immovable property. Movable property roughly corresponds to personal property, while immovable property corresponds to real estate or real property, and the associated rights and obligations thereon - [https://en.wikipedia.org/wiki/Property_law wikipedia]"},{"slug":"pseudonymity","title":"Pseudonymity","date":1467102784609,"synopsis":"Pseudonymity, a word derived from pseudonym, meaning 'false name', is a state of disguised identity."},{"slug":"pseudonymous","title":"Pseudonymous","date":1467102800803,"synopsis":"Pseudonymity, a word derived from pseudonym, meaning 'false name', is a state of disguised identity."},{"slug":"pubic-happening","title":"Pubic Happening","date":1470235863828,"synopsis":"A public [[Happening]] is an event that takes place in a public venue, theatre, café, Hackspace, conference or social venue. It is designed to be of value to a public audience that may observe or otherwise take part in the event."},{"slug":"public-good","title":"Public good","date":1473756543919,"synopsis":"In economics, a public good is a good that is both non-excludable and non-rivalrous."},{"slug":"publics","title":"Publics","date":1475589393828,"synopsis":"The starting point is Michale Warner, \"Publics and Counterpublics, [http://castillocorrales.fr/wp-content/uploads/2013/03/Michael-Warner-Publics-Short.pdf pdf]."},{"slug":"publics-considered","title":"Publics Considered","date":1475589420949,"synopsis":"Publics are self-organized spaces organized by discourse.  They are impersonal, and an organization of strangers. What holds a public together is that it is addressed as a public. That is, what constitutes a public is attention.  It's where discourse circulates, and is circulated by.  It's made of links.  Publics come and go: they are located. And a public calls into existence the world it exists in."},{"slug":"publishing-thought","title":"Publishing Thought","date":1476360293672,"synopsis":"We have many ways to publish thought, but how best should this be done? Here we look at the history and future of publishing as an [[Evolutionary Language]] of thought."},{"slug":"pythagorean-comma","title":"Pythagorean comma","date":1469783685974,"synopsis":"In musical tuning, the Pythagorean comma (or ditonic comma), named after the ancient mathematician and philosopher Pythagoras, is the small interval (or comma) existing in Pythagorean tuning between two enharmonically equivalent notes such as C and B♯ ( Play ), or D♭ and C♯. It is equal to the frequency ratio 531441:524288, or approximately 23.46 cents, roughly a quarter of a semitone (in between 75:74 and 74:73). The comma which musical temperaments often refer to tempering is the Pythagorean comma - [https://en.wikipedia.org/wiki/Pythagorean_comma wiki"},{"slug":"radical-discourse","title":"Radical Discourse","date":1433874897718,"synopsis":"What we might have given up in [[Rethinking ThreadMode]] and [[Rethinking DocumentMode]] we regain in Radical Discourse. The idea is that when dissertation pages are linked up, constellated, we create the larger, multi-voiced discourse."},{"slug":"radio","title":"Radio","date":1494458381637,"synopsis":"In the context of working politically together, most thought has been in the space of writing or [[Collaborative Writing]]. Here we look at the politics of sound and radio."},{"slug":"radio-lab","title":"Radio Lab","date":1498139001430,"synopsis":"A page with 1 items."},{"slug":"radiolab","title":"Radiolab","date":1467963358321,"synopsis":"Radiolab is a radio program produced by WNYC, a public radio station in New York City, and broadcast on public radio stations in the United States. The show is nationally syndicated and is available as a podcast. In 2008, Radiolab began offering live shows - [https://en.wikipedia.org/wiki/Radiolab wikipedia]"},{"slug":"real-space","title":"Real Space","date":1426103510027,"synopsis":"Real Space is community space that real people feel comfortable in. It is not pretentious, it is not simply for entertainment, but nor is it dull and worthy."},{"slug":"reassembling-the-social","title":"Reassembling the Social","date":1428897070999,"synopsis":"Latour, Bruno. Reassembling the Social: An Introduction to [[Actor-Network Theory]]. Oxford University Press. 2007."},{"slug":"recent-thoughts","title":"Recent Thoughts","date":1434653560123,"synopsis":"Here we jot down quick thoughts that ay or may not go anywhere:"},{"slug":"red-planet","title":"Red Planet","date":1490377074222,"synopsis":"As we dream of sending humans to Mars, the psychological problems of a mission loom large. As part of Radio 4's Mars season."},{"slug":"red-terror","title":"Red Terror","date":1459272783745,"synopsis":"The Red Terror was a campaign of mass killings, torture, and systematic oppression conducted by the Bolsheviks after they seized power in Petrograd and Moscow in 1917. Soviet historiography describes the Red Terror as having been officially announced in September 1918 by Yakov Sverdlov and ending about October 1918. However, the term was frequently applied to political repression during the whole period of the Russian Civil War of 1918–1922. The Cheka (the Bolshevik secret police) conducted the mass repressions. Estimates for the total number of people k"},{"slug":"redefining-liquid-democracy","title":"Redefining Liquid Democracy","date":1492511522735,"synopsis":"I am not sure what sort of definition in practice the existing projects, platforms and theoreticians have for [[Liquid Democracy]]. What we aim to do here is to explore these by going back to the roots, and seeing how the core ideas of Liquid Democracy interface with everyday practice, and other equally compelling [[New Forms Of Democracy]]."},{"slug":"rhizome","title":"Rhizome","date":1459268027893,"synopsis":"Rhizome is a philosophical concept developed by Gilles Deleuze and Félix Guattari. It is what Deleuze calls an \"image of thought\", based on the botanical rhizome, that apprehends multiplicities - [https://en.wikipedia.org/wiki/Rhizome_%28philosophy%29 wikipedia]"},{"slug":"ricardo-semler","title":"Ricardo Semler","date":1427110835320,"synopsis":"Ricardo Semler (born 1959 in S√£o Paulo) is the CEO and majority owner of Semco Partners, a Brazilian company best known for its radical form of industrial democracy and corporate re-engineering - [https://en.wikipedia.org/wiki/Ricardo_Semler wikipedia]"},{"slug":"richard-dawkins","title":"Richard Dawkins","date":1470128820025,"synopsis":"Richard Dawkins (born 26 March 1941) is an English ethologist, evolutionary biologist and author. He is an emeritus fellow of New College, Oxford, and was the University of Oxford's Professor for Public Understanding of Science from 1995 until 2008 - [https://en.wikipedia.org/wiki/Richard_Dawkins wikipedia]"},{"slug":"richard-feynman","title":"Richard Feynman","date":1470125234916,"synopsis":"Richard Phillips Feynman (/ˈfaɪnmən/; May 11, 1918 – February 15, 1988) was an American theoretical physicist known for his work in the path integral formulation of quantum mechanics, the theory of quantum electrodynamics, and the physics of the superfluidity of supercooled liquid helium, as well as in particle physics for which he proposed the parton model. For his contributions to the development of quantum electrodynamics, Feynman, jointly with Julian Schwinger and Sin-Itiro Tomonaga, received the Nobel Prize in Physics in 1965 - [https://en.wikipedia"},{"slug":"rippin-the-rainbow-a-new-one","title":"Rippin' the Rainbow a New One","date":1472801222368,"synopsis":"Radiolab rips the rainbow a new one - [http://www.radiolab.org/story/211178-rip-rainbow/?utm_source=sharedUrl&utm_medium=metatag&utm_campaign=sharedUrl radiolab.org]"},{"slug":"rising-suicides","title":"Rising Suicides","date":1441980738055,"synopsis":"Suicides have surpassed traffic fatalities as a cause of accidental death in the U.S. While some of this is due to falling traffic fatalities, the prime driver is the steady climb of suicide since 2000. [http://www.governing.com/topics/health-human-services/gov-suicide-deaths-spike-in-rural-western-states.html html]"},{"slug":"robert-bork","title":"Robert Bork","date":1469881956348,"synopsis":"Robert Heron Bork (March 1, 1927 – December 19, 2012) was an American legal scholar who advocated the judicial philosophy of originalism. Bork served as a Yale Law School professor, Solicitor General, Acting Attorney General, and a judge of the United States Court of Appeals for the District of Columbia Circuit - [https://en.wikipedia.org/wiki/Robert_Bork wikipedia]"},{"slug":"robot","title":"Robot","date":1498643362078,"synopsis":"A robot (also called a droid) is a machine —especially one programmable by a computer— capable of carrying out a complex series of actions automatically. Robots can be guided by an external control device or the control may be embedded within. Robots may be constructed to take on human form but most robots are machines designed to perform a task with no regard to how they look - [https://en.wikipedia.org/wiki/Robot wikipedia]"},{"slug":"roof-layout","title":"Roof Layout","synopsis":". . . assume now that you have a rough plan, to scale, for each floor of the building. In this case you already know roughly how the roofs will go, from <span>[[Cascade Of Roofs]]</span> and <span>[[Sheltering Roof]]</span>; and you know exactly where the roof is flat to form roof gardens next to rooms at different floors - <span>[[Roof Garden]]</span>. This pattern shows you how to get a detailed roof plan for the building, which helps those patterns come to life, for any plan which you have drawn."},{"slug":"royal-society","title":"Royal Society","date":1470904961948,"synopsis":"The President, Council, and Fellows of the Royal Society of London for Improving Natural Knowledge, commonly known as the Royal Society, is a learned society for science and is possibly the oldest such society still in existence - [https://en.wikipedia.org/wiki/Royal_Society wikipedia]"},{"slug":"rules-in-use","title":"Rules-in-Use","date":1448075879813,"synopsis":"We'll need some terms and definitions to help with the discussion of governance."},{"slug":"science-and-technology","title":"Science and technology","date":1460754479190,"synopsis":"No section text, so add your own here.. - [https://en.wikipedia.org/wiki/Singularity#Science_and_technology wikipedia]"},{"slug":"science-commons","title":"Science Commons","date":1426180105078,"synopsis":"Science Commons (SC) was a Creative Commons project for designing strategies and tools for faster, more efficient web-enabled scientific research."},{"slug":"science-in-public","title":"Science in Public","date":1426179525793,"synopsis":"How, how much, and why science should be conducted in public. Notes from the Mozilla open Science Call can be found here [https://etherpad.mozilla.org/sciencelab-calls-mar12-2015 etherpad]"},{"slug":"scientific-corruption","title":"Scientific corruption","date":1473163876303,"synopsis":"There are many forms of scientific corruption. Here we look at not simply conventional financial or legal corruption, but institutional forms that distort the scientific process."},{"slug":"scientific-errors","title":"Scientific Errors","date":1470236692067,"synopsis":"Here we look at errors in science and scientific publishing. Scientific institutions are just one more example of the [[Medieval Institutions]] that surround us."},{"slug":"scientific-institution","title":"Scientific Institution","date":1426181320533,"synopsis":"What sort of organisational structure is best suited to science? What type of organisational structure would we end up with if we applied rigorous scientific principles to the organisational basis of science?"},{"slug":"scitopia","title":"SciTopia","date":1426155463631,"synopsis":"[[SciTopia]] is a science project (originally proposed to the Welcome Trust in 2012), that looks to create a new form of [[Scientific Institution]], based on an analysis of the activities and practice of real world science."},{"slug":"scratch","title":"Scratch","date":1434708545230,"synopsis":"A page with 0 items."},{"slug":"semantic-network","title":"Semantic Network","date":1471727859207,"synopsis":"A semantic network is a graphic notation for representing knowledge in patterns of interconnected nodes and arcs. It is one way for knowledge visualization and presentation."},{"slug":"seneca-nebraska","title":"Seneca, Nebraska","date":1476357189041,"synopsis":"In 2014 the town of Seneca, Nebraska was so deeply divided that they weighed their own self-destruction - [http://www.radiolab.org/story/seneca-nebraska/?utm_source=sharedUrl&utm_medium=metatag&utm_campaign=sharedUrl radiolab.org]"},{"slug":"sensemaking","title":"Sensemaking","date":1470314303056,"synopsis":"Sensemaking is the process by which people give meaning to experience. While this process has been studied by other disciplines under other names for centuries, the term \"sensemaking\" has primarily marked three distinct but related research areas since the 1970s: Sensemaking was introduced to human–computer interaction by PARC researchers Russell, Stefik, Pirolli and Card in 1993, to information science by Brenda Dervin, and to organizational studies by Karl E. Weick - [https://en.wikipedia.org/wiki/Sensemaking wikipedia]"},{"slug":"sexual-selection","title":"Sexual selection","date":1468065456486,"synopsis":"Sexual selection is a mode of natural selection where members of one biological sex choose mates of the other sex to mate with (intersexual selection), and compete with members of the same sex for access to members of the opposite sex (intrasexual selection) - [https://en.wikipedia.org/wiki/Sexual_selection wikipedia]"},{"slug":"sheeple","title":"Sheeple","date":1493486310804,"synopsis":"Sheeple (a portmanteau of \"sheep\" and \"people\") is a derogatory term that highlights the passive herd behavior of people easily controlled by a governing power which likens them to sheep, a herd animal that is easily led about - [https://en.wikipedia.org/wiki/Sheeple wikipedia]"},{"slug":"sigmund-freud","title":"Sigmund Freud","date":1467803515823,"synopsis":"Sigmund Freud (6 May 1856 – 23 September 1939) was an Austrian neurologist and the founder of psychoanalysis, a clinical method for treating psychopathology through dialogue between a patient and a psychoanalyst - [https://en.wikipedia.org/wiki/Sigmund_Freud wikipedia]"},{"slug":"simply-power","title":"Simply Power","date":1466433772987,"synopsis":"In the dialog Sophist, written in 360 BC, [[Plato]] wrote:"},{"slug":"simulation","title":"Simulation","date":1498547010313,"synopsis":"Simulation is the imitation of the operation of a real-world process or system over time. The act of simulating something first requires that a model be developed; this model represents the key characteristics, behaviors and functions of the selected physical or abstract system or process. The model represents the system itself, whereas the simulation represents the operation of the system over time - [https://en.wikipedia.org/wiki/Simulation wikipedia]"},{"slug":"simultaneous-dramaturgy","title":"Simultaneous Dramaturgy","date":1429363192301,"synopsis":"Simultaneous Dramaturgy is the process the actors or audience members could stop a performance, often a short scene in which a character was being oppressed in some way. The audience would suggest different actions for the actors to carry out on-stage in an attempt to change the outcome of what they were seeing."},{"slug":"singularity","title":"Singularity","date":1460754448079,"synopsis":"Singularity or Singular points may refer to: - [https://en.wikipedia.org/wiki/Singularity wikipedia]"},{"slug":"sitesfedwikiorg","title":"sites.fed.wiki.org","date":1424469802554,"synopsis":"Catalog of federated wiki sites with domain names for page titles and brief descriptions tuned for search."},{"slug":"situationalists","title":"Situationalists","date":1433607678543,"synopsis":"The Situationist International was an international organization of social revolutionaries, the exclusive membership of which was made up of avant-garde artists, intellectuals, and political theorists, active from its formation in 1957 to its dissolution in 1972 - [https://en.wikipedia.org/wiki/Situationist_International wikipedia]"},{"slug":"situationist-international","title":"Situationist International","date":1471257804763,"synopsis":"The Situationist International (SI) was an international organization of social revolutionaries made up of avant-garde artists, intellectuals, and political theorists, prominent in Europe from its formation in 1957 to its dissolution in 1972 - [https://en.wikipedia.org/wiki/Situationist_International wikipedia]"},{"slug":"slow-hunch","title":"Slow Hunch","date":1427125725895,"synopsis":"In Good Ideas, Steven suggests:"},{"slug":"small-public-spaces","title":"Small public spaces","date":1427125381147,"synopsis":"William H Whyte's book, The Social Life of Small Urban Spaces, was a landmark study published in 1980 of the way people adapted to the built environment and [[Movable Furniture]] of small plazas in larger cities."},{"slug":"social-simulation","title":"Social Simulation","date":1429360086874,"synopsis":"Building Utopia is a social simulation in a sense that it simulates some of the processes of society as a complex system. So more precisely it is a representation of society as a symbolic system. Contrary to the Social Simulation as an academic field - Building Utopia is interdisciplinary and borrows elements of [[Systems Modelling]], Social Simulation, and uses [[Performance]] to replace [[Agent Based Simulation]]."},{"slug":"society-of-the-spectacle","title":"Society of the Spectacle","date":1471258188912,"synopsis":"The Society of the Spectacle was [[Guy Debord]]’s (1931–1994) best-known work, La société du spectacle (1967), is a polemical and prescient indictment of our image-saturated consumer culture."},{"slug":"sociobiology","title":"Sociobiology","date":1470898698209,"synopsis":"Sociobiology is a field of scientific study that is based on the hypothesis that social behavior has resulted from evolution and attempts to examine and explain social behavior within that context. It is a branch of biology that deals with social behavior, and also draws from ethology, anthropology, evolution, zoology, archaeology, population genetics, and other disciplines. Within the study of human societies, sociobiology is closely allied to the fields of Darwinian anthropology, human behavioral ecology and evolutionary psychology - [https://en.wikipe"},{"slug":"software-for-science","title":"Software for Science","date":1535190373857,"synopsis":"Redirect to [[Science Software]]"},{"slug":"sol-lewitt","title":"Sol LeWitt","date":1428692933588,"synopsis":"Solomon \"Sol\" LeWitt was an American artist linked to various movements, including Conceptual art and Minimalism - [https://en.wikipedia.org/wiki/Sol_LeWitt wikipedia]"},{"slug":"sovereign-state-of-forvik","title":"Sovereign State of Forvik","date":1466328200464,"synopsis":"The Sovereign State of Forvik, previously referred to as the Crown Dependency of Forvik, is an unrecognised micronation run by Stuart \"Captain Calamity\" Hill. It consists of the island of Forewick Holm - [https://en.wikipedia.org/wiki/Sovereign_state_of_forvik wikipedia]"},{"slug":"sovereignty","title":"Sovereignty","date":1467825183027,"synopsis":"Sovereignty is understood in jurisprudence as the full right and power of a governing body to govern itself without any interference from outside sources or bodies. In political theory, sovereignty is a substantive term designating supreme authority over some polity. It is a basic principle underlying the dominant Westphalian model of state foundation - [https://en.wikipedia.org/wiki/Sovereignty wikipedia]"},{"slug":"sovereignty-question","title":"Sovereignty Question","date":1471262365583,"synopsis":"# See also"},{"slug":"speech-acts","title":"Speech Acts","date":1467656854999,"synopsis":"Education, open-source culture, and structured collaboration in language. PyCon 2016 keynote by Lorena Barba highlights Winograd & Flores using github pull-requests as an example. [https://www.youtube.com/watch?v=ckW1xuGVpug&feature=youtu.be&t=35m11s video] [https://figshare.com/articles/PyCon2016_Keynote/3407779 slides]"},{"slug":"speed-of-light","title":"Speed of light","date":1473071796932,"synopsis":"The speed of light in vacuum, commonly denoted c, is a universal physical constant important in many areas of physics. Its exact value is 299,792,458 metres per second metres per second, since the length of the metre is defined from this constant and the international standard for time - [https://en.wikipedia.org/wiki/Speed_of_light wikipedia]"},{"slug":"squatting","title":"Squatting","date":1457450066533,"synopsis":"Squatting is the action of occupying an abandoned or unoccupied area of land–or a building, usually residential–that the squatter does not own, rent or otherwise have lawful permission to use - [https://en.wikipedia.org/wiki/Squatting wikipedia]"},{"slug":"stafford-beer","title":"Stafford Beer","date":1522559972524,"synopsis":"Stafford Beer (born Anthony Stafford Beer, 25 September 1926 – 23 August 2002) was a British theorist, consultant and professor at the Manchester Business School. He is best known for his work in the fields of operational research and management cybernetics - [https://en.wikipedia.org/wiki/Stafford_Beer wikipedia]"},{"slug":"stalin","title":"Stalin","date":1459272274176,"synopsis":"Joseph Stalin (/ˈstɑːlɪn/; birth surname: Jughashvili; 18 December 1878 – 5 March 1953) was the leader of the Soviet Union from the mid-1920s until his death in 1953. Holding the post of the General Secretary of the Central Committee of the Communist Party of the Soviet Union, he was effectively the dictator of the state - [https://en.wikipedia.org/wiki/Joseph_stalin wikipedia]"},{"slug":"stalin-before-the-revolution","title":"Stalin before the Revolution","date":1459273511053,"synopsis":"Joseph Stalin, leader of the Soviet Union in the mid-20th century, was born on 18 December 1878 to a Georgian cobbler in Gori, Georgia. After leaving school, he embraced Marxism and became an avid follower of Vladimir Lenin. After being marked by Russian secret police for his activities, he became a full-time revolutionary and outlaw. He became one of the Bolsheviks' chief operatives in the Caucasus, organizing paramilitaries, spreading propaganda, raising money through bank robberies, and kidnappings and extortion. He was captured and exiled to Siberia "},{"slug":"staph-retreat","title":"Staph Retreat","date":1468072752376,"synopsis":"In the war on devilish microbes, our weapons are starting to fail us.What if the only way forward is backward? - [http://www.radiolab.org/story/best-medicine/?utm_source=sharedUrl&utm_medium=metatag&utm_campaign=sharedUrl radiolab.org]"},{"slug":"steganography","title":"Steganography","date":1470671946136,"synopsis":"Steganography (US /ˌstɛ.ɡəˈnɔː.ɡrə.fi/, UK /ˌstɛɡ.əˈnɒɡ.rə.fi/) is the practice of concealing a file, message, image, or video within another file, message, image, or video. The word steganography combines the Greek words steganos (στεγανός), meaning \"covered, concealed, or protected\", and graphein (γράφειν) meaning \"writing\" - [https://en.wikipedia.org/wiki/Steganography wikipedia]"},{"slug":"stephen-hawking","title":"Stephen Hawking","date":1469882516835,"synopsis":"Stephen William Hawking, CH, CBE, FRS, FRSA (/ˈstiːvən ˈhɔːkɪŋ/; born 8 January 1942) is an English theoretical physicist, cosmologist, author and Director of Research at the Centre for Theoretical Cosmology within the University of Cambridge. His scientific works include a collaboration with Roger Penrose on gravitational singularity theorems in the framework of general relativity, and the theoretical prediction that black holes emit radiation, often called Hawking radiation. Hawking was the first to set forth a theory of cosmology explained by a union "},{"slug":"stranger","title":"Stranger","date":1429804125629,"synopsis":"[[Georg Simmel]] introduced the notion of \"the stranger\" as a unique sociological category. He differentiates the stranger both from the [[Outsider]] who has no specific relation to a group and from the [[Wanderer]] who comes today and leaves tomorrow."},{"slug":"structured-conversation-platform","title":"Structured Conversation Platform","date":1470314600155,"synopsis":"Examples of structured conversation platforms include [[Compendium]], [[Cohere]], [[Debategraph]],  [[TruthMapping]], [[Climate Collaboratorium]], and [[Argument Mapping]] and an emerging list of others."},{"slug":"suicide-belt","title":"Suicide Belt","date":1444155682657,"synopsis":"A spike of suicides concentrated around a set of western states has policy makers wondering whats going on. The area of concentration, which stretches from Idaho down through Utah to Arizona and New Mexico, has been dubbed the Suicide Belt. No single cause has been determined, although the reasons are likely to be related to the reasons driving [[Rising Suicides]] in the U.S. as a whole. [http://www.governing.com/topics/health-human-services/gov-suicide-deaths-spike-in-rural-western-states.html html]"},{"slug":"supreme-court","title":"Supreme Court","date":1491130684199,"synopsis":"A supreme court is the highest court within the hierarchy of many legal jurisdictions. Other descriptions for such courts include court of last resort, instance court, judgment court, apex court, and highest court of appeal. Broadly speaking, the decisions of a supreme court are not subject to further review by any other court. Supreme courts typically function primarily as appellate courts, hearing appeals from decisions of lower trial courts, or from intermediate-level appellate courts - [https://en.wikipedia.org/wiki/Supreme_court wikipedia]"},{"slug":"surveillance","title":"Surveillance","date":1468666182523,"synopsis":"Surveillance is the monitoring of the behavior, activities, or other changing information, usually of people for the purpose of influencing, managing, directing, or protecting them - [https://en.wikipedia.org/wiki/Surveillance wikipedia]"},{"slug":"swedish-suicide-myth","title":"Swedish Suicide Myth","date":1420243522403,"synopsis":"There is a myth that Sweden has a particularly high suicide rate. Sweden actually has a rate comparable to other Western countries, and high rates in the 1960s were likely the result of shoddy reporting. [http://nymag.com/scienceofus/2014/05/sweden-to-world-were-not-suicidal.html html]"},{"slug":"sybil","title":"Sybil","date":1457703985252,"synopsis":"Sybil is a 1973 book by Flora Rheta Schreiber about the treatment of Sybil Dorsett (a pseudonym for Shirley Ardell Mason) for [[Dissociative Identity Disorder]] (then referred to as multiple personality disorder) by her psychoanalyst, Cornelia B. Wilbur - [https://en.wikipedia.org/wiki/Sybil_(book) wikipedia]"},{"slug":"systems-modelling","title":"Systems Modelling","date":1429368873546,"synopsis":"Systems modeling or system modeling is the interdisciplinary study of the use of models to conceptualize and construct systems in business and IT development."},{"slug":"talking-to-the-enemy","title":"Talking To The Enemy","date":1470598328088,"synopsis":"Amaryllis Fox's secret life in the CIA taught her one lesson: Listen to your enemy. As she begins the process of having her CIA cover rolled back, this is the first time she has spoken publicly about working undercover."},{"slug":"talkoot","title":"Talkoot","date":1469024525459,"synopsis":"Talkoot is a Finnish expression for a gathering of friends and neighbours to accomplish a task. The word is borrowed into [[Finland Swedish]] as ''talko'', but is unknown to most Swedes, however, the same term and in approximately the same context is used in [[Estonia]], in Latvia and in Lithuania."},{"slug":"talschaft","title":"Talschaft","date":1424360897089,"synopsis":"In Swiss politics and the history of the Old Swiss Confederacy, a Talschaft is the body of voting population in a certain valley (as it were English dale-ship)."},{"slug":"techne","title":"Techne","date":1471702868325,"synopsis":"\"Techne\" is a term, etymologically derived from the Greek word τέχνη , that is often translated as \"craftsmanship\", \"craft\", or \"art\" - [https://en.wikipedia.org/wiki/Techne wikipedia]"},{"slug":"techne-as-an-art-in-rhetoric","title":"Techne as an art in rhetoric","date":1498657369713,"synopsis":"Techne is often used as a term to further define the process of rhetoric as an art of persuasion.  In his writing Toward a Sophistic Definition of Rhetoric, rhetoric scholar Dr. [[John Poulakos]] explains how the [[Sophist]]s believed rhetoric to be an art that aimed for terpis, or aesthetic pleasure, while maintaining a medium of [[logos]]."},{"slug":"technology-and-democracy","title":"Technology and Democracy","date":1471680672498,"synopsis":"Here we look at the issues, problems and potential of using technology to augment democratic practice."},{"slug":"teding","title":"Teding","date":1424357261238,"synopsis":"Teding is I beleive another word to \"Ding\" or [[Thing (assembly)]]."},{"slug":"tektology","title":"Tektology","date":1426007295055,"synopsis":"Tektology is regarded a precursor of system science. I'm proposing reusing this term for a new science of topographical representation of fluid, but stable complexes of thought."},{"slug":"tell-a-passing-stranger","title":"Tell A Passing Stranger","date":1427126900256,"synopsis":"This is a page about the function of passing strangers in carrying messages through networks. See also [[Journeyman]]:"},{"slug":"terms-of-reference","title":"Terms of Reference","date":1426083836510,"synopsis":"[[Terms of Reference]] describe the purpose and structure of a project, or collection of people who have agreed to work together to accomplish a shared goal."},{"slug":"the-appearance-of-wisdom","title":"The Appearance of Wisdom","date":1514732812737,"synopsis":"[[Plato]]'s Phaedrus is a book on the art of rhetoric.  In it Socrates argues that the invention of writing will be the death of memory:"},{"slug":"the-assemblage-of-play","title":"The Assemblage of Play","date":1428898443127,"synopsis":"Taylor, TL 2009, ‘The Assemblage of Play’, Games and Culture, vol. 4, no. 4, pp. 331-9."},{"slug":"the-beetle-in-a-box","title":"The Beetle in a box","date":1470126652610,"synopsis":"The Beetle in a Box is a famous thought experiment that Wittgenstein introduces in the context of his investigation of pains. - [https://en.wikipedia.org/wiki/Private_language_argument#The_Beetle_in_a_box wikipedia]"},{"slug":"the-buried-bodies-case","title":"The Buried Bodies Case","date":1469534468903,"synopsis":"How far should lawyersgo to provide thebest defense to the worst people? - [http://www.radiolab.org/story/the_buried_bodies_case/?utm_source=sharedUrl&utm_medium=metatag&utm_campaign=sharedUrl radiolab.org]"},{"slug":"the-company-of-strangers","title":"The Company of Strangers","date":1429800999495,"synopsis":"Paul Seabright's The Company of Strangers, is a study of the importance of trust in strangers in our everyday lives."},{"slug":"the-difference-engine","title":"The Difference Engine","date":1427975146610,"synopsis":"The Difference Engine (1990) is an alternate history novel by [[William Gibson]] and [[Bruce Sterling]]. It is widely regarded as a book that helped establish the genre conventions of [[Steampunk]] - [https://en.wikipedia.org/wiki/The_Difference_Engine wikipedia]"},{"slug":"the-fact-of-the-matter","title":"The Fact of the Matter","date":1471331689053,"synopsis":"Getting a firm hold on the truth is never as simple as nailing down the facts of a situation. This hour, we go after a series of seemingly simple facts -- facts that offer surprising insight, facts that inspire deeply different stories, and facts that, in the end, might not matter at all - [http://www.radiolab.org/story/239470-the-fact-of-the-matter/?utm_source=sharedUrl&utm_medium=metatag&utm_campaign=sharedUrl radiolab.org]"},{"slug":"the-fatal-conceit","title":"The Fatal Conceit","date":1498547310766,"synopsis":"The Fatal Conceit: The Errors of Socialism is a non-fiction book written by the economist and political philosopher [[Friedrich Hayek]] and edited by William Warren Bartley."},{"slug":"the-federation","title":"The Federation","date":1430937375368,"synopsis":"A page with 1 items."},{"slug":"the-free-rider-problem","title":"The Free Rider Problem","date":1452184383821,"synopsis":"Perhaps the first step toward solving the free rider problem is to accept that each of us is a free rider in some area. I may drive a dirtier car or have more kids or shop at stores that horribly exploit their workers, but maybe those things are offset by some others that improve the commons of whatever in some other way, like composting, walking on short trips, and volunteering to build homes for the poor."},{"slug":"the-ghost-in-the-machine","title":"The Ghost in the Machine","date":1467882951341,"synopsis":"The Ghost in the Machine is a 1967 book about philosophical psychology by Arthur Koestler. The title is a phrase (see ghost in the machine) coined by the Oxford philosopher Gilbert Ryle to describe the Cartesian dualist account of the mind–body relationship. Koestler shares with Ryle the view that the mind of a person is not an independent non-material entity, temporarily inhabiting and governing the body. One of the book's central concepts is that as the human brain evolved, it retained and built upon earlier, more primitive brain structures. The work a"},{"slug":"the-giant-bubble-thing","title":"The Giant Bubble Thing","date":1468828051823,"synopsis":"Before Dave Stein, soap bubbles were round, smallish, and collapsed with a pop. Now, they are anything but - [http://bubblething.com/ bubblething.com]"},{"slug":"the-gondolier","title":"The Gondolier","date":1497610540038,"synopsis":"What happens when doing what you want to do means giving up who you really are? - [http://www.radiolab.org/story/gondo/?utm_source=sharedUrl&utm_medium=metatag&utm_campaign=sharedUrl radiolab.org]"},{"slug":"the-humane-representation-of-thought","title":"The Humane Representation of Thought","date":1476359984846,"synopsis":"This was a talk by [[Bret Victor]] a few years ago. On this page we also collect other ideas and quotes on the use of models and simulations as a way of [[Publishing Thought]] as an [[Evolutionary Language]]."},{"slug":"the-image-of-thought","title":"The Image Of Thought","date":1466331262626,"synopsis":"Deleuze's unusual metaphysics entails an equally atypical [[epistemology]], or what he calls a transformation of \"the image of thought\"."},{"slug":"the-madness-of-people","title":"The Madness of People.","date":1472803274470,"synopsis":"[[Attack or Defence]]"},{"slug":"the-majority-illusion","title":"The Majority Illusion","date":1470048351304,"synopsis":"Network scientists have discovered how social networks can create the illusion that something is common when it is actually rare - [https://www.technologyreview.com/s/538866/the-social-network-illusion-that-tricks-your-mind/ technologyreview.com]"},{"slug":"the-memex","title":"The Memex","date":1489520621094,"synopsis":"Imagined by [[Vannevar Bush]] in [http://www.theatlantic.com/magazine/archive/1945/07/as-we-may-think/303881/ \"As We May Think,\"] in 1945, the memex is a desk-sized scholar workstation containing a microfilm library. Text and images are displayed on two screens, and can be annotated by hand. Most importantly, texts and images can be linked, so that bringing up a text on one screen brings up a linked text on the other. These links can be organized into trails, and the trails shared with others."},{"slug":"the-mind-in-the-media","title":"The Mind in the Media","date":1490376998840,"synopsis":"If you ask the author, Nathan Filer, when he first came into contact with mental illness, he'll tell you it was in 1999 when he first became a psychiatric nurse. But, like many of us, he'd actually met it much earlier : through film, drama and the news. Like many of us, his understanding had been shaped by how the media chose to portray it. But he quickly realised how very different real life was to fiction and the reports. - [http://www.bbc.co.uk/programmes/p04xk236 bbc]"},{"slug":"the-origin-of-common-sense","title":"The Origin of Common Sense","date":1476359772351,"synopsis":"[[The Origin of Common Sense]], the focus is on Ancient Rome with Galen's 'animal spirits' gently inflating the ventricles and making thought possible, and on how early Christian scholarship placed the soul in the brain's ventricles - [http://www.bbc.co.uk/programmes/b016x234 bbc]"},{"slug":"the-part-time-parliament","title":"The Part Time Parliament","date":1466347146026,"synopsis":"This is a funny, but important story for science and anyone interested noth in how academic pubishing works, and how we might improve it."},{"slug":"the-perfect-yellow","title":"The Perfect Yellow","date":1472801254333,"synopsis":"Jad and Robert wonder if maybe they could add to their color palette. Jay Neitz wondered the same thing, sort of. Take a monkey that can't see red, for example. Couldn't you just give them the red cones they were missing? So he took the human gene for red cones, figured out a way to inject it into the eyes of a group of squirrel monkeys, and he started doing vision tests. Day after a day for weeks. Until something remarkable happened. And that got us thinking. Could you take Jay's experiment even further? Could add whole new cones to .. - [http://www.rad"},{"slug":"the-political-thicket","title":"The Political Thicket","date":1467970724870,"synopsis":"On this episode, the case that pushed one Supreme Court justice to a nervous breakdown, brought a boiling feud to a head, and changed the course of the Supreme Court forever - [http://www.radiolab.org/story/the_political_thicket/?utm_source=sharedUrl&utm_medium=metatag&utm_campaign=sharedUrl radiolab.org]"},{"slug":"the-psychology-of-money---podcast","title":"The psychology of money - podcast","date":1470598040855,"synopsis":"How does money change our thinking, feelings and behaviour? Claudia Hammond joins the podcast team to teach us how to take control of our cash - [https://www.theguardian.com/science/audio/2016/may/20/the-psychology-of-money-podcast bbc]"},{"slug":"the-road-to-damascus","title":"The Road To Damascus","date":1498165553874,"synopsis":"What happens when a terrorist has a change of heart?"},{"slug":"the-society-of-the-spectacle","title":"The Society of the Spectacle","date":1471259360015,"synopsis":"[[Guy Debord]]’s (1931–1994) best-known work, La société du spectacle (The Society of the Spectacle) (1967), is a polemical and prescient indictment of our image-saturated consumer culture. The book examines the “Spectacle,” Debord’s term for the everyday manifestation of capitalist-driven phenomena; advertising, television, film, and celebrity."},{"slug":"the-sound-of-bees","title":"The Sound Of Bees","date":1472462212385,"synopsis":"Here we will explore the forthcoming networked event in London, which weaves a number of themes into one overpowering sound. [[Drone]] is the meme and name of the event."},{"slug":"the-thickness-of-things","title":"The Thickness of Things","date":1428897919177,"synopsis":"A nice phrase from an article in [http://www.academia.edu/495635/The_Thickness_of_Things_Exploring_the_Curriculum_of_Museums_through_Phenomenological_Touch academia.edu]"},{"slug":"theatre","title":"Theatre","date":1496658672928,"synopsis":"Theatre or theater is a collaborative form of fine art that uses live performers, typically actors or actresses, to present the experience of a real or imagined event before a live audience in a specific place, often a stage - [https://en.wikipedia.org/wiki/Theatre wikipedia]"},{"slug":"theory-of-assemblage","title":"Theory of Assemblage","date":1428898535074,"synopsis":"Assemblage is one of these “bridging concepts” that connect various disciplines while retaining their specificity. Commonly used in geology, paleontology, archaeology and art, recently it regains popularity in different fields (political sciences - Manuel DeLanda, science studies – Bruno Latour, cultural studies - Brian Massumi) - [http://web.stanford.edu/dept/archaeology/cgi-bin/TAG/drupal/?q=content/theory-assemblage-0 stanford.edu]"},{"slug":"thing-assembly","title":"Thing (assembly)","date":1426129179656,"synopsis":"A \"thing\" was the governing assembly of a Germanic society, made up of the free people of the community presided over by [[Lawspeaker]]s. Its meeting-place was called a [[Thingstead]]."},{"slug":"thing-in-action","title":"Thing in Action\"","date":1425144640046,"synopsis":"A thing in action is essentially a right to sue. It is an intangible personal property right recognized and protected by the law, that has no existence apart from the recognition given by the law, and that confers no present possession of a tangible object. Another term is a \"chose in action\" - [https://en.wikipedia.org/wiki/Chose Wikipedia]."},{"slug":"thingstead","title":"Thingstead","date":1427406533619,"synopsis":"A \"thingstead\" is a meeting place of a [[Thing (assembly)]] - the governing assembly of a Germanic society."},{"slug":"thinking-styles","title":"Thinking Styles","date":1467804416428,"synopsis":"Design thinking is popular these days. We design products, experiences, and even business models. But something is missing. We’ve embraced design thinking, but we’ve failed to design our thinking  - [https://hbr.org/2016/06/design-how-your-team-thinks hbr.org]"},{"slug":"thomas-schelling","title":"Thomas Schelling","date":1427706326490,"synopsis":"Thomas Crombie Schelling (born 14 April 1921) is an American economist and professor of foreign policy, national security, nuclear strategy, and arms control at the School of Public Policy at University of Maryland, College Park."},{"slug":"thought-experiment","title":"Thought experiment","date":1471008462067,"synopsis":"A thought experiment considers some hypothesis, theory, or principle for the purpose of thinking through its consequences. Given the structure of the experiment, it may or may not be possible to actually perform it, and if it can be performed, there need be no intention of any kind to actually perform the experiment in question - [https://en.wikipedia.org/wiki/Thought_experiment wikipedia]"},{"slug":"threat-level","title":"Threat Level","date":1472116109749,"synopsis":"A good story about witness statements, and conspiracy theories. There is also a follow up story that is interesting to examine from the point of view of suicide, death and terrorism."},{"slug":"thynghowe","title":"Thynghowe","date":1424358165096,"synopsis":"Thynghowe was an important [[Danelaw]] meeting place, or thing, located in Sherwood Forest, Nottinghamshire, England. It was lost to history until its rediscovery in 2005-6 by local history enthusiasts Lynda Mallett and Stuart Reddish [http://www.culture24.org.uk/history+%2526+heritage/archaeology/art56785 culture24.org.uk]."},{"slug":"time","title":"Time","date":1471675777220,"synopsis":"Time is the indefinite continued progress of existence and events that occur in apparently irreversible succession from the past through the present to the future - [https://en.wikipedia.org/wiki/Time wikipedia]"},{"slug":"tissue-engineering","title":"Tissue engineering","date":1477146641597,"synopsis":"Tissue engineering is the use of a combination of cells, engineering and materials methods, and suitable biochemical and physicochemical factors to improve or replace biological tissues. Tissue engineering involves the use of a scaffold for the formation of new viable tissue for a medical purpose. While it was once categorized as a sub-field of biomaterials, having grown in scope and importance it can be considered as a field in its own - [https://en.wikipedia.org/wiki/Tissue_engineering wikipedia]"},{"slug":"token-exchange-games","title":"Token Exchange Games","date":1476360240845,"synopsis":"Here we look to collect and analyze a set of games that use tokens, exchanged between actors as a means to to encode, store and evolve an understanding of the world"},{"slug":"tools-of-change","title":"Tools of Change","date":1491832773093,"synopsis":"Henrik Kniberg describes complex and confusing causal relationships with disarmingly simple drawings. Now he joins other graphic innovators in explaining climate change and our own obligations to address it."},{"slug":"topic-map","title":"Topic Map","date":1470994989997,"synopsis":"Topic Maps is a standard for the representation and interchange of knowledge, with an emphasis on the findability of information - [https://en.wikipedia.org/wiki/Topic_Maps wikipedia]"},{"slug":"topic-maps","title":"Topic Maps","date":1470995202915,"synopsis":"Topic Maps is a standard for the representation and interchange of knowledge, with an emphasis on the findability of information - [https://en.wikipedia.org/wiki/Topic_Maps wikipedia]"},{"slug":"tournament-species","title":"Tournament species","date":1468065551906,"synopsis":"Tournament species in [[zoology]] are those [[species]] in which members of one sex (usually [[male]]s) compete in order to mate. In tournament species, most members of the competing sex never win the competitions and never mate, but almost all members of the other sex do mate with the small group of winners."},{"slug":"transcendental-empiricism","title":"Transcendental empiricism","date":1466331078855,"synopsis":"Deleuze's main philosophical project in the works he wrote prior to his collaborations with [[Félix Guattari]] can be baldly summarized as an inversion of the traditional metaphysical relationship between identity and difference."},{"slug":"truth","title":"Truth","date":1471704247432,"synopsis":"Truth is most often used to mean being in accord with fact or reality, or fidelity to an original or standard. Truth may also often be used in modern contexts to refer to an idea of \"truth to self,\" or authenticity - [https://en.wikipedia.org/wiki/Truth wikipedia]"},{"slug":"turings-machines","title":"Turing's Machines","date":1473438898453,"synopsis":"Alan Turing's mental leaps about machines and computers were some of the most innovative ideas of the 20th century. But the world wasn't kind to him. Turing was a math genius, a hero of World War II, and is widely considered to be the father of artificial intelligence. But in 1952, he was arrested and convicted under a British law that prohibited \"acts of gross indecency between men, in public or private.\" Leading Robert to wonder how Turing's personal life shaped his understanding of mechanical minds and human emotions. Read more: Janna Levin, A Madman "},{"slug":"type-theory","title":"Type theory","date":1466358557478,"synopsis":"In mathematics, logic, and computer science, a type theory is any of a class of formal systems, some of which can serve as alternatives to set theory as a foundation for all mathematics. In type theory, every \"term\" has a \"type\" and operations are restricted to terms of a certain type - [https://en.wikipedia.org/wiki/Type_theory wikipedia]"},{"slug":"ulysses-pact","title":"Ulysses pact","date":1467716641384,"synopsis":"A Ulysses pact or Ulysses contract is a freely made decision that is designed and intended to bind oneself in the future. The term is used in medicine, especially in reference to advance directives (also known as living wills), where there is some controversy over whether a decision made by a person in one state of health should be considered binding upon that person when he or she is in a markedly different, usually worse, state of health - [https://en.wikipedia.org/wiki/Ulysses_pact wikipedia]"},{"slug":"unpleasant-design","title":"Unpleasant Design","date":1470992081249,"synopsis":"Some notes on a great podcast and book that you can find described here - [http://99percentinvisible.org/episode/unpleasant-design-hostile-urban-architecture/ 99percentinvisible.org]"},{"slug":"utopia","title":"Utopia","date":1469202630300,"synopsis":"A utopia (/juːˈtoʊpiə/ yoo-TOH-pee-ə) is an imagined community or society that possesses highly desirable or nearly perfect qualities. Utopian ideals often place emphasis on egalitarian principles of equality in economics, government and justice, though by no means exclusively, with the method and structure of proposed implementation varying based on ideology. According to Lyman Tower Sargent \"[t]here are socialist, capitalist, monarchical, democratic, anarchist, ecological, feminist, patriarchal, egalitarian, hierarchical, racist, left-wing, right-wing,"},{"slug":"vclav-havel","title":"Václav Havel","date":1467717031483,"synopsis":"Václav Havel (5 October 1936 – 18 December 2011) was a Czech writer, philosopher, dissident, and statesman. From 1989 to 1992, he served as the last president of Czechoslovakia. He then served as the first president of the Czech Republic (1993–2003) after the Czech–Slovak split. Within Czech literature, he is known for his plays, essays, and memoirs - [https://en.wikipedia.org/wiki/V%C3%A1clav_Havel wikipedia]"},{"slug":"velvet-revolution","title":"Velvet Revolution","date":1467739793494,"synopsis":"The Velvet Revolution (Czech: sametová revoluce) or Gentle Revolution (Slovak: nežná revolúcia) was a non-violent transition of power in what was then Czechoslovakia. The period of upheaval and transition took place from November 17 to December 29, 1989. Popular demonstrations against the one-party government of the Communist Party of Czechoslovakia combined students and older dissidents. The end result was the end of 41 years of Communist rule in Czechoslovakia, and the subsequent conversion to a parliamentary republic - [https://en.wikipedia.org/wiki/V"},{"slug":"viable-system-model","title":"Viable system model","date":1501440848235,"synopsis":"The viable system model (VSM) is a model of the organisational structure of any autonomous system capable of producing itself -  [https://en.wikipedia.org/wiki/Viable_system_model wikipedia]"},{"slug":"view-to-nature","title":"View to Nature","date":1427781029478,"synopsis":"A view to nature can result in measurable improvements in health outcomes"},{"slug":"voyager-program","title":"Voyager program","date":1474272073223,"synopsis":"The Voyager program is a continuing American scientific program that employs two robotic probes, Voyager 1 and Voyager 2, to study the outer Solar System. They were launched in 1977 to take advantage of a favorable alignment of Jupiter, Saturn, Uranus, and Neptune, and are now exploring the outer boundary of the heliosphere currently in interstellar space. Although their original mission was to study only the planetary systems of Jupiter and Saturn, Voyager 2 continued on to Uranus and Neptune, and both Voyagers are now tasked with exploring interstellar"},{"slug":"wanderbuch","title":"Wanderbuch","date":1465981112141,"synopsis":"A [[Journeyman]] would be required to keep a journal or [[Wanderbuch]]. This would often serve as both passport and a resumé - [http://www.peterspioneers.com/wanderbuch.htm peterspioneers.com]"},{"slug":"war-on-drugs","title":"War on Drugs","date":1492248667103,"synopsis":"[[The War on Drugs]] is an American term usually applied to the United States government's campaign of prohibition of drugs, military aid, and military intervention, with the stated aim being to reduce the illegal drug trade."},{"slug":"ward-cunningham","title":"Ward Cunningham","date":1430937369159,"synopsis":"I'm enjoying reading more in [[The Federation]]. Here is a place that I can fork content without concern for the information architecture that results."},{"slug":"ward-explains-debt-metaphor","title":"Ward Explains Debt Metaphor","date":1427781766751,"synopsis":"[[Ward Cunningham]] posted a video explaining Debt Metaphor (see [[Technical Debt]], for example) himself, clearing some confusion in the blogosphere about it."},{"slug":"water-clock","title":"Water Clock","date":1470047833318,"synopsis":"A water clock or clepsydra (Greek κλεψύδρα from κλέπτειν kleptein, 'to steal'; ὕδωρ hydor, 'water') is any timepiece in which time is measured by the regulated flow of liquid into (inflow type) or out from (outflow type) a vessel where the amount is then measured - [https://en.wikipedia.org/wiki/Water_clock wikipedia]"},{"slug":"we-have-never-been-modern","title":"We Have Never Been Modern","date":1425157298918,"synopsis":"We Have Never Been Modern is a 1991 book by [[Bruno Latour]]. The book is an \"anthropology of science\" that explores the dualistic distinction modernity makes between nature and society - [https://en.wikipedia.org/wiki/We_Have_Never_Been_Modern Wikipedia]."},{"slug":"we-the-sheeple","title":"We The Sheeple","date":1493494431574,"synopsis":"Sheeple (a portmanteau of \"sheep\" and \"people\") is a derogatory term that highlights the passive herd behavior of people easily controlled by a governing power which likens them to sheep, a herd animal that is easily led about - [https://en.wikipedia.org/wiki/Sheeple wikipedia]"},{"slug":"web-archive-format","title":"Web Archive Format","date":1489520558934,"synopsis":"What format should we save our data, and code in the Federation? We look for the following properties and qualities for any solution we choose:"},{"slug":"welcome-visitors","title":"Welcome Visitors","date":1519814764056,"synopsis":"Welcome to this [[Federated Wiki]] site. The purpose of this site is to discuss and document the idea and practice of [[Liquid Democracy]]."},{"slug":"what-makes-a-good-con-artist-podcast","title":"What makes a good con artist? Podcast","date":1470597806933,"synopsis":"How does the brain of the con artist differ from the rest of us? And how could some of their skills be redeployed for the greater good? - [https://www.theguardian.com/science/audio/2016/jan/29/what-makes-a-good-con-artist-podcast bbc]"},{"slug":"whats-left-when-youre-right","title":"What's Left When You're Right?","date":1471597082876,"synopsis":"From the stage to the cage, a series of showdowns that leave us wondering about the price of being right ... or coming from the left - [http://www.radiolab.org/story/whats-left-when-youre-right/?utm_source=sharedUrl&utm_medium=metatag&utm_campaign=sharedUrl radiolab.org]"},{"slug":"who-makes-the-rules","title":"Who makes the Rules","date":1449865159045,"synopsis":"[[Rules-in-Use]] lists the three levels for governance with regard to the Federated Wiki. But in general, three levels suffices pretty well for any commons, as [[Elinor Ostrom]] has written."},{"slug":"why","title":"Why?","date":1470129518263,"synopsis":"Here we look at this basic question. And one fantastic answer."},{"slug":"why-isnt-the-sky-blue","title":"Why Isn't the Sky Blue?","date":1472801155193,"synopsis":"What is the color of honey, and \"faces pale with fear\"? If you're Homer--one of the most influential poets in human history--that color is green. And the sea is \"wine-dark,\" just like oxen...though sheep are violet. Which all sounds...well, really off. Producer Tim Howard introduces us to linguist Guy Deutscher, and the story of William Gladstone (a British Prime Minister back in the 1800s, and a huge Homer-ophile). Gladstone conducted an exhaustive study of every color reference in The Odyssey and The Iliad. And he found something startling: No blue! Ti"},{"slug":"wicked-problem","title":"Wicked problem","date":1470246649707,"synopsis":"A wicked problem is a problem that is difficult or impossible to solve because of incomplete, contradictory, and changing requirements that are often difficult to recognize. The use of term \"wicked\" here has come to denote resistance to resolution, rather than evil. Moreover, because of complex interdependencies, the effort to solve one aspect of a wicked problem may reveal or create other problems - [https://en.wikipedia.org/wiki/Wicked_problem wikipedia]"},{"slug":"wiki-as-theatre","title":"Wiki as Theatre","date":1496602513372,"synopsis":"Most of what I know about human nature I learned from the Theatre. Writing for, directing of, and performing in the theatre require talent and practice. I don't expect great works of federated wiki to be any different."},{"slug":"wiki-truth","title":"Wiki Truth","date":1416076483240,"synopsis":"While many people question the truth of what they read in wiki, I question their understanding of truth itself."},{"slug":"wiki-voting-discussion","title":"Wiki Voting Discussion","date":1452418063520,"synopsis":"We should all really get out the vote as much as possible! There's a great company trying to promote voting through some friendly competition amongst the different ideals... check them out [http://www.voteapparel.com www.voteapparel.com]. Every shirt or tank-top gets a vote and then the Vote Apparel company makes a donation to which ever party sells the most t-shirts! Way cool! Wearing your vote and promoting voting -- such a great idea!"},{"slug":"wikpedia-image-import","title":"Wikpedia Image Import","date":1469024335177,"synopsis":"Here is an image from Wikipedia ready to drag onto your page..."},{"slug":"windows-overlooking-life","title":"Windows Overlooking Life","synopsis":". . . this pattern helps to complete the earlier patterns which give each room its shape: <span>[[Light On Two Sides Of Every Room]]</span>, <span>[[Ceiling Height Variety]]</span>, and <span>[[The Shape Of Indoor Space]]</span>. Once these patterns are clear, this pattern helps to place the windows rather more precisely in the walls. It defines just how many windows there should be, how far apart, and what their total area should be."},{"slug":"wings-oflight","title":"Wings Oflight","synopsis":". . . at this stage, you have a rough position for the building or buildings on the site from <span>[[South Facing Outdoors]]</span> and <span>[[Positive Outdoor Space]]</span>. Before you lay out the interior of the building in detail, it is necessary to define the shapes of roofs and buildings in rather more detail. To do this, go back to the decisions you have already made about the basic social components of the building. In some cases, you will have made these decisions according to the individual case; in other cases you may have used the fundament"},{"slug":"without-a-king","title":"Without a King?","date":1471262284444,"synopsis":"how can you run a country or organisation without a king? The is the [[Sovereignty Question]]."},{"slug":"work","title":"Work","date":1471259533674,"synopsis":"See[[The magic bureaucrat]] -  [http://99percentinvisible.org/episode/magic-bureaucrat-riverside-miracle/ 99percentinvisible.org]"},{"slug":"worth","title":"Worth","date":1469730120723,"synopsis":"Here we look at how we value things. In the podcast below there are some nice introductory stories - a little from a US perspective about health economics, and environmental economics, and questions of value - [http://www.radiolab.org/story/worth/?utm_source=sharedUrl&utm_medium=metatag&utm_campaign=sharedUrl radiolab.org]"},{"slug":"writing-with-strangers","title":"Writing with Strangers","date":1429804097374,"synopsis":"Writing in the presence of rampant forking calls into question [[What it Means to Write]] and how to do it well."},{"slug":"yanis-varoufakis","title":"Yanis Varoufakis","date":1501355160448,"synopsis":""},{"slug":"you-v-you","title":"You v. You","date":1473344617257,"synopsis":"Zelda Gamson tried for decades to stop smoking. But while one part of her wanted to quit, another part just didn't want to let go. So, how do you win a tug-of-war with yourself? We decided to ask one of the greatest negotiators of our time for some advice. Adam Davidson from Planet Money introduces us to Nobel Prize-winning economist [[Thomas Schelling]], whose tactical skills saw him through high-stakes conflicts during the Cold War. But while his strategies worked wonders during nuclear stand-offs, it turns out they fell apart when he tried them on him"}]