[{"slug":"accidental-dystopia","title":"Accidental Dystopia","date":1509290977860,"synopsis":"We're building an artificial intelligence-powered dystopia, one click at a time, says techno-sociologist Zeynep Tufekci. In an eye-opening talk, she details how the same algorithms companies like Facebook, Google and Amazon use to get you to click on ads are also used to organize your access to political and social information. [https://www.ted.com/talks/zeynep_tufekci_we_re_building_a_dystopia_just_to_make_people_click_on_ads ted]"},{"slug":"are-we-living-in-a-simulation","title":"Are We Living In A Simulation?","date":1509730368090,"synopsis":"Are we living in a simulation? [[Elon Musk]] thinks we definitely could be, and it seems he is not alone. The idea that we might simply be products of an advanced post-human civilisation, that are simply running a simulation of our universe and everything it contains, has taken hold over the last few years."},{"slug":"artificial-neural-network","title":"Artificial neural network","date":1507291317099,"synopsis":"Artificial neural networks (ANNs) or connectionist systems are computing systems inspired by the biological neural networks that constitute animal brains. Such systems learn (progressively improve performance) to do tasks by considering examples, generally without task-specific programming - [https://en.wikipedia.org/wiki/Artificial_neural_network wikipedia]"},{"slug":"beware-the-machines","title":"Beware the Machines","date":1457709577407,"synopsis":"Should we beware the machines? Professor Stephen Hawking has warned the rise of Artificial Intelligence could mean the end of the human race. He's joined other renowned scientists urging computer programmers to focus not just on making machines smarter, but also ensuring they promote the good and not the bad."},{"slug":"browser-gets-smarter","title":"Browser Gets Smarter","date":1507508254018,"synopsis":"Teachable Machine is built with a new library called deeplearn.js, which makes it easier for any web developer to get into machine learning by training and running neural nets. Now anyone can explore machine learning, no coding required. [https://www.blog.google/topics/machine-learning/now-anyone-can-explore-machine-learning-no-coding-required/ post]"},{"slug":"causal-networks","title":"Causal networks","date":1507552698281,"synopsis":"A [[causal network]] is a Bayesian network with an explicit requirement that the relationships be causal - [https://en.wikipedia.org/wiki/Bayesian_network#Causal_networks wikipedia]"},{"slug":"cyborg-corporations","title":"Cyborg Corporations","date":1507482990498,"synopsis":"Tim O’Reilly says, like an AI gone rogue, somebody planted the idea that shareholder value was the right algorithm, the right thing to be optimizing for. But this wasn’t the way companies acted before. We can plant a different idea. That’s what this political process is about. [https://www.wired.com/story/tim-oreilly-algorithms-have-already-gone-rogue wired]"},{"slug":"disgust-and-envy","title":"Disgust and Envy","date":1509305850508,"synopsis":"Image processing researchers have mixed feelings of disgust and envy towards this recent trend of deep learning that keeps pushing itself into our court. Some of us have chosen to remain bystanders for now, while others play along and divert their research accordingly. [https://sinews.siam.org/Details-Page/deep-deep-trouble-4 post]"},{"slug":"federation","title":"Federation","date":1508422975191,"synopsis":"The web is a federated document database. Pages from wildly different sites are shown in a single browser interface."},{"slug":"fuzzy-cognitive-map","title":"Fuzzy cognitive map","date":1507546003890,"synopsis":"A fuzzy cognitive map is a cognitive map within which the relations between the elements (e.g. concepts, events, project resources) of a \"mental landscape\" can be used to compute the \"strength of impact\" of these elements. Fuzzy cognitive maps were introduced by Bart Kosko. Ron Axelrod introduced cognitive maps as a formal way of representing social scientific knowledge and modeling decision making in social and political systems, then brought in the computation fuzzy logic - [https://en.wikipedia.org/wiki/Fuzzy_cognitive_map wikipedia]"},{"slug":"intelligence","title":"Intelligence","date":1507549223406,"synopsis":"Intelligence has been defined in many different ways including as one's capacity for logic, understanding, self-awareness, learning, emotional knowledge, planning, creativity, and problem solving. It can be more generally described as the ability or inclination to perceive or deduce information, and to retain it as knowledge to be applied towards adaptive behaviors within an environment or context - [https://en.wikipedia.org/wiki/Intelligence wikipedia]"},{"slug":"logic","title":"Logic","date":1507291993798,"synopsis":"Furthermore, computers can be used as tools for logicians. For example, in symbolic logic and mathematical logic, proofs by humans can be computer-assisted. Using [[automated theorem proving]], the machines can find and check proofs, as well as work with proofs too lengthy to write out by hand."},{"slug":"neural-network","title":"Neural network","date":1507291323766,"synopsis":"Artificial neural networks (ANNs) or connectionist systems are computing systems inspired by the biological neural networks that constitute animal brains. Such systems learn (progressively improve performance) to do tasks by considering examples, generally without task-specific programming - [https://en.wikipedia.org/wiki/Artificial_neural_network wikipedia]"},{"slug":"path-analysis-statistics","title":"Path analysis (statistics)","date":1507630980735,"synopsis":"In statistics, path analysis is used to describe the directed dependencies among a set of variables. This includes models equivalent to any form of multiple regression analysis, factor analysis, canonical correlation analysis, discriminant analysis, as well as more general families of models in the multivariate analysis of variance and covariance analyses (MANOVA, ANOVA, ANCOVA) - [https://en.wikipedia.org/wiki/Path_analysis_(statistics) wikipedia]"},{"slug":"post-truth-politics","title":"Post-truth politics","date":1507631847156,"synopsis":"Post-truth politics (also called post-factual politics) is a political culture in which debate is framed largely by appeals to emotion disconnected from the details of policy, and by the repeated assertion of talking points to which factual rebuttals are ignored. Post-truth differs from traditional contesting and falsifying of truth by rendering it of \"secondary\" importance. While this has been described as a contemporary problem, there is a possibility that it has long been a part of political life, but was less notable before the advent of the Internet"},{"slug":"secure-automata","title":"Secure Automata","date":1507608858020,"synopsis":"Language-theoretic security (LangSec) is a design and programming philosophy that"},{"slug":"semantic-network","title":"Semantic network","date":1507630928164,"synopsis":"A semantic network, or frame network, is a network that represents semantic relations between concepts. This is often used as a form of knowledge representation. It is a directed or undirected graph consisting of vertices, which represent concepts, and edges, which represent semantic relations between concepts - [https://en.wikipedia.org/wiki/Semantic_network wikipedia]"},{"slug":"surveillance-capitalism","title":"Surveillance Capitalism","date":1493037177437,"synopsis":"Governmental control is nothing compared to what Google is up to. The company is creating a wholly new genus of capitalism, a systemic coherent new logic of accumulation we should call surveillance capitalism. Is there nothing we can do? Shoshana Zuboff. [http://www.faz.net/aktuell/feuilleton/debatten/the-digital-debate/shoshana-zuboff-secrets-of-surveillance-capitalism-14103616.html?printPagedArticle=true post]"},{"slug":"symbolic-ai","title":"Symbolic AI","date":1507290889492,"synopsis":"When access to digital computers became possible in the middle 1950s, AI research began to explore the possibility that human intelligence could be reduced to symbol manipulation. The research was centered in three institutions: [[Carnegie Mellon University]], [[Stanford]] and [[MIT]], and each one developed its own style of research. [[John Haugeland]] named these approaches to AI \"good old fashioned AI\" or \"[[GOFAI]]\"."},{"slug":"tensorflow-playground","title":"Tensorflow Playground","date":1507508295386,"synopsis":"Tinker with a neural network in your browser. It’s a technique for building a computer program that learns from data. It is based very loosely on how we think the human brain works. [http://playground.tensorflow.org/ site]"},{"slug":"the-federation","title":"The Federation","date":1508423227601,"synopsis":"Here we describe the The Federation. We should use this term wisely. It describes quite clearly the social aspects of this project, while also pointing gently towards [[Star Trek]] and the future of the [[Decentralised Web]]."},{"slug":"the-policemans-beard-is-half-constructed","title":"The Policeman's Beard is Half Constructed","date":1498483593216,"synopsis":"The Policeman's Beard is Half Constructed is the first book written by a computer. See also companies like [[Narrative Science]]."},{"slug":"thought-garden-activity","title":"Thought Garden Activity","date":1501864022703,"synopsis":"View all activity from [[Thought Garden Sites]] listed in the roster below:"},{"slug":"war-on-free-will","title":"War on Free Will","date":1508254150370,"synopsis":"Here we examine how [[Large Corporations]], [[Big Data]] and [[Artificial Intelligence]] are combining to pose a threat to our democracy, ideas, values and even the way we think."},{"slug":"welcome-visitors","title":"Welcome Visitors","date":1508251833594,"synopsis":"Here we gather notes and research regarding [[Intelligence]] (artificial or other) and it's relationship to the creation of an [[Open Think Tank]] in the [[Thought Garden]] project."}]