[{"slug":"-27-role-of-perception-and-communication-in-conflict","title":"\n2.7 ROLE OF PERCEPTION AND COMMUNICATION IN CONFLICT","date":1501692001578,"synopsis":"In conflict situations, perception plays a major role in the escalation or transformation of conflicts. Perception has been defined as the process by which individuals select, organize, and interpret the input from their senses to give meaning and order to the world around them (Jennifer, 2005).   Perception can be positive or negative and it is negative perception that fuels conflicts. De Haans, (2002) noted that antagonistic perception and beliefs among farmers and herdsmen could compound conflicts especially because of failing traditional institutions"},{"slug":"-link-error","title":" Link Error","date":1498415070905,"synopsis":"#Please view this page in edit mode and click on this paragraph to see what is being described"},{"slug":"11-background-of-the-study","title":"1.1 BACKGROUND OF THE STUDY","date":1501688493793,"synopsis":"Conflict is an integral part of life. As contained in the biblical story of man’s beginning, a terrible conflict erupted between Cain and Abel, the two siblings of the same family. It turned violent, resulting in Cain killing his brother, Abel because the latter’s sacrifice was allegedly accepted by God while the former’s was not. Since then, the world has continued to experience conflicts."},{"slug":"12-study-area","title":"1.2 STUDY AREA","date":1501688643510,"synopsis":"Saki-West Local Government is located in the North-Western part of Oyo State. (See annexure 1).  The Local Government is bounded on the East by Saki-East Focal Government, on the South by Atisbo Local Government and on the West by the Republic of Benin. It is bounded on the North by Baruteen Local Government of Kwara State. Saki-West Local Government area has a population of 278,002 (2006 census). The headquarters of the Local Government is Saki, a prominent commercial and farming centre. Due to its strategic location, the town attracts people from all p"},{"slug":"13-rationale-for-the-study","title":"1.3 RATIONALE FOR THE STUDY","date":1501688787497,"synopsis":"Conflict between Farmers and Fulani Herdsmen remains a persistent problem in Saki-West Local Government Area. In 1999, the conflict degenerated into violent clashes which resulted into monumental loss of lives on both sides. Many cows belonging to the Fulani were lost as collateral damage. Although, studies have been conducted on this subject, (e.g. Adebayo and Olaniyi, 2008; Albert, 2010) this research is aimed at examining the problems from different perspectives."},{"slug":"14-general-objective-of-the-study","title":"1.4 GENERAL OBJECTIVE OF THE STUDY","date":1501689060311,"synopsis":"The general objective of the study to examine the causes of conflicts between Fulani herdsmen and farmers in Saki West Local Government Area and review the age-old relationship to determine the source(s) of the conflict. Furthermore, it is a well-known fact that perception plays a major role in conflict generation and management. What are the perceptual filters that govern the relationship?  Perceptual filters include culture, ethnicity, gender and sexuality, knowledge, previous experiences in managing the conflicts, i.e. issues that may condition the at"},{"slug":"15-research-methodology","title":"1.5 RESEARCH METHODOLOGY","date":1501689165888,"synopsis":"Two broad areas of research have been identified in dealing with community conflicts. These are basic or pure and applied or action research (Albert: 2001). While the focus of basic research is to understand a problem, applied or action research focuses on solving a problem (Elmes and Roediger, 1995)."},{"slug":"16-conceptual-definitions","title":"1.6 CONCEPTUAL DEFINITIONS","date":1501748194237,"synopsis":"**Pastoralism**: Pastoralism is the practice of raising livestock for livelihood. Azanya (1996) refers to pastoralism as an economy based on raising livestock which could be undertaken by sedentary or nomadic groups. Nomadism refers to the spatial movement of herdsmen. Nomadism and pastoralism are intertwined. Indeed, nomadism represents an integral, social, political and environment dimension of pastoralism. (Shettima & Tar: 2008; 165)."},{"slug":"2017-07-24-work","title":"2017-07-24 Work","date":1500892107462,"synopsis":"Notes for what I'm doing today"},{"slug":"2027-time-capsule","title":"#2027 Time Capsule","date":1504314571814,"synopsis":"You are invited to contribute to the time capsule that we will be opening in ten years time at Exponentially Human Twenty Twenty-Seven  - called [[XH2027]] for short"},{"slug":"21-what-is-conflict","title":"2.1 WHAT IS CONFLICT?","date":1501689816587,"synopsis":"Conflict is a universal phenomenon because it occurs in all human societies in the world. It is an intrinsic and inevitable part of human existence (Francis, 2007). The term “conflict” derives from confligere, a Latin word which means “to strike together.” In its original context, conflict had a physical rather than a moral connotation (Albert, 2001). In his own opinion, Deutsch (1977) says that conflict is an action which prevents, obstructs, interferes with, injures or renders ineffective, another action with which it is incompatible."},{"slug":"22-causes-of-conflicts","title":"2.2 CAUSES OF CONFLICTS","date":1501689982115,"synopsis":"Conflicts are caused by various factors and Albert (2001) compresses them into the following:"},{"slug":"23-farmers-pastoralists-conflicts-in-nigeria","title":"2.3 FARMERS-PASTORALISTS CONFLICTS IN NIGERIA","date":1501690103593,"synopsis":"The conflicts between Fulani nomadic cattle herders and farmers is a common phenomenon in Nigeria, West Africa and, indeed, in many parts of the world and it has been escalating in recent times. Professor Hagher Iyorwuese likened it to a full blown war in Benue and Nasarawa States of Nigeria. He accused President Jonathan of behaving like the proverbial Emperor Nero who fiddled while Rome was burning!  (Iyorwuese, 2012). Now hardly a week passes without media reports of clashes in Kaduna, Jos, Makurdi and some other places in the north with the attendant"},{"slug":"231-categorisation","title":"2.3.1. CATEGORISATION","date":1501690295910,"synopsis":"There are different categories of Pastoralists. Some are nomadic, semi-settled (transhumant) and settled (sedentary agro pastoralists) according to the degree of mobility (Oladele and Oladele 2011). Albert (2012:105) categorized the Fulanis in Oke Ogun into four. The first is the Fulani Yorubas or the “Fulani Ile” i.e Fulanis who were born and bred in Oke Ogun or whose parents were born in Oke Ogun and they speak Yoruba and Fulfude languages fluently. The second type is the settled Fulani who have chosen to live in Oke Ogun and move their herds around th"},{"slug":"24-farmer-pastoralist-conflict-as-a-resource-based-conflict","title":"2.4 FARMER-PASTORALIST CONFLICT AS A RESOURCE-BASED CONFLICT","date":1501690423895,"synopsis":"Conflict between farmers and pastoralists which has been in existence for a long time was at a low level because of the low population density and the high incidence of cattle diseases that ravaged herds and severely limited cattle holdings. Blench (2005;iv-16) puts this succinctly when he observes that if the Nigerian population is projected backwards to pre-colonial times, the human population, for what is today known as Nigeria,  may not be more than 10 million in the19th and early 20th century. Conversely, the land area of the Nigerian nation remains"},{"slug":"25-environmental-impact-of-land-resource-usage-by-farmers-and-pastoralists","title":"2.5 ENVIRONMENTAL IMPACT OF LAND RESOURCE USAGE BY FARMERS AND PASTORALISTS","date":1501690621881,"synopsis":"Environmental conflict is sometimes used interchangeably with resource use conflict. In a project called Environmental Conflicts Projects (ENCOP) the following definition was adopted:"},{"slug":"26-theories-of-resource-use-conflict","title":"2.6 THEORIES OF RESOURCE-USE CONFLICT","date":1501691431079,"synopsis":"There are several theories of resource use conflict. These include:"},{"slug":"28-consequences-of-resource-use-conflict-between-farmers-and-pastoralists","title":"2.8 CONSEQUENCES OF RESOURCE USE CONFLICT BETWEEN FARMERS AND PASTORALISTS","date":1501748115342,"synopsis":"Resource use conflict has a number of implications for the society. It can lead to scarcity of food as farmers often abandon their farms for self preservation and therefore there is no cultivation of crops. Primate Samson Ojoawo, President-General of Grassroots Farmers Association (GFA) in Saki, emphasized this point in an interview conducted with him."},{"slug":"31-background","title":"3.1 BACKGROUND","date":1501744737734,"synopsis":"Conflict between Bororo Fulani herdsmen and farmers is not peculiar to Saki West Local Government Area but has become a national and, indeed, an international problem.  Northern Nigeria which is often regarded as homogenous in language, religion and culture, also experiences similar conflicts."},{"slug":"32-creation-of-modern-states-as-a-trigger-of-farmers--pastoralists-conflict","title":"3.2 CREATION OF MODERN STATES AS A TRIGGER OF FARMERS / PASTORALIST’S CONFLICT","date":1501744817993,"synopsis":"Another explanation for the problem of resource use conflict is the territories and borders created by colonial powers which virtually excluded the pastoralists from possession of any land of theirs. This brings them into direct conflict with farmers and other resource users. Besides, modern States were created in such a way to restrict nomads to fixed and artificial boundaries, thereby making people who are historically mobile new prisoners of limited spaces. This situation increases their vulnerability to the vagaries of social and natural scarcities. "},{"slug":"33-politics-as-a-factor-in-resource--based-conflict","title":"3.3 POLITICS AS A FACTOR IN RESOURCE- BASED CONFLICT","date":1501745330621,"synopsis":"In a political relationship where power resides will determine how a conflict is resolved or managed. As earlier observed, where there is symmetry of power, there is a balance of power and the conflicting parties can seek to resolve the conflict without one party dictating the terms of settlement. However, where there is asymmetric power relationship there is the tendency of the more powerful to bully the less privileged and cow him or her into submission. Any agreement reached to resolve a conflict in such a situation merely scuttles the problem which m"},{"slug":"34-genesis-of-the-conflict-in-saki-west-local-government","title":"3.4 GENESIS OF THE CONFLICT IN SAKI WEST LOCAL GOVERNMENT","date":1501745701073,"synopsis":"According to official records and documents  at Saki West Local Government, the etiology of the problem can be traced to a case of arson and large–scale destruction of crops by Bororo/Fulani cattle rearers at the farm/ranch of Western Livestock Company Limited in Ogbooro in the defunct Ifedapo Local Government, area on 15th November, 1989.  The company was owned by the government of the old Western State. The Bororo Fulani cattle rearers invaded the plantation and grazed down 22 hectares of cotton and 2.2 hectares of cassava. Following a security surveil"},{"slug":"35-the-1999-crisis","title":"3.5 THE 1999 CRISIS","date":1501746225803,"synopsis":"The crisis that erupted in 1999 started to brew in 1997. The peace and security committee of the defunct Ifedapo Local Government had met on 20th November 1997 during which it was informed that the Fulani/Bororos were dissatisfied with the resolution on a land issue at Okerete area of the Local Government."},{"slug":"36-grievances-of-the-parties","title":"3.6 GRIEVANCES OF THE PARTIES","date":1501746572411,"synopsis":"**Farmers Grievances**"},{"slug":"37-effects-of-violent-clashes-between-bororo-fulani-and-farmers---on-saki-west-local-government","title":"3.7 EFFECTS OF VIOLENT CLASHES BETWEEN BORORO –FULANI AND FARMERS   ON SAKI-WEST LOCAL GOVERNMENT","date":1501747291028,"synopsis":"The first violent clash between farmers and pastoralists occurred on 24th March, 1999. This was the day that  hunters first intervened in the conflict and, according to the account of Miyetti Allah Cattle Breeders Association of Nigeria (MIYETTI ALLAH), the attack started sporadically and heightened and consequently led to loss of lives and properties. The immediate effect was the migration of the Bororo Fulanis from Saki West Local Government area. The related outcomes include:"},{"slug":"38-aftermath-of-the-conflict","title":"3.8 AFTERMATH OF THE CONFLICT","date":1501747451400,"synopsis":"Many lives were lost on both sides. One unintended consequence of this crisis was the closure of Saki Cattle Market.  Saki community could hardly tolerate any Bororo Fulani in its vicinity. Since it was the Bororo Fulani that supplied the cattle in the Saki kraal, their disappearance from Saki automatically stopped the supply to the market. New cattle markets were opened in Ago Are and Ilesa Ibariba as alternative to the former one at Saki.  The adverse effect of this incident is felt in Saki till today."},{"slug":"39-involvement-of-odua-peoples-congress-opc","title":"3.9 INVOLVEMENT OF ODUA PEOPLE’S CONGRESS. (OPC)","date":1501747947325,"synopsis":"The Odua People’s Congress (OPC) was deeply involved in the crisis. Indeed, according to Albert (2010), OPC’s involvement escalated the conflict. It was said that OPC believed that Bororo Fulani cattle rearers’ recalcitrant attitude, especially during the Abacha regime, was because they felt that with their kinsman in power, they were virtually untouchable."},{"slug":"41-conflict-management-techniques","title":"4.1 CONFLICT MANAGEMENT TECHNIQUES","date":1501959820569,"synopsis":"Conflict management techniques have been discussed exhaustively in the various literatures. Pendzich (1994), Anderson, J. Ganthier, M. Thomas, and Wondelleck J. (1996) and Ojiji (2007) identified seven conflict management styles, while Albert (2001) compressed them to four as follows:"},{"slug":"42-the-role-of-governments-in-the-conflict","title":"4.2 THE ROLE OF GOVERNMENTS IN THE CONFLICT","date":1501959852879,"synopsis":"Historically, government at the State and Local Governments have played active roles in managing the conflicts between farmers and Fulani herdsmen in Oyo State in general and in Saki West Local Government areas in particular. The famed intervention of the former Governor of Oyo State, late Alhaji Lam Adesina is a case in point. On 22nd May, 2000 he called a peace meeting between Yorubas and Bororo Fulanis herdsmen during which he read a “riot act” to Local Government Council Executive Officers and threatened that he would dissolve any Local Government Ca"},{"slug":"44-interaction-with-major-stakeholders","title":"4.4 INTERACTION WITH MAJOR STAKEHOLDERS","date":1501959923828,"synopsis":"Focus group discussions with the major stakeholders in the conflict produced interesting yet instructive results. Some of the people discussed with include representatives of the farmers, the hunters and the Bororo Fulanis. Highlights of the discussions are as follows:"},{"slug":"51-observations","title":"5.1 OBSERVATIONS","date":1501960033041,"synopsis":"Certain issues remain critical to understanding the conflict between the farmers and pastoralists. Such issues include the following:"},{"slug":"53-recommendations","title":"5.3 RECOMMENDATIONS","date":1501960098121,"synopsis":"**(i)** Creation of grazing reserves. There is an urgent need to create gazing reserves in different geographical locations in the country. Furthermore, the existing ones in Oyo State should be made functional urgently. Existence of grazing reserves in places like Kwara, Kogi, and Benue States will reduce the pressure on pastoralists to migrate to the south during the dry season."},{"slug":"a-plus-for-nrova","title":"A Plus For NROVA","date":1498654204909,"synopsis":"#A personal experience of the benefit of NROVAs"},{"slug":"about","title":"About","date":1503848842492,"synopsis":"FEAST stands for Food, Environment, Art and Sustainable Technology."},{"slug":"academy-methodology","title":"Academy Methodology","date":1498675311614,"synopsis":"The [[Outlandish Academy]] is a P2P framework for creating online and offline learning experiences. Students are encouraged to pass on their learning by the built in [[Learning TimeBank]], which enables us to offer all courses for free to anyone in the world."},{"slug":"action-research","title":"Action research","date":1500389811787,"synopsis":"Action research takes the position that the researcher is part of the research. It is connected to the epistemological claim that knowledge is not discovered but created."},{"slug":"africa-stories","title":"Africa Stories","date":1500298336122,"synopsis":"The intention here is to provide a \"library\" of real-life stories about and from places in Africa where work is being done by locals on the ground to grow their capacity and capabilities for sustainable prosperity. Unleashing the collective human, technological, economic and ecological genius of each place will accelerate progress toward the flourishing conditions wanted and needed."},{"slug":"africa-stories---page-2","title":"Africa Stories - page 2","date":1501519000855,"synopsis":"Original information posted as Dadamac blogs and Cicely's blog"},{"slug":"agile-teaching","title":"Agile Teaching","date":1498606261309,"synopsis":"In the Viral Academy we use a modified version of [[Agile Project Management]] as our teaching philosophy and methodology"},{"slug":"aims","title":"Aims","date":1503849607933,"synopsis":"FEAST is an event that creates conversations between people. We aim to create a popular, massively scaleable, platform for collaboration and democratic engagement. To do this we build upon our nature as social beings, that for thousands of years have come together around food to converse, tell stories, and be entertained."},{"slug":"albion-millennium-green","title":"Albion Millennium Green","date":1505512138759,"synopsis":"[https://twitter.com/albionmilgreen @albionmilgreen]"},{"slug":"alexandria","title":"Alexandria","date":1497962022607,"synopsis":"The Ancient Library of Alexandria is a perfect, and tragic, example of the problem with centralization. Today’s information architecture is similarly vulnerable because the it’s hub and spoke network relies on centralized hubs to store and distribute information. Decentralized technology eliminates central points of failure - [http://www.alexandria.io/learn/#learn1 alexandria.io]"},{"slug":"andrew-orford","title":"Andrew Orford","date":1501495117906,"synopsis":""},{"slug":"anthropological-archive","title":"Anthropological Archive","date":1497961919715,"synopsis":"An [[archive]] can be considered as a store of artefacts, whether digital or physical, but here we look to describe something more organic, more \"present\" and evolving in terms of structure, and more psychosocial in terms of content."},{"slug":"apprenticeship","title":"Apprenticeship","date":1498652307825,"synopsis":"An apprenticeship is a system of training a new generation of practitioners of a trade or profession with on-the-job training and often some accompanying study - [https://en.wikipedia.org/wiki/Apprenticeship wikipedia]"},{"slug":"archive","title":"Archive","date":1459337724529,"synopsis":"An archive is an accumulation of historical records or the physical place they are located. Archives contain primary source documents that have accumulated over the course of an individual or organization's lifetime, and are kept to show the function of that person or organization. Professional archivists and historians generally understand archives to be records that have been naturally and necessarily generated as a product of regular legal, commercial, administrative or social activities. They have been metaphorically defined as \"the secretions of an "},{"slug":"archivist-manifesto","title":"Archivist Manifesto","date":1497962313368,"synopsis":"There appears to be no publicly available text for this manifesto?"},{"slug":"audioboom","title":"AudioBoom","date":1500062159735,"synopsis":"Where we write about the AudioBoom software, learning to use it, and post examples of work."},{"slug":"belbin-and-film-making","title":"Belbin and Film Making","date":1500065554150,"synopsis":"#nina #belbin #pamela #film-making"},{"slug":"bibliography","title":"Bibliography","date":1501958546622,"synopsis":"- Adebayo, O, O, and Olaniyi O.A. (2008): Factors Associated with Pastoral and Crop Farmers Conflict in Derived Savannah Zone of Oyo State, Nigeria. In J. Hum, Ecol, 23(1) pp. 71-74."},{"slug":"capital","title":"Capital","date":1503350823524,"synopsis":"A page in Federated Wiki referenced in a TEDx talk, by Ward Cunningham, about Federated Wiki - but I haven't tracked the page down yet."},{"slug":"changes-to-the-future","title":"Changes to the Future","date":1493403448969,"synopsis":"Below we list recent changes from contributors below writing specifically on topics of relevance to the [[Future of the Federation]]:"},{"slug":"changes-to-this-site","title":"Changes to this Site","date":1434532209841,"synopsis":"Below we list recent changes to this site only without also listing changes from the [[Neighbourhood]]:"},{"slug":"chapter-four-references","title":"CHAPTER FOUR REFERENCES","date":1501938834832,"synopsis":"- Adisa, R.S. (2011): “Land Use Conflict between Farmers and Herdsmen-Implications for Rural Development” www.interchopen.com/download/pdf 34416."},{"slug":"chapter-one-references","title":"CHAPTER ONE REFERENCES","date":1501748215343,"synopsis":"- Albert I.O. (2001): Introduction to Third-Party Intervention in Community Conflicts: Peaceful Transformations Forum is Association with John Archers (Publishers) Ltd pp. 45-60."},{"slug":"chapter-three-references","title":"CHAPTER THREE REFERENCES","date":1501747927998,"synopsis":"- Albert I.O. (2001): Introduction to Third-Party Intervention in Community Conflicts: Peaceful Transformations Forum is Association with John Archers (Publishers) Ltd pp. 45-60."},{"slug":"chapter-two-references","title":"CHAPTER TWO REFERENCES","date":1501748085400,"synopsis":"- Adekunle, O.A. and Adisa, S.R. (2010): An Empirical Phenomenological Psychological Study of Farmer-Herdsman Conflicts in Northern Nigeria: Journal of Alternative Perspectives in the Social Science, vol. 2, No. 1."},{"slug":"choice-framework","title":"Choice Framework","date":1502809030283,"synopsis":"This work by Dorothea Kleine has some useful potential meeting points where \"on the ground\" initiatives could connect with academia. We might take one or more of the diagrams in this video as starting points for exploring areas of overlap (first one is 7 minutes in). To people outside of academic ICT4D some of the development terminology may sound patronising, but it is challenging some of \"Development\" mindsets of the time, and and it is pointing to the creativity of people who are limited by their circumstances, but are making the most of what opportun"},{"slug":"collective-intelligence-and-inspirations","title":"Collective Intelligence and Inspirations","date":1498049525789,"synopsis":"Relevant to developing [[Flat Organisational Structures]]."},{"slug":"community","title":"Community","date":1500975728407,"synopsis":"The community of people with some connection through Outlandish Academy or other Federated Wiki connections"},{"slug":"conversational-space","title":"Conversational Space","date":1498942088885,"synopsis":"Here we describe the architecture of conversation, in a system or design perspective, not as a singular temporal event but as a network process that occurs across time and space."},{"slug":"coping-with-dying","title":"Coping with Dying","date":1459538253374,"synopsis":"Dying is part of the experience of living, so it's best to make peace with it and accept that every living thing undergoes it at some point - [https://www.reddit.com/r/AskReddit/comments/1wzcaj/serious_how_do_you_cope_with_the_passing_of/ reddit]"},{"slug":"courses-and-resources","title":"Courses and Resources","date":1498226170772,"synopsis":"#School of Life"},{"slug":"crowd-streaming","title":"Crowd Streaming","date":1499598440736,"synopsis":"Crowd streaming is the combination and synergy between live streaming, and serialised podcasting with a crowdfunding campaign."},{"slug":"currently-working-on","title":"Currently Working On","date":1499173684296,"synopsis":"Here is a list of [[Recent Changes]] I consider important. View our experiments on the [[Scratch]] page. To clear stuff saved in your browser try [[Local Changes]]."},{"slug":"dadamac-an-introduction","title":"Dadamac: An Introduction","date":1502983381880,"synopsis":"#The beginning - an informal network"},{"slug":"david-bovill","title":"David Bovill","date":1489691927769,"synopsis":"On this site I write about [[Livecode]], the projects I am working on and the courses I am teaching."},{"slug":"david-bovills-thinking","title":"David Bovill's Thinking","date":1499704775411,"synopsis":"This is where I make notes about what David is thinking about work that involves (or may involve) both of us"},{"slug":"davids-sites","title":"David's Sites","date":1501415622449,"synopsis":"Here is a list of sites I write on (and some [[Dead Sites]]):"},{"slug":"delia-aka-dr-de","title":"Delia AKA Dr De*","date":1500939623949,"synopsis":"Delia Pembrey MacNamara AKA Dr De* is one of the confirmed speakers for [http://exponentiallyhuman.org/view/welcome-visitors Exponentially Human Twenty Twenty-Seven] under the name she intends to be using by 2027 i.e. Dr De*"},{"slug":"delia-pembrey-macnamara","title":"Delia Pembrey MacNamara","date":1500939228363,"synopsis":"This page is written by Pamela McLean about Delia Pembrey MacNamara"},{"slug":"descartes","title":"Descartes","date":1497963896574,"synopsis":"Descartes tells us that our thought is the only sure evidence that we are anything at all."},{"slug":"design-thinking","title":"Design thinking","date":1500837915666,"synopsis":"Design thinking refers to creative strategies designers utilize during the process of designing. Design thinking is also an approach that can be used to consider issues, with a means to help resolve these issues, more broadly than within professional design practice and has been applied in business as well as social issues. Design thinking in business uses the designer's sensibility and methods to match people's needs with what is technologically feasible and what a viable business strategy can convert into customer value and market opportunity - [https:"},{"slug":"disruption","title":"Disruption","date":1500914690289,"synopsis":"Thoughts about Disruption related to digital technologies and living in an increasingly \"connected world\""},{"slug":"documentary-research-archive","title":"Documentary Research Archive","date":1496588090506,"synopsis":"While researching a subject for a documentary or podcast we inevitably create an archive."},{"slug":"doug-morrison","title":"Doug Morrison","date":1499270966902,"synopsis":"Hi, I am Doug. I am a minimalist. Google \"Doug Minimalist\" to find out more about me."},{"slug":"education","title":"Education","date":1503347935153,"synopsis":"This is about educational theory and shifts in the education system."},{"slug":"eleanor-marx","title":"Eleanor Marx","date":1501868736150,"synopsis":"Eleanor Marx lived the last years of her life in Sydenham. She was the first translator of [[Madame Bovary]] into English. Like Emma Bovary she committed suicide by taking poison. She was pronounced dead by [[Ernest Shackleton]]'s father Henry who lived round the corner and was the local doctor."},{"slug":"elfneh-bariso","title":"Elfneh Bariso","date":1500029226399,"synopsis":""},{"slug":"elfnehs-audioboos","title":"Elfneh's AudioBoos","date":1500034998409,"synopsis":"Recordings made by Elfneh Bariso on AudioBoom. These are the very first \"learning by doing\" attempts."},{"slug":"emotional-dictionary","title":"Emotional Dictionary","date":1498064196287,"synopsis":"The Emotional Dictionary was a project I started with artist [[Dilek Winchester]] some time around 2001, to create a visual and multimedia dictionary of emotions."},{"slug":"error-on-new-page-link","title":"Error on New Page Link","date":1498414879021,"synopsis":"#A mistake I made when creating a new link "},{"slug":"ethical-design-manifesto","title":"Ethical Design Manifesto","date":1497962493875,"synopsis":"The Ethical Design manifesto was written by [[Aral Balkan]] and the Ind.ie team. I am proposing working with this as a guiding principle for the people facing published surface of the [[Anthropological Archive]] and [[Permanent Wiki]]."},{"slug":"exploring","title":"Exploring","date":1498077226583,"synopsis":"This is for bits and pieces I just happen to find when I'm exploring Federated Wiki. NB - When pages are copied like this the links within the pages may not work."},{"slug":"exponential-leap-publication","title":"Exponential Leap Publication","date":1505085524736,"synopsis":"*[[Pamela McLean]] is responsible for content here*"},{"slug":"exponentially-human---an-intro-mini-booklet","title":"Exponentially Human - an intro \"mini-booklet\"","date":1505078225076,"synopsis":"This is where we try to write a \"covering page\" that we can use each time we send out a few introductory pages about Exponentially Human time capsule, or Exponentially Human Twenty Twenty-Seven."},{"slug":"exponentially-human-2027-gavin","title":"Exponentially Human 2027 (Gavin)","date":1500065022797,"synopsis":"First #XH2027 #Interview #Gavin"},{"slug":"facilitation","title":"Facilitation","date":1500169278830,"synopsis":"Facilitation is an emerging industry to perform the specialized role of assisting groups to collaborate or explore ideas."},{"slug":"fanstsuam-foundation-talent","title":"Fanstsuam Foundation Talent","date":1501625903799,"synopsis":"This page was a mis-spelling of [[Fantsuam Foundation Talent]]"},{"slug":"fanstsuam-foundation-talent-show","title":"Fanstsuam Foundation Talent Show","date":1501437126490,"synopsis":"A page with 1 items."},{"slug":"fantsuam-foundation","title":"Fantsuam Foundation","date":1498896612055,"synopsis":"Fantsuam Foundation is an integrated community development organisation in Kaduna State, North Central Nigeria, directed by [[John Dada]]"},{"slug":"fantsuam-foundation-talent","title":"Fantsuam Foundation Talent","date":1501625848210,"synopsis":"A page with references to talent and creative arts at [[Fantsuam Foundation]]"},{"slug":"fantsuam-outlandish-home","title":"Fantsuam Outlandish Home","date":1503002101054,"synopsis":"This is a new online space for Fantsuam Foundation that complements and extends the [http://fantsuam.org/ Fantsuam.org] and [https://www.dadamac.net/ Dadamac.net] websites by using the evolving Federated Wiki platform which makes content more easily shareable, adaptable and collaboratively actionable."},{"slug":"farmer-pastoralist-conflict","title":"Farmer Pastoralist Conflict","date":1498995923581,"synopsis":"This page links to the initial work on the topic."},{"slug":"farmers-and-pastoralists-research-archive","title":"Farmers and Pastoralists Research Archive","date":1502912049726,"synopsis":"See [[Conflict Resolution Resources]]"},{"slug":"feast","title":"FEAST","date":1503931749879,"synopsis":"FEAST is a celebration of local cultures that are unique yet connected. We come together around food, music, and conversation, which we celebrate locally while connecting globally to other communities through the medium of radio."},{"slug":"feast-activity","title":"FEAST Activity","date":1491944607960,"synopsis":"This form of writing and co-creation that we explore is new. It is an unusual and new way to collaborate, one which encourages us to share our early thoughts as we see them pass from hand to hand. This process we have called before [[Writing With Strangers]]."},{"slug":"feast-open-cafe","title":"FEAST Open Cafe","date":1504696533651,"synopsis":"David Bovill used a term \"Open Cafe\" during a phone call on 05Sep2017 with Pamela McLean, Andrew Orford and Gavin Peacock."},{"slug":"feast-website","title":"FEAST Website","date":1503851905130,"synopsis":"Here we collect information relevant for populating the FEAST.fm [http://www.feast.fm/ website]"},{"slug":"federated-wiki","title":"Federated Wiki","date":1424469802551,"synopsis":"We publish federated wiki software as a Node.js package ready to run on a variety of platforms. This is usefully run on a personal laptop or an industrial server in the cloud. Most people get started by joining a community and launching sites and/or servers with their help. The server software supports a multi-tenant \"farm\" option useful for small groups or heavy users. [https://www.npmjs.com/package/wiki npm]"},{"slug":"federated-wiki-and-xh2027","title":"Federated Wiki and XH2027","date":1500994713411,"synopsis":"This is where I make notes about the connection between Federated Wiki and XH2027 (Exponentially Human Twenty Twenty-Seven)"},{"slug":"federated-wiki-training","title":"Federated Wiki Training","date":1500063344829,"synopsis":"First thoughts about charging for courses. #payment #sponsorship"},{"slug":"fedwiki-tools","title":"Fedwiki Tools","date":1499877132564,"synopsis":"Here we list a few tools that are of particular use in managing and creating [[Fedwiki]] content."},{"slug":"first-outlandish-academy-steps","title":"First Outlandish Academy Steps","date":1497865671324,"synopsis":"# Archive of first steps"},{"slug":"first-recording-for-wiki","title":"First Recording for Wiki","date":1497816716275,"synopsis":"Start of learning how to make recordings, do interviews and put them onto wiki . #XH2027 #FEAST #interviews #skills #wiki"},{"slug":"flat-organisational-structures","title":"Flat Organisational Structures","date":1498433674913,"synopsis":"This page is for collecting background information about flat organisational structures."},{"slug":"foraging","title":"Foraging","date":1437307821140,"synopsis":"Foraging is searching for wild food resources. This page is where I log my attempts to find food, or places where I may find food in the future."},{"slug":"from-local-to-global","title":"From local to global","date":1501441347130,"synopsis":"Original information posted as a Dadamac blog"},{"slug":"future-of-the-federation","title":"Future of the Federation","date":1489051327477,"synopsis":"Here we collect notes and ideas about how [[The Federation]] should evolve - where it is going. See [[Changes to the Future]]."},{"slug":"gavin-peacock","title":"Gavin Peacock","date":1499119296630,"synopsis":"Born in the 1960s in South West London into an \"ordinary\" working household. Nothing traumatic that I can recall about my childhood, and I left school at 18 after my \"A\" Levels and fell straight into banking. Deep down, I didn't really have a strong sense of what I wanted to do, and where my brightest \"talents\" might lie."},{"slug":"gbade-adejumo","title":"Gbade Adejumo","date":1501690636116,"synopsis":"Chief Gbade Adejumo is an expert in community affairs. He is a retired Permanent Secretary with Oyo State Government. He also worked in local government. He is well respected for his involvement in local community issues.  On his retirement he studied for an MA at Ibadan University .His thesis was on \"Farmers and Pastoralists' Conflicts and Their Management in Saki West Local Government Area of Oke-Ogun, Oyo State\"."},{"slug":"gbade-adejumo-thesis-contents","title":"Gbade Adejumo Thesis Contents","date":1501957909165,"synopsis":"Please see below a list of pages that each contain a section of Gbade's Thesis: *FARMERS AND PASTORALISTS' CONFLICTS AND THEIR MANAGEMENT IN SAKI WEST LOCAL GOVERNMENT AREA OF OKE-OGUN, OYO STATE*"},{"slug":"global-goals-no4-quality-education","title":"Global Goals No.4: Quality Education","date":1499245214800,"synopsis":"# Ensure inclusive and quality education for all and promote lifelong learning"},{"slug":"goals-for-federated-wiki","title":"Goals for Federated Wiki","date":1495044305641,"synopsis":"We share an interest in the continued growth in federated wiki as an important concept and in the open codebase that demonstrates its advantages."},{"slug":"grazing-rights","title":"Grazing rights","date":1500992002454,"synopsis":"Submitted by Frances on 21 June 2014"},{"slug":"halo","title":"Halo","date":1495378559668,"synopsis":"A wiki page is rendered with a colored border when that page has been retrieved from other than the origin site. A hover over the page flag may explain details."},{"slug":"heutagogy","title":"Heutagogy","date":1502894125941,"synopsis":"About Heutagogy, and what is happening in the field. Heutagogy is the study of self-determined learning."},{"slug":"holacracy","title":"Holacracy","date":1498434920001,"synopsis":"- [[Medium Articles About Holacracy]]"},{"slug":"holacracy-of-one","title":"Holacracy of One","date":1497953800005,"synopsis":"At the end of 2016 George Por posted an article called [http://www.enliveningedge.org/columns/mapping-a-lifework/ Mapping a LifeWork] which drew some of its inspiration from the workings of [http://www.holacracy.org/how-it-works/ Holacracy]. This evolving article attempts to map out my own “Circle of LifeWork” or “Holacracy of One”, seeing myself as a multi-faceted, multi-potential “human organization” of wholes within wholes…"},{"slug":"home-away-from-home","title":"Home Away from Home","date":1498002605110,"synopsis":"We redirect visitors to alternative landing pages written in html and provided in the status/theme directory for each site in a wiki farm."},{"slug":"ict-for-development","title":"ICT for Development","date":1502895192960,"synopsis":"Information about ICT (Information and Communication Technologies) for Development. There is a particular interest here in enabling better communication between work \"on the ground\" and work in academia."},{"slug":"image-transporter","title":"Image Transporter","date":1495900565792,"synopsis":"This service creates wiki pages with images in several forms without loading image data within the page. Use this for large or detailed images that will be stored remotely."},{"slug":"innovation-in-africa-in-education","title":"Innovation In Africa in Education","date":1499713173381,"synopsis":"This is where we look at rhetoric and reality about ICTs (Information and Communication Technologies) in educational innovation in Africa and elsewhere."},{"slug":"interests-or-initiatives","title":"Interests or Initiatives","date":1503847392188,"synopsis":"Practical projects that are part of the Outlandish Academy studies of Pamela McLean"},{"slug":"introductions","title":"Introductions","date":1500915076349,"synopsis":"This page for a gradually developing list of relationships between people in my network and aspects of federated wiki has been replaced by [[Community]]"},{"slug":"jacob-berrier","title":"Jacob Berrier","date":1499614905171,"synopsis":"I explore new technologies and currently work with HoloLens"},{"slug":"javier-gomez","title":"Javier Gomez","date":1500938778885,"synopsis":"I am interested in human centered innovation: [[design thinking]], [[lean startup]], [[agile]] and [[jobs-to-be-done]]. I love to learn by doing. I am interested in Federated wiki as a way to explore new ways to collaborate better."},{"slug":"john-dada","title":"John Dada","date":1500920338776,"synopsis":""},{"slug":"john-dada-two-pager","title":"John Dada Two Pager","date":1500194075262,"synopsis":"This is where we write about John and his work and why it matters."},{"slug":"kuhn-cycle","title":"Kuhn Cycle","date":1451851237849,"synopsis":"Thomas Kuhn's Structure of Scientific Revolutions described the social cycle through which science advances, one stage of which is the paradigm shift for which he is famous."},{"slug":"learning-journey","title":"Learning Journey","date":1500994613359,"synopsis":"This page tracks the early part of my learning journey with [[Federated Wiki]]. I have been shown some of the basics of creating pages etc, but I lack an understanding of  \"how we behave around here\", what it means to belong to this community, the vision of the creators, how I contribute usefully and appropriately etc. So I need to learn...  and I'll document my learning journey here."},{"slug":"learning-passport","title":"Learning Passport","date":1498651533916,"synopsis":"#Source"},{"slug":"learning-roles","title":"Learning Roles","date":1498675579552,"synopsis":"In conversation with [[Mike Caulfield]] we started to outline a series of [[Roles or Hats]] that might enable a more explicit contract with people working together on a [[Happening]]:"},{"slug":"leena-koni-hoffmann","title":"Leena Koni Hoffmann","date":1499728286940,"synopsis":"Leena Hoffmann PhD is a Chatham House associate fellow of the Africa Programme and technical advisor to the Permanent Inter-State Committee for Drought Control in the Sahel (CILSS). Her research focuses on Nigeria’s politics, corruption, security and trade. She is currently involved in researching the political economy of the food security and agricultural policy agenda of the Sahel and West Africa. Her previous work includes researching the impact of border politics on West Africa’s regional trade. and being an investigator for the Anti-Corruption Commi"},{"slug":"legacy-and-immortality","title":"Legacy and Immortality","date":1497962107276,"synopsis":"The aim here is to work on a project that create a sustainable archive of cultural and personal conversations and oral histories."},{"slug":"lineup","title":"Lineup","date":1440986154602,"synopsis":"The lineup is the list of wiki pages currently displayed within one tab, in order, with duplication possible."},{"slug":"lineup-links","title":"LineUp Links","date":1492506382110,"synopsis":"Presently [[wiki links]] implement internal links within [[the federation]], using a mechanism we call [[collaborative links]]. Here I outline a proposal to extend this mechanism to enable wiki links to open a number of lineup pages."},{"slug":"link-error","title":"Link Error","date":1498415229406,"synopsis":"This page is correctly titled i.e. it has no space before the work \"Link\""},{"slug":"live-tv-studios","title":"Live TV Studios","date":1502634200924,"synopsis":"In the Viral Academy we are interested in using audio and video to enhance the learning experience in new way. Technology allows us to create new forms of conversation and interaction suitable to a distributed learning experience."},{"slug":"maps","title":"Maps","date":1500133844910,"synopsis":"Here we look at how to work with maps in wiki. In particular we want to look out how we can use wiki to create and document walks, oral histories, and map festivals."},{"slug":"medium-articles-about-holacracy","title":"Medium Articles About Holacracy","date":1498433546689,"synopsis":"#Collection started on June 25th 2017"},{"slug":"mike-caulfield","title":"Mike Caulfield","date":1423103632203,"synopsis":"I've worked in educational technology since the 1990s. I'm currently exploring applications of federated wiki to education. Most of my day is spent helping faculty integrate technology into teaching as Washington State University Vancouver as the Director of Blended and Networked Learning."},{"slug":"more-about-elfneh","title":"More About Elfneh","date":1498679667128,"synopsis":"This information was written in 2014 by Pamela McLean for Dadamac.net."},{"slug":"my-wiki-skill-building","title":"My Wiki Skill Building","date":1498676712860,"synopsis":"*[[Wiki Information Pages Written by Not Pamela]]* -"},{"slug":"narrative-linking-interests-or-initiatives","title":"Narrative Linking Interests or Initiatives","date":1500934443620,"synopsis":"Connections between the different \"Interests or Initiatives\" and how they came about."},{"slug":"news-from-kafanchan-and-new-blogger","title":"News from Kafanchan and new blogger","date":1501190325880,"synopsis":"**[http://dadamac.net/blog/20130210/market-toilets-waste-plastic-cisco-costs-and-rest-news-kafanchan Market toilets, waste plastic, CISCO costs and the rest of the news from Kafanchan]**"},{"slug":"nina-bumbalkova","title":"Nina Bumbalkova","date":1500817412470,"synopsis":"Nina B was born in Prague in 1987. She works predominantly in photography, but also makes films. With her images, she aims to record an inside view of the city’s subcultures and urban spaces."},{"slug":"nomadic-teaching","title":"Nomadic Teaching","date":1498656902661,"synopsis":"There are a number of important ways in which [[Mobile Learning]] leads to the development of this new form of teaching role. In particular the modern day ubiquity and prevalence of [[Conferences and Meetups]] combined with technological access to this information, leads us to ask what the role of a [[Conference Speaker]] is in a modern educational contet."},{"slug":"nrova","title":"NROVA","date":1498653469903,"synopsis":"#NROVA - National Record of Vocational Achievement (UK)"},{"slug":"open-simulation-archive","title":"Open Simulation Archive","date":1497962169108,"synopsis":"[[Open Simulation Archive]] is an open archive of 3D science models and simulations. This ‚Äúbiomedical 3D warehouse‚Äù would be the science equivalent to Google Warehouse."},{"slug":"outlandish-academy","title":"Outlandish Academy","date":1498764376690,"synopsis":"Outlandish acadamy is the online location that turns establishment ideas about learning and teaching on their heads."},{"slug":"outlandish-academy-as-heutagogy-","title":"Outlandish Academy as Heutagogy\n","date":1502700453251,"synopsis":"Outlandish Academy’s use of fedwiki to support participatory autonomy could be interpreted as an example of heutagogy."},{"slug":"outlandish-activity","title":"Outlandish Activity","date":1499424858054,"synopsis":"View all activity of the [[Outlandish Researchers]]  listed in the roster below, writing across education initiatives in the [[Outlandish Academy]]:"},{"slug":"outlandish-exploration","title":"Outlandish Exploration","date":1500065709434,"synopsis":"Exploring #federatedwiki and outlandish academy with Andrew Doug and Pamela"},{"slug":"outlandish-methodology","title":"Outlandish Methodology","date":1499177541129,"synopsis":"In this [[research group]] we have decided to look at pedagogy. That is to explore and research."},{"slug":"outlandish-methodology-02","title":"Outlandish Methodology 02","date":1500064223700,"synopsis":"Confusing intro by David"},{"slug":"outlandish-researchers","title":"Outlandish Researchers","date":1499615195686,"synopsis":"Here we list current researchers for the [[Outlandish Academy]]. Based on the content being developed we will recruit [[Learners]] and provide them with their own writing and collaboration space."},{"slug":"pam-on-outlandish-academy","title":"Pam on Outlandish Academy","date":1500064088585,"synopsis":"It's a description of and the induction course for outlandish Academy perfect"},{"slug":"pamela-learning-wiki","title":"Pamela Learning Wiki","date":1501622299148,"synopsis":"This is for Pamela's learning journey related to Federated Wiki"},{"slug":"pamela-mclean","title":"Pamela McLean","date":1497864906211,"synopsis":"Pamela McLean has been a teacher/learner and creator of new knowledge related to the use of digital technologies since the late 1970s (when her name was Pam Fiddy)."},{"slug":"pamela-mclean-learning-journey","title":"Pamela McLean Learning Journey","date":1502807760525,"synopsis":"This is for classifying is some way the learning journey elements of what [[Pamela McLean]] is doing at the Outlandish Academy. (This page is linked to from [[Pamela Outlandish Start Page]])"},{"slug":"pamela-mcleans-learning-journey","title":"pamela-mcleans-learning-journey","date":1500895490884,"synopsis":"A page with 0 items."},{"slug":"pamela-outlandish-start-page","title":"Pamela Outlandish Start Page","date":1503351212767,"synopsis":"This is an experiment with a page where my own work starts (separate from the welcome page)- so it will probably have reminders, and links, and pages with long names not intended for anyone else, and generally my own messy exploration of how I can  use federated wiki in ways that are useful for me, while also being easily shareable/accessible to others."},{"slug":"pamelas-activity","title":"Pamela's Activity","date":1498757687704,"synopsis":"Here are all the changes across all my sites. If I want to add a new site drag a [[About Reference Plugin]] link to my page called [[Pamela Mclean]]."},{"slug":"pamelas-audioboos","title":"Pamela's AudioBoos","date":1500066716627,"synopsis":"Where we share our learning journey using AudioBoom for podcast preparation."},{"slug":"pamelas-outlandish-academy-start-page","title":"pamelas-outlandish-academy-start-page","date":1500893058472,"synopsis":"Renamed [[Pamela  Outlandish Start page]]"},{"slug":"participants","title":"Participants","date":1499813815994,"synopsis":"This is for bios of potential participants in our SOAS podcasts, including some who have already made  contributions."},{"slug":"pastoralists-also-need-peace","title":"Pastoralists Also Need Peace","date":1490401121004,"synopsis":"Pastoralists Also Need Peace"},{"slug":"pedagogy","title":"Pedagogy","date":1498742546702,"synopsis":"A page with 0 items."},{"slug":"personal-learning-environment","title":"Personal Learning Environment","date":1419033247071,"synopsis":"The idea is that the learner assembles a personal set of tools and creates a personal workspace and workflows that enable her learning. Learning environments in face to face classrooms are shaped by the institutions and teachers generally following customs (rows and columns of desks, blackboards or whiteboards, selected texts, often prescribed tools...). The institutional learning environment enforces social roles and positions that, too, are deemed appropriate to that environment. In online learning, the learning environment - the machines, the applicat"},{"slug":"place","title":"Place","date":1500214617068,"synopsis":"This is where I store topics on place based investigation."},{"slug":"potential-venues","title":"potential-venues","date":1499644720489,"synopsis":"These are some off the cuff venues that may work for the [[Thought Garden Installation]] in the US."},{"slug":"practical-collaboration","title":"Practical Collaboration","date":1498053468804,"synopsis":"In our rapidly changing world we need to become more adept at forming teams that can work together effectively quickly and reliably, in fluid ways. "},{"slug":"preparation-for-mia","title":"Preparation for Mia","date":1499956201216,"synopsis":"This is where I make notes for myself and to share with Mia for the SOAS FEAST.fm radio broadcast."},{"slug":"project-for-a-progressive-ethics","title":"Project for a Progressive Ethics","date":1500066672191,"synopsis":"Discussion at Newspeak House July 8th 2017"},{"slug":"radio-garden","title":"Radio Garden","date":1503848379005,"synopsis":"By bringing distant voices close, radio connects people and places. Radio Garden allows listeners to explore processes of broadcasting and hearing identities across the entire globe. From its very beginning, radio signals have crossed borders. Radio makers and listeners have imagined both connecting with distant cultures, as well as re-connecting with people from ‘home’ from thousands of miles away – or using local community radio to make and enrich new homes - [http://radio.garden/ radio.garden]"},{"slug":"reliable-prosperty","title":"Reliable Prosperty","date":1503350795846,"synopsis":"A page in Federated Wiki referenced in a TEDx talk, by Ward Cunningham, about Federated Wiki - but I haven't tracked the page down yet."},{"slug":"research-group","title":"Research Group","date":1498646176133,"synopsis":"The [[Outlandish Academy]] is based around the idea of small study groups - a group of people working together and sharing research and learning on a particular topic."},{"slug":"reusable-learning-objects","title":"Reusable Learning Objects","date":1423957304188,"synopsis":"At the [[Viral Academy]] we started to use the term [[Learning Object]] for the [[Hangout Based Lessons]] we were experimenting with."},{"slug":"search-for-farmers-and-pastoralists","title":"Search for 'Farmers and pastoralists'","synopsis":"String 'Farmers and pastoralists' found on 26 of 1989 pages from 40 sites."},{"slug":"search-for-gbade-adejumo","title":"Search for 'gbade adejumo'","synopsis":"String 'gbade adejumo' found on 12 of 1991 pages from 40 sites."},{"slug":"shackleton-at-newspeak-house","title":"Shackleton at Newspeak House","date":1500066126587,"synopsis":"Lucy Carty end of Shackleton Exhibition"},{"slug":"sheep-and-goats---and-pigs-too","title":"Sheep and Goats - and pigs too","date":1501436309322,"synopsis":"A Dadamac blog"},{"slug":"sofia-bustamante","title":"Sofia Bustamante","date":1499177234333,"synopsis":"Working with women on embodied leadership - using aikido, coaching, games and therapy!"},{"slug":"some-talk-to-think","title":"Some Talk to Think","date":1503344943286,"synopsis":"This page is for exploring the idea of talking to enable ourselves to think."},{"slug":"start-here","title":"Start Here","date":1498779922181,"synopsis":"Welcome. This is the place to begin familiarising yourself with the way you write in [[Federated Wiki]]."},{"slug":"stranger","title":"Stranger","date":1429804125629,"synopsis":"[[Georg Simmel]] introduced the notion of \"the stranger\" as a unique sociological category. He differentiates the stranger both from the [[Outsider]] who has no specific relation to a group and from the [[Wanderer]] who comes today and leaves tomorrow."},{"slug":"super-drone","title":"Super Drone","date":1500066000411,"synopsis":"Discussion down in the basement of Newspeak House"},{"slug":"teaching-machines-mike-caulfield","title":"Teaching Machines (Mike Caulfield)","date":1435167029554,"synopsis":"The Teaching Machines Happening ran officially in March 2015. These were some of the topics."},{"slug":"teaching-machines-sites","title":"Teaching Machines Sites","date":1424141293469,"synopsis":"A list of people involved in the [[Teaching Machines]] Happening."},{"slug":"technology-sites","title":"Technology Sites","date":1427395729121,"synopsis":"A list of sites that document technology related to the technology."},{"slug":"temp","title":"Temp","date":1500987809488,"synopsis":""},{"slug":"test-page","title":"Test page","date":1500894949435,"synopsis":"hi Gavin"},{"slug":"the-memex","title":"The Memex","date":1489520621094,"synopsis":"Imagined by [[Vannevar Bush]] in [http://www.theatlantic.com/magazine/archive/1945/07/as-we-may-think/303881/ \"As We May Think,\"] in 1945, the memex is a desk-sized scholar workstation containing a microfilm library. Text and images are displayed on two screens, and can be annotated by hand. Most importantly, texts and images can be linked, so that bringing up a text on one screen brings up a linked text on the other. These links can be organized into trails, and the trails shared with others."},{"slug":"the-memory-of-albion","title":"The Memory of Albion","date":1512813739969,"synopsis":"The MeMory of ALBION"},{"slug":"this-is-outlandish-academy-three","title":"this is outlandish Academy three","date":1500064503468,"synopsis":"David reply about being more inclusive regarding Outlandish Academy"},{"slug":"this-week","title":"This Week","date":1501616598010,"synopsis":"#"},{"slug":"thought-garden-installation","title":"Thought Garden Installation","date":1499731967773,"synopsis":"The [[Thought Garden]] installation is a [[conversational space]] that layers and places sound spatially in order to represent the architecture of the topic presented."},{"slug":"thoughts-on-futures-facilitation","title":"Thoughts on Futures Facilitation","date":1504696340631,"synopsis":"There are many facilitation processes practised in the world today aimed at capturing and channelling diverse collective intelligence for realising faster better progress and greater collective benefit."},{"slug":"tim-unwin","title":"Tim Unwin","date":1499722405011,"synopsis":"See blogs at https://unwin.wordpress.com/"},{"slug":"tools-for-talking","title":"Tools for Talking","date":1503349404506,"synopsis":"This is about the Digital Technologies that are \"Tools for Talking to Each Other\" and for writing and thinking with each other. "},{"slug":"trevor-e-hilder","title":"Trevor E Hilder","date":1499354170417,"synopsis":"I am the founder of [http://www.webofwealth.org webofwealth.org] and [http://www.nailsoup.net Nail Soup Ltd]"},{"slug":"trial-rec-with-nina","title":"trial rec with Nina","date":1500031419436,"synopsis":"Testing rec in thmlts"},{"slug":"u2u-conversations","title":"U2U Conversations","date":1499879083178,"synopsis":"Here we look at how a conversation between two groups meeting at remote universities can work together. Our focus is on creating a new form of dialogue that is exciting and productive."},{"slug":"ubiquitous-learning","title":"Ubiquitous Learning","date":1425225793486,"synopsis":"One of the principles of the Viral Academy is that learning takes place everywhere - it should be embedded in the experience of doing things."},{"slug":"uni-to-uni-research","title":"uni to uni research","date":1500029673101,"synopsis":"<div align=center><img src=\"http://d15mj6e6qmt1na.cloudfront.net/i/29098463\" width=428></div>"},{"slug":"vannevar-bush","title":"Vannevar Bush","date":1424882424964,"synopsis":"Bush was an engineer, the head of the U.S. Office of Scientific Research and Development during World War II, and the founder of Raytheon (among other things)."},{"slug":"viable-system-model","title":"Viable system model","date":1501440848235,"synopsis":"The viable system model (VSM) is a model of the organisational structure of any autonomous system capable of producing itself -  [https://en.wikipedia.org/wiki/Viable_system_model wikipedia]"},{"slug":"village-1","title":"village 1","date":1500031718995,"synopsis":"Interview with Pam 1"},{"slug":"village-conversation","title":"Village Conversation","date":1499621987579,"synopsis":"This about conversation with villages in Africa"},{"slug":"village-conversations","title":"Village Conversations","date":1499598532893,"synopsis":"This is where we look at the challenges of including people in poorly served village locations. We also look at opportunities, what we already know, people we connect with, and progress so far."},{"slug":"voice-from-ibadan","title":"Voice from Ibadan","date":1500211055059,"synopsis":"Chief Gbade Adejumo introducing himself and his interests"},{"slug":"walk-trail-design","title":"Walk Trail Design","date":1512383815346,"synopsis":"Trail design (for [[Walking]]) as a craft draws upon various disciplines including education, service design, heritage interpretation and nature studies."},{"slug":"walking","title":"Walking","date":1500166588615,"synopsis":"Walking in a group is a great method to demonstrate [[action research]] on the social process of knowledge transfer."},{"slug":"wanderbuch","title":"Wanderbuch","date":1498651809765,"synopsis":"A [[Journeyman]] would be required to keep a journal or [[Wanderbuch]]. This would often serve as both passport and a resumé - [http://www.peterspioneers.com/wanderbuch.htm peterspioneers.com]"},{"slug":"week-beginning-2017-06-19","title":"Week Beginning 2017-06-19","date":1501616477613,"synopsis":"This page is for each of our agreed personal to-do items that we are working on this week."},{"slug":"welcome-visitors","title":"Welcome Visitors","date":1505069174822,"synopsis":"Welcome to this [[Federated Wiki]] site for the [[Outlandish Academy]]."},{"slug":"wiki-information-pages-written-by-not-pamela","title":"wiki-information-pages-written-by-not-pamela","date":1498417675854,"synopsis":"-  [[Federated Wiki]]"},{"slug":"wiki-queries","title":"Wiki Queries","date":1499704486178,"synopsis":"#Items from [[This week]] which referred to week beginning Monday June 19th"},{"slug":"writing-with-strangers","title":"Writing with Strangers","date":1429288732439,"synopsis":"Writing in the presence of rampant forking calls into question what it means to write and how to do it well."},{"slug":"yellow-local","title":"Yellow Local","date":1495210757340,"synopsis":"A page found in the browser's local storage shows with a yellow border."}]