[{"slug":"bar-dapp-func-specs","title":"Bar Dapp Func Specs","date":1475069224796,"synopsis":"BarDapp Functional Specs"},{"slug":"bar-dapp-white-paper","title":"Bar Dapp White Paper","date":1503050812418,"synopsis":"Disclaimer: this is a very first draft of the paper. I spent 1 day writing it and 2 weeks thinking about it. I very much need feedback and comments. First draft, iteration zero. "},{"slug":"bardapp","title":"BarDapp","date":1503052750934,"synopsis":"BarDapp is a project I [[thunk]] for [[Ksenya]] for an event she was organising in Berlin called [[Dapp Hack]]."},{"slug":"creative-proposition","title":"Creative Proposition","date":1503053536998,"synopsis":"A creative proposition is an idea that has been given form and detail in terms of both the realisation and scope of the idea."},{"slug":"feast","title":"FEAST","date":1490209876402,"synopsis":"[[FEAST]] is a global decentralised conference and music festival, connected by radio. It is a celebration of local culture, with communities connected globally through conversation, sound and music."},{"slug":"identity","title":"Identity","date":1449087570443,"synopsis":"This will be a collection of audio notes on the topic of idenity. Some subtopics below:"},{"slug":"outlandish-academy","title":"Outlandish Academy","date":1503051874658,"synopsis":"The Outlandish Academy is an open distributed education project for offline and online group work. Our aim is to make online learning more social, personalised, and flexible - [http://outlandish.academy outlandish]"},{"slug":"people-powered-money","title":"People Powered Money","date":1498934624614,"synopsis":"People Powered Money is a conference that we will be running at various locations around the world on financial systems that are currently operating, or in the process of being created that offer an alternative to mainstream economic thinking."},{"slug":"sound-garden","title":"Sound Garden","date":1501861359970,"synopsis":"The Sound Garden installation uses spatialised or 3D [[Immersive Sound]] to reflect the location of the speakers in geographical or conceptual space."},{"slug":"thought-garden-projects","title":"Thought Garden Projects","date":1503052222545,"synopsis":"[[Thought Garden]] projects are a bit like film or documentary projects in that they are long term projects, which do not necessarily have a production or release date."},{"slug":"thunk","title":"Thunk","date":1503053279715,"synopsis":"Thunk is to think together, or alone. To create inside your head, without formalising these thoughts into a concrete written proposal. It is the first part of a creative process."},{"slug":"welcome-visitors","title":"Welcome Visitors","date":1503052135998,"synopsis":"Here we gather notes and research on [[Thought Garden Projects]] These projects are in various stages of development, as we look to gather together other independent projects and explore synergy."},{"slug":"world-of-the-commons","title":"World of the Commons","date":1498933394389,"synopsis":"The [[Commons]] is not a singular thing. There are many diverse forms of commons. Here we collect them together so that they can learn from and inform each other."}]