[{"slug":"-the-compass---bbc-world-service","title":" The Compass - BBC World Service","date":1510962295424,"synopsis":"A page with 0 items."},{"slug":"1-rule-internet-culture","title":"1% rule (Internet culture)","date":1515082471939,"synopsis":"In Internet culture, the 1% rule is a rule of thumb pertaining to participation in an internet community, stating that only 1% of the users of a website actively create new content, while the other 99% of the participants only lurk."},{"slug":"100--city","title":"100 % City","date":1509710224871,"synopsis":"100 % Stadt ([[100 % City]]) takes 100 statistically representative residents of cities like Berlin, Zurich, London, Melbourne, Copenhagen, or San Diego and places them on stage."},{"slug":"100-finsbury-park","title":"100% Finsbury Park","date":1509711126381,"synopsis":"[[100% Finsbury Park]] is a radio play inspired by the [[100% City]] theatre performances by [[Rimini Protocol]]. The radio show will be based on narrative portraits of the views, opinions and life stories of 100 individuals from the local area, based on audio interviews and portrait sittings with local residents."},{"slug":"100-utopia","title":"100% Utopia","date":1509711231777,"synopsis":"Original Text"},{"slug":"9091-rule","title":"90–9–1 rule","date":1515082507820,"synopsis":"In Internet culture, the [[1% rule (Internet culture)]] is a rule of thumb pertaining to participation in an internet community, stating that only 1% of the users of a website actively create new content, while the other 99% of the participants only lurk."},{"slug":"adam-curtis","title":"Adam Curtis","date":1511106250014,"synopsis":"Kevin Adam Curtis (born 1955) is an English documentary film-maker. Curtis says that his favourite theme is \"power and how it works in society\", and his works explore areas of sociology, psychology, philosophy and political history."},{"slug":"adam-smith","title":"Adam Smith","date":1508425062265,"synopsis":"Adam Smith  (16 June 1723 NS (5 June 1723 OS) – 17 July 1790) was a Scottish economist, philosopher and author as well as a moral philosopher, a pioneer of political economy and a key figure during the Scottish Enlightenment era. Smith is best known for two classic works: The Theory of Moral Sentiments (1759) and An Inquiry into the Nature and Causes of the Wealth of Nations (1776). The latter, usually abbreviated as The Wealth of Nations, is considered his magnum opus and the first modern work of economics - [https://en.wikipedia.org/wiki/Adam_Smith wik"},{"slug":"adversarial-system","title":"Adversarial system","date":1469534721009,"synopsis":"The adversarial system or adversary system is a legal system used in the common law countries where two advocates represent their parties' positions before an impartial person or group of people, usually a jury or judge, who attempt to determine the truth of the case. It is in contrast to the inquisitorial system used in some civil law systems (i.e. those deriving from Roman law or the Napoleonic code) where a judge or group of judges investigates the case - [https://en.wikipedia.org/wiki/Adversarial_system wikipedia]"},{"slug":"african-american-civil-rights-movement-19541968","title":"African-American Civil Rights Movement (1954–1968)","date":1509819923119,"synopsis":"The Civil Rights Movement, also known as the American Civil Rights Movement and other names, is a term that encompasses the strategies, groups, and social movements in the United States whose goals were to end racial segregation and discrimination against African Americans and to secure legal recognition and federal protection of the citizenship rights enumerated in the Constitution and federal law. This article covers the phase of the movement between 1954 and 1968, particularly in the South - [https://en.wikipedia.org/wiki/African-American_Civil_Rights"},{"slug":"agile-parliament","title":"Agile Parliament","date":1393795991000,"synopsis":"One of the [[Enterprise Pattern]]s in the upcoming [[Open Agile Pattern Language]] - an initiative in [[Agile Tng]]."},{"slug":"alexithymia","title":"Alexithymia","date":1515855409476,"synopsis":"Alexithymia  is a personality construct characterized by the subclinical inability to identify and describe emotions in the self. Alexithymia occurs in approximately 10% of the population and can occur with a number of psychiatric conditions - [https://en.wikipedia.org/wiki/Alexithymia wikipedia]"},{"slug":"america-laboratory-of-democracy","title":"America Laboratory of Democracy","date":1510962342091,"synopsis":"American democracy can easily frustrate change. The country’s Constitution is almost impossible to amend. The many interest groups swirling through Congress often paralyse or colonise it; and corralling 50 states is often beyond the capacity of the most able president - [http://www.bbc.co.uk/programmes/w3cswbm4 bbc]"},{"slug":"anti-austerity-movement-in-spain","title":"Anti-austerity movement in Spain","date":1509819855002,"synopsis":"The anti-austerity movement in Spain, also referred to as the 15-M Movement (Spanish: Movimiento 15-M), the Indignados Movement, and Take the Square had origins in social networks such as Real Democracy NOW (Spanish: Democracia Real YA) or Youth Without a Future (Spanish: Juventud Sin Futuro). and began with demonstrations on 15 May 2011 close to the local and regional elections, held on 22 May - [https://en.wikipedia.org/wiki/Anti-austerity_movement_in_Spain wikipedia]"},{"slug":"anti-globalization-movement","title":"Anti-globalization movement","date":1509820401971,"synopsis":"The anti-globalization movement, or counter-globalisation movement, is a social movement critical of economic globalization. The movement is also commonly referred to as the global justice movement, alter-globalization movement, anti-globalist movement, anti-corporate globalization movement, or movement against neoliberal globalization - [https://en.wikipedia.org/wiki/Anti-globalization_movement wikipedia]"},{"slug":"aragon","title":"Aragon","date":1522495270549,"synopsis":"Aragon looks like an interesting project with good film and media capabilities in the area of blockchain and democracy:"},{"slug":"aral-balkan","title":"Aral Balkan","date":1491388985853,"synopsis":"Aral Balkan is an activist, designer, and software developer - [https://ar.al/ ar.al]"},{"slug":"art","title":"Art","date":1509639837668,"synopsis":"Art is hard to define. It is easier to define negatively than it is positively. I don't feel that art is distinct in any essential way from other forms of creative work, whether it is product design, science or mathematics."},{"slug":"art-of-politics","title":"Art of Politics","date":1509709872548,"synopsis":"Here we explore projects and ideas that integrate art practice, theatre and documentary into political debate."},{"slug":"athenian-democracy","title":"Athenian democracy","date":1509820778959,"synopsis":"Athenian democracy developed around the fifth century BC in the Greek city-state (known as a polis) of Athens, comprising the city of Athens and the surrounding territory of Attica, and is the first known democracy in the world. Other Greek cities set up democracies, most following the Athenian model, but none are as well documented as Athens' - [https://en.wikipedia.org/wiki/Athenian_democracy wikipedia]"},{"slug":"augusto-boal","title":"Augusto Boal","date":1429367413599,"synopsis":"Augusto Boal was a Brazilian theatre director, writer and politician. He was the founder of Theatre of the Oppressed, a theatrical form originally used in radical popular education movements - [https://en.wikipedia.org/wiki/Augusto_Boal wikipedia]"},{"slug":"authentic-deliberation","title":"Authentic deliberation","date":1510231478504,"synopsis":"[[Deliberative democracy]] holds that, for a democratic decision to be legitimate, it must be preceded by authentic deliberation, not merely the aggregation of preferences that occurs in voting."},{"slug":"basic-income","title":"Basic income","date":1509911700443,"synopsis":"An unconditional basic income (also called basic income, basic income guarantee, universal basic income, universal demogrant, or citizen's income) is a form of social security system in which all citizens or residents of a country regularly receive an unconditional sum of money, either from a government or some other public institution, in addition to any income received from elsewhere - [https://en.wikipedia.org/wiki/Basic_income wikipedia]"},{"slug":"bergerparker-index","title":"Berger–Parker index","date":1515084816318,"synopsis":"The Berger–Parker index equals the maximum value in the dataset, i.e. the proportional abundance of the most abundant type."},{"slug":"bernie-sanders","title":"Bernie Sanders","date":1509818405646,"synopsis":"Bernard Sanders (born September 8, 1941) is an American politician who has been the junior United States Senator from Vermont since 2007 - [https://en.wikipedia.org/wiki/Bernie_Sanders wikipedia]"},{"slug":"black-lives-matter","title":"Black Lives Matter","date":1509817729168,"synopsis":"[[Black Lives Matter]] is an international activist group that fights against police brutality ([[Police brutality in the United States]]) and systemic racism.[http://blacklivesmatter.com/ Black Lives Matter]  Black Lives Matter has organized protests against the deaths of African-Americans by police actions and crimes. These include protests against the deaths of Michael Brown, Tamir Rice, Eric Garner, Freddie Gray, and Korryn Gaines."},{"slug":"blockchain-based-voting","title":"Blockchain Based Voting","date":1509835747500,"synopsis":"Below are a collection of links imported from [[OneTab]]. You can view these links here - [https://www.one-tab.com/page/GS3bmzlaTEeBHGiLkWrQ1Q one-tab.com]:"},{"slug":"blockchain-democracy","title":"Blockchain Democracy","date":1509835753179,"synopsis":"Below are a collection of links imported from [[OneTab]]. You can view these links here - [https://www.one-tab.com/page/GS3bmzlaTEeBHGiLkWrQ1Q one-tab.com]:"},{"slug":"blockchain-politics","title":"Blockchain Politics","date":1522495043440,"synopsis":"Here we research the belated, but increasingly important emphasis on democracy, law, and decision making that leverages [[blockchain]], [[distributed ledger]]s and [[decentralised technology]]."},{"slug":"breakout-tables","title":"Breakout Tables","date":1508325894017,"synopsis":"The ability to create small groups of people that can interact and discuss an issue face-to-face or using rich media such as video conferencing is fundamental to real deliberation and therefore democratic debate."},{"slug":"brexit","title":"Brexit","date":1471679827305,"synopsis":"Brexit is the forthcoming withdrawal of the United Kingdom (UK) from the European Union (EU). In the June 2016 referendum, 52% voted to leave the EU, leading into a complex separation process implying political and economic changes for the UK and other countries. The timetable for withdrawal has not yet been firmly established - [https://en.wikipedia.org/wiki/Brexit wikipedia]"},{"slug":"brexit-and-democracy","title":"Brexit And Democracy","date":1471677227726,"synopsis":"Some highlights of the video debate. Emotions, genes and facts."},{"slug":"brian-eno","title":"Brian Eno","date":1509653854843,"synopsis":"Brian Peter George St John le Baptiste de la Salle Eno, RDI (; born 15 May 1948 and originally christened Brian Peter George Eno) is an English musician, composer, record producer, singer, writer, and visual artist."},{"slug":"changes-to-democracy","title":"Changes to Democracy","date":1509816011364,"synopsis":"Here we list changes to all the [[Democracy Sites]] we write with in the federation:"},{"slug":"changes-to-this-site","title":"Changes to this Site","date":1434532209841,"synopsis":"Below we list recent changes to this site only without also listing changes from the [[Neighbourhood]]:"},{"slug":"charrette","title":"Charrette","date":1469024572695,"synopsis":"A charrette, often Anglicized to charette or charet and sometimes called a design charrette, is an intense period of design or planning activity - [https://en.wikipedia.org/wiki/Charrette wikipedia]"},{"slug":"chris-hedges","title":"Chris Hedges","date":1508179180617,"synopsis":"Christopher Lynn Hedges (born September 18, 1956) is a Pulitzer Prize-winning American journalist, Presbyterian minister, and Princeton University professor. His books include War Is a Force That Gives Us Meaning (2002)—a finalist for the National Book Critics Circle Award for Nonfiction—Empire of Illusion: The End of Literacy and the Triumph of Spectacle (2009), Death of the Liberal Class (2010), The New York Times best seller, written with cartoonist Joe Sacco, Days of Destruction, Days of Revolt (2012), and his most recent Wages of Rebellion: The Mora"},{"slug":"citizenship","title":"Citizenship","date":1509806086047,"synopsis":"Citizenship is the status of a person recognized under the custom or law as being a legal member of a sovereign state or part of a nation - [https://en.wikipedia.org/wiki/Citizenship wikipedia]"},{"slug":"cohousing","title":"Cohousing","date":1509225583624,"synopsis":"Cohousing is an intentional community of private homes clustered around shared space. Each attached or single family home has traditional amenities, including a private kitchen."},{"slug":"community","title":"Community","date":1509816321772,"synopsis":"Here we list groups and organisations that are relevant to the purpose of this site:"},{"slug":"conflict-of-interest","title":"Conflict of interest","date":1510681189665,"synopsis":"A conflict of interest (COI) is a situation in which a person or organization is involved in multiple interests, financial or otherwise, one of which could possibly corrupt the motivation or decision-making of that individual or organization - [https://en.wikipedia.org/wiki/Conflict_of_interest wikipedia]"},{"slug":"consensus-decision-making","title":"Consensus decision-making","date":1509818455097,"synopsis":"Consensus decision-making is a group decision-making process in which group members develop, and agree to support a decision in the best interest of the whole. Consensus may be defined professionally as an acceptable resolution, one that can be supported, even if not the \"favourite\" of each individual. Consensus is defined by Merriam-Webster as, first, general agreement, and second, group solidarity of belief or sentiment. It has its origin in the Latin word cōnsēnsus (agreement), which is from cōnsentiō meaning literally feel together. It is used to des"},{"slug":"conversational-space","title":"Conversational Space","date":1509644572086,"synopsis":"Here we describe the architecture of conversation, in a system or design perspective, not as a singular temporal event but as a network process that occurs across time and space."},{"slug":"criticisms-of-pareto-efficiency","title":"Criticisms of Pareto efficiency","date":1515082345021,"synopsis":"It would be incorrect to treat Pareto efficiency as equivalent to societal optimization, as the latter is a [[normative]] concept that is a matter of interpretation that typically would account for the consequence of degrees of inequality of distribution."},{"slug":"deep-democracy","title":"Deep Democracy","date":1454022772717,"synopsis":"Is a form of [[democracy]] that goes further than voting."},{"slug":"deliberative-democracy","title":"Deliberative democracy","date":1510232371877,"synopsis":"Deliberative democracy or discursive democracy is a form of democracy in which deliberation is central to decision-making. It adopts elements of both consensus decision-making and majority rule - [https://en.wikipedia.org/wiki/Deliberative_democracy wikipedia]"},{"slug":"democracy","title":"Democracy","date":1491770935617,"synopsis":"Democracy is a system of government in which all the people of a state or polity are involved in making decisions about its affairs, typically by voting to elect representatives to a parliament or similar assembly."},{"slug":"democracy-activity","title":"Democracy Activity","date":1519815163138,"synopsis":"View all activity from [[Democracy Sites]] listed in the roster below:"},{"slug":"democracy-alliance","title":"Democracy Alliance","date":1509817401445,"synopsis":"The Democracy Alliance is a network of progressive donors who coordinate their political donations to groups that the Alliance has endorsed. As of 2015, the organization has approximately 110 partners who are required to contribute at least $200,000 a year to groups the Democracy Alliance vets and recommends. The Alliance has helped distribute approximately $500 million to liberal organizations since its founding in 2005. Members of the Democracy Alliance include billionaires George Soros and Tom Steyer - [https://en.wikipedia.org/wiki/Democracy_Alliance"},{"slug":"democracy-earth-foundation","title":"Democracy Earth Foundation","date":1509829570271,"synopsis":"Democracy Earth Foundation is a Y Combinator & Fast Forward backed non-profit building incorruptible digital governance for small and large communities in a post Nation-State world."},{"slug":"democracy-initiative","title":"Democracy Initiative","date":1509819252775,"synopsis":"The Democracy Initiative is a progressive coalition formed in late 2012 which had goals of restricting the unlimited monetary donations by corporations and the wealthy to political campaigns and causes permitted by the United States Supreme Court decision in Citizens United v. Federal Election Commission, supporting voters' rights, combating voter ID laws, and curbing aggressive use of the filibuster in the United States Senate. The coalition was formed at an invitation only meeting at National Education Association headquarters by the NEA, the Sierra Cl"},{"slug":"democracy-realized-the-progressive-alternative","title":"Democracy Realized: The Progressive Alternative","date":1509817376988,"synopsis":"Democracy Realized: The Progressive Alternative is a 1998 book by philosopher and politician Roberto Mangabeira Unger. In the book, Unger sets forth a program of \"democratic experimentalism\" that challenges and defies the neoliberal consensus that there are few alternatives for the progressive reform of democratic and market structures - [https://en.wikipedia.org/wiki/Democracy_Realized:_The_Progressive_Alternative wikipedia]"},{"slug":"democracy-sites","title":"Democracy Sites","date":1519815056680,"synopsis":"Here we list current sites related to [[Democracy]]. See [[Democracy Activity]] for a chronological view of all contributions."},{"slug":"democracyearth","title":"DemocracyEarth","date":1511548115208,"synopsis":"In a world that has succeeded in the globalization of financial assets while keeping political rights enclosed to territories, we need to build new models of democratic governance that enable humanity to collaborate and address pressing global issues."},{"slug":"democracyos","title":"DemocracyOS","date":1427374015465,"synopsis":"In the DemocracyOS software each citizen can either cast their vote or can delegate it on a trusted peer - [https://en.wikipedia.org/wiki/Net_Party#DemocracyOS wikipedia]"},{"slug":"democratic-preference","title":"Democratic Preference","date":1513551832501,"synopsis":"The ways we are able to express our ideas and political beliefs in a political process are currently very limited. Placing a cross on a piece of paper once ever 4 years is hardly the most expressive form of communication."},{"slug":"demographic-data","title":"Demographic Data","date":1509704528778,"synopsis":"Demographic data refers to data that is statistically socio-economic in nature such as population, race, income, education and employment, which represent specific geographic locations and are often associated with time."},{"slug":"demography","title":"Demography","date":1509704461711,"synopsis":"Demography is the statistical study of populations, especially human beings. As a very general science, it can analyze any kind of dynamic living population, i.e., one that changes over time or space (see population dynamics) - [https://en.wikipedia.org/wiki/Demography wikipedia]"},{"slug":"demography-and-politics","title":"Demography and Politics","date":1511264628929,"synopsis":"While I suggested in my post on Jonathan Last's \"What to Expect When No One's Expecting\" that reading about demographics in developed countries was not uplifting, the consequences described by Last could be considered pretty minor."},{"slug":"demography-of-london","title":"Demography of London","date":1509704335291,"synopsis":"The demography of London is analysed by the Office for National Statistics and data is produced for each of the Greater London wards, the City of London and the 32 London boroughs, the Inner London and Outer London statistical sub-regions, each of the Parliamentary constituencies in London, and for all of Greater London as a whole - [https://en.wikipedia.org/wiki/Demography_of_London wikipedia]"},{"slug":"diem-caf","title":"DIEM Café","date":1509277660189,"synopsis":"Here we explore ideas and experiments from the us of [[World Café]] experiments both online and offline for [[DIEM25]]."},{"slug":"diem-caf-software","title":"DIEM Café Software","date":1509277644681,"synopsis":"The current software implementation is in php. It's a simple LAMP stack that serves to manage table allocation for [[World Café]] events online."},{"slug":"diem25","title":"DiEM25","date":1510171887231,"synopsis":"The Democracy in Europe Movement 2025, or DiEM25, is a Pan-European political movement launched in 2015 by former Greek finance minister [[Yanis Varoufakis]]."},{"slug":"diem25-community","title":"DIEM25 Community","date":1510171655654,"synopsis":"Here we explore the [[DIEM25]] community. How to find DSC's and where to look online."},{"slug":"direct-action-network","title":"Direct Action Network","date":1509819831497,"synopsis":"Direct Action Network (DAN) was a North American confederation of anti-corporate, anti-authoritarian and anarchist affinity groups, collectives, and organizations. It grew out of the Seattle chapter which had been formed to coordinate the nonviolent civil disobedience portion of the anti-WTO mobilization in Seattle in 1999 - [https://en.wikipedia.org/wiki/Direct_Action_Network wikipedia]"},{"slug":"distributed-unconference","title":"Distributed Unconference","date":1433264636983,"synopsis":"We need to be able to hold rich distributed conversations. This is both a core part of the process of deliberation in the [[Parliament of Things]], and a bootstrapping process in order to enable us to design the tools and techniques that we need to support the construction of this new democracy. It is a pressing question of practice, not merely theory - [http://www.parliamentofthings.org/thing/distributed-unconferences/ parliamentofthings.org]"},{"slug":"diversity-index","title":"Diversity index","date":1515084467335,"synopsis":"A diversity index is a quantitative measure that reflects how many different types (such as species) there are in a dataset (a community), and simultaneously takes into account how evenly the basic entities (such as individuals) are distributed among those types - [https://en.wikipedia.org/wiki/Diversity_index wikipedia]"},{"slug":"dot-voting","title":"Dot-voting","date":1509820284399,"synopsis":"Dot-voting (also known as dotmocracy or voting with dots) is an established facilitation method used to describe voting with dot stickers or marks with a marker pen - [https://en.wikipedia.org/wiki/Dot-voting wikipedia]"},{"slug":"ekklesia","title":"Ekklesia","date":1509820750799,"synopsis":"The central events of the Athenian democracy were the meetings of the assembly. Unlike a parliament, the assembly's members were not elected, but attended by right when they chose."},{"slug":"epistemic-democracy","title":"Epistemic democracy","date":1510232819639,"synopsis":"Epistemic democracy is the \"doctrine of the wisdom of the multitude.\" - [https://en.wikipedia.org/wiki/Epistemic_democracy wikipedia]"},{"slug":"ethical-regulator","title":"Ethical regulator","date":1510966966374,"synopsis":"The ethical regulator theorem builds upon the good regulator theorem, which is ambiguous because being good at regulating does not imply being good ethically. \"The ethical regulator theorem claims that the following nine requisites are necessary and sufficient for a cybernetic regulator to be both effective and ethical: - [https://en.wikipedia.org/wiki/Ethical_regulator wikipedia]"},{"slug":"ethnic-groups-in-london","title":"Ethnic groups in London","date":1509703588545,"synopsis":"London is one of the most ethnically diverse cities in the world. In 2007 there were over 300 languages spoken in it and more than 50 non-indigenous communities with a population of more than 10,000 - [https://en.wikipedia.org/wiki/Ethnic_groups_in_London wikipedia]"},{"slug":"fake-news","title":"Fake news","date":1509637976283,"synopsis":"Fake news is a type of hoax or deliberate spread of misinformation (false information), be it via the traditional print or broadcasting news media or via Internet-based social media."},{"slug":"federation","title":"Federation","date":1508426080666,"synopsis":"Here we look at the concept of federation, from both social, political and a technical point of view."},{"slug":"fedwiki-tools","title":"Fedwiki Tools","date":1520583165956,"synopsis":"Here we list a few tools that are of particular use in managing and creating [[Fedwiki]] content."},{"slug":"finance","title":"Finance","date":1519928215243,"synopsis":"- Rebooting the Civic Commons -"},{"slug":"fishkins-model-of-deliberation","title":"Fishkin's model of deliberation","date":1510231080056,"synopsis":"[[James Fishkin]] and Robert Luskin suggest that deliberative discussion should be:"},{"slug":"fork-is-the-new-like","title":"Fork is the New Like","date":1418312729789,"synopsis":"A 'like' is a way of sharing attention with a new work and its author. We consider how federated wiki's 'fork' improves on the 'like' mechanism."},{"slug":"garden-of-ideas","title":"Garden Of Ideas","date":1510848527058,"synopsis":"​ Garden of Ideas (GOI) is the next generation of visitor attraction, a profit making, world-class cultural entertainment resort, that will add value to any city or new development."},{"slug":"geodemography","title":"Geodemography","date":1509703347978,"synopsis":"Geodemography includes the application of geodemographic classifications for business, social research and public policy but has a parallel history in academic research seeking to understand the processes by which settlements (notably, cities) evolve and neighborhoods are formed."},{"slug":"gini-coefficient","title":"Gini coefficient","date":1515084090028,"synopsis":"In economics, the Gini coefficient (sometimes expressed as a Gini ratio or a normalized Gini index) ( jee-nee) is a measure of statistical dispersion intended to represent the income or wealth distribution of a nation's residents, and is the most commonly used measure of inequality. It was developed by the Italian statistician and sociologist Corrado Gini and published in his 1912 paper Variability and Mutability - [https://en.wikipedia.org/wiki/Gini_coefficient wikipedia]"},{"slug":"globalnet21","title":"GlobalNet21","date":1504625678606,"synopsis":"GlobalNet 21 is a leading UK platform for discussing the major issues of the 21st Century, where we share a common concern for the sustainability of both our planet and the people on it - [https://www.meetup.com/GlobalNet21/ meetup.com]"},{"slug":"good-regulator","title":"Good regulator","date":1510996653195,"synopsis":"The good regulator is a theorem conceived by Roger C. Conant and W. Ross Ashby that is central to cybernetics  - [https://en.wikipedia.org/wiki/Good_regulator wikipedia]"},{"slug":"governance","title":"Governance","date":1509882175933,"synopsis":"Here we gather notes and research [[Governance]],"},{"slug":"guardians","title":"Guardians","date":1511039834182,"synopsis":"Below are a collection of links imported from [[OneTab]]. You can view these links here - [https://www.one-tab.com/page/i4TnFOLmRwK30phbrBEBwg one-tab.com]:"},{"slug":"hand-signaling-open-outcry","title":"Hand signaling (open outcry)","date":1509820151659,"synopsis":"Hand signaling, also known as arb or arbing (short for arbitrage), is a system of hand signals used on financial trading floors to communicate buy and sell information in an open outcry trading environment. The system is used at financial exchanges such as the Chicago Mercantile Exchange (CME) and the American Stock Exchange (AMEX). The AMEX is the only U.S. stock market to permit the transmission of buy and sell orders through hand signals - [https://en.wikipedia.org/wiki/Hand_signaling_(open_outcry) wikipedia]"},{"slug":"harkness-table","title":"Harkness table","date":1514732602297,"synopsis":"The Harkness table, Harkness method, or Harkness discussion is a teaching and learning method involving students seated in a large, oval configuration to discuss ideas in an encouraging, open-minded environment with only occasional or minimal teacher intervention. The method is in use at many American boarding schools and colleges and encourages classes to be held in a discursive manner - [https://en.wikipedia.org/wiki/Harkness_table wikipedia]"},{"slug":"health-care-reform","title":"Health care reform","date":1509817572180,"synopsis":"In 2009, the [[Congressional Progressive Caucus]] outlined five key healthcare principles they intended to pass into law. The CPC mandated a nationwide public option, affordable health insurance, insurance market regulations, an employer insurance provision mandate, and comprehensive services for children.[https://cpc-grijalva.house.gov/health-care-reform/cpc-releases-health-care-principles/ Congressional Progressive Caucus : Health Care Reform : CPC Releases Health Care Principles] In March 2010, Congress passed the [[Patient Protection and Affordable C"},{"slug":"heiner-benking","title":"Heiner Benking","date":1534411882285,"synopsis":"Heiner Benking is an internationally known independent journalist and science writer/curator. His background is in Geophysics. He is a strong supporter of Future Worlds Center and its Structured Democratic Dialogue applications since 2008."},{"slug":"history-of-citizenship","title":"History of citizenship","date":1509806465766,"synopsis":"History of citizenship describes the changing relation between an individual and the state, commonly known as citizenship. Citizenship is generally identified not as an aspect of Eastern civilization but of Western civilization. There is a general view that citizenship in ancient times was a simpler relation than modern forms of citizenship, although this view has been challenged - [https://en.wikipedia.org/wiki/History_of_citizenship wikipedia]"},{"slug":"holochain","title":"Holochain","date":1514134906111,"synopsis":"Holographic storage for distributed applications. A holochain is a validating distributed hash table (DHT) where every node enforces validation rules on data against the signed chains where the data originated - [http://ceptr.org/projects/holochain ceptr.org]"},{"slug":"human-microphone","title":"Human microphone","date":1509820169009,"synopsis":"A human microphone, also known as the people's microphone, is a means for delivering a speech to a large group of people, wherein persons gathered around the speaker repeat what the speaker says, thus \"amplifying\" the voice of the speaker without the need for amplification equipment - [https://en.wikipedia.org/wiki/Human_microphone wikipedia]"},{"slug":"hypernormalisation","title":"HyperNormalisation","date":1510010217256,"synopsis":"HyperNormalisation is a 2016 BBC documentary by British filmmaker Adam Curtis. In the film, Curtis argues that since the 1970s, governments, financiers, and technological utopians have given up on the complex \"real world\" and built a simple \"fake world\" that is run by corporations and kept stable by politicians. The film was released on 16 October 2016 on the BBC iPlayer - [https://en.wikipedia.org/wiki/HyperNormalisation wikipedia]"},{"slug":"inquiry-workflow","title":"Inquiry Workflow","date":1449883057455,"synopsis":"We suggest a workflow that might allow participants in this [[Experimental Interview]] to assert some direction upon the writing of others."},{"slug":"institute-of-art--ideas","title":"Institute of Art & Ideas","date":1506805874757,"synopsis":"<video src=\"http://iai.tv/assets/videos/linked/HTLGI2015_85_AftertheEndofTruthHD.mp4\" width=100% controls></video>"},{"slug":"interview-pod-charter","title":"Interview Pod Charter","date":1450020536803,"synopsis":"We describe how we will collectively author a single chapter based on what we are calling an [[Experimental Interview]]."},{"slug":"invisible-hand","title":"Invisible hand","date":1508425076716,"synopsis":"The invisible hand is a term used by Adam Smith to describe the unintended social benefits of individual self-interested actions. The phrase was employed by Smith with respect to income distribution (1759) and production (1776). The exact phrase is used just three times in Smith's writings, but has come to capture his notion that individuals' efforts to pursue their own interest may frequently benefit society more than if their actions were directly intending to benefit society. Smith may have come up with the two meanings of the phrase from Richard Cant"},{"slug":"isought-problem","title":"Is–ought problem","date":1509637691778,"synopsis":"The is–ought problem, as articulated by Scottish philosopher and historian David Hume (1711–76), states that many writers make claims about what ought to be on the basis of statements about what is. Hume found that there seems to be a significant difference between positive statements (about what is) and prescriptive or normative statements (about what ought to be), and that it is not obvious how one can coherently move from descriptive statements to prescriptive ones. The is–ought problem is also known as Hume's law, or Hume's guillotine - [https://en.w"},{"slug":"james-fishkin","title":"James Fishkin","date":1510231051146,"synopsis":"[[James S. Fishkin]] (born 1948) holds the Janet M. Peck Chair in International Communication in the Department of Communication at Stanford University, where he is professor of communication and (by courtesy) professor of political science - [https://en.wikipedia.org/wiki/James_S._Fishkin wikipedia]"},{"slug":"james-s-fishkin","title":"James S. Fishkin","date":1510227905956,"synopsis":"James S. Fishkin (born 1948) holds the Janet M. Peck Chair in International Communication in the Department of Communication at Stanford University, where he is professor of communication and (by courtesy) professor of political science - [https://en.wikipedia.org/wiki/James_S._Fishkin wikipedia]"},{"slug":"jonas-staal","title":"Jonas Staal","date":1509641044686,"synopsis":"Jonas Staal  is a Dutch visual artist. His work deals with the relationship between art, politics and ideology and has often generated public debate - [http://www.jonasstaal.nl/ jonasstaal.nl]"},{"slug":"joshua-cohen-philosopher","title":"Joshua Cohen (philosopher)","date":1510232764437,"synopsis":"Joshua Cohen (; born 1951) is an American philosopher specializing in [[political philosophy]] - [https://en.wikipedia.org/wiki/Joshua_Cohen_(philosopher) wikipedia]"},{"slug":"konrad-kellen","title":"Konrad Kellen","date":1515853168320,"synopsis":"Konrad Kellen (December 14, 1913 – April 8, 2007) was a German-born American political scientist, intelligence analyst and author - [https://en.wikipedia.org/wiki/Konrad_Kellen wikipedia]"},{"slug":"law-of-requisite-variety","title":"Law of Requisite Variety","date":1510997092547,"synopsis":"If a system is to be stable, the number of states of its control mechanism must be greater than or equal to the number of states in the system being controlled."},{"slug":"legislative-theatre","title":"Legislative Theatre","date":1429365294847,"synopsis":"Legislative Theatre is an extension of Augusto Boal's [[Forum Theatre]] techniques and functions to determine the need for, create, and enact laws. Beyond community building and issue awareness. Legislative Theatre uses theatrical techniques to create concrete and specific socio-political impact."},{"slug":"leon-gour","title":"Leon Gouré","date":1515852927326,"synopsis":"Leon Gouré (November 1, 1922 – March 16, 2007) was a Russian-born American political scientist and analyst. His studies for the RAND Corporation were important influences on US policy in the 1960s and 1970s, particularly on civil defense preparedness in the Soviet Union, and on the morale of the Viet Cong in Vietnam - [https://en.wikipedia.org/wiki/Leon_Gour%C3%A9 wikipedia]"},{"slug":"liquid-democracy","title":"Liquid Democracy","date":1513460674080,"synopsis":"Liquid Democracy is a combination of [[Direct Democracy]], and [[Representative Democracy]]. It aims to create a more flexible and fluid way for people to express their [[Democratic Preference]]."},{"slug":"lorenz-curve","title":"Lorenz curve","date":1515084038408,"synopsis":"In economics, the Lorenz curve is a graphical representation of the distribution of income or of wealth. It was developed by Max O. Lorenz in 1905 for representing inequality of the wealth distribution - [https://en.wikipedia.org/wiki/Lorenz_curve wikipedia]"},{"slug":"magic-roundtable","title":"Magic Roundtable","date":1534411776600,"synopsis":"Magic Roundtables are a deliberative technique used to encourage equal participation on one or more issues."},{"slug":"margaret-thatcher","title":"Margaret Thatcher","date":1508424952823,"synopsis":"Margaret Hilda Thatcher, Baroness Thatcher,  (née Roberts; 13 October 1925 – 8 April 2013) was a British stateswoman who was Prime Minister of the United Kingdom from 1979 to 1990 and Leader of the Conservative Party from 1975 to 1990."},{"slug":"minimum-wage","title":"Minimum wage","date":1509817628844,"synopsis":"Adjusted for inflation, the minimum wage peaked in 1968 at $8.54 (in 2014 dollars).[http://www.pewresearch.org/fact-tank/2015/07/23/5-facts-about-the-minimum-wage/ 5 facts about the minimum wage] Progressives believe that stagnating wages perpetuate income inequality and that raising the minimum wage is a necessary step to combat inequality.<ref name=\":2\" /> If the minimum wage grew at the rate of productivity growth in the United States, it would be $21.72 an hour, nearly three times as much as the current $7.25 an hour.[http://cepr.net/documents/public"},{"slug":"mitigating-income-inequality","title":"Mitigating income inequality","date":1509817697068,"synopsis":"[[Income inequality in the United States]] has been on the rise since 1970, as the wealthy continue to hold more and more wealth and income.[http://eds.b.ebscohost.com/eds/detail/detail?vid=7&sid=214030dc-b494-4400-8415-c5a0236e82b5@sessionmgr104&hid=114&bdata=JnNpdGU9ZWRzLWxpdmU=#AN=99389508&db=bth Trends and Sources of Income Inequality in the United States: Start Your Search!] For example, 95% of income gains from 2009 to 2013 went to the top 1% of wage earners in the United States.<!-- This figure is generally misleading on the grounds that it is sou"},{"slug":"momentum-organisation","title":"Momentum (organisation)","date":1508116550915,"synopsis":"Momentum is a left-wing, British political organisation. It was founded in 2015 by Jon Lansman, four weeks after Jeremy Corbyn's successful campaign for the Labour Party leadership. It has been described as a grassroots movement supportive of Corbyn and the Labour Party - [https://en.wikipedia.org/wiki/Momentum_(organisation) wikipedia]"},{"slug":"neoliberalism","title":"Neoliberalism","date":1508285320826,"synopsis":"Neoliberalism or neo-liberalism refers primarily to the 20th-century resurgence of 19th-century ideas associated with laissez-faire economic liberalism. Such ideas include economic liberalization policies such as privatization, austerity, deregulation, free trade, and reductions in government spending in order to increase the role of the private sector in the economy and society. These market-based ideas and the policies they inspired constitute a paradigm shift away from the post-war Keynesian consensus which lasted from 1945 to 1980 - [https://en.wikip"},{"slug":"net-party","title":"Net Party","date":1508116783902,"synopsis":"The Net Party (Partido de la Red, in Spanish) is a political party headquartered in Argentina, with a global projection based on the Internet, that proposes an online form of liquid democracy that it calls \"net democracy\", with the goal electing representatives who will reliably vote according to what the citizenry decide online - [https://en.wikipedia.org/wiki/Net_Party wikipedia]"},{"slug":"niklas-luhmann","title":"Niklas Luhmann","date":1509637530073,"synopsis":"Niklas Luhmann (December 8, 1927 – November 6, 1998) was a German sociologist, and a prominent thinker in systems theory, who is increasingly recognized as one of the most important social theorists of the 20th century - [https://en.wikipedia.org/wiki/Niklas_Luhmann wikipedia]"},{"slug":"noam-chomsky","title":"Noam Chomsky","date":1508176954541,"synopsis":"Avram Noam Chomsky (US:  a-VRAHM NOHM CHOM-skee; born December 7, 1928) is an American linguist, philosopher, cognitive scientist, historian, social critic, and political activist. Sometimes described as \"the father of modern linguistics,\" Chomsky is also a major figure in analytic philosophy and one of the founders of the field of cognitive science. He is the author of over 100 books on topics such as linguistics, war, politics, and mass media. Ideologically, he aligns with anarcho-syndicalism and libertarian socialism. He holds a joint appointment as I"},{"slug":"normative-science","title":"Normative science","date":1509638412106,"synopsis":"In the applied sciences, normative science is a type of information that is developed, presented, or interpreted based on an assumed, usually unstated, preference for a particular policy or class of policies. Regular or traditional science does not presuppose a policy preference, but normative science, by definition, does - [https://en.wikipedia.org/wiki/Normative_science wikipedia]"},{"slug":"notenough","title":"#NotEnough","date":1513552615779,"synopsis":"#NotEnough is an art project from 2013. The idea is for people to take a photo of themselves showing the number of votes they expect to have left to express an entire lifetime of values and beliefs."},{"slug":"occupy-methods","title":"Occupy Methods","date":1510172076557,"synopsis":"Activists have used web technologies and social media like [[IRC]], [[Facebook]], [[Twitter]], and Meetup ([[Meetup (website)]]) to coordinate events."},{"slug":"occupy-movement","title":"Occupy movement","date":1509818655450,"synopsis":"The Occupy movement is an international socio-political movement against social and economic inequality and lack of \"real democracy\" around the world, its primary goal being to advance social and economic justice and new forms of democracy - [https://en.wikipedia.org/wiki/Occupy_movement wikipedia]"},{"slug":"occupy-movement-hand-signals","title":"Occupy movement hand signals","date":1509819732278,"synopsis":"The [[Occupy movement]] hand signals are a group of hand signals used by Occupy Wall Street protesters to negotiate a consensus. The signals have been equated with other hand languages used by soldiers, cliques, or even Wall Street traders - [https://en.wikipedia.org/wiki/Occupy_movement_hand_signals wikipedia]"},{"slug":"one-hundred-percent","title":"One Hundred Percent","date":1509711196935,"synopsis":"This is a derivative work based on [[Rimini Protokoll]]s [[100 % City]] - [https://vimeo.com/riminiprotokoll vimeo]"},{"slug":"open-collective","title":"Open Collective","date":1509829946639,"synopsis":"While the Internet has been very good so far at helping people do things together, it is still very difficult for groups to collect money and use it transparently. As a result, we see initiatives, projects, movements popping up here and there that disappear quickly from lack of funding."},{"slug":"open-data","title":"Open data","date":1509703436559,"synopsis":"Open data is the idea that some data should be freely available to everyone to use and republish as they wish, without restrictions from copyright, patents or other mechanisms of control - [https://en.wikipedia.org/wiki/Open_data wikipedia]"},{"slug":"pareto-efficiency","title":"Pareto efficiency","date":1515082374243,"synopsis":"Pareto efficiency or Pareto optimality is a state of allocation of resources from which it is impossible to reallocate so as to make any one individual or preference criterion better off without making at least one individual or preference criterion worse off. The concept is named after Vilfredo Pareto (1848–1923), Italian engineer and economist, who used the concept in his studies of economic efficiency and income distribution. The concept has been applied in academic fields such as economics, engineering, and the life sciences - [https://en.wikipedia.o"},{"slug":"pareto-optimality","title":"Pareto optimality","date":1515082692381,"synopsis":"[[Pareto optimality]] is a formally defined concept used to determine when an allocation ([[resource allocation]]) is optimal."},{"slug":"pareto-principle","title":"Pareto principle","date":1515083648845,"synopsis":"The Pareto principle (also known as the 80/20 rule, the law of the vital few, or the principle of factor sparsity) states that, for many events, roughly 80% of the effects come from 20% of the causes - [https://en.wikipedia.org/wiki/Pareto_principle wikipedia]"},{"slug":"participation-inequality","title":"Participation inequality","date":1515081252966,"synopsis":"In social sciences, participation inequality consists of difference between levels of participation of various groups in certain activities - [https://en.wikipedia.org/wiki/Participation_inequality wikipedia]"},{"slug":"pentagon-papers","title":"Pentagon Papers","date":1515853536245,"synopsis":"The Pentagon Papers, officially titled United States – Vietnam Relations, 1945–1967: A Study Prepared by the Department of Defense, is a United States Department of Defense history of the United States' political-military involvement in Vietnam from 1945 to 1967 - [https://en.wikipedia.org/wiki/Pentagon_Papers wikipedia]"},{"slug":"phylogenetic-tree","title":"Phylogenetic tree","date":1509192844479,"synopsis":"A phylogenetic tree or evolutionary tree is a branching diagram or \"tree\" showing the inferred evolutionary relationships among various biological species or other entities—their phylogeny—based upon similarities and differences in their physical or genetic characteristics. The taxa joined together in the tree are implied to have descended from a common ancestor. Phylogenetic trees are central to the field of phylogenetics - [https://en.wikipedia.org/wiki/Phylogenetic_tree wikipedia]"},{"slug":"pia-mancini","title":"Pia Mancini","date":1508116770010,"synopsis":"Pia Mancini is an innovator of liquid democracy and trans-national collaboration. Her TED talk, How to Upgrade Democracy for the Modern Era, received over a million views - [https://en.wikipedia.org/wiki/Pia_Mancini wikipedia]"},{"slug":"podemos-spanish-political-party","title":"Podemos (Spanish political party)","date":1509817882747,"synopsis":"[[Podemos]] (translated in English as \"We can\") is a left-wing political party in Spain - [https://en.wikipedia.org/wiki/Podemos_(Spanish_political_party) wikipedia]"},{"slug":"political-conversation","title":"Political Conversation","date":1468079445124,"synopsis":"How to turn the political conversation around"},{"slug":"politics-of-nature","title":"Politics of Nature","date":1425155310369,"synopsis":"Politics of Nature: How to Bring the Sciences Into Democracy - is an influential book by the French theorist and philosopher of science [[Bruno Latour]] - [https://en.wikipedia.org/wiki/Politics_of_Nature Wikipedia]."},{"slug":"population-geography","title":"Population geography","date":1509700010779,"synopsis":"Population geography is a division of human geography. It is the study of the ways in which spatial variations in the distribution, composition, migration, and growth of populations are related to the nature of places - [https://en.wikipedia.org/wiki/Population_geography wikipedia]"},{"slug":"post-democracy","title":"Post-Democracy","date":1509730945990,"synopsis":"[http://markcarrigan.net/2015/01/11/what-will-post-democracy-look-like/ Interesting post by Mark Carrigan] that mirrors a couple of recent conversations I've had on similar topics e.g. the illusion of democratic functions when money buys the ability to set the agenda."},{"slug":"power-of-fork","title":"Power of Fork","date":1509194056527,"synopsis":"In politics there is little understanding of the importance and relevance of the concept of \"forking\" that originates in the world of software development."},{"slug":"problem-of-the-centre","title":"Problem of the Centre","date":1513904586324,"synopsis":"Group organisation traditionally requires a coordinated central management group or committee. This is no simple task. Here we explore some of the known and documented issues they face."},{"slug":"progressive-alliance","title":"Progressive alliance","date":1508107855014,"synopsis":"The Progressive Alliance is an international coalition of social-democratic political parties founded in 2013 - [https://en.wikipedia.org/wiki/Progressive_Alliance_(disambiguation) wikipedia]"},{"slug":"progressive-democracy","title":"Progressive Democracy","date":1509817990183,"synopsis":"With the rise in popularity of self-proclaimed progressives such as [[Bernie Sanders]] and [[Elizabeth Warren]], the term began to carry greater cultural currency, particularly in the [[2016 Democratic primaries]]."},{"slug":"progressive-movements","title":"Progressive Movements","date":1510171999144,"synopsis":"Here we list progressive movements in Europe and around the world:"},{"slug":"progressive-party-brazil","title":"Progressive Party (Brazil)","date":1509818428261,"synopsis":"The Progressive Party (Portuguese: Partido Progressista, PP) is a centre-right and conservative-liberal political party in Brazil - [https://en.wikipedia.org/wiki/Progressive_Party_(Brazil) wikipedia]"},{"slug":"progressive-party-iceland","title":"Progressive Party (Iceland)","date":1509817392149,"synopsis":"The Progressive Party (Icelandic: Framsóknarflokkurinn, FSF) is a centre-right, populist and agrarian political party in Iceland - [https://en.wikipedia.org/wiki/Progressive_Party_(Iceland) wikipedia]"},{"slug":"progressive-stack","title":"Progressive stack","date":1509818440567,"synopsis":"A progressive stack is a technique used to give marginalized groups a greater chance to speak. It is sometimes an introduction to, or stepping stone to, consensus decision-making in which simple majorities have less power - [https://en.wikipedia.org/wiki/Progressive_stack wikipedia]"},{"slug":"progressive-thinkers","title":"Progressive thinkers","date":1508117196726,"synopsis":"Here are some links and references to progressive thinkers from around the world:"},{"slug":"progressivism","title":"Progressivism","date":1509817292338,"synopsis":"Progressivism is the support for or advocacy of social reform. As a philosophy, it is based on the Idea of Progress, which asserts that advancements in science, technology, economic development, and social organization are vital to the improvement of the human condition - [https://en.wikipedia.org/wiki/Progressivism wikipedia]"},{"slug":"progressivism-in-the-united-states","title":"Progressivism in the United States","date":1509817419820,"synopsis":"Progressivism in the United States is a broadly based reform movement that reached its height early in the 20th century and is generally considered to be middle class and reformist in nature. It arose as a response to the vast changes brought by modernization, such as the growth of large corporations, pollution and fears of corruption in American politics. In the 21st century, progressives continue to embrace concepts such as environmentalism and social justice. Social progressivism, the view that governmental practices ought to be adjusted as society ev"},{"slug":"public-sphere","title":"Public sphere","date":1509806738241,"synopsis":"The public sphere (German Öffentlichkeit) is an area in social life where individuals can come together to freely discuss and identify societal problems, and through that discussion influence political action - [https://en.wikipedia.org/wiki/Public_sphere wikipedia]"},{"slug":"quakers","title":"Quakers","date":1509820493293,"synopsis":"Quakers are members of a historically Christian group of religious movements formally known as the Religious Society of Friends, or Friends Church - [https://en.wikipedia.org/wiki/Quakers wikipedia]"},{"slug":"razem","title":"Razem","date":1510171828532,"synopsis":"Partia Razem (Together Party) is a left-wing political party in Poland formed in May 2015. It was one of the eight nationwide committees standing in the 2015 parliamentary election - [https://en.wikipedia.org/wiki/Razem wikipedia]"},{"slug":"ricardo-semler","title":"Ricardo Semler","date":1427110835320,"synopsis":"Ricardo Semler (born 1959 in S√£o Paulo) is the CEO and majority owner of Semco Partners, a Brazilian company best known for its radical form of industrial democracy and corporate re-engineering - [https://en.wikipedia.org/wiki/Ricardo_Semler wikipedia]"},{"slug":"rimini-protokoll","title":"Rimini Protokoll","date":1509641491249,"synopsis":"Rimini Protokoll works in the realm of theater, sound and radio plays, film and installation emerge in constellations of two or three and solo as well."},{"slug":"roberts-rules-of-order","title":"Robert's Rules of Order","date":1509820344230,"synopsis":"Robert's Rules of Order Newly Revised, commonly referred to as Robert’s Rules of Order (or simply Robert’s Rules), is the most widely used manual of parliamentary procedure in the United States. It governs the meetings of a diverse range of organizations—including church groups, county commissions, homeowners associations, nonprofit associations, professional societies, school boards, and trade unions—that have adopted it as their parliamentary authority - [https://en.wikipedia.org/wiki/Robert%27s_Rules_of_Order wikipedia]"},{"slug":"saigon-1965","title":"Saigon, 1965","date":1515857727636,"synopsis":"This podcast tells the story about [[Mai Elliot]], [[Leon Gouré]] (from Rand), and [[Konrad Kellen]] about the [[Vietnam Motivation and Moral Project]]. It is about intelligence failure."},{"slug":"schism","title":"Schism","date":1509193815639,"synopsis":"A schism is a division between people, usually belonging to an organization, movement, or religious denomination."},{"slug":"shannon-index","title":"Shannon index","date":1515084935076,"synopsis":"The Shannon index has been a popular diversity index in the ecological literature, where it is also known as Shannon's diversity index, the Shannon–Wiener index, the Shannon–Weaver ([[Warren Weaver]]) index and the Shannon entropy."},{"slug":"simpson-index","title":"Simpson index","date":1515084967989,"synopsis":"The Simpson index was introduced in 1949 by [[Edward H. Simpson]] to measure the degree of concentration when individuals are classified into types."},{"slug":"smart-voting","title":"Smart Voting","date":1509835776928,"synopsis":"Below are a collection of links imported from [[OneTab]]. You can view these links here - [https://www.one-tab.com/page/dVeAr_OhSyKN6AP7euCuDQ one-tab.com]:"},{"slug":"socratic-method","title":"Socratic method","date":1514732643955,"synopsis":"The Socratic method, also can be known as maieutics, method of elenchus, elenctic method, or Socratic debate, is a form of cooperative argumentative dialogue between individuals, based on asking and answering questions to stimulate critical thinking and to draw out ideas and underlying presumptions - [https://en.wikipedia.org/wiki/Socratic_method wikipedia]"},{"slug":"sound-garden","title":"Sound Garden","date":1502030182518,"synopsis":"The Sound Garden installation uses spatialised or 3D [[Immersive Sound]] to reflect the location of the speakers in geographical or conceptual space."},{"slug":"sovereignty-question","title":"Sovereignty Question","date":1471262365583,"synopsis":"# See also"},{"slug":"sovrin","title":"Sovrin","date":1519434332879,"synopsis":"The [[Sovrin Foundation]] is a private-sector, international non-profit that was established to govern the world’s first [[Self-sovereign Identity Network]]."},{"slug":"spaces","title":"Spaces","date":1515499178887,"synopsis":"Here we list spaces that are of interest, that we may be able to twin with, organise discussions, and research together:"},{"slug":"stalker","title":"Stalker","date":1509640120202,"synopsis":"Stalker is a collective of architects and researchers connected to the Roma Tre University who came together in the mid-1990s. In 2002, Stalker founded the research network Osservatorio Nomade (ON), which consists of architects, artists, activists and researchers working experimentally and engaging in actions to create self-organised spaces and situations - [http://www.spatialagency.net/database/how/networking/stalkerosservatorio.nomade spatialagency.net]"},{"slug":"syriza","title":"Syriza","date":1509816307448,"synopsis":"The Coalition of the Radical Left, mostly known by the syllabic abbreviation Syriza (a Greek adverb meaning \"from the roots\" or \"radically\"), is a left-wing political party in Greece, founded in 2004 as a coalition of left-wing and radical left parties - [https://en.wikipedia.org/wiki/Syriza wikipedia]"},{"slug":"systems-theory","title":"Systems theory","date":1509637405797,"synopsis":"A page with 0 items."},{"slug":"tactical-voting","title":"Tactical voting","date":1508116388880,"synopsis":"In voting methods, tactical voting (or strategic voting or sophisticated voting or insincere voting) occurs, in elections with more than two candidates, when a voter supports another candidate more strongly than their sincere preference in order to prevent an undesirable outcome - [https://en.wikipedia.org/wiki/Tactical_voting wikipedia]"},{"slug":"talking-to-the-enemy","title":"Talking To The Enemy","date":1470598328088,"synopsis":"Amaryllis Fox's secret life in the CIA taught her one lesson: Listen to your enemy. As she begins the process of having her CIA cover rolled back, this is the first time she has spoken publicly about working undercover."},{"slug":"technical-platforms","title":"Technical Platforms","date":1508421490057,"synopsis":"Here we research and review technologies and platforms for progressive politics."},{"slug":"the-alternative-denmark","title":"The Alternative (Denmark)","date":1510171844205,"synopsis":"The Alternative (Danish: Alternativet) is a green political party in Denmark. The party was publicly launched on 27 November 2013 by former Minister of Culture Uffe Elbæk and Josephine Fock, both of whom had been Members of Parliament for the Social Liberal Party - [https://en.wikipedia.org/wiki/The_Alternative_(Denmark) wikipedia]"},{"slug":"the-century-of-the-self","title":"The Century of the Self","date":1509900425245,"synopsis":"The Century of the Self is a 2002 British television documentary series by filmmaker [[Adam Curtis]]. It focuses on the work of psychoanalysts Sigmund Freud and Anna Freud, and PR consultant [[Edward Bernays]] - [https://en.wikipedia.org/wiki/The_Century_of_the_Self wikipedia]"},{"slug":"the-compass---bbc-world-service","title":"The Compass - BBC World Service","date":1510962326682,"synopsis":"The Compass - exploring our world- [http://www.bbc.co.uk/programmes/p035w97h co.uk]"},{"slug":"the-fatal-conceit","title":"The Fatal Conceit","date":1498547310766,"synopsis":"The Fatal Conceit: The Errors of Socialism is a non-fiction book written by the economist and political philosopher [[Friedrich Hayek]] and edited by William Warren Bartley."},{"slug":"the-federation","title":"The Federation","date":1508423227601,"synopsis":"Here we describe the The Federation. We should use this term wisely. It describes quite clearly the social aspects of this project, while also pointing gently towards [[Star Trek]] and the future of the [[Decentralised Web]]."},{"slug":"the-swarm-project","title":"The SWARM Project","date":1511264794821,"synopsis":"Developing a new type of platform for collaborative intelligence analysis, combining crowdsourcing with new structured analytical techniques."},{"slug":"the-wise-democracy-pattern-language","title":"The Wise Democracy Pattern Language","date":1508513451474,"synopsis":"The 3 Dimensions: Power, Participation, Wisdom. [https://i1.wp.com/www.wd-pl.com/wp-content/uploads/Venn-Merge-Film-2.png?resize=300%2C240 source]"},{"slug":"the-woodcraft-folk","title":"The Woodcraft Folk","date":1509819819558,"synopsis":"Woodcraft Folk is a UK-based educational movement for children and young people. Founded in 1925 and grown by volunteers, it has been a registered charity since 1965 and a registered company limited by guarantee since 2012. The constitutional object of this youth organisation is \"to educate and empower young people to be able to participate actively in society, improving their lives and others' through active citizenship.\" - [https://en.wikipedia.org/wiki/The_Woodcraft_Folk wikipedia]"},{"slug":"the-world-transformed","title":"The World Transformed","date":1508117675858,"synopsis":"From 24 September 2016, Momentum held a four-day fringe festival alongside the Labour Party conference in Liverpool. Foregrounding art, music and culture alongside political discussions, 'The World Transformed'."},{"slug":"theil-index","title":"Theil index","date":1515083384026,"synopsis":"The Theil index is a statistic primarily used to measure economic inequality and other economic phenomena, though it has also been used to measure racial segregation - [https://en.wikipedia.org/wiki/Theil_index wikipedia]"},{"slug":"there-is-no-such-thing-as-society","title":"There is no such thing as society","date":1508425863577,"synopsis":"Here we look at the idea that there is no such thing as society. The phrase is often (somewhat unfairly) attributed to [[Margret Thatcher]], but the underlying philosophy which is derived from [[Adam Smith]] and the [[Invisible Hand]], through"},{"slug":"thought-garden-project-activity","title":"Thought Garden Project Activity","date":1503250152070,"synopsis":"View all activity from the [[Thought Garden Projects]] roster below:"},{"slug":"truth","title":"Truth","date":1509638359249,"synopsis":"Truth is most often used to mean being in accord with fact or reality, or fidelity to an original or standard. Truth may also often be used in modern contexts to refer to an idea of \"truth to self,\" or authenticity - [https://en.wikipedia.org/wiki/Truth wikipedia]"},{"slug":"uk-uncut","title":"UK Uncut","date":1509819776907,"synopsis":"UK Uncut was a network of United Kingdom-based protest groups established in October 2010 to protest against cuts to public services and tax avoidance in the UK. Various sources have described the group as left-wing in its political orientation - [https://en.wikipedia.org/wiki/UK_Uncut wikipedia]"},{"slug":"unison","title":"UniSon","date":1509377179458,"synopsis":"I saw the closing matinee of UniSon last week. It was, as you told me, fabulous. What you didn't tell me is that I would want to see it again, immediately. But no, that can't happen now. [https://www.osfashland.org/en/productions/2017-plays/unison.aspx osf]"},{"slug":"uport","title":"uPort","date":1518885696902,"synopsis":"uPort gives users direct control of their identity, and developers direct control of how this identity system is integrated. Self-sovereign identity requires an entire ecosystem, so supporting the community building it with us is our #1 priority - [https://www.uport.me/about/  uport.me]"},{"slug":"user-generated-content","title":"User-generated content","date":1515081291952,"synopsis":"User-generated content (UGC), alternatively known as user-created content, is any form of content created by users of a system or service and made available publicly on that system - [https://en.wikipedia.org/wiki/User-generated_content wikipedia]"},{"slug":"user-mode-preeminence","title":"User-mode Preeminence","date":1507126935375,"synopsis":"At the moment Fedwiki is constructed in the interest of the writer, we may even say the advanced writer. Let's call this mode of experience the Author Mode."},{"slug":"variety-cybernetics","title":"Variety (cybernetics)","date":1510996846374,"synopsis":"In cybernetics, the term variety denotes the total number of distinct states of a system - [https://en.wikipedia.org/wiki/Variety_(cybernetics) wikipedia]"},{"slug":"vendor-lock-in","title":"Vendor lock-in","date":1508325626687,"synopsis":"In economics, vendor lock-in, also known as proprietary lock-in or customer lock-in, makes a customer dependent on a vendor for products and services, unable to use another vendor without substantial switching costs. Lock-in costs which create barriers to market entry may result in antitrust action against a monopoly - [https://en.wikipedia.org/wiki/Vendor_lock-in wikipedia]"},{"slug":"video-conferencing-platforms","title":"Video Conferencing Platforms","date":1509277543047,"synopsis":"Here we list other technologies that we can build on (particularly [[WebRTC]]) in order to create the functionality we need for a truly [[Democratic Deliberation Platform]]."},{"slug":"voter-turnout","title":"Voter turnout","date":1509827800180,"synopsis":"Voter turnout is the percentage of eligible voters who cast a ballot in an election. Eligibility varies by country, and the voting-eligible population should not be confused with the total adult population. Age and citizenship status are often among the criteria used to determine eligibility, but some countries further restrict eligibility based on sex, race, and/or religion - [https://en.wikipedia.org/wiki/Voter_turnout wikipedia]"},{"slug":"w-ross-ashby","title":"W. Ross Ashby","date":1511264699741,"synopsis":"W. Ross Ashby (6 September 1903 in London – 15 November 1972) was an English psychiatrist and a pioneer in [[cybernetics]], the study of the science of communications and automatic control systems in both machines and living things. His first name was not used: he was known as Ross Ashby - [https://en.wikipedia.org/wiki/W._Ross_Ashby wikipedia]"},{"slug":"walking-charrette","title":"Walking Charrette","date":1469024012791,"synopsis":"The proposal is that we organise a series of events, supported by a from of writing and research that uses wiki, but is based on the physical act of walking and discussing ideas of relevance the the physical location of the walk."},{"slug":"wall-street-reform","title":"Wall Street reform","date":1509817689329,"synopsis":"Progressives began to demand stronger Wall Street regulation after they perceived deregulation and relaxed enforcement as leading to the financial crisis of 2008. Passing the Dodd-Frank ([[Dodd–Frank Wall Street Reform and Consumer Protection Act]]) financial regulatory act in 2010 provided increased oversight on financial institutions and the creation of new regulatory agencies, but many Progressives argue its broad framework allows for financial institutions to continue to take advantage of consumers and the government.[http://eds.a.ebscohost.com/eds/p"},{"slug":"walls","title":"Walls","date":1509653796249,"synopsis":"Here we collect links, images and ideas about walls:"},{"slug":"welcome-visitors","title":"Welcome Visitors","date":1522494892995,"synopsis":"Welcome to this [[Federated Wiki]] site. The purpose of this site is to research and discuss ideas, practices, and software in the movements that can be broadly categorised as the [[Progressive Alliance]]."},{"slug":"what-the-post-missed","title":"What 'The Post' Missed","date":1515851967307,"synopsis":"Leslie Gelb, the man who supervised the team that compiled the [[Pentagon Papers]], wasn't a character in the new Hollywood drama, The Post."},{"slug":"wiser-together-guiding-principles","title":"Wiser Together Guiding Principles","date":1504694693233,"synopsis":"Wiser Together is a pioneering venture of conversational experiences, learning programs and consultation services designed to develop and sustain multi-generational collaboration on the most critical issues of today. Multi-generational World Café practitioners are poised to work within communities and organizations to tap into the collective wisdom and co-creativity that shows up when we intentionally invite the voices and unique contributions of all generations to participate."},{"slug":"without-a-king","title":"Without a King?","date":1471262284444,"synopsis":"how can you run a country or organisation without a king? The is the [[Sovereignty Question]]."},{"slug":"world-caf","title":"World Café","date":1514728584496,"synopsis":"Small groups of four or five participants sit around a table and discuss an open-ended question for a structured amount of time."},{"slug":"world-caf-design-principles","title":"World Café design principles","date":1504693550206,"synopsis":"The following seven World Café design principles are an integrated set of ideas and practices that form the basis of the pattern embodied in the World Café process (see also the [http://www.theworldcafe.com/services-programs/wiser-together/ Wiser Together guiding principles] for more about the World Cafe’s DNA)."},{"slug":"world-caf-events","title":"World Café Events","date":1517507384147,"synopsis":"Here we look at the future and history of [[World Café]] events:"},{"slug":"yanis-varoufakis","title":"Yanis Varoufakis","date":1511262837809,"synopsis":""},{"slug":"zoom","title":"Zoom","date":1508337403329,"synopsis":"Zoom is video conferencing software that is affordable, highly functional and most importantly has a robust API that ensures that using the platform does not result us being locked into a proprietary platform."}]