[{"slug":"-tracks---bbc-radio-4","title":" Tracks - BBC Radio 4","date":1514900614054,"synopsis":"The first in a major new nine-part conspiracy thriller, starring Romola Garai. Written by Matthew Broughton. - [http://www.bbc.co.uk/programmes/b07mxgxl bbc]"},{"slug":"2mt","title":"2MT","date":1514552902195,"synopsis":"2MT was the first British radio station to make regular entertainment broadcasts, and the world's first regular wireless broadcast for entertainment."},{"slug":"6-doubts-about-islam-and-the-remedies","title":"6 Doubts About Islam and The Remedies","date":1514900721963,"synopsis":"In this talk Hamza shares with us the six types of doubts in Islam and how we can over come these.The Audio Hamza Tzortzis – 6 Doubts About Islam and The Remedies appeared first on Muslim Central- [https://player.fm/1gfljs player.fm]"},{"slug":"andrews-list-of-podcasts","title":"Andrew's List of Podcasts","date":1523525244738,"synopsis":"Here I will keep a synoptic list of podcasts to indicate content/formats that I am investigating."},{"slug":"anthropological-archive","title":"Anthropological Archive","date":1500114723827,"synopsis":"An [[archive]] can be considered as a store of artefacts, whether digital or physical, but here we look to describe something more organic, more \"present\" and evolving in terms of structure, and more psychosocial in terms of content."},{"slug":"anthropological-radio","title":"Anthropological Radio","date":1493561358157,"synopsis":"Here we make some early notes about a technique or practice that we could use to research a podcast for the radio involving multiple remote locations."},{"slug":"audio-archive","title":"Audio Archive","date":1501858879799,"synopsis":"The idea here is to use Fedwiki to curate and archive of conversations recorded as part of [[FEAST]]. The eventual aim is to create a shared archive of audio files together with background research around the themes discussed in order to form a suitable medium for grups collaborating around researching themes for radio production."},{"slug":"benji-rogers","title":"Benji Rogers","date":1514653527448,"synopsis":"Benji Rogers is a British-born, New York-based entrepreneur, technologist, musician, and the CEO and co-founder of the dotBlockchain Media Project - [https://www.linkedin.com/in/benjirogers/ linkedin]"},{"slug":"birth-of-public-radio-broadcasting","title":"Birth of public radio broadcasting","date":1514564596519,"synopsis":"The birth of public radio broadcasting is credited to [[Lee de Forest]] who transmitted the world’s first public broadcast in New York City on January 13, 1910."},{"slug":"broadcasting-in-australia","title":"Broadcasting in Australia","date":1514552628825,"synopsis":"The [[History of broadcasting in Australia]] has been shaped for over a century by the problem of communication across long distances, coupled with a strong base in a wealthy society with a deep taste for aural communications."},{"slug":"broadcasting-in-canada","title":"Broadcasting in Canada","date":1514543156691,"synopsis":"The history of broadcasting in Canada begins as early as 1919 with the first experimental broadcast programs in Montreal. Canadians were swept up in the radio craze and built crystal sets to listen to American stations while The Marconi Wireless Telegraph Company of Canada offered its first commercially produced radio-broadcast receiver (Model \"C\") in 1921, followed by its \"Marconiphone\" Model I in 1923."},{"slug":"broadcasting-in-cuba","title":"Broadcasting in Cuba","date":1514543228051,"synopsis":"There was interest in radio almost from broadcasting's earliest days. Due to the proximity of Cuba to the U.S. state of Florida, some Cubans would try to listen to the American stations whose signals reached the island. But there was no radio station in Cuba until 1922."},{"slug":"broadcasting-in-france","title":"Broadcasting in France","date":1514543335926,"synopsis":"[[Radio Paris]] began operations in 1922, followed by Radio Toulouse and Radio Lyon.  Before 1940, 14 commercial and 12 public sector radio stations were in operation. The government exerted tight control over radio broadcasting. Political debate was not encouraged. In the 1932 election campaign, for example, the opposition was allowed one broadcast while the incumbent made numerous campaign broadcasts. Radio was a potentially powerful new medium, but France was quite laggard in consumer ownership of radio sets, With 5 million radio receivers in 1937, co"},{"slug":"broadcasting-in-germany","title":"Broadcasting in Germany","date":1514543367675,"synopsis":"The first radio station in Germany went on the air in Berlin in late 1923, using the call letters \"LP.\"<ref name=\"Now Numbers Many Millions 1923, p. 13\"/>  Before 1933,  German radio broadcasting was Conducted by 10 regional broadcasting monopolies, each of which had a government representative on its board. The Post Office Provided overall supervision.  A listening fee of 2 Reichsmark ([[German reichsmark]]) per receiver paid most costs, and radio station frequencies were limited, which even restricted the number of amateur radio operators. Immediately "},{"slug":"broadcasting-in-japan","title":"Broadcasting in Japan","date":1514543388109,"synopsis":"The first radio station in Japan was JOAK, which opened in Tokyo in March 1925.  It was founded by Masajiro Kotamura, an inventor and engineer. It was unique in that at least one of its announcers was a woman, Akiko Midorikawa. JOAK was followed soon after by JOBK in Osaka and JOCK in Nagoya.  The National Broadcasting Service, today known as NHK (Nippon Hoso Kyokai), began in August 1926. All stations were supported by licensing fees:  in 1926, for example, people wishing to receive a permit to own a radio set paid a fee of one yen a month to the govern"},{"slug":"broadcasting-in-mexico","title":"Broadcasting in Mexico","date":1514543405530,"synopsis":"Amateur radio was very popular in Mexico; while most of the hams were male, notably Constantino de Tarnava, acknowledged in some sources as Mexico's first amateur radio operator, one of the early ham radio operators was female—Maria Dolores Estrada."},{"slug":"broadcasting-in-philppines","title":"Broadcasting in Philppines","date":1514543443483,"synopsis":"Interest in amateur radio was noted in the Philippines in the early 1920s.  There were radio stations operating in the Philippines, including one owned by American businessman named Henry Hermann, as early as 1922, according to some sources; not much documentation about that period of time exists.  In the autumn of 1927, KZRM in Manila, owned by the Radio Corporation of the Philippines, went on the air. The Radio Corporation of the Philippines was a subsidiary of American company RCA (Radio Corporation of America). By 1932, the island had three radio sta"},{"slug":"broadcasting-in-sri-lanka","title":"Broadcasting in Sri Lanka","date":1514544096007,"synopsis":"[[Sri Lanka]] has the oldest radio station in Asia (world's second oldest). The station was known as [[Radio Ceylon]]. It developed into one of the finest broadcasting institutions in the world. It is now known as the [[Sri Lanka Broadcasting Corporation]]."},{"slug":"broadcasting-in-united-kingdom","title":"Broadcasting in United Kingdom","date":1514548658575,"synopsis":"The first experimental music broadcasts, from Marconi's ([[Guglielmo Marconi]]) factory in Chelmsford ([[Chelmsford, England]]), began in 1920."},{"slug":"broadcasting-in-united-states","title":"Broadcasting in United States","date":1514547564424,"synopsis":"[[Reginald Fessenden]] did ground-breaking experiments with voice and music by 1906."},{"slug":"carrie-jacobs-bond","title":"Carrie Jacobs-Bond","date":1514571786807,"synopsis":"Carrie Minetta Jacobs-Bond (August 11, 1862 – December 28, 1946) was an American singer, pianist, and songwriter who composed some 175 pieces of popular music from the 1890s through the early 1940s - [https://en.wikipedia.org/wiki/Carrie_Jacobs-Bond wikipedia]"},{"slug":"cfro-fm","title":"CFRO-FM","date":1514726056774,"synopsis":"CFRO-FM, licensed and owned by Vancouver Co-operative Radio, is a non-commercial community radio station in Vancouver, British Columbia. It is a legally registered co-operative and is branded as [[Co-op Radio]]."},{"slug":"changes-to-this-site","title":"Changes to this Site","date":1434532209841,"synopsis":"Below we list recent changes to this site only without also listing changes from the [[Neighbourhood]]:"},{"slug":"chaos-radio","title":"Chaos Radio","date":1457616227986,"synopsis":"Just came across this site which relates to the [[CCC]] and as an emaple here is a [[Podcast]] about [[Wikipedia]] (in German):"},{"slug":"co-op-radio","title":"Co-op Radio","date":1514726081747,"synopsis":"[[CFRO-FM]], licensed and owned by Vancouver Co-operative Radio, is a non-commercial community radio station in Vancouver, British Columbia. It is a legally registered co-operative and is branded as [[Co-op Radio]]."},{"slug":"community-radio-licences","title":"Community radio licences","date":1512691956386,"synopsis":"Submitted by Frances on 18 August 2014"},{"slug":"creative-currencies","title":"Creative Currencies","date":1512726798916,"synopsis":"I've worked on the idea of creative currencies since 1990, when I first started work a [[shareware]] based \"publishing points\" for multimedia and book publishing system in medical education."},{"slug":"dao-space-sound","title":"DAO Space Sound","date":1437683936729,"synopsis":"DAO Space Sound is one of the projects at [[DAO Space]] - Chaos Camp Village. Basic idea is to record  interviews across the Chaos Communication Camp and publish it on a FedWiki and IPFS."},{"slug":"davids-recent-activity","title":"David's Recent Activity","date":1493214463667,"synopsis":"This page shows all my recent changes across all my sites. You can also see [[All David's Activity]] and the older [[David's Recent Changes]] pages:"},{"slug":"distributed-djs","title":"Distributed DJs","date":1418150083579,"synopsis":"We live in an age where music is more diverse than ever but the radio is at its most homogenous in decades. Why is this?"},{"slug":"drama-of-the-week-feat-pod-plays","title":"Drama of the Week (feat. POD PLAYS)","date":1514900810952,"synopsis":"Every Friday we bring you a new drama from BBC Radio 4 or Radio 3."},{"slug":"early-broadcasting","title":"Early broadcasting","date":1514651467553,"synopsis":"Here we look at the history of early broadcasting around the world:"},{"slug":"early-music-transmission","title":"Early music transmission","date":1514547808197,"synopsis":"The very first transmission of music by radio is credited to one Dr. Nussbaumer of the [[University of Graz]] in 1904, however it was not to the public. He yodeled an Austrian folk song into an experimental transmitter which was received in the next room at the university where he worked. He does not show in any standard scientific reference works."},{"slug":"enrico-caruso","title":"Enrico Caruso","date":1514652858438,"synopsis":"Enrico Caruso (Italian pronunciation: [enˈriːko kaˈruːzo]; 25 February 1873 – 2 August 1921) was an Italian operatic tenor - [https://en.wikipedia.org/wiki/Enrico_Caruso wikipedia]"},{"slug":"enrique-telmaco-susini","title":"Enrique Telémaco Susini","date":1514561241006,"synopsis":"Enrique Telémaco Susini (January 31, 1891 - July 4, 1972) was an Argentine entrepreneur and media pioneer - [https://en.wikipedia.org/wiki/Enrique_Tel%C3%A9maco_Susini wikipedia]"},{"slug":"equipment","title":"Equipment","date":1437865796885,"synopsis":"We had a look at different podcasting studio set ups. These are based on our own experience and experts advise. Thanks to [https://wiki.milliways.info/wiki/Chaos_Communication_Camp_2015/Radio Milliways Radio] for an advice on budget equipment."},{"slug":"eugenia-farrar","title":"Eugenia Farrar","date":1514718916420,"synopsis":"Eugenia Farrar, the first person ever to sing on the radio, in 1907, died in 1966 at the age of 93."},{"slug":"feast-radio","title":"FEAST Radio","date":1503431721520,"synopsis":"[[FEAST.fm]] is an internet radio station which is designed to concentrate on music and talk shows to accompany the [[FEAST Festival]]."},{"slug":"fedwiki-tools","title":"Fedwiki Tools","date":1511705109115,"synopsis":"Here we list a few tools that are of particular use in managing and creating [[Fedwiki]] content. Check [[Recycled pages]] to find delted pages."},{"slug":"first-entertainment-radio-broadcast","title":"First entertainment radio broadcast","date":1514552323454,"synopsis":"Until the early-1930s, it was generally accepted that [[Lee de Forest]], who conducted a series of test broadcasts beginning in 1907, and who was widely quoted promoting the potential of organized radio broadcasting, was the first person to transmit music and entertainment by radio."},{"slug":"first-live-radio-recital","title":"First live radio recital","date":1514655018907,"synopsis":"The first live radio recital by a professional musician took place at the Chelmsford factory, by the legendary Australian diva, Dame [[Nellie Melba]]."},{"slug":"first-public-speech-by-radio","title":"First public speech by radio","date":1514564826357,"synopsis":"In early 1909, in what may have been the [[First public speech by radio]], de Forest's mother-in-law, [[Harriot Eaton Stanton Blatch]], made a broadcast supporting women's suffrage."},{"slug":"funkhaus","title":"Funkhaus","date":1510410159417,"synopsis":"Funkhaus was built in the 1950s as the radio broadcasting center for East Germany within the USSR.  The design of the Funkhaus came out of three founding principles - perfection, practicality and a focus on creative production."},{"slug":"gilson-schwartz","title":"Gilson Schwartz","date":1512725980249,"synopsis":"Prof Gilson Schwartz is a leading senior researcher in digital culture and public policy in Brazil since he was awarded a Visiting Research Fellowship at the IAS of the University of São Paulo for his “City of Knowledge” Project (1999-2002) - [https://warwick.ac.uk/fac/arts/theatre_s/cp/research/researchthemes/iamukbrazil/ warwick.ac.uk]"},{"slug":"golden-age-of-radio","title":"Golden Age of Radio","date":1514910673143,"synopsis":"The old-time radio era, sometimes referred to as the Golden Age of Radio, was an era of radio programming in the United States during which radio was the dominant electronic home entertainment medium - [https://en.wikipedia.org/wiki/Golden_Age_of_Radio wikipedia]"},{"slug":"guglielmo-marconi","title":"Guglielmo Marconi","date":1514563352638,"synopsis":"Guglielmo Marconi, 1st Marquis of Marconi (25 April 1874 – 20 July 1937) was an Anglo-Italian inventor and electrical engineer known for his pioneering work on long-distance radio transmission and for his development of Marconi's law and a radio telegraph system - [https://en.wikipedia.org/wiki/Guglielmo_Marconi wikipedia]"},{"slug":"history-of-broadcasting","title":"History of broadcasting","date":1514551768622,"synopsis":"The first broadcasting of a radio transmission consisted of Morse code (or wireless telegraphy) was made from a temporary station set up by [[Guglielmo Marconi]] in 1895."},{"slug":"history-of-radio","title":"History Of Radio","date":1514718355679,"synopsis":"In 1864 [[James Clerk Maxwell]] showed mathematically that electromagnetic waves could propagate through free space. This led to a series of experiments in [[Early Radio Transmission]] leading up to the [[First Live Radio Recital]] in 1920 - [https://en.wikipedia.org/wiki/Radio#History wikipedia]"},{"slug":"history-of-radio-advertising","title":"History of radio advertising","date":1514911207849,"synopsis":"Commercial advertising by audio services goes back to even before the introduction of radio broadcasting, beginning with the 1893 establishment of telephone-based ''[[Telefon Hírmondó]]'' of Budapest, Hungary. As of 1901, this \"[[telephone newspaper]]\" was selling twelve-second spots for one florin ([[Hungarian forint]]) each to reach the subscribers listening to the service's programming."},{"slug":"home-sweet-home","title":"Home Sweet Home","date":1514652099730,"synopsis":"With financial sponsorship from the Daily Mail newspaper, the Marconi Company was persuaded to broadcast the world's first live recital by a professional musician - the legendary Australian diva, Dame [[Nellie Melba]]."},{"slug":"how-to-be-in-two-places-at-once-the-firesign-theatre-in-the-us-and-vietnam","title":"How to Be in Two Places at Once: The Firesign Theatre in the US and Vietnam","date":1515161140819,"synopsis":"Four comedians trained in poetry and psy-ops, [[Firesign Theatre]] created dense, album-length art-objects that could take multiple spins to understand."},{"slug":"i-love-you-truly","title":"I Love You Truly","date":1514654956622,"synopsis":"\"I Love You Truly\" is a parlor song written by [[Carrie Jacobs-Bond]]. Since its publication in 1901 it has been sung at weddings, recorded by numerous artists over many decades, and heard on film and television - [https://en.wikipedia.org/wiki/I_Love_You_Truly wikipedia]"},{"slug":"initial-broadcasting-experiments","title":"Initial broadcasting experiments","date":1514569288726,"synopsis":"[[Lee de Forest]] also used the arc-transmitter to conduct some of the earliest experimental entertainment radio broadcasts - see [[birth of public radio broadcasting]]."},{"slug":"internet-enabled-local-radio","title":"Internet Enabled Local Radio","date":1491129525602,"synopsis":"What it is and what it could become."},{"slug":"ipfs","title":"IPFS","date":1474103395161,"synopsis":"IPFS stands for the [[InterPlanetary File System]]. IPFS is a bold attempt at evolving the Internet's infrastructure."},{"slug":"jingle","title":"Jingle","date":1514910693934,"synopsis":"A jingle is a short song or tune used in advertising and for other commercial uses. The jingle contains one or more hooks and meaning that explicitly promote the product or service being advertised, usually through the use of one or more advertising slogans. Ad buyers use jingles in radio and television commercials; they can also be used in non-advertising contexts to establish or maintain a brand image. Jingles are a form of sound branding. Many jingles are also created using snippets of popular songs, in which lyrics are modified to appropriately adver"},{"slug":"joe-frank","title":"Joe Frank","date":1516447562522,"synopsis":"Joe Frank (August 19, 1938 – January 15, 2018) was a French-born American radio personality and humorist known best for his often philosophical, humorous, surrealist, and sometimes absurd monologues and radio dramas - [https://en.wikipedia.org/wiki/Joe_Frank wikipedia]"},{"slug":"kafanchan-with-john-dada","title":"Kafanchan with John Dada","date":1490622571361,"synopsis":"This page is about a place, some people and a radio programme."},{"slug":"kdka-am","title":"KDKA (AM)","date":1514546752457,"synopsis":"KDKA (1020 kHz AM) is a Class A (clear channel) radio station, owned and operated by Entercom and licensed to Pittsburgh, Pennsylvania. Its studios are located at the combined Entercom Pittsburgh facility in the Foster Plaza on Holiday Drive in Green Tree, and its transmitter site is at Allison Park. The station's programming is also carried over KDKA-FM's 93.7 HD2 digital subchannel - [https://en.wikipedia.org/wiki/KDKA_(AM) wikipedia]"},{"slug":"koop-radio","title":"Koop Radio","date":1514717308257,"synopsis":"KOOP (pronounced koh-op) is a community radio station in Austin, TX, owned and operated by its members in a cooperative structure depending primarily upon its volunteers and supporters for all operations of the station."},{"slug":"lee-de-forest","title":"Lee de Forest","date":1514654116324,"synopsis":"He is accredited with the first documented radio broadcast of a live singer, when [[Eugenia Farrar]] sang [[I Love You Truly]] in an unpublicized test from his laboratory in 1907."},{"slug":"list-of-oldest-radio-stations","title":"List of oldest radio stations","date":1514545342219,"synopsis":"It is generally recognised that the first radio transmission was made from a temporary station set up by Guglielmo Marconi in 1895. This followed on from pioneering work in the field by a number of people including Alessandro Volta, André-Marie Ampère, Georg Ohm and James Clerk Maxwell. The title of oldest permanent or semi-permanent radio station is disputed by contenders in Europe (UK and Germany), and in the United States and Canada - [https://en.wikipedia.org/wiki/List_of_oldest_radio_stations wikipedia]"},{"slug":"live-and-local","title":"Live and Local","date":1489595277253,"synopsis":"The radio connects people through sound. As you walk from café to café, the music you hear is curated by local artists, and the [[Local Adverts]] tell the story of projects, and local venues."},{"slug":"live-audio-podcast","title":"Live Audio Podcast","date":1491126476410,"synopsis":"A Live audio podcasts is a radio show in which we include live conversation or audio feedback from a [[Live Panel Discussion]] or a [[Live Phone In]]."},{"slug":"live-feedback","title":"Live Feedback","date":1491129928482,"synopsis":"Live Feedback involves recording live audio in the radio programme, either via panel guests brought into the studio, live phone ins via the internet or telephone, or through on location mobile radio stations streaming the broadcast live."},{"slug":"live-stream-mixer","title":"Live stream mixer","date":1517850479987,"synopsis":"A page with 1 items."},{"slug":"mesh-radio","title":"MESH Radio","date":1514726604109,"synopsis":"Here we collect research on the idea of creating learning and radio communities around solar powered [[Wireless mesh network]] and [[IPFS]]."},{"slug":"nellie-melba","title":"Nellie Melba","date":1514568735496,"synopsis":"Dame Nellie Melba GBE (19 May 1861 – 23 February 1931), born Helen Porter Mitchell, was an Australian operatic soprano. She became one of the most famous singers of the late Victorian era and the early 20th century. She was the first Australian to achieve international recognition as a classical musician. She took the pseudonym \"Melba\" from Melbourne, her home town - [https://en.wikipedia.org/wiki/Nellie_Melba wikipedia]"},{"slug":"pi-zero-pirate-radio","title":"Pi Zero Pirate Radio","date":1502538743878,"synopsis":"This kit has everything you'll need, including a [[Pi Zero W]], our flash new [[pHAT BEAT DAC]] and stereo amp, a 5W speaker, and a beautifully retro acrylic enclosure to make it look the business. It'll take you around 30 minutes to assemble everything - [https://shop.pimoroni.com/products/pirate-radio-pi-zero-w-project-kit pimoroni.com]"},{"slug":"production-partners","title":"Production Partners","date":1503850677065,"synopsis":"FEAST seeks to be an annual festival of radio and podcasting around the world. We look to celebrate the best in radio, and to attract new audiences to podcasters and local radio stations. Our aim is to establish as many co-productions as possible with existing organisations, and to license this content in such a way so as to encourage syndication, remixing and dialogue between shows. We are also looking to promote new talent, putting individuals in touch with local and international producers, and stations looking for fresh ideas, shows and talent."},{"slug":"punctum-radio","title":"Punctum radio","date":1514719067622,"synopsis":"[[Punctum radio]] is a community based in the Zizkov area of Prague, which forms a backdrop for creative, educational and relaxing activities. Its purpose is to bring together people from different subcultural communities to create new stimuli for collaboration and communication."},{"slug":"radio","title":"Radio","date":1494458381637,"synopsis":"In the context of working politically together, most thought has been in the space of writing or [[Collaborative Writing]]. Here we look at the politics of sound and radio."},{"slug":"radio---general","title":"Radio - general","date":1500480467358,"synopsis":"This is the grey subtitle"},{"slug":"radio-2xg","title":"Radio 2XG","date":1514556776131,"synopsis":"Radio station 2XG, also known as the \"Highbridge station\", was an experimental station located in New York City - [https://en.wikipedia.org/wiki/Radio_2XG wikipedia]"},{"slug":"radio-advert","title":"Radio advert","date":1514895892991,"synopsis":"A page with 1 items."},{"slug":"radio-advertisement","title":"Radio advertisement","date":1514910146026,"synopsis":"In the United States, commercial radio stations make most of their revenue by selling airtime to be used for running radio advertisements. These advertisements are the result of a business or a service providing a valuable consideration, usually money, in exchange for the station airing their commercial or mentioning them on air. The most common advertisements are \"spot commercials\", which normally last for no more than one minute, and longer programs, commonly running up to one hour, known as \"informercials\" - [https://en.wikipedia.org/wiki/Radio_advert"},{"slug":"radio-argentina","title":"Radio Argentina","date":1514562644252,"synopsis":"After returning to Argentina in 1919, [[Enrique Telémaco Susini]] started working on the conversion of an old circus site into the [[Teatro Coliseo]] theater. Together with his friends, he started planning for a radio transmission from there, strongly supported by the two Italian owners, Faustino da Rossa and Walter Mocchi."},{"slug":"radio-brazil","title":"Radio Brazil","date":1514725632980,"synopsis":"Below are a collection of links imported from [[OneTab]]. You can view these links here - [https://www.one-tab.com/page/dMNwmPP2QYi2zaeh2XN4Eg one-tab.com]:"},{"slug":"radio-conference","title":"Radio Conference","date":1491928023879,"synopsis":"Radio as we understand it today is a broadcast medium. Conferences are events that take place in physical space. Both allow only limited forms of dialogue and questioning from the audience. FEAST aims to create an entirely new form of radio show and dialogue with the audience."},{"slug":"radio-garden","title":"Radio Garden","date":1516450408649,"synopsis":"By bringing distant voices close, radio connects people and places. Radio Garden allows listeners to explore processes of broadcasting and hearing identities across the entire globe. From its very beginning, radio signals have crossed borders. Radio makers and listeners have imagined both connecting with distant cultures, as well as re-connecting with people from ‘home’ from thousands of miles away – or using local community radio to make and enrich new homes - [http://radio.garden/ radio.garden]"},{"slug":"radio-network-simulator","title":"Radio Network Simulator","date":1420390431175,"synopsis":"I simulated a store-and-forward network composed of 173 vhf radios. I implemented a hierarchal routing and showed that it could route traffic backwards to use a discovered transcontinental link. [http://c2.com/~ward/morse/SimNet/ website]"},{"slug":"radio-prague","title":"Radio Prague","date":1501532265168,"synopsis":"[[Radio Prague]] is on Wednesday celebrating the 80th anniversary of its first, shortwave broadcast, which was from outside Pardubice in East Bohemia on 31 August 1936 - [http://www.radio.cz/en/section/news/radio-prague-celebrates-80th-anniversary-of-first-broadcast radio.cz]"},{"slug":"radio-production-templates","title":"Radio Production Templates","date":1503850119254,"synopsis":"FEAST makes it as easy as possible for people to produce their own panel discussions, game shows, or live music sessions on the radio. We provide templates and training to enable radio stations and individuals to produce their own shows and take part in decentralised radio conferences that take advantage of the networked gatherings that FEAST facilitates. In this way we can organise a variety of simple forms of interaction between the audience and the radio shows we produce."},{"slug":"radio-speaks","title":"Radio speaks","date":1514718586495,"synopsis":"The first time the human voice was transmitted by radio is debateable. Claims to that distinction include the phrase, \"Hello Rainey,\" which was spoken by Nathan B. Stubblefield to a test partner near Murray, Kentucky in 1892 as well as an experimental program of talk and music by [[Reginald Fessenden]] in 1906 that was heard by radio-equipped ships within several hundred miles."},{"slug":"radio-stations","title":"Radio Stations","date":1520003987150,"synopsis":"[[Radio.coop]] connects radio stations from all around the world encouraging content sharing, discussion and a multi-language exchange."},{"slug":"radio-stations-and-people","title":"Radio Stations and People","date":1491130098523,"synopsis":"- Finsbury Park and David Bovill"},{"slug":"radio-thoughts","title":"Radio Thoughts","date":1516473022554,"synopsis":"Welcome to this site where I write and research about the history and future of [[radio]], [[podcast]]ing and [[sound art]]. My name is [[David Bovill]], and here you can see all [[David's Recent Activity]]."},{"slug":"radio-university","title":"Radio University","date":1493479562889,"synopsis":"In January 1924 the Columbia Spectator reported experiments in broadcasting educational content \"wirelessly\" to a mass audience, and anticipated that in the future this could see the establishment of a Radio University."},{"slug":"radio-usp","title":"Radio USP","date":1520087721728,"synopsis":"Radio USP broadcasts its programmes ornament its playlists for a socially and culturally different interview. In element to the broadcast of a show of accumulation and entertainment programmes, Radio USP broadcasts different anesthetic productions. Their productions and substance based programs contains such as circulating affairs, culinary, ethnic, amusement and sports comedian. They are working as a construction between listeners and penalization."},{"slug":"radioactive","title":"RadioActive","date":1520088205765,"synopsis":"RadioActive provide equipment, training and technical assistance to set up radio stations around the world.  No matter what your budget is or where you are based, we can help you have your voice heard and harness the incredible power of radio - [https://radioactive.org.uk/ radioactive.org.uk]"},{"slug":"radiocoop","title":"Radio.coop","date":1514726019039,"synopsis":"[[Radio.coop]] connects radio stations from all around the world encouraging content sharing, discussion and a multi-language exchange."},{"slug":"reginald-fessenden","title":"Reginald Fessenden","date":1514717880010,"synopsis":"Reginald Aubrey Fessenden (October 6, 1866 – July 22, 1932) was a Canadian-born inventor, who did a majority of his work in the United States and also claimed U.S. citizenship through his American-born father. During his life he received hundreds of patents in various fields, most notably ones related to radio and sonar - [https://en.wikipedia.org/wiki/Reginald_Fessenden wikipedia]"},{"slug":"renewed-broadcasting-activities","title":"Renewed broadcasting activities","date":1514556965763,"synopsis":"In the summer of 1915, the Radio Telephone Company received an Experimental license for station [[Radio 2XG]], located at its Highbridge laboratory."},{"slug":"research-activity","title":"Research Activity","date":1519753275482,"synopsis":"On this page you can find [[research groups]] that are working on topics related to the current [[domain]]:"},{"slug":"rimini-protokoll","title":"Rimini Protokoll","date":1507025785254,"synopsis":"Rimini Protokoll works in the realm of theater, sound and radio plays, film and installation emerge in constellations of two or three and solo as well."},{"slug":"school-of-the-air","title":"School of the Air","date":1425905509716,"synopsis":"School of the Air is the term used for correspondence schools catering to the primary and early secondary education of children in remote and outback Australia. Some or all of the classes were traditionally conducted by radio."},{"slug":"secure-digital-music-initiative","title":"Secure Digital Music Initiative","date":1514653057399,"synopsis":"Secure Digital Music Initiative (SDMI) was a forum formed in late 1998, composed of more than 200 IT, consumer electronics, security technology, ISP and recording industry companies, as well as Authors, Composers and Publishers Right holders (represented by CISAC and BIEM representatives, mainly from SGAE/SDAE, GEMA, SACEM/SDRM, MCPS/PRS, ASCAP, BMI, SODRAC), ostensibly with the purpose of developing technology and rights management systems specifications that will protect once developed and installed, the playing, storing, distributing and performing of"},{"slug":"soho-conversations","title":"Soho Conversations","date":1490350080750,"synopsis":"FEAST Conversations are a set of walks, and conversations that take place over a weekend in Soho. These conversations can take place in a café, and open studio, or larger venue. They can also take place as organised walks, or as conversations that take place on the radio."},{"slug":"soho-radio","title":"Soho Radio","date":1501535137434,"synopsis":"Soho’s online community radio station"},{"slug":"solidarityfm","title":"Solidarity.fm","date":1501677198776,"synopsis":"Solidarity.fm is a decentralised radio station similar in design aims to [[FEAST.fm]]. It is a part of the [[Synergiehub]] project based in Switzerland."},{"slug":"spark-gap-transmitter","title":"Spark-gap transmitter","date":1514718151731,"synopsis":"Radio-telegraphy is the sending by radio waves the same dot-dash message (morse code) used in a telegraph. Transmitters at that time were called spark-gap machines. It was developed mainly for ship-to-shore and ship-to-ship communication. This was a way of communicating between two points. However, it was not public radio broadcasting as we know it today - [https://www.thoughtco.com/invention-of-radio-1992382 thoughtco.com]"},{"slug":"teatro-coliseo","title":"Teatro Coliseo","date":1514562420553,"synopsis":"The Teatro Coliseo is a theatre in Retiro neighbourhood in Buenos Aires, Argentina which opened on July 8, 1905 - [https://en.wikipedia.org/wiki/Teatro_Coliseo wikipedia]"},{"slug":"the-firesign-theatre","title":"The Firesign Theatre","date":1529311336158,"synopsis":"The Firesign Theatre (also known as The Firesigns) were an American surreal comedy group who first performed live on Los Angeles radio station KPFK during the mid-1960s."},{"slug":"this-is-no-way-to-run-a-democracy","title":"'This is no way to run a democracy'","date":1514900672123,"synopsis":"The military-industrial complex is growing at a rampant and exponential pace, sensible gun safety measures remain ever elusive, and Americans are more polarized than ever."},{"slug":"university-of-louisvilles-radio-assisted-courses","title":"University of Louisville's \"Radio-assisted\" courses","date":1402602256961,"synopsis":"\"The chairman of the Federal Communications Commission grandly predicted that \"college-by-radio\" would put \"American education 25 years ahead.\" Local residents could pay U of L tuition, receive study materials in the mail, and listen to classroom discussions on the radio. The university offered \"radio-assisted correspondence courses\" entitled \"Problems of Modern Society\" and \"Contemporary American Literature\" in the fall semester of 1948, with WHAS and WRXW each handling student discussions two days a week.\""},{"slug":"uses-of-radio","title":"Uses of radio","date":1489518881424,"synopsis":"Early uses were maritime, for sending telegraphic messages using [[Morse code]] between ships and land. The earliest users included the Japanese Navy scouting the Russian fleet during the [[Battle of Tsushima]] in 1905. One of the most memorable uses of marine telegraphy was during the sinking of the RMS ''Titanic'' ([[RMS Titanic]]) in 1912, including communications between operators on the sinking ship and nearby vessels, and communications to shore stations listing the survivors - [https://en.wikipedia.org/wiki/Radio#Uses_of_radio wikipedia]"},{"slug":"welcome-visitors","title":"Welcome Visitors","date":1520087774259,"synopsis":"Welcome to this site where I write and research about the history and future of [[radio]], [[podcast]]ing and [[sound art]]. My name is [[David Bovill]], and here you can see all [[David's Recent Activity]]."},{"slug":"wireless-mesh-network","title":"Wireless mesh network","date":1514726742874,"synopsis":"A wireless mesh network (WMN) is a communications network made up of radio nodes organized in a mesh topology. It is also a form of wireless ad hoc network - [https://en.wikipedia.org/wiki/Wireless_mesh_network wikipedia]"},{"slug":"wireless-telegraphy","title":"Wireless telegraphy","date":1514562996024,"synopsis":"Wireless telegraphy is the transmission of electric telegraphy signals without wires (wirelessly). The term is used synonymously for radio communication systems, also called radiotelegraphy, which transmit telegraph signals by radio waves - [https://en.wikipedia.org/wiki/Wireless_telegraphy wikipedia]"},{"slug":"wnyc","title":"WNYC","date":1489693446363,"synopsis":"WNYC is the trademark, and a set of call letters shared by a pair of non-profit, noncommercial, public radio stations located in New York City - [https://en.wikipedia.org/wiki/WNYC wikipedia]"},{"slug":"world-radio-day","title":"World Radio Day","date":1502718285798,"synopsis":"World Radio Day is an observance day held annually on 13 February. World Radio Day is about celebrating radio, why we love it and why we need it today more than ever."},{"slug":"world-radio-day-2017","title":"World Radio Day 2017","date":1501675629109,"synopsis":"[http://www.diamundialradio.org World Radio Day 2017] was held on 13 February 2017 around the theme of \"'''Radio is You\"''', with the goal of celebrating how audiences interact with Radio. The theme was designed to encourage radio stations to be the best they can, by having audience engagement policies, ethical committees, public editors, self review programmes and by ensuring their community radio networks were strong. A record number of countries, took part in World Radio Day 2017 with more than 500 events worldwide."},{"slug":"world-radio-day-2018","title":"World Radio Day 2018","date":1502803008919,"synopsis":"During the week of [[World Radio Day]] we aim to create an annual fringe event, featuring the future and history of radio, and sounds from stations from all over the world."},{"slug":"worldcupfm","title":"WorldCup.fm","date":1511207358742,"synopsis":"This is a project to create a global internet radio station for the Football World Cup and can be extended to other World Cups."}]