[{"slug":"about","title":"About","date":1503851423749,"synopsis":"FEAST could stand for Festival of the Environment Art & Sustainable Technology."},{"slug":"aims","title":"Aims","date":1503851891961,"synopsis":"FEAST is an event that creates conversations between people. We aim to create a popular, massively scalable, platform for collaboration and democratic engagement. To do this we build upon our nature as social beings, that for thousands of years have come together around food to converse, tell stories, and be entertained."},{"slug":"circular-economy","title":"Circular Economy","date":1503849286583,"synopsis":"The Circular Economy is a key concept related to the ST of FEAST (Sustainable Technology)."},{"slug":"feast-futures-event-oct2017---initial-thoughts","title":"FEAST Futures Event Oct2017 - initial thoughts","date":1504633449171,"synopsis":"Following on from a call with David Bovill on 5 Sep 2017, Pam, Andrew and Gavin brainstorm ideas that could bring together [[GlobalNet21]] and [[London Futurists]] for an event potentially on Sunday the 8th of October 2017."},{"slug":"feast-overview","title":"FEAST Overview","date":1503850719494,"synopsis":"This page originated from a March 2017 draft document produced by [[David Bovill]] about FEAST."},{"slug":"feast-website","title":"FEAST Website","date":1503844402400,"synopsis":"#FEAST"},{"slug":"feastzero","title":"FEASTzero","date":1503851872925,"synopsis":"[https://twitter.com/search?f=tweets&q=%23FEASTzero #FEASTzero] is like the 'starter culture' used in breadmaking or yogurt. It boots up a new instance of the operating system called 'festival' or 'conference' but with the DNA necessary to make such events distributed, scalable and sustainable."},{"slug":"ideas-for-feast","title":"Ideas for FEAST","date":1504472182657,"synopsis":"Keeping a list of ideas and concepts:"},{"slug":"radio-garden","title":"Radio Garden","date":1503848379005,"synopsis":"By bringing distant voices close, radio connects people and places. Radio Garden allows listeners to explore processes of broadcasting and hearing identities across the entire globe. From its very beginning, radio signals have crossed borders. Radio makers and listeners have imagined both connecting with distant cultures, as well as re-connecting with people from ‘home’ from thousands of miles away – or using local community radio to make and enrich new homes - [http://radio.garden/ radio.garden]"},{"slug":"welcome-visitors","title":"Welcome Visitors","date":1504634321413,"synopsis":"This is where we will work on the construction of the FEAST platform in advance of [https://twitter.com/search?f=tweets&q=%23FEASTzero #FEASTzero]."}]