[{"slug":"arsenal-fc","title":"Arsenal F.C.","date":1511207429306,"synopsis":"Arsenal Football Club is a professional football club based in Highbury, London, England, that plays in the Premier League, the top flight of English football. The club has won 13 League titles, a record 13 FA Cups, two League Cups, the League Centenary Trophy, 15 FA Community Shields, one UEFA Cup Winners' Cup and one Inter-Cities Fairs Cup. It has won the second-most top flight matches in English football history, and is the only English club to go a 38-match league season unbeaten - [https://en.wikipedia.org/wiki/Arsenal_F.C. wikipedia]"},{"slug":"chelsea-fc","title":"Chelsea F.C.","date":1511207318296,"synopsis":"Chelsea Football Club is a professional football club based in London, England that competes in the Premier League, of which they are reigning champions. Founded in 1905, the club's home ground since then has been Stamford Bridge in Fulham - [https://en.wikipedia.org/wiki/Chelsea_F.C. wikipedia]"},{"slug":"creative-finance","title":"Creative Finance","date":1511075448722,"synopsis":"Creative Finance is an inclusive, ever evolving, continually innovating, transdisciplinary approach to the financing of diverse creative projects that blends art, science and technology for backing ideas that lead to social, cultural, economic and environmental benefit."},{"slug":"fedwiki-tools","title":"Fedwiki Tools","date":1510668606425,"synopsis":"Here we list a few tools that are of particular use in managing and creating [[Fedwiki]] content."},{"slug":"film-finance","title":"Film finance","date":1511040421364,"synopsis":"Film finance is an aspect of film production that occurs during the development stage prior to pre-production, and is concerned with determining the potential value of a proposed film. In the United States, the value is typically based on a forecast of revenues (generally 10 years for films and 20 years for television shows), beginning with theatrical release, and including DVD sales, and release to cable broadcast television networks both domestic and international and inflight airline licensing - [https://en.wikipedia.org/wiki/Film_finance wikipedia]"},{"slug":"finance","title":"Finance","date":1511074452643,"synopsis":"Here we research how such innovations are relevant to [[Thought Garden Projects]]. As a starting point we are exploring their relevance in:"},{"slug":"gavin-peacock","title":"Gavin Peacock","date":1511076199532,"synopsis":"Gavin in a founding Director of Creative Finance Ltd. He has 25 years of financial services experience, primarily for investment banks including JP Morgan, Barclays Capital, WestLB, Citigroup, Credit Suisse and Salomon Brothers International."},{"slug":"welcome-visitors","title":"Welcome Visitors","date":1511076460772,"synopsis":"This is a Federated Wiki site of [[Gavin Peacock]] for research related to [[Creative Finance]]. FedWiki is a P2P framework for creating online and offline learning experiences, designed to encourage exploration, sharing, and collaboration with transparency of individual and collective contribution."},{"slug":"worldcupfm","title":"WorldCup.fm","date":1511207358742,"synopsis":"This is a project to create a global internet radio station for the Football World Cup and can be extended to other World Cups."}]