[{"slug":"adab-al-tabib","title":"Adab al-Tabib","date":1496668646436,"synopsis":"Adab al-Tabib (Arabic: أدب الطبيب‎‎ Adab aț-Ṭabīb, \"Morals of the physician\") is the common title of a historical Arabic book on medical ethics, written by Al-Ruhawi, a 9th-century physician. The title can be roughly translated \"Practical Ethics of the Physician\". As the name suggests, it focuses on adab, the Islamic concept of etiquette and personal ethics, as it is defined in a medical context. One of the earliest texts on Islamic medical ethics, it has been called the \"crowning achievement\" of early works concerning adab in medicine - [https://en.wiki"},{"slug":"adversarial-review","title":"Adversarial review","date":1496668593889,"synopsis":"Adversarial review is the process by which some law, hypothesis, or proposal is reviewed by its author's adversaries - [https://en.wikipedia.org/wiki/Adversarial_review wikipedia]"},{"slug":"alan-sokal","title":"Alan Sokal","date":1496689768846,"synopsis":"Alan David Sokal (/ˈsoʊkəl/; born January 24, 1955) is a professor of mathematics at University College London and professor of physics at New York University. He works in statistical mechanics and combinatorics. He is best known to the wider public for his criticism of postmodernism, after the Sokal affair in 1996 when his deliberately nonsensical paper was published by Duke University's Social Text. He also works to counter faulty scientific reasoning, as seen with his involvement in criticising the critical positivity ratio concept in positive psychol"},{"slug":"altmetrics","title":"Altmetrics","date":1496683315039,"synopsis":"In scholarly and scientific publishing, altmetrics are non-traditional metrics proposed as an alternative to more traditional citation impact metrics, such as impact factor and [[h-index]] - [https://en.wikipedia.org/wiki/Altmetrics wikipedia]"},{"slug":"anthropological-archive","title":"Anthropological Archive","date":1496778274648,"synopsis":"Relevant here are topics of [[Personal Identity]], of [[Documentary]], [[Personal Archiving]] and [[Personal Data]]. We anticipate a future where we are able to access a rich set of media regarding individual and social views of a group of people at any given time, and ask how such a body of information can be structured."},{"slug":"arrow-of-time","title":"Arrow of time","date":1496919542268,"synopsis":"The second law of thermodynamics is a physical law that is not symmetric to reversal of the time direction - [https://en.wikipedia.org/wiki/Second_law_of_thermodynamics#living_organisms#Arrow_of_time wikipedia]"},{"slug":"article-level-metrics","title":"Article-level Metrics","date":1496684596014,"synopsis":"One of the most basic citation metrics is how often an article was cited in other articles, books, or other sources (such as theses)."},{"slug":"artificial-enzymes","title":"Artificial Enzymes","date":1417620442229,"synopsis":"Science AMA Series: We have used synthetic biology to evolve the first artificial enzymes (XNAzymes), Ask Us Anything! [http://www.reddit.com/r/science/comments/2o1iy7/science_ama_series_we_have_used_synthetic_biology/ reddit]"},{"slug":"attributed-peer-review","title":"Attributed Peer Review","date":1496755119966,"synopsis":"lfdjlfdsal"},{"slug":"author-level-metrics","title":"Author-level metrics","date":1496668581630,"synopsis":"Author-level metrics are citation metrics that measure the bibliometric impact of individual authors, researchers, academics, and scholars. A prime example is the h-index. Other metrics originally developed for academic journals can be reported at researcher level, such as the author-level eigenfactor and the author impact factor - [https://en.wikipedia.org/wiki/Author-level_metrics wikipedia]"},{"slug":"bad-pharma","title":"Bad Pharma","date":1496690711029,"synopsis":"Bad Pharma: How Drug Companies Mislead Doctors and Harm Patients is a book by the British physician and academic Ben Goldacre about the pharmaceutical industry, its relationship with the medical profession, and the extent to which it controls academic research into its own products. It was published in the UK in September 2012 by the Fourth Estate imprint of HarperCollins, and in the United States in February 2013 by Faber and Faber - [https://en.wikipedia.org/wiki/Bad_Pharma wikipedia]"},{"slug":"bad-science-book","title":"Bad Science (book)","date":1496690728002,"synopsis":"Bad Science is a book by Ben Goldacre, criticising mainstream media reporting on health and science issues. It was published by Fourth Estate in September 2008. It has been positively reviewed by the British Medical Journal and the Daily Telegraph and has reached the Top 10 bestseller list for Amazon Books. It was shortlisted for the 2009 Samuel Johnson Prize. Bad Science or BadScience is also the title of Goldacre's column in The Guardian and his website - [https://en.wikipedia.org/wiki/Bad_Science_(book) wikipedia]"},{"slug":"bealls-list","title":"Beall's List","date":1515514709267,"synopsis":"In academic publishing, predatory open access publishing is an exploitative open-access publishing business model that involves charging publication fees to authors without providing the editorial and publishing services associated with legitimate journals (open access or not) - [https://en.wikipedia.org/wiki/Predatory_open_access_publishing wikipedia]"},{"slug":"beta-battery","title":"Beta Battery","date":1481899456886,"synopsis":"Amorphous diamond collects energy from carbon-14 reactor waste. Diamond is a semiconductor, and like the operation of a silicon solar panel cell, electric current flows when valence electrons are given enough energy to be promoted into the conduction band. [http://www.electronicsweekly.com/news/research-news/diamond-nuclear-battery-generate-100%CE%BCw-5000-years-2016-12/ post]"},{"slug":"bibliometrics","title":"Bibliometrics","date":1496668775477,"synopsis":"Bibliometrics is statistical analysis of written publications, such as books or articles. Bibliometric methods are frequently used in the field of library and information science, including scientometrics. For instance, bibliometrics are used to provide quantitative analysis of academic literature or for evaluating budgetary spending. Citation analysis is a commonly used bibliometric method which is based on constructing the citation graph, a network or graph representation of the citations between documents. Many research fields use bibliometric methods"},{"slug":"biological-materials-transfer-project","title":"Biological Materials Transfer Project","date":1436211009834,"synopsis":"The [[Biological Materials Transfer Project]] (MTA) developed and deployed standard, modular contracts to lower the costs of transferring biological materials such as DNA, cell lines, model animals and more - [https://en.wikipedia.org/wiki/Science_Commons#Biological_Materials_Transfer_Project wikipedia]"},{"slug":"bogus-journals","title":"Bogus Journals","date":1417534690998,"synopsis":"The Bogus Academic Journal Racket Is Officially Out of Control, By Rebecca Schuman. [http://www.slate.com/blogs/browbeat/2014/11/24/bogus_academic_journal_accepts_paper_that_reads_get_me_off_your_fucking.html slate]"},{"slug":"bret-victor","title":"Bret Victor","date":1469879485974,"synopsis":"Bret Victor worked at Apple (2007-2010) as a member of the “HID Proto” future-interface prototyping team, designing UI concepts for experimental hardware platforms."},{"slug":"bruno-latour","title":"Bruno Latour","date":1470389020098,"synopsis":"Bruno Latour is a philosopher of science and sympathetic critic of [[Deep Ecology]], which he seeks to replace with a [[Political Ecology]]. I sometimes blog about these things over at [http://parliamentofthings.org parliamentofthings.org]."},{"slug":"catcall-research-methods","title":"Catcall Research Methods","date":1415982408785,"synopsis":"The recent \"catcalling\" video is a good demonstration of why research methods matter for everyone, not just scientists. Increasingly the public is presented with data that has the appearance and tone of science, but lacks the rigor.  This can lead to misunderstandings of what data means. (See Zeynep Tufekci's post:[https://medium.com/message/that-catcalling-video-and-why-research-methods-is-such-an-exciting-topic-really-32223ac9c9e8 html])"},{"slug":"center-for-bits-and-atoms","title":"Center for Bits and Atoms","date":1512243707073,"synopsis":"The Center for Bits and Atoms was established in 2001 in the MIT Media Lab at the Massachusetts Institute of Technology. It is currently run by Neil Gershenfeld. This cross-disciplinary center broadly looks at the intersection of information to its physical representation - [https://en.wikipedia.org/wiki/Center_for_Bits_and_Atoms wikipedia]"},{"slug":"center-for-open-science","title":"Center for Open Science","date":1496689280627,"synopsis":"The Center for Open Science is a non-profit technology organization based in Charlottesville, Virginia with a mission to \"increase the openness, integrity, and reproducibility of scientific research.\" Brian Nosek and Jeffrey Spies founded the organization in January 2013, funded mainly by the Laura and John Arnold Foundation and others, after implementation and use of the Open Science Framework. The organization began with work in reproducibility of psychology research. See reproducibility project. A second reproducibility project for cancer biology rese"},{"slug":"changes-to-the-commons","title":"Changes to the Commons","date":1496663992708,"synopsis":"Here we list all the [[Commons Sites]] we know of in the federation that concentrate mainly on the commons."},{"slug":"changes-to-this-site","title":"Changes to this Site","date":1434641767059,"synopsis":"Below we list recent changes to this site only without also listing changes from the [[Neighbourhood]]:"},{"slug":"citation","title":"Citation","date":1510609737208,"synopsis":"Broadly, a citation is a reference to a published or unpublished source (not always the original source). More precisely, a citation is an abbreviated alphanumeric expression embedded in the body of an intellectual work that denotes an entry in the bibliographic references section of the work for the purpose of acknowledging the relevance of the works of others to the topic of discussion at the spot where the citation appears. Generally the combination of both the in-body citation and the bibliographic entry constitutes what is commonly thought of as a c"},{"slug":"citation-graph","title":"Citation graph","date":1496683749454,"synopsis":"In information science and bibliometrics, a citation graph (or citation network) is a directed graph in which each vertex represents a document and in which each edge represents a citation from the current publication to another - [https://en.wikipedia.org/wiki/Citation_graph wikipedia]"},{"slug":"citation-impact","title":"Citation impact","date":1496684661432,"synopsis":"Citation impact quantifies the citation usage of scholarly works. It is a result of citation analysis or bibliometrics. Among the measures that have emerged from citation analysis are the citation counts for an individual article, an author, and an academic journal - [https://en.wikipedia.org/wiki/Citation_impact wikipedia]"},{"slug":"citation-index","title":"Citation Index","date":1496683681603,"synopsis":"A citation index is a kind of bibliographic database, an index of citations between publications, allowing the user to easily establish which later documents cite which earlier documents -  [https://en.wikipedia.org/wiki/Citation_index wikipedia]"},{"slug":"citoid","title":"Citoid","date":1510512744372,"synopsis":"Citoid is a stateless node service on the SCB cluster. It processes HTTP requests containing a URL or ISBN number by retrieving citation information from external sources with help from a local XULrunner-based Zotero server. It responds with a JSON structure containing the citation information - [https://wikitech.wikimedia.org/wiki/Citoid wikitech.wikimedia.org]"},{"slug":"climate-engineering","title":"Climate engineering","date":1472461744325,"synopsis":"Climate engineering, commonly referred to as geoengineering, also known as climate intervention, is the deliberate and large-scale intervention in the Earth’s climatic system with the aim of limiting adverse climate change. Climate engineering is an umbrella term for two types of measures: carbon dioxide removal and solar radiation management. Carbon dioxide removal addresses the cause of climate change by removing one of the greenhouse gases (carbon dioxide) from the atmosphere. Solar radiation management attempts to offset effects of greenhouse gases b"},{"slug":"co-to-fuels-platform","title":"CO₂-to-Fuels Platform","date":1507214850710,"synopsis":"Joule has pioneered a CO₂-to-fuel production platform, effectively reversing combustion through the use of solar energy. Free of feedstock constraints and complex processing, this platform can achieve unrivaled scalability, volumes and costs without the use of any agricultural land, fresh water or crops. [http://www.jouleunlimited.com/ website]"},{"slug":"collaborative-bookmarking","title":"Collaborative Bookmarking","date":1510495416562,"synopsis":"Collaborative bookmarking has been tried many times before, but never really taken off. This may be because of corporate priorities (Yahoo buying [[Delicio.us]]), or may be not many people want to collaborate this way. Here we look at simple and effective ways to share research, references and bookmarks:"},{"slug":"collaborative-research-in-science","title":"Collaborative Research in Science","date":1470907454362,"synopsis":"Here we look at the importance and issue of collaborative research in science."},{"slug":"common-people","title":"Common People","date":1497278903644,"synopsis":"Here we write about the [[Common People]], that is people who have in one way or other substantially added to the [[commons]], or are writing here together."},{"slug":"conservation-of-energy","title":"Conservation of energy","date":1497265426520,"synopsis":"In physics, the law of conservation of energy states that the total energy of an isolated system remains constant—it is said to be conserved over time. Energy can neither be created nor destroyed; rather, it transforms from one form to another. For instance, chemical energy can be converted to kinetic energy in the explosion of a stick of dynamite. In technical terms, conservation of energy can be rigorously proven by the Noether theorem to be a direct consequence of continuous time translation symmetry - [https://en.wikipedia.org/wiki/Conservation_of_en"},{"slug":"creative-commons","title":"Creative Commons","date":1515514996987,"synopsis":"Creative Commons (CC) is an American non-profit organization devoted to expanding the range of creative works available for others to build upon legally and to share. The organization has released several copyright-licenses known as Creative Commons licenses free of charge to the public - [https://en.wikipedia.org/wiki/Creative_Commons wikipedia]"},{"slug":"credit-commons","title":"Credit Commons","date":1492505130393,"synopsis":"Credit Commons is a proposal by [[Matthew Slater]] to reform the way finance and [[The Commons]]."},{"slug":"currently-working-on","title":"Currently Working On","date":1496914299687,"synopsis":"Here is a list of [[Recent Changes]] I consider important. View our experiments on the [[Scratch]] page. To clear stuff saved in your browser try [[Local Changes]]."},{"slug":"daisy-world","title":"Daisy World","date":1515840732965,"synopsis":"Daisy World is loosely modelled on [[James Lovelock]]'s [[Daisyworld]], but based in Minecraft where we can make use of the extensive environmental infrastructure of [[Biomes]], [[Plants]] and [[Animals]]."},{"slug":"data-science-trello-board","title":"Data Science Trello Board","date":1450556617897,"synopsis":"Having collected data science resources for years, Thai has now updated his collection and placed them into a neat Trello list, open to all. [http://www.datasciencecentral.com/profiles/blogs/huge-trello-list-of-great-data-science-resources post] [https://trello.com/b/rbpEfMld/data-science trello]"},{"slug":"degraded-energy","title":"Degraded energy","date":1497266341784,"synopsis":"Thermal energy in equilibrium at a given temperature already represents the maximal evening-out of energy between all possible states. Such energy is sometimes considered [[Degraded energy]], because it is not entirely convertible a \"useful\" form, i.e. one that can do more than just affect temperature."},{"slug":"dna-hard-drives","title":"DNA Hard Drives","date":1512243350870,"synopsis":"This talk at the [[World Economic Forum]] explores long term archiving of information using DNA. These [[DNA Hard Drives]] are very compact, and reliable - but recording information onto them remains expensive."},{"slug":"e-o-wilson","title":"E. O. Wilson","date":1496771017006,"synopsis":"Known to many as the founding father of socio-biology, E O Wilson is a big hitter in the world of evolutionary theory. But, recently he's criticised what's popularly known as The Selfish Gene theory of evolution that he once worked so hard to promote (and that now underpins the mainstream view on evolution)."},{"slug":"earths-energy-budget","title":"Earth's energy budget","date":1515840657963,"synopsis":"Earth's energy budget accounts for the energy Earth receives from the Sun. Much of this energy is lost when the earth re-radiates it back into outer space, and the rest of the energy is distributed throughout the five components of Earth's climate system. This system is made up of earth's water, ice, atmosphere, rocky crust, and all living things - [https://en.wikipedia.org/wiki/Earth%27s_energy_budget wikipedia]"},{"slug":"emergy","title":"Emergy","date":1497267477327,"synopsis":"Emergy is a type of energy (exergy) that is consumed in direct and indirect transformations needed to make a product or service. Emergy is a measure of quality differences between different forms of energy. Emergy is an expression of all the energy used in the work processes that generate a product or service in units of one type of energy. Emergy is measured in units of emjoules, a unit referring to the available energy consumed in transformations. Emergy accounts for different forms of energy and resources (e.g. sunlight, water, fossil fuels, minerals,"},{"slug":"emmy-noether","title":"Emmy Noether","date":1496921303220,"synopsis":"Amalie Emmy Noether (German: [ˈnøːtɐ]; 23 March 1882 – 14 April 1935) was a German mathematician known for her landmark contributions to abstract algebra and theoretical physics - [https://en.wikipedia.org/wiki/Emmy_Noether wikipedia]"},{"slug":"energy","title":"Energy","date":1496920941654,"synopsis":"In physics, energy is the property that must be transferred to an object in order to perform work on – or to heat – the object, and can be converted in form, but not created or destroyed. The SI unit of energy is the joule, which is the energy transferred to an object by the mechanical work of moving it a distance of 1 metre against a force of 1 newton - [https://en.wikipedia.org/wiki/Energy wikipedia]"},{"slug":"energy-transformation","title":"Energy transformation","date":1497266195171,"synopsis":"Energy transformation, also termed energy conversion, is the process of changing energy from one of its forms into another. In physics, energy is a quantity that provides the capacity to perform many actions—some as simple as lifting or warming an object. In addition to being convertible, energy is transferable to a different location or object, but it cannot be created or destroyed - [https://en.wikipedia.org/wiki/Energy_transformation wikipedia]"},{"slug":"eternity-wall","title":"Eternity Wall","date":1496770749488,"synopsis":"At Eternity Wall we think putting hash of data in the blockchain and putting the data themselves are two completely different things - [https://eternitywall.com/ eternitywall.com]"},{"slug":"evidence-based-medicine","title":"Evidence-based medicine","date":1496689325650,"synopsis":"Evidence-based medicine (EBM) is an approach to medical practice intended to optimize decision-making by emphasizing the use of evidence from well-designed and well-conducted research. Although all medicine based on science has some degree of empirical support, EBM goes further, classifying evidence by its epistemologic strength and requiring that only the strongest types (coming from meta-analyses, systematic reviews, and randomized controlled trials) can yield strong recommendations; weaker types (such as from case-control studies) can yield only weak "},{"slug":"faculty-transformation","title":"Faculty Transformation","date":1499254988882,"synopsis":"Like many early adopters, my history with OER materials began out of desperation upon realizing that many of my students could not afford the textbook(s) I had assigned."},{"slug":"fedwiki-tools","title":"Fedwiki Tools","date":1509546962150,"synopsis":"Here we list a few tools that are of particular use in managing and creating [[Fedwiki]] content."},{"slug":"forms-of-energy","title":"Forms of energy","date":1497267430025,"synopsis":"In the context of physical science, several forms of energy have been identified. These include: - [https://en.wikipedia.org/wiki/Forms_of_energy wikipedia]"},{"slug":"from-biomolecular-computing-to-internet-democracy--ehud-shapiro","title":"From biomolecular computing to internet democracy | Ehud Shapiro","date":1512240380162,"synopsis":"The Internet is now is in its Middle Ages, with feudal lords and powerless serfs. When electronic identities are broadly deployed, and people can verify who is who online, the Internet could support a democracy that unites humanity - [https://www.youtube.com/watch?v=GgS9myPsGUw youtube.com]"},{"slug":"futon-bias","title":"FUTON bias","date":1515514862914,"synopsis":"FUTON bias is the tendency of scholars to cite academic journals with open access - that is, journals that make their full text available on the Internet without charge - in preference to toll-access publications - [https://en.wikipedia.org/wiki/FUTON_bias wikipedia]"},{"slug":"genetic-takeover","title":"Genetic Takeover","date":1417623611455,"synopsis":"Genes propagate information through replication, a key process in life and evolution. When information transfers from one genetic substances to another, say RNA to DNA, we call that takeover."},{"slug":"global-solar-budget","title":"Global Solar Budget","date":1497051329489,"synopsis":"The [[earth's energy budget]] is a simple but profoundly important systemic way of viewing [[Global Warming]]. Let's look at the figures:"},{"slug":"h-index","title":"H-index","date":1496683780191,"synopsis":"The h-index is an author-level metric that attempts to measure both the productivity and citation impact of the publications of a scientist or scholar - [https://en.wikipedia.org/wiki/H-index wikipedia]"},{"slug":"health-spending","title":"Health Spending","date":1471703520961,"synopsis":"The US stands out as an outlier: the US spends far more on health than any other country, yet the life expectancy of the American population is not longer but actually shorter than in other countries that spend far less - [https://www.ineteconomics.org/ideas-papers/blog/the-link-between-health-spending-and-life-expectancy-the-us-is-an-outlier?p=ideas-papers%2Fblog%2Fthe-link-between-health-spending-and-life-expectancy-the-us-is-an-outlier ineteconomics.org]"},{"slug":"henry-oldenburg","title":"Henry Oldenburg","date":1496665743455,"synopsis":"Henry Oldenburg (also Henry Oldenbourg) (c. 1619 as Heinrich Oldenburg – 5 September 1677) was a German theologian known as a diplomat, a natural philosopher and as the creator of scientific [[peer review]] - [https://en.wikipedia.org/wiki/Henry_Oldenburg wikipedia]"},{"slug":"incentivising-sharing","title":"Incentivising Sharing","date":1496664844513,"synopsis":"Here we explore our current publishing structures and how these can be modified to incentivise sharing."},{"slug":"invalid-science","title":"Invalid science","date":1496690772045,"synopsis":"Invalid science consists of scientific claims based on experiments that cannot be reproduced or that are contradicted by experiments that can be reproduced. Recent analyses indicate that the proportion of invalid claims in the scientific literature is steadily increasing. The number of retractions has grown tenfold over the past decade. But they still make up no more than 0.2% of the 1.4m papers published annually in scholarly journals - [https://en.wikipedia.org/wiki/Invalid_science wikipedia]"},{"slug":"irreversibility","title":"Irreversibility","date":1496919707668,"synopsis":"Irreversibility in [[thermodynamic process]]es is a consequence of the asymmetric character of thermodynamic operations, and not of any internally irreversible microscopic properties of the bodies. Thermodynamic operations are macroscopic external interventions imposed on the participating bodies, not derived from their internal properties. There are reputed \"paradoxes\" that arise from failure to recognize this - [https://en.wikipedia.org/wiki/Second_law_of_thermodynamics#living_organisms#Irreversibility wikipedia]"},{"slug":"james-lovelock","title":"James Lovelock","date":1496675874431,"synopsis":"Anne McElvoy looks back at the life of the maverick scientist James Lovelock who pioneered the theory of Gaia, of a self-regulating Earth. Lovelock also looks to the future and the next evolution of Gaia which could lead to the extinction of human life, and a rise of Artificial Intelligence, but the writer and ecologist George Monbiot prefers his future world with wolves, wild boars and beavers living alongside humans. The UN's intergovernmental panel on climate change has warned to expect more volatile weather patterns, and the physicist Joanna Haigh ex"},{"slug":"karl-popper","title":"Karl Popper","date":1469276327353,"synopsis":"Sir Karl Raimund Popper CH FBA FRS (28 July 1902 – 17 September 1994) was an Austrian-British philosopher and professor. He is generally regarded as one of the greatest philosophers of science of the 20th century - [https://en.wikipedia.org/wiki/Karl_Popper wikipedia]"},{"slug":"kleins-list","title":"Klein's List","date":1426173573080,"synopsis":"I asked the wikipedia research list when one might publish results. Many of the ideas for wiki in scienc were spawned from Samuel Klein's response. [http://lists.wikimedia.org/pipermail/wiki-research-l/2012-September/002337.html email]"},{"slug":"knowledge-commons","title":"Knowledge Commons","date":1489580166393,"synopsis":"Elinor Ostrom, with Oliver Williamson, won the Nobel Prize in Economic Sciences in 2009 because she demonstrated that regular folks like you and I can create and self-govern a commons in a sustainable and equitable manner - [http://www.elinorostrom.com elinorostrom.com]"},{"slug":"kuhn-cycle","title":"Kuhn Cycle","date":1429289911890,"synopsis":"Thomas Kuhn's Structure of Scientific Revolutions described the social cycle through which science advances, one stage of which is the paradigm shift for which he is famous."},{"slug":"laws-of-thermodynamics","title":"Laws of thermodynamics","date":1497265531223,"synopsis":"The four laws of thermodynamics define fundamental physical quantities (temperature, energy, and entropy) that characterize thermodynamic systems at thermal equilibrium. The laws describe how these quantities behave under various circumstances, and forbid certain phenomena (such as perpetual motion) - [https://en.wikipedia.org/wiki/Laws_of_thermodynamics wikipedia]"},{"slug":"life-begat-continents","title":"Life Begat Continents","date":1448208043539,"synopsis":"Some say that life itself has changed the forces in plate tectonics, and helped to shape the world. [http://www.bbc.co.uk/programmes/p01bt3wn bbc]"},{"slug":"linked-data","title":"Linked Data","date":1436210610390,"synopsis":"In computing, linked data (often capitalized as Linked Data) describes a method of publishing structured data so that it can be interlinked and become more useful through semantic queries - [https://en.wikipedia.org/wiki/Linked_data wikipedia]"},{"slug":"list-of-scholarly-publishing-hoaxes","title":"List of scholarly publishing hoaxes","date":1496685883411,"synopsis":"This is a list of [[Scholarly Publishing Hoaxes]] such as the [[Sokal affair]] - [https://en.wikipedia.org/wiki/List_of_scholarly_publishing_hoaxes wikipedia]"},{"slug":"living-organisms","title":"Living organisms","date":1496919521483,"synopsis":"There are two principal ways of formulating thermodynamics, (a) through passages from one state of thermodynamic equilibrium to another, and (b) through cyclic processes, by which the system is left unchanged, while the total entropy of the surroundings is increased. These two ways help to understand the processes of life. This topic is mostly beyond the scope of this present article, but has been considered by several authors, such as Erwin Schrödinger ([[What is Life?]]), [[Léon Brillouin]] and Isaac Asimov ([[Life and Energy]]). It is also the topic o"},{"slug":"loschmidts-paradox","title":"Loschmidt's paradox","date":1496919579731,"synopsis":"[[Loschmidt's paradox]], also known as the reversibility paradox, is the objection that it should not be possible to deduce an irreversible process from the time-symmetric dynamics that describe the microscopic evolution of a macroscopic system - [https://en.wikipedia.org/wiki/Second_law_of_thermodynamics#living_organisms#Loschmidt's_paradox wikipedia]"},{"slug":"matthew-effect","title":"Matthew effect","date":1496688524383,"synopsis":"The Matthew effect of accumulated advantage, described in sociology, is a phenomenon sometimes summarized by the adage that \"the rich get richer and the poor get poorer.\" The concept is applicable to matters of fame or status, but may also be applied literally to cumulative advantage of economic capital - [https://en.wikipedia.org/wiki/Matthew_effect wikipedia]"},{"slug":"maven","title":"Maven","date":1496668816650,"synopsis":"A maven (also mavin) is a trusted expert in a particular field, who seeks to pass knowledge on to others - [https://en.wikipedia.org/wiki/Maven wikipedia]"},{"slug":"maven-index","title":"Maven Index","date":1496914248329,"synopsis":"A [[Maven Index]] is a reputation metric derived from the success of an individual in knowledgeably assessing the quality of other peoples scientific work."},{"slug":"maxwells-demon","title":"Maxwell's demon","date":1496919725544,"synopsis":"[[James Clerk Maxwell]] imagined one container divided into two parts, ''A'' and ''B''. Both parts are filled with the same [[gas]] at equal temperatures and placed next to each other, separated by a wall. Observing the [[molecule]]s on both sides, an imaginary [[demon]] guards a microscopic trapdoor in the wall. When a faster-than-average molecule from ''A'' flies towards the trapdoor, the demon opens it, and the molecule will fly from ''A'' to ''B''. The average [[speed]] of the molecules in ''B'' will have increased while in ''A'' they will have slowe"},{"slug":"medical-commons","title":"Medical Commons","date":1433271131115,"synopsis":"The Medical Commons is a project to facilitate learning about the science and practice of medicine. By learning together, through researching together, and through sharing our medical data in a privacy respecting, consensual manner, all of society can benefit."},{"slug":"medieval-institutions","title":"Medieval Institutions","date":1470907462169,"synopsis":"Here we look at what is arguably the greatest problem and threat to the future of humanity, as best expressed by the father of [[sociobiology]] [[E O Wilson]]"},{"slug":"mega-journal","title":"Mega journal","date":1515516706536,"synopsis":"A mega journal (also mega-journal and megajournal) is a peer-reviewed academic open access journal designed to be much larger than a traditional journal by exerting low selectivity among accepted articles. It was pioneered by PLOS ONE. This highly lucrative publishing model was soon emulated by other publishers - [https://en.wikipedia.org/wiki/Mega_journal wikipedia]"},{"slug":"mendeley","title":"Mendeley","date":1510495544678,"synopsis":"Mendeley is a desktop and web program for managing and sharing research papers, discovering research data and collaborating online. It combines Mendeley Desktop, a PDF and reference management application (available for Windows, OS X and Linux) and Mendeley for Android and iOS, with Mendeley Web, an online social network for researchers - [https://en.wikipedia.org/wiki/Mendeley wikipedia]"},{"slug":"mineral-life","title":"Mineral Life","date":1417623049455,"synopsis":"Crystalline surfaces of common rock-forming minerals are likely to have played several important roles in life’s geochemical origins. [http://www.ncbi.nlm.nih.gov/pmc/articles/PMC2857174/ article]"},{"slug":"mozilla-science-lab","title":"Mozilla Science Lab","date":1458846176594,"synopsis":"Join our next project call, Thursday, March 24th at 12pm ET, to learn how you can get involved in open source and open science! Each month, we celebrate new contributors, hear updates on our Collaborate projects, and share tips on working openly and collaboratively on research software."},{"slug":"neil-gerschenfeld","title":"Neil Gerschenfeld","date":1512243721012,"synopsis":"Neil Gershenfeld is the director of MIT's [[Center for Bits and Atoms]], a lab that breaks down boundaries between digital and physical worlds, from creating molecular quantum computers to virtuosic musical instruments. He started Fab Lab, a global network that allows people access to prototype tools for personal fabrication. He also directs Fab Academy, an associated programme for distributed research and education in digital fabrication."},{"slug":"network-theory","title":"Network theory","date":1496668859853,"synopsis":"Network theory is the study of graphs as a representation of either symmetric relations or, more generally, of asymmetric relations between discrete objects. In computer science and network science, network theory is a part of graph theory: a network can be defined as a graph in which nodes and/or edges have attributes (e.g. names) - [https://en.wikipedia.org/wiki/Network_theory wikipedia]"},{"slug":"new-front-matter-to-science","title":"New Front Matter to Science","date":1449421844643,"synopsis":"Wikipedia as the Front Matter to All Research. A brown bag talk on scholarly citations on Wikipedia with Geoffrey Bilder (CrossRef) and Dario Taraborelli (Wikimedia Foundation)."},{"slug":"nick-goldman","title":"Nick Goldman","date":1512242958828,"synopsis":"Molecular Biologist Nick Goldman and his team at the European Bioinformatics Institute, have created a way to use DNA to store data - [http://www.weforum.org/  weforum.org]"},{"slug":"noethers-theorem","title":"Noether's theorem","date":1496921032966,"synopsis":"Noether's (first) theorem states that every differentiable symmetry of the action of a physical system has a corresponding conservation law. The theorem was proven by mathematician [[Emmy Noether]] in 1915 and published in 1918. The action of a physical system is the integral over time of a Lagrangian function (which may or may not be an integral over space of a Lagrangian density function), from which the system's behavior can be determined by the principle of least action - [https://en.wikipedia.org/wiki/Noether%27s_theorem wikipedia]"},{"slug":"null-result","title":"Null result","date":1496690962788,"synopsis":"In science, a null result is a result without the expected content: that is, the proposed result is absent. It is an experimental outcome which does not show an otherwise expected effect. This does not imply a result of zero or nothing, simply a result that does not support the hypothesis. The term is a translation of the scientific Latin nullus resultarum, meaning \"no consequence\" - [https://en.wikipedia.org/wiki/Null_result wikipedia]"},{"slug":"open-access-journal","title":"Open access journal","date":1515514415244,"synopsis":"Open access (OA) journals are scholarly journals that are available online to the reader \"without financial, legal, or technical barriers other than those inseparable from gaining access to the internet itself.\" They remove price barriers (e.g. subscription, licensing fees, pay-per-view fees) and most permission barriers (e.g. copyright and licensing restrictions). While open access journals are freely available to the reader, there are still costs associated with the publication and production of such journals. Some are subsidized, and some require paym"},{"slug":"open-peer-review","title":"Open Peer Review","date":1496691752779,"synopsis":"Open peer review (also called \"public peer review\", \"transparent peer review\") denotes several, closely related forms of scholarly peer review - [https://en.wikipedia.org/wiki/Open_peer_review wikipedia]"},{"slug":"open-science","title":"Open Science","date":1426176245613,"synopsis":"Open science is the movement to make scientific research, data and dissemination accessible to all levels of an inquiring society, amateur or professional."},{"slug":"open-simulation-archive","title":"Open Simulation Archive","date":1426181466857,"synopsis":"[[Open Simulation Archive]] is an open archive of 3D science models and simulations. This ‚Äúbiomedical 3D warehouse‚Äù would be the science equivalent to Google Warehouse."},{"slug":"orcid","title":"ORCID","date":1436210520895,"synopsis":"ORCID (Open Researcher and Contributor ID) is a nonproprietary alphanumeric code to uniquely identify scientific and other academic authors - [https://en.wikipedia.org/wiki/ORCID wikipedia]"},{"slug":"pareto-principle","title":"Pareto principle","date":1496668840036,"synopsis":"The Pareto principle (also known as the 80/20 rule, the law of the vital few, or the principle of factor sparsity) states that, for many events, roughly 80% of the effects come from 20% of the causes. Management consultant Joseph M. Juran suggested the principle and named it after Italian economist Vilfredo Pareto, who noted the 80/20 connection while at the University of Lausanne in 1896, as published in his first paper, \"Cours d'économie politique\". Essentially, Pareto showed that approximately 80% of the land in Italy was owned by 20% of the populatio"},{"slug":"parody-generator","title":"Parody generator","date":1496685671629,"synopsis":"Parody generators are computer programs which generate text that is syntactically correct, but usually meaningless, often in the style of a technical paper or a particular writer. They are also called travesty generators and random text generators - [https://en.wikipedia.org/wiki/Parody_generator wikipedia]"},{"slug":"peer-index","title":"Peer Index","date":1496913672680,"synopsis":"Here we look at metrics that are designed to quantify influence in social networks. There are a number of companies that provide such metrics through analysing [[social networks]]:"},{"slug":"peer-review","title":"Peer review","date":1496686970968,"synopsis":"Peer review is the evaluation of work by one or more people of similar competence to the producers of the work (peers). It constitutes a form of self-regulation by qualified members of a profession within the relevant field."},{"slug":"peer-review-scam","title":"Peer Review Scam","date":1417546629857,"synopsis":"Nature News: Publishing: The peer-review scam."},{"slug":"philosophy-of-science","title":"Philosophy of science","date":1471007463477,"synopsis":"Philosophy of science is a branch of philosophy concerned with the foundations, methods, and implications of science. The central questions of this study concern what qualifies as science, the reliability of scientific theories, and the ultimate purpose of science. This discipline overlaps with metaphysics, ontology, and epistemology, for example, when it explores the relationship between science and truth - [https://en.wikipedia.org/wiki/Philosophy_of_science wikipedia]"},{"slug":"poincar-recurrence-theorem","title":"Poincaré recurrence theorem","date":1496919725541,"synopsis":"The [[Poincaré recurrence theorem]] considers a theoretical microscopic description of an isolated physical system."},{"slug":"politics-of-nature","title":"Politics of Nature","date":1425155310369,"synopsis":"Politics of Nature: How to Bring the Sciences Into Democracy - is an influential book by the French theorist and philosopher of science [[Bruno Latour]] - [https://en.wikipedia.org/wiki/Politics_of_Nature Wikipedia]."},{"slug":"postmodernism-generator","title":"Postmodernism Generator","date":1496685641883,"synopsis":"The Postmodernism Generator is a computer program that automatically produces imitations of postmodernist writing. It was written in 1996 by Andrew C. Bulhak of Monash University using the Dada Engine, a system for generating random text from recursive grammars. A free version is also hosted online. The essays are produced from a formal grammar defined by a recursive transition network. Nassim Nicholas Taleb writes about \"Monte Carlo generators\" in his 2001 book Fooled by Randomness as a real instance of the reverse Turing test: a human can be declared u"},{"slug":"power-consumption","title":"Power Consumption","date":1497264641930,"synopsis":"Here we collect some figures regarding the power consumption of every day domestic appliances, and biological processes."},{"slug":"predatory-open-access-publishing","title":"Predatory open access publishing","date":1515514612951,"synopsis":"In academic publishing, predatory open-access publishing is an exploitative open-access publishing business model that involves charging publication fees to authors without providing the editorial and publishing services associated with legitimate journals (open access or not) - [https://en.wikipedia.org/wiki/Predatory_open_access_publishing wikipedia]"},{"slug":"project-hieroglyph","title":"Project Hieroglyph","date":1454867643703,"synopsis":"Project from ASU that pairs science fiction writers with ASU thinkers to imagine positive futures. [link](http://hieroglyph.asu.edu/)"},{"slug":"proof-of-god","title":"Proof Of God","date":1509832689019,"synopsis":"Here we look at a strange type of theory that I've been mulling over for a number of years that looks poetically at [[Cosmology]], the [[Big Bang]]. the [[Anthropic Principle]] and the [[Philosophy of Science]]."},{"slug":"proteus-phenomenon","title":"Proteus phenomenon","date":1496689450144,"synopsis":"The Proteus phenomenon is the tendency in science for early replications of a work to contradict the original findings, a consequence of publication bias. It is akin to the winner's curse - [https://en.wikipedia.org/wiki/Proteus_phenomenon wikipedia]"},{"slug":"publication-bias","title":"Publication bias","date":1496689292555,"synopsis":"Publication bias is a type of bias that occurs in published academic research. It occurs when the outcome of an experiment or research study influences the decision whether to publish or otherwise distribute it. Publication bias matters because literature reviews regarding support for a hypothesis can be biased if the original literature is contaminated by publication bias. Publishing only results that show a significant finding disturbs the balance of findings - [https://en.wikipedia.org/wiki/Publication_bias wikipedia]"},{"slug":"reform","title":"Reform","date":1496690524434,"synopsis":"Here we list some proposed reform strategies to fix [[Invalid Science]]"},{"slug":"replication-crisis","title":"Replication crisis","date":1496689307874,"synopsis":"The replication crisis (or replicability crisis) refers to a methodological crisis in science in which scientists have found that the results of many scientific experiments are difficult or impossible to replicate on subsequent investigation, either by independent researchers or by the original researchers themselves. While the crisis has long-standing roots, the phrase was coined in the early 2010s as part of a growing awareness of the problem - [https://en.wikipedia.org/wiki/Replication_crisis wikipedia]"},{"slug":"reproducibility-project","title":"Reproducibility Project","date":1496689414140,"synopsis":"The Reproducibility Project: Psychology was a collaboration of 270 contributing authors to repeat 100 published experimental and correlational psychological studies. This project was led by the Center for Open Science and its co-founder, Brian Nosek, who started the project in November 2011. The results of this collaboration were published in August 2015. Reproducibility is the ability to produce a copy or duplicate, in this case it is the ability to replicate the results of the original studies. The project has illustrated the growing problem of failed "},{"slug":"research-networking-tools","title":"Research Networking Tools","date":1496691432501,"synopsis":"Research networking (RN) is about using web-based tools to discover and use research and scholarly information about people and resources. Research networking tools (RN tools) serve as knowledge management systems for the research enterprise. RN tools connect institution-level/enterprise systems, national research networks, publicly available research data (e.g., grants and publications), and restricted/proprietary data by harvesting information from disparate sources into compiled expertise profiles for faculty, investigators, scholars, clinicians, comm"},{"slug":"retraction-watch","title":"Retraction Watch","date":1496668807417,"synopsis":"Retraction Watch is a blog that reports on retractions of scientific papers. The blog was launched in August 2010 and is produced by science writers Ivan Oransky (Vice President and Global Editorial Director of MedPage Today) and Adam Marcus (editor of Gastroenterology & Endoscopy News) - [https://en.wikipedia.org/wiki/Retraction_Watch wikipedia]"},{"slug":"royal-society","title":"Royal Society","date":1470904961948,"synopsis":"The President, Council, and Fellows of the Royal Society of London for Improving Natural Knowledge, commonly known as the Royal Society, is a learned society for science and is possibly the oldest such society still in existence - [https://en.wikipedia.org/wiki/Royal_Society wikipedia]"},{"slug":"rupert-sheldrake","title":"Rupert Sheldrake","date":1509840126297,"synopsis":"Alfred Rupert Sheldrake (born 28 June 1942) is an English author, and researcher in the field of parapsychology, known for his \"morphic resonance\" concept - [https://en.wikipedia.org/wiki/Rupert_Sheldrake wikipedia]"},{"slug":"scholarly-publishing-hoaxes","title":"Scholarly Publishing Hoaxes","date":1496685944790,"synopsis":"This is a list of [[Scholarly Publishing Hoaxes]] such as the [[Sokal affair]] - [https://en.wikipedia.org/wiki/List_of_scholarly_publishing_hoaxes wikipedia]"},{"slug":"sci-hub","title":"Sci-Hub","date":1504450013557,"synopsis":"Sci-Hub is the first pirate website in the world to provide mass and public access to tens of millions of research papers - [http://sci-hub.cc/ sci-hub.cc]"},{"slug":"science-commons","title":"Science Commons","date":1426179277123,"synopsis":"Science Commons (SC) was a Creative Commons project for designing strategies and tools for faster, more efficient web-enabled scientific research."},{"slug":"science-commons-academy","title":"Science Commons Academy","date":1449242677654,"synopsis":"The science commons academy is a research group, and learning environment for the [[Science Commons]]. Here we research and learn about tools, technologies, [[Scientific Method]], and [[Governance Changes]] relevent to the [[Institution of Science]]."},{"slug":"science-in-public","title":"Science in Public","date":1426179525793,"synopsis":"How, how much, and why science should be conducted in public. Notes from the Mozilla open Science Call can be found here [https://etherpad.mozilla.org/sciencelab-calls-mar12-2015 etherpad]"},{"slug":"science-vs-god","title":"Science vs God","date":1509910747790,"synopsis":"Dubbed “the most controversial scientist on Earth” Rupert Sheldrake joins me to discuss the dogmas within conventional science, the evolving laws of physics, memory in nature, and how science validates and improves spiritual practices."},{"slug":"science-wars","title":"Science wars","date":1496689956179,"synopsis":"The science wars were a series of intellectual exchanges, between scientific realists and postmodernist critics, about the nature of scientific theory and intellectual inquiry - [https://en.wikipedia.org/wiki/Science_wars wikipedia]"},{"slug":"scientific-corruption","title":"Scientific corruption","date":1473163876303,"synopsis":"There are many forms of scientific corruption. Here we look at not simply conventional financial or legal corruption, but institutional forms that distort the scientific process."},{"slug":"scientific-institution","title":"Scientific Institution","date":1426181320533,"synopsis":"What sort of organisational structure is best suited to science? What type of organisational structure would we end up with if we applied rigorous scientific principles to the organisational basis of science?"},{"slug":"scientific-journals-for-null-results","title":"Scientific journals for null results","date":1496690971939,"synopsis":"There are now several scientific journals dedicated to the publication of negative or null results, including the following: - [https://en.wikipedia.org/wiki/Null_result#scientific_journals_for_null_results#Scientific_journals_for_null_results wikipedia]"},{"slug":"scientific-method","title":"Scientific method","date":1496689486170,"synopsis":"The scientific method is a body of techniques for investigating phenomena, acquiring new knowledge, or correcting and integrating previous knowledge. To be termed scientific, a method of inquiry is commonly based on empirical or measurable evidence subject to specific principles of reasoning. The Oxford Dictionaries Online define the scientific method as \"a method or procedure that has characterized natural science since the 17th century, consisting in systematic observation, measurement, and experiment, and the formulation, testing, and modification of "},{"slug":"scigen","title":"SCIgen","date":1496685557008,"synopsis":"SCIgen is a computer program that uses context-free grammar to randomly generate nonsense in the form of computer science research papers. All elements of the papers are formed, including graphs, diagrams, and citations. Created by scientists at the Massachusetts Institute of Technology, its stated aim is \"to maximize amusement, rather than coherence.\" - [https://en.wikipedia.org/wiki/SCIgen wikipedia]"},{"slug":"scitopia","title":"SciTopia","date":1426155463631,"synopsis":"[[SciTopia]] is a science project (originally proposed to the Welcome Trust in 2012), that looks to create a new form of [[Scientific Institution]], based on an analysis of the activities and practice of real world science."},{"slug":"second-law-of-thermodynamics","title":"Second law of thermodynamics","date":1496919510352,"synopsis":"The second law of thermodynamics states that the total entropy of an isolated system can only increase over time. It can remain constant in ideal cases where the system is in a steady state (equilibrium) or undergoing a reversible process. The increase in entropy accounts for the irreversibility of natural processes, and the asymmetry between future and past - [https://en.wikipedia.org/wiki/Second_law_of_thermodynamics wikipedia]"},{"slug":"small-world-experiment","title":"Small-world experiment","date":1496668850356,"synopsis":"The small-world experiment comprised several experiments conducted by Stanley Milgram and other researchers examining the average path length for social networks of people in the United States. The research was groundbreaking in that it suggested that human society is a small-world-type network characterized by short path-lengths. The experiments are often associated with the phrase \"six degrees of separation\", although Milgram did not use this term himself - [https://en.wikipedia.org/wiki/Small-world_experiment wikipedia]"},{"slug":"software-for-science","title":"Software for Science","date":1535190373857,"synopsis":"Redirect to [[Science Software]]"},{"slug":"sokal-affair","title":"Sokal affair","date":1496685711579,"synopsis":"The Sokal affair, also called the Sokal hoax, was a scholarly publishing hoax perpetrated by Alan Sokal, a physics professor at New York University and University College London. In 1996, Sokal submitted an article to Social Text, an academic journal of postmodern cultural studies. The submission was an experiment to test the journal's intellectual rigor and, specifically, to investigate whether \"a leading North American journal of cultural studies – whose editorial collective includes such luminaries as Fredric Jameson and Andrew Ross – [would] publish "},{"slug":"solar-few","title":"Solar FEW","date":1507214678926,"synopsis":"We propose the utilization of the entire solar spectrum by redirecting solar photons to maximize food, energy, and water (FEW) production from a given land area.  [https://www.nature.com/articles/s41598-017-03437-x nature]"},{"slug":"solar-power","title":"Solar power","date":1507289798373,"synopsis":"Solar power is the conversion of energy from sunlight into electricity, either directly using photovoltaics (PV), or indirectly using concentrated solar power. Concentrated solar power systems use lenses or mirrors and tracking systems to focus a large area of sunlight into a small beam. Photovoltaic cells convert light into an electric current using the photovoltaic effect - [https://en.wikipedia.org/wiki/Solar_power wikipedia]"},{"slug":"speaking-for-the-wind","title":"Speaking for the Wind","date":1508150651322,"synopsis":"This is an early (March 23, 2011 ) post about voting - [http://web.archive.org/web/20120111034109/http://parliamentofthings.org:80/ archive.org]"},{"slug":"stiglers-law-of-eponymy","title":"Stigler's law of eponymy","date":1496688536355,"synopsis":"Stigler's law of eponymy is a process proposed by University of Chicago statistics professor Stephen Stigler in his 1980 publication \"Stigler’s law of eponymy\". It states that no scientific discovery is named after its original discoverer. Examples include Hubble's law which was derived by Georges Lemaître two years before Edwin Hubble, the Pythagorean theorem although it was known to Babylonian mathematicians before Pythagoras, and Halley's comet which was observed by astronomers since at least 240 BC. Stigler himself named the sociologist Robert K. Mer"},{"slug":"suntracker","title":"SunTracker","date":1426944769898,"synopsis":"This\tphysical\tmodel\tsimulates\tthe\tSun’s\ttracks\tacross\tthe\tsky\tat\t"},{"slug":"swansons-law","title":"Swanson's law","date":1497271657975,"synopsis":"Swanson's law is an observation that the price of solar photovoltaic modules tends to drop 20 percent for every doubling of cumulative shipped volume. At present rates, costs halve about every 10 years. The Law is named after Richard Swanson, the founder of SunPower Corporation, a solar panel manufacturer. Swanson's Law has been compared to Moore's law. Crystalline silicon photovoltaic cell prices have fallen from $76.67 per watt in 1977 to $0.36 per watt in 2014. Plotting the module price (in $/Wp) versus time shows a dropping by 10% per year. A 2015 st"},{"slug":"sydney-brenner","title":"Sydney Brenner","date":1512757484862,"synopsis":"Sydney Brenner talks to biologist and historian Matthew Cobb about his twenty-year collaboration with DNA pioneer Francis Crick which generated some of their most creative research. [http://www.bbc.co.uk/programmes/w3cstxnk bbc]"},{"slug":"the-part-time-parliament","title":"The Part Time Parliament","date":1466347146026,"synopsis":"This is a funny, but important story for science and anyone interested noth in how academic pubishing works, and how we might improve it."},{"slug":"the-tipping-point","title":"The Tipping Point","date":1496668827371,"synopsis":"The Tipping Point: How Little Things Can Make a Big Difference is the debut book by Malcolm Gladwell, first published by Little Brown in 2000. Gladwell defines a tipping point as \"the moment of critical mass, the threshold, the boiling point\". The book seeks to explain and describe the \"mysterious\" sociological changes that mark everyday life. As Gladwell states: \"Ideas and products and messages and behaviors spread like viruses do\". The examples of such changes in his book include the rise in popularity and sales of Hush Puppies shoes in the mid-1990s a"},{"slug":"timestamping-stuff","title":"Timestamping Stuff","date":1449010994614,"synopsis":"I decided that next time I hear something I like from someone I will timestamp it on [http://eternitywall.it/ Eternity Wall] or other blockchain timestamping service."},{"slug":"web-of-science","title":"Web of Science","date":1496668796386,"synopsis":"Web of Science (previously known as Web of Knowledge) is an online subscription-based scientific citation indexing service originally produced by the Institute for Scientific Information (ISI), now maintained by Clarivate Analytics (previously the Intellectual Property and Science business of Thomson Reuters), that provides a comprehensive citation search. It gives access to multiple databases that reference cross-disciplinary research, which allows for in-depth exploration of specialized sub-fields within an academic or scientific discipline - [https://"},{"slug":"welcome-visitors","title":"Welcome Visitors","date":1512242340659,"synopsis":"Here we write about the [[Science Commons]]. A particular focus here, and something we actively research is the [[Problem of Peer Review]]."},{"slug":"where-does-solar-power-go","title":"Where does solar power go?","date":1497270673675,"synopsis":"Here we explore the question regarding where energy from the sun, when converted by solar panels, or plants into a useable form of energy on this planet ends up."},{"slug":"whos-afraid-of-peer-review","title":"Who's Afraid of Peer Review?","date":1496685844841,"synopsis":"\"Who's Afraid of Peer Review?\" is an article written by Science correspondent John Bohannon that describes his investigation of peer review among fee-charging open-access journals - [https://en.wikipedia.org/wiki/Who%27s_Afraid_of_Peer_Review%3F wikipedia]"},{"slug":"wikidata-for-research","title":"Wikidata for Research","date":1417798227066,"synopsis":"... we plan to draft a proposal that aims at establishing Wikidata as a central hub for linked open research data more generally, so that it can facilitate fruitful interactions at scale between professional research institutions and citizen science and knowledge initiatives. We plan to draft this proposal in public – you can join us and help develop it via a dedicated page on Wikidata. [http://blog.wikimedia.de/2014/12/05/wikidata-for-research-a-grant-proposal-that-anyone-can-edit/ post]"},{"slug":"zotero","title":"Zotero","date":1510508565630,"synopsis":"Zotero is software for managing bibliographic and other reference material, usually in research contexts. It is quite an agile tool, not only for storage of references but also for generation of citations, footnotes, bibliographies and reference lists in many formats - [https://en.wikipedia.org/wiki/Zotero wikipedia]"}]