[{"slug":"-the-new-world---bbc-radio-4","title":" The New World - BBC Radio 4","date":1514810477544,"synopsis":"This is bonus material from interviews recorded for the New World Series. The economist Jim O’Neill talks with his old boss, the former Conservative Chancellor, George Osborne, about the roots and policy responses to the current backlash against globalisation. - [http://www.bbc.co.uk/programmes/p04nglqv bbc]"},{"slug":"branko-milanovi","title":"Branko Milanović","date":1514824735515,"synopsis":"Branko Milanović (Serbian: Бранко Милановић; born October 24, 1953) is a Serbian-American economist. A development and inequality specialist, he is since January 2014 visiting presidential professor at City University of New York Graduate Center and an affiliated senior scholar at the Luxembourg Income Study (LIS) - [https://en.wikipedia.org/wiki/Branko_Milanovi%C4%87 wikipedia]"},{"slug":"changes-to-this-site","title":"Changes to this Site","date":1434532209841,"synopsis":"Below we list recent changes to this site only without also listing changes from the [[Neighbourhood]]:"},{"slug":"globalization","title":"Globalization","date":1514825712424,"synopsis":"Globalization (or globalisation; see spelling differences) is the increasing interaction of people, states, or countries through the growth of the international flow of money, ideas, and culture. Globalization is primarily an economic process of integration that has social and cultural aspects. It involves goods and services, and the economic resources of capital, technology, and data - [https://en.wikipedia.org/wiki/Globalization wikipedia]"},{"slug":"hawala","title":"Hawala","date":1516477885544,"synopsis":"Hawala or hewala (meaning transfer or sometimes trust), is a popular and informal value transfer system based not on the movement of cash, or on telegraph or computer network wire transfers between banks, but instead on the performance and honour of a huge network of money brokers (known as \"hawaladars\") - [https://en.wikipedia.org/wiki/Hawala wikipedia]"},{"slug":"history-of-money","title":"History of money","date":1512665967199,"synopsis":"The history of money concerns the development of means of carrying out transactions involving a medium of exchange. Money is any clearly identifiable object of value that is generally accepted as payment for goods and services and repayment of debts within a market or which is legal tender within a country - [https://en.wikipedia.org/wiki/History_of_money wikipedia]"},{"slug":"islamic-finance","title":"Islamic Finance","date":1516477772117,"synopsis":"Islamic banking or Islamic finance or sharia-compliant finance is banking or financing activity that complies with sharia (Islamic law) and its practical application through the development of Islamic economics - [https://en.wikipedia.org/wiki/Islamic_banking_and_finance wikipedia]"},{"slug":"neoliberalism","title":"Neoliberalism","date":1508285320826,"synopsis":"Neoliberalism or neo-liberalism refers primarily to the 20th-century resurgence of 19th-century ideas associated with laissez-faire economic liberalism. Such ideas include economic liberalization policies such as privatization, austerity, deregulation, free trade, and reductions in government spending in order to increase the role of the private sector in the economy and society. These market-based ideas and the policies they inspired constitute a paradigm shift away from the post-war Keynesian consensus which lasted from 1945 to 1980 - [https://en.wikip"},{"slug":"origins-of-money","title":"Origins of Money","date":1512657391777,"synopsis":"Here we explore the [[history of money]]."},{"slug":"paul-krugman","title":"Paul Krugman","date":1514812424833,"synopsis":"Paul Robin Krugman (  ( listen) KRUUG-mən; born February 28, 1953) is an American economist who is currently Distinguished Professor of Economics at the Graduate Center of the City University of New York, and a columnist for The New York Times - [https://en.wikipedia.org/wiki/Paul_Krugman wikipedia]"},{"slug":"the-elephant-graph","title":"The Elephant Graph","date":1514826065490,"synopsis":"The Elephant Graph is taken from the work of [[Branko Milanović]], an economist with the World Bank. The graph helps explain the rise of China, the rise of populism in Europe and the rise of Donald Trump. From a global perspective, income inequality has gone down."},{"slug":"trustlines","title":"TrustLines","date":1516478067982,"synopsis":"The Trustlines Network is the original [[Ripple]] idea built on [[Ethereum]]. It looks like an interesting and solid basis for building a [[Creative Currency]] - [https://trustlines.network/ trustlines.network]"},{"slug":"welcome-visitors","title":"Welcome Visitors","date":1514812193658,"synopsis":"Here we gather notes and research regarding [[Economics]] and it's relationship to [[Value]]. Our aim is to relate this body of thought to other forms of rational though. It's an [[Open Think Tank]] dialogue framed within the ecosystem of the [[Thought Garden]] project."}]