[{"slug":"add-an-external-link","title":"Add an External Link","date":1423448738866,"synopsis":"External Links are used to provide additional information, context, or citation to a wiki article. Here we talk about when to use external links, and how to add an [[External Link]] to a page."},{"slug":"add-an-image","title":"Add an Image","date":1519649268009,"synopsis":"There are several ways to add images to wiki. The prefered way is to embed them in an HTML element after uploading the image to the assets folder. An older way is to use [[embedded image]]s that are base64 encoded into the page."},{"slug":"all-pages-in-neighborhood","title":"All Pages in Neighborhood","date":1423760208993,"synopsis":"We've talked about the Neighborhood, but have not gone into it in great detail. Here we talk about what the Neighborhood is, and how to list all pages in it."},{"slug":"blue-halo","title":"Blue Halo","date":1519647418304,"synopsis":"A blue halo around a page means that the origin of the page is not the same as the server that the page you are viewing in the browser is coming from - the data is \"foreign\". It is coming from a [[Foreign server]]."},{"slug":"changes-to-this-site","title":"Changes to this Site","date":1434532209841,"synopsis":"Below we list recent changes to this site only without also listing changes from the [[Neighbourhood]]:"},{"slug":"create-a-good-caption","title":"Create a Good Caption","date":1429431427619,"synopsis":"Here is an example of a [[Wikipedia Image]] that has been captioned with an internal link (to [[Medieval University]], and an external link (to the full resolution accredited image on Wikipedia."},{"slug":"create-a-scratch-page","title":"Create a Scratch Page","date":1519573306184,"synopsis":"To create a [[scratch page]] on your sight follow the instructions in the video below."},{"slug":"create-and-claim-a-site","title":"Create and Claim a Site","date":1462899925400,"synopsis":"Down at the bottom of your page (the [[Footer]]) there is a blue button (the [[Login]]). On systems running our Node code, it will say either \"Sign In\" \"Sign Out\" or \"Claim with your Email\"."},{"slug":"currently-working-on","title":"Currently Working On","date":1429383139964,"synopsis":"Here is a list of [[Recent Changes]] I consider important. View our experiments on the [[Scratch]] page. To clear stuff saved in your browser try [[Local Changes]]."},{"slug":"embed-video","title":"Embed Video","date":1462913028472,"synopsis":"Embedding video is similar to adding an image. Instead of dragging and dropping an image onto [[Factory]], however, you are going to drag and drop a URL."},{"slug":"execute-a-cross-page-move","title":"Execute a Cross-Page Move","date":1423588296537,"synopsis":"You can drag paragraphs up and down. Try it with these paragraphs. Click, hold, drag, then drop."},{"slug":"federated-wiki-strangeness","title":"Federated Wiki Strangeness","date":1462900672269,"synopsis":"There are some strange and very unfamiliar concepts in federated wiki. Let's prepare ourselves to be confused."},{"slug":"free-culture-image","title":"Free Culture Image","date":1429358168733,"synopsis":"When you add an image to a [[Fedwiki Page]] it gets copied into the page. This is not simple \"linking\" the actual data gets copied. This makes it even more important than usual to make sure you are legally entitled to use on your page - [http://images.google.com/advanced_image_search images.google.com]"},{"slug":"know-your-neighbours","title":"Know Your Neighbours","date":1462912815216,"synopsis":"VIMEO 166086174"},{"slug":"learn-shift-click-magic","title":"Learn Shift-Click Magic","date":1466184434098,"synopsis":"Modifier keys are used heavily in Federated Wiki. Shift-click is one such modifier key. To use it, hold down your shift key while executing your normal click action."},{"slug":"make-an-encyclopedic-page","title":"Make an Encyclopedic Page","date":1423589608371,"synopsis":"In this activity we will make a simple encyclopedic page."},{"slug":"make-an-index-page","title":"Make an Index Page","date":1422924194416,"synopsis":"Index pages are used as entry points into your site's content. In pedagogical uses of federated wiki it can also function as a portfolio of student work. Here we show you how to make one."},{"slug":"many-servers","title":"Many Servers","date":1462900785689,"synopsis":"VIMEO 166065098"},{"slug":"orientation","title":"Orientation","date":1466502064696,"synopsis":"[[Fedwiki]] involves ideas and concepts that are not the way the rest of the web you are familiar with works. It takes a little while to get accustomed to our culture, but many find it addictive when it clicks."},{"slug":"orientation-site","title":"Orientation Site","date":1462913012274,"synopsis":"Because [[Federated Wiki]] contains some essential and unfamiliar concepts to most people - it is well worth orienting yourself."},{"slug":"reference","title":"Reference","date":1465115798298,"synopsis":"A reference or [[Reference Link]] is a direct link to a specific resource on a specific site. It also has an editable field to describe the resource."},{"slug":"reference-link","title":"Reference Link","date":1465115933577,"synopsis":"A [[reference]] or reference link is a direct link to a specific resource on a specific site. It also has an editable field to describe the resource."},{"slug":"roster-plugin","title":"Roster Plugin","date":1429383548795,"synopsis":"This page is [[About Roster Plugin]]. This plugin provides a hoverable, clickable roster of sites participating in a group activity."},{"slug":"scratch","title":"Scratch","date":1429431331860,"synopsis":"Uploaded image"},{"slug":"scratch-page","title":"Scratch Page","date":1519573196456,"synopsis":"A page, named [[Scratch]], where authors compose journal heavy edits to drag and drop on a target page when done."},{"slug":"start-here","title":"Start Here","date":1489052294189,"synopsis":"Welcome. This is the place to begin familiarising yourself with the way you write in [[Federated Wiki]]."},{"slug":"things-you-must-do","title":"Things You Must Do","date":1462899791789,"synopsis":"You can wander all day in the federation, and it's easy to get sidetracked. Here we link you directly to the things you must be do/be able to do before the starting to work with others, in a nice linear style. You can still wander if you want, but if you want to do the minimum, go through this list, skip the byways, and you will be set."},{"slug":"understand-welcome-visitors","title":"Understand Welcome Visitors","date":1462897441863,"synopsis":"Welcome Visitors is one of a few special system pages. Welcome Visitors is meant to identify what your site is about to others. It also may function as a personal landing page. See [[Special Page Names]]"},{"slug":"use-arrow-keys","title":"Use Arrow Keys","date":1423267115029,"synopsis":"This is an easy one. We're going to learn how to use keys to navigate. See [[What Arrow Keys Look Like]]."},{"slug":"view-remote-pages","title":"View Remote Pages","date":1423509657525,"synopsis":"You've probably noticed that some of these pages have a \"blue halo\" around them. This means that the data of the page is being served from a server other than the one from which you're browsing (your [[Origin Site]])."},{"slug":"viral-academy-orientation","title":"Viral Academy Orientation","date":1428673463437,"synopsis":"This site contains information, tutorials, and practical examples that help you understand how to use and work with [[Smallest Federated Wiki]] in the [[Viral Academy]]."},{"slug":"welcome-visitors","title":"Welcome Visitors","date":1519572210871,"synopsis":"Welcome to this [[Orientation]] site for [[Federated Wiki]] site. This is the place to get to know how [[Fedwiki]] works, the concepts involved, and how you can [[Get Involved]]."},{"slug":"yellow-halo-of-death","title":"Yellow Halo of Death","date":1423588430002,"synopsis":"Sometimes a yellow halo will appear around your document. Other times you may find that your site has different content on your browser than on someone else's."}]