[{"slug":"abstract-syntax-tree","title":"Abstract syntax tree","date":1524123074461,"synopsis":"In computer science, an abstract syntax tree (AST), or just syntax tree, is a tree representation of the abstract syntactic structure of source code written in a programming language. Each node of the tree denotes a construct occurring in the source code. The syntax is \"abstract\" in not representing every detail appearing in the real syntax - [https://en.wikipedia.org/wiki/Abstract_syntax_tree wikipedia]"},{"slug":"authoring-microservices","title":"Authoring Microservices","date":1523988505855,"synopsis":"One of the biggest priorities for this project is to attract good writers, coders, and speakers to the forthcoming [[Platform Earth]] events and podcasts."},{"slug":"calm-theorem","title":"CALM Theorem","date":1527012379223,"synopsis":"Conventional distributed systems wisdom dictates that perfect consistency is too expensive to guarantee in general, and consistency mechanisms—if you use them at all—should be reserved for infrequent, small-scale, mission-critical tasks."},{"slug":"commons","title":"Commons","date":1523861758308,"synopsis":"The commons is the cultural and natural resources accessible to all members of a society, including natural materials such as air, water, and a habitable earth. These resources are held in common, not owned privately - [https://en.wikipedia.org/wiki/Commons wikipedia]"},{"slug":"commons-server","title":"Commons server","date":1525337682925,"synopsis":"The **Commons Server** is an easily deployed web server that is designed to provide the minimal services required to sustainably host, maintain, and add to [[the commons]]."},{"slug":"developer-experience","title":"Developer Experience","date":1525355327988,"synopsis":"This [[commons server]] will be designed to create a great developer experience. A core aim for [[Platform Earth]] is to provide an architecture with which developers from many small communities around the world can readily get involved, reuse for their own purposes, and involve themselves in exchanges with other groups."},{"slug":"distributed-ledger","title":"Distributed ledger","date":1525336732263,"synopsis":"A distributed ledger is a consensus of replicated, shared, and synchronized digital data geographically spread across multiple sites, countries, or institutions. There is no central administrator or centralized data storage. - [https://en.wikipedia.org/wiki/Distributed_ledger wikipedia]"},{"slug":"etherpad-lite","title":"Etherpad Lite","date":1512054976393,"synopsis":"[[Etherpad Lite]] is an almost complete rewrite of the original [[Etherpad]] software, based on different technical foundations and written by different authors."},{"slug":"federated-architecture","title":"Federated architecture","date":1523861901430,"synopsis":"Federated architecture (FA) is a pattern in enterprise architecture that allows interoperability and information sharing between semi-autonomous de-centrally organized lines of business (LOBs), information technology systems and applications - [https://en.wikipedia.org/wiki/Federated_architecture wikipedia]"},{"slug":"flowchart","title":"Flowchart","date":1525466099219,"synopsis":"A page with 1 items."},{"slug":"functional-specification","title":"Functional Specification","date":1525457960315,"synopsis":"A functional specification describes how a product will work entirely from the user's perspective. It doesn't care how the thing is implemented. It talks about features. It specifies screens, menus, dialogs, and so on - [http://www.joelonsoftware.com/articles/fog0000000035.html joelonsoftware.com]"},{"slug":"hackmd","title":"HackMD","date":1523990054496,"synopsis":"HackMD is a realtime, multiplatform collaborative markdown note editor."},{"slug":"html5-slide-creation","title":"HTML5 Slide Creation","date":1523993179093,"synopsis":"Presenters speakers, and authors wishing to make more conventional linear presentations from wiki should be able to do so with relative ease."},{"slug":"istio","title":"Istio","date":1525327889536,"synopsis":"Istio addresses many of the challenges faced by developers and operators as monolithic applications transition towards a distributed microservice architecture. The term [[Service mesh]] is often used to describe the network of microservices that make up such applications and the interactions between them - [https://istio.io/docs/concepts/what-is-istio/overview.html istio.io]"},{"slug":"javascript-slide-presentation","title":"Javascript Slide presentation","date":1523990955594,"synopsis":"There are a number of ways of creating presentations in Javascript and HTML5 (see [[Web-based Slideshow]]). Here we look how we can author a  [[reveal.js]] presentation using [[pandoc]] (see [[Presentations with Pandoc]])."},{"slug":"kubeless","title":"Kubeless","date":1524355660325,"synopsis":"kubeless is a Kubernetes-native serverless framework that lets you deploy small bits of code without having to worry about the underlying infrastructure plumbing. It leverages Kubernetes resources to provide auto-scaling, API routing, monitoring, troubleshooting and more."},{"slug":"leslie-lamport","title":"Leslie Lamport","date":1527011871929,"synopsis":"Leslie B. Lamport (born February 7, 1941) is an American computer scientist. Lamport is best known for his seminal work in distributed systems and as the initial developer of the document preparation system LaTeX - [https://en.wikipedia.org/wiki/Leslie_lamport wikipedia]"},{"slug":"minimal-viable-governance","title":"Minimal Viable Governance","date":1525336836423,"synopsis":"Our aim is to support this governance with minimal flexible tools, that enable small groups of individuals to choose, select and build the governance they seek."},{"slug":"netflix-guide-to-microservices","title":"Netflix Guide to Microservices","date":1527011683258,"synopsis":"This video is very useful in terms of getting a realistic picture of what scaling implies when dealing with [[microservices]]."},{"slug":"non-goals","title":"Non-goals","date":1525354405933,"synopsis":"The following outcomes or goals we will seek to avoid."},{"slug":"not-for-individuals","title":"Not for individuals","date":1525354924896,"synopsis":"Our focus is on groups, and group-to-group communication, exchange, and co-working, not the individual."},{"slug":"pandoc","title":"pandoc","date":1512209130407,"synopsis":"Pandoc is an open-source document converter, widely used as a writing tool (especially by scholars) and as a basis for publishing workflows - [https://en.wikipedia.org/wiki/Pandoc wikipedia]"},{"slug":"paxos","title":"Paxos","date":1466347007579,"synopsis":"Here we write about [[Paxos (computer science)]] and not the lovely Greek Island - although there is a connection (see below)."},{"slug":"platform-earth-roadmap","title":"Platform Earth Roadmap","date":1522522460929,"synopsis":"The roadmap for [[platform earth]] is a living document governed by it's members. We are seeking to build a [[microservice]] [[platform for the commons]], based on open source software, and a pragmatic, agile approach to software development."},{"slug":"polyglot-virtual-machine","title":"Polyglot Virtual Machine","date":1524123560659,"synopsis":"GraalVM is a universal virtual machine for running applications written in JavaScript, Python, Ruby, R, JVM-based languages like Java, Scala, Kotlin, and LLVM-based languages such as C and C++."},{"slug":"polygot-service-design","title":"Polygot service design","date":1523724578326,"synopsis":"Ability to code services in a wide range of programming languages."},{"slug":"presentations-with-pandoc","title":"Presentations with Pandoc","date":1459417811126,"synopsis":"Here we look how we can author a  [[reveal.js]] presentation using [[pandoc]]"},{"slug":"revealjs","title":"reveal.js","date":1523991903603,"synopsis":"A framework for easily creating beautiful presentations using HTML."},{"slug":"revealjs-javascript-api","title":"Reveal.js JavaScript API","date":1523991916131,"synopsis":"// Navigation"},{"slug":"scenarios","title":"Scenarios","date":1525457357184,"synopsis":"Our initial focus will be on the:"},{"slug":"screen-by-screen-specification","title":"Screen-by-Screen specification","date":1525457889211,"synopsis":"All screens are created for mobile."},{"slug":"service-mesh","title":"Service mesh","date":1525327483429,"synopsis":"A page with 0 items."},{"slug":"simple-writing","title":"Simple Writing","date":1523990629595,"synopsis":"Authors need to be able to create textual content in a way that is fully compatible with [[the federation]], and yet familiar with the way they normally write."},{"slug":"specification-overview","title":"Specification Overview","date":1525339146178,"synopsis":"Between April and July 2019 we aim to bootstrap this project through creating a single minimal, containerised server that provides [[minimal viable governance]] for cooperatives and not-for-profit groups."},{"slug":"the-commons","title":"The Commons","date":1525332628293,"synopsis":"The [[Commons]] is the cultural and natural resources accessible to all members of a society, including natural materials such as air, water, and a habitable earth. These resources are held in common, not owned privately - [https://en.wikipedia.org/wiki/Commons wikipedia]"},{"slug":"the-federation","title":"The Federation","date":1523807824894,"synopsis":"Here we describe the The Federation. We should use this term wisely. It describes quite clearly the social aspects of this project, while also pointing gently towards [[Star Trek]] and the future of the [[Decentralised Web]]."},{"slug":"the-linux-control-groups-api","title":"The Linux Control Groups API","date":1524584323693,"synopsis":"Understanding the new control groups API [https://lwn.net/Articles/679786/ page]"},{"slug":"traefik","title":"Traefik","date":1523903270376,"synopsis":"Træfik (pronounced like traffic) is a modern HTTP reverse proxy and load balancer made to deploy microservices with ease. It supports several backends (Docker, Swarm mode, Kubernetes, Marathon, Consul, Etcd, Rancher, Amazon ECS, and a lot more) to manage its configuration automatically and dynamically - [https://traefik.io/ traefik.io]"},{"slug":"welcome-visitors","title":"Welcome Visitors","date":1527010346893,"synopsis":"[[Platform Earth]] is a [[microservice]] platform for the [[commons]]. Here we research and specify the design of a single reference [[commons server]] for [[the federation]]."}]