[{"slug":"alpha-diversity","title":"Alpha diversity","date":1515242619103,"synopsis":"In ecology, alpha diversity (α-diversity) is the mean species diversity in sites or habitats at a local scale. The term was introduced by R. H. Whittaker together with the terms beta diversity (β-diversity) and gamma diversity (γ-diversity). Whittaker's idea was that the total species diversity in a landscape (gamma diversity) is determined by two different things, the mean species diversity in sites or habitats at a more local scale (alpha diversity) and the differentiation among those habitats (beta diversity) - [https://en.wikipedia.org/wiki/Alpha_div"},{"slug":"anthropocene","title":"Anthropocene","date":1515241999907,"synopsis":"The Anthropocene is a proposed epoch dating from the commencement of significant human impact on the Earth's geology and ecosystems, including, but not limited to, anthropogenic climate change - [https://en.wikipedia.org/wiki/Anthropocene wikipedia]"},{"slug":"bergerparker-index","title":"Berger–Parker index","date":1515084816318,"synopsis":"The Berger–Parker index equals the maximum value in the dataset, i.e. the proportional abundance of the most abundant type."},{"slug":"beta-diversity","title":"Beta diversity","date":1515242655626,"synopsis":"In ecology, beta diversity (β-diversity or true beta diversity) is the ratio between regional and local species diversity. The term was introduced by R. H. Whittaker together with the terms alpha diversity (α-diversity) and gamma diversity (γ-diversity). The idea was that the total species diversity in a landscape (γ) is determined by two different things, the mean species diversity at the habitat level (α) and the differentiation among habitats (β). Other formulations for beta diversity include \"absolute species turnover\", \"Whittaker's species turnover\""},{"slug":"biodiversity","title":"Biodiversity","date":1515243081725,"synopsis":"According to the United Nations Environment Programme, biodiversity typically measures variation at the genetic, the species, and the ecosystem level - [https://en.wikipedia.org/wiki/Biodiversity wikipedia]"},{"slug":"biodiversity-loss","title":"Biodiversity loss","date":1515242697531,"synopsis":"Loss of biodiversity or biodiversity loss tamara is the extinction of species (human, plant or animal) worldwide, and also the local reduction or loss of species in a certain habitat - [https://en.wikipedia.org/wiki/Biodiversity_loss wikipedia]"},{"slug":"diversity","title":"Diversity","date":1515242866831,"synopsis":"Here we write about diversity in all its forms, including [[biodiversity]] and [[linguistic diversity]]: - [https://en.wikipedia.org/wiki/Diversity wikipedia]"},{"slug":"diversity-factor","title":"Diversity factor","date":1515238628936,"synopsis":"Diversity factor is commonly used for a number of mathematics-related topics. One such instance is when completing a coordination study for a system. This diversity factor is used to estimate the load of a particular node in the system - [https://en.wikipedia.org/wiki/Diversity_factor wikipedia]"},{"slug":"diversity-index","title":"Diversity index","date":1515084467335,"synopsis":"A diversity index is a quantitative measure that reflects how many different types (such as species) there are in a dataset (a community), and simultaneously takes into account how evenly the basic entities (such as individuals) are distributed among those types - [https://en.wikipedia.org/wiki/Diversity_index wikipedia]"},{"slug":"diversity-marketing","title":"Diversity marketing","date":1515238104845,"synopsis":"Diversity marketing (or in-culture marketing) is a marketing paradigm which sees marketing (and especially marketing communications) as a way to connect with the different individuals in the market. As society has progressed companies have learned that not everyone can be chalked up as the same and that every person has different life experiences, may it be religion culture or beliefs. \"Diversity marketing involves acknowledging that marketing and advertising must offer alternative ways of communicating to these diverse groups. With that knowledge, diver"},{"slug":"diversity-politics","title":"Diversity (politics)","date":1515238094605,"synopsis":"In sociology and political studies, the term diversity is used to describe political entities (neighborhoods, student bodies, etc.) with members who have identifiable differences in their cultural backgrounds or lifestyles - [https://en.wikipedia.org/wiki/Diversity_(politics) wikipedia]"},{"slug":"diversity-scheme","title":"Diversity scheme","date":1515238327838,"synopsis":"In telecommunications, a diversity scheme refers to a method for improving the reliability of a message signal by using two or more communication channels with different characteristics. Diversity is mainly used in radio communication and is a common technique for combatting fading and co-channel interference and avoiding error bursts. It is based on the fact that individual channels experience different levels of fading and interference. Multiple versions of the same signal may be transmitted and/or received and combined in the receiver. Alternatively, "},{"slug":"diversity-university","title":"Diversity University","date":1515238793707,"synopsis":"Diversity University was the first MOO dedicated specifically for education. Like other MUDs, it was an online realm that allowed people to interact in real time by connecting to a central server, assuming a virtual identity within that realm, \"teleporting\" (in other words, transporting your character) or \"walking\" to virtual rooms, and holding text-based conversations with others who had entered the same virtual room."},{"slug":"diversityfunction-debate","title":"Diversity–function debate","date":1515242769305,"synopsis":"Functional diversity, composition, and species richness affect the biogeochemical processes of ecosystems. However, the degree to which these factors influence ecosystems and whether that influence is significant is debated - [https://en.wikipedia.org/wiki/Diversity%E2%80%93function_debate wikipedia]"},{"slug":"e-o-wilson","title":"E. O. Wilson","date":1512665007769,"synopsis":"Known to many as the founding father of socio-biology, E O Wilson is a big hitter in the world of evolutionary theory. But, recently he's criticised what's popularly known as The Selfish Gene theory of evolution that he once worked so hard to promote (and that now underpins the mainstream view on evolution)."},{"slug":"ecosystem-diversity","title":"Ecosystem diversity","date":1515238282146,"synopsis":"Ecosystem diversity deals with the variations in ecosystems within a geographical location and its overall impact on human existence and the environment - [https://en.wikipedia.org/wiki/Ecosystem_diversity wikipedia]"},{"slug":"evolutionary-diversification","title":"Evolutionary diversification","date":1515241294109,"synopsis":"The existence of a \"global carrying capacity\", limiting the amount of life that can live at once, is debated, as is the question of whether such a limit would also cap the number of species - [https://en.wikipedia.org/wiki/Biodiversity#Evolutionary_diversification wikipedia]"},{"slug":"gamma-diversity","title":"Gamma diversity","date":1515242745615,"synopsis":"In ecology, gamma diversity (γ-diversity) is the total species diversity in a landscape - [https://en.wikipedia.org/wiki/Gamma_diversity wikipedia]"},{"slug":"genetic-diversity","title":"Genetic diversity","date":1515238157581,"synopsis":"Genetic diversity is the total number of genetic characteristics in the genetic makeup of a species. It is distinguished from genetic variability, which describes the tendency of genetic characteristics to vary - [https://en.wikipedia.org/wiki/Genetic_diversity wikipedia]"},{"slug":"gini-coefficient","title":"Gini coefficient","date":1515084090028,"synopsis":"In economics, the Gini coefficient (sometimes expressed as a Gini ratio or a normalized Gini index) ( jee-nee) is a measure of statistical dispersion intended to represent the income or wealth distribution of a nation's residents, and is the most commonly used measure of inequality. It was developed by the Italian statistician and sociologist Corrado Gini and published in his 1912 paper Variability and Mutability - [https://en.wikipedia.org/wiki/Gini_coefficient wikipedia]"},{"slug":"global-biodiversity","title":"Global biodiversity","date":1515242058099,"synopsis":"Global biodiversity is the measure of biodiversity on planet Earth and is defined as the total variability of life forms. More than 99 percent of all species, that ever lived on Earth are estimated to be extinct. Estimates on the number of Earth's current species range from 2 million to 1012, of which about 1.6 million have been databased thus far and over 80 percent have not yet been described. More recently, in May 2016, scientists reported that 1 trillion species are estimated to be on Earth currently with only one-thousandth of one percent described."},{"slug":"holocene-extinction","title":"Holocene extinction","date":1515241830661,"synopsis":"The Holocene extinction, otherwise referred to as the Sixth extinction or [[Anthropocene]] extinction, is the ongoing extinction event of species during the present Holocene epoch, mainly as a result of human activity - [https://en.wikipedia.org/wiki/Holocene_extinction wikipedia]"},{"slug":"language","title":"Language","date":1515238365569,"synopsis":"Language is a system that consists of the development, acquisition, maintenance and use of complex systems of communication, particularly the human ability to do so; and a language is any specific example of such a system - [https://en.wikipedia.org/wiki/Language wikipedia]"},{"slug":"language-endangerment","title":"Language endangerment","date":1515239867743,"synopsis":"Language endangerment ([[endangered language]]) occurs when a language is at risk of falling out of use as its speakers die out or shift ([[language shift]]) to speaking another language."},{"slug":"language-families-of-the-world","title":"Language families of the world","date":1515238478737,"synopsis":"The world's languages can be grouped into language families ([[Language family]]) consisting of languages that can be shown to have common ancestry. Linguists recognize many hundreds of language families, although some of them can possibly be grouped into larger units as more evidence becomes available and in-depth studies are carried out. At present, there are also dozens of [[language isolate]]s: languages that cannot be shown to be related to any other languages in the world. Among them are Basque ([[Basque language]]), spoken in Europe, Zuni ([[Zuni "},{"slug":"last-universal-common-ancestor","title":"Last universal common ancestor","date":1515243347830,"synopsis":"The last universal common ancestor (LUCA), also called the last universal ancestor (LUA), cenancestor, or (incorrectly) progenote, is the most recent population of organisms from which all organisms now living on Earth have a common descent - [https://en.wikipedia.org/wiki/Last_universal_common_ancestor wikipedia]"},{"slug":"linguistic-diversity","title":"Linguistic diversity","date":1515239969972,"synopsis":"[[SIL Ethnologue]] defines a \"living language\" as \"one that has at least one speaker for whom it is their first language\"."},{"slug":"loss-rate","title":"Loss rate","date":1515242569997,"synopsis":"A page with 0 items."},{"slug":"measurement-of-biodiversity","title":"Measurement of biodiversity","date":1515242183252,"synopsis":"Conservation biologists have designed a variety of objective means to measure biodiversity empirically. Each measure of biodiversity relates to a particular use of the data. For practical conservationists, measurements should include a quantification of values that are commonly shared among locally affected organisms, including humans. For others, a more economically defensible definition should allow the ensuring of continued possibilities for both adaptation and future use by humans, assuring environmental sustainability - [https://en.wikipedia.org/wik"},{"slug":"nature-of-human-effects","title":"Nature of human effects","date":1515241956685,"synopsis":"The human impact on biodiversity forms one of the primary attributes of the Anthropocene. Humankind has entered what is sometimes called the Earth's sixth major extinction.[http://www.nbcnews.com/science/environment/scientists-build-case-sixth-extinction-say-it-could-kill-us-n378586 Scientists Build Case for 'Sixth Extinction' ... and Say It Could Kill Us] Most experts agree that human activities have accelerated the rate of species extinction. The exact rate remains controversial – perhaps 100 to 1000 times the normal background rate of extinction.[ ] A"},{"slug":"neurodiversity","title":"Neurodiversity","date":1515238082534,"synopsis":"Neurodiversity is an approach to learning and disability that argues diverse neurological conditions are result of normal variations in the human genome. This portmanteau of neurological and diversity originated in the late 1990s as a challenge to prevailing views of neurological diversity as inherently pathological, instead asserting that neurological differences should be recognized and respected as a social category on a par with gender, ethnicity, sexual orientation, or disability status - [https://en.wikipedia.org/wiki/Neurodiversity wikipedia]"},{"slug":"phylogenetic-diversity","title":"Phylogenetic diversity","date":1515238269508,"synopsis":"Phylogenetic diversity is a measure of biodiversity which incorporates phylogenetic difference between species. It is defined and calculated as \"the sum of the lengths of all those branches that are members of the corresponding minimum spanning path\", in which 'branch' is a segment of a cladogram, and the minimum spanning path is the minimum distance between the two nodes - [https://en.wikipedia.org/wiki/Phylogenetic_diversity wikipedia]"},{"slug":"pollinator-decline","title":"Pollinator decline","date":1515242821936,"synopsis":"The term pollinator decline refers to the reduction in abundance of insect and other animal pollinators in many ecosystems worldwide beginning at the end of the twentieth century, and continuing into the present day - [https://en.wikipedia.org/wiki/Pollinator_decline wikipedia]"},{"slug":"shannon-index","title":"Shannon index","date":1515084935076,"synopsis":"The Shannon index has been a popular diversity index in the ecological literature, where it is also known as Shannon's diversity index, the Shannon–Wiener index, the Shannon–Weaver ([[Warren Weaver]]) index and the Shannon entropy."},{"slug":"simpson-index","title":"Simpson index","date":1515084967989,"synopsis":"The Simpson index was introduced in 1949 by [[Edward H. Simpson]] to measure the degree of concentration when individuals are classified into types."},{"slug":"site-diversity","title":"Site diversity","date":1515238347806,"synopsis":"Site diversity is one of six techniques used to improve the reliability of satellite communications by limit atmospheric effects, particularly those caused by rain fade. A diversity scheme is typically required when using frequencies in the Ka, V, or W-band. The downlink transmissions of satellites cover very large areas, that will have different weather. The site diversity technique consists of linking two or more ground stations receiving the same signal: this way, if the signal is heavily attenuated in one area, another ground stations can compensate "},{"slug":"species-diversity","title":"Species diversity","date":1515238146349,"synopsis":"Species diversity is the number of different species that are represented in a given community (a dataset). The effective number of species refers to the number of equally abundant species needed to obtain the same mean proportional species abundance as that observed in the dataset of interest (where all species may not be equally abundant). Species diversity consists of three components: species richness,taxonomic or phylogenetic diversity and species evenness. Species richness is a simple count of species,taxonomic or phylogenetic diversity is the gene"},{"slug":"species-loss-rates","title":"Species loss rates","date":1515241089593,"synopsis":"During the last century, decreases in biodiversity have been increasingly observed - [https://en.wikipedia.org/w/index.php?title=Biodiversity&action=edit&section=28 wikipedia]"},{"slug":"time-diversity","title":"Time diversity","date":1515238339175,"synopsis":"Time Diversity is used in digital communication systems to combat that the transmissions channel may suffer from error bursts due to time-varying channel conditions. The error bursts may be caused by fading in combination with a moving receiver, transmitter or obstacle, or by intermittent electromagnetic interference, for example from crosstalk in a cable, or co-channel interference from radio transmitters - [https://en.wikipedia.org/wiki/Time_diversity wikipedia]"},{"slug":"timeline-of-human-evolution","title":"Timeline of human evolution","date":1515242170870,"synopsis":"The timeline of human evolution outlines the major events in the development of the human species, Homo sapiens, and the evolution of our ancestors. It includes brief explanations of some of the species, genera, and the higher ranks of taxa that are seen today as possible ancestors of modern humans - [https://en.wikipedia.org/wiki/Timeline_of_human_evolution wikipedia]"},{"slug":"timeline-of-the-evolutionary-history-of-life","title":"Timeline of the evolutionary history of life","date":1515242105140,"synopsis":"This timeline of the evolutionary history of life represents the current scientific theory outlining the major events during the development of life on planet Earth. In biology, evolution is any change across successive generations in the heritable characteristics of biological populations. Evolutionary processes give rise to diversity at every level of biological organization, from kingdoms to species, and individual organisms and molecules, such as DNA and proteins. The similarities between all present day organisms indicate the presence of a common an"},{"slug":"united-nations-decade-on-biodiversity","title":"United Nations Decade on Biodiversity","date":1515242039694,"synopsis":"The United Nations General Assembly declared 2011–20 the United Nations Decade on Biodiversity (Resolution 65/161). The UN Decade on Biodiversity serves to support and promote implementation of the objectives of the Strategic Plan for Biodiversity and the Aichi Biodiversity Targets, with the goal of significantly reducing biodiversity loss - [https://en.wikipedia.org/wiki/United_Nations_Decade_on_Biodiversity wikipedia]"},{"slug":"welcome-visitors","title":"Welcome Visitors","date":1515243376895,"synopsis":"Here we gather notes and research regarding [[Diversity]] and [[Biodiversity]]."}]