[{"slug":"addressing-environmental-impacts","title":"Addressing environmental impacts","date":1497544090691,"synopsis":"Human wellbeing also depends on a healthy environment. Community currencies play an important role in efforts to better value the planet’s finite resources, move away from the doctrine of endless economic growth and incentivise more sustainable behaviour. There are a number of ways in which they can influence this area, such as rewarding carbon reduction by citizens and businesses or creating better accounting systems for the valuation of natural resources."},{"slug":"addressing-inequalities","title":"Addressing inequalities","date":1497542769760,"synopsis":"In any given society, certain groups are more powerful and better-off financially than others. Social policies that aim to enhance or ‘grow’ the core economy must therefore go hand-in-hand with measures to promote greater equality within and between different social groups."},{"slug":"backing","title":"Backing","date":1497737397655,"synopsis":"The narrow definition of ‘backing’ means that those holding the backed currency have a legally enforceable claim against the operator of the currency for a specific quantity of another currency or commodity."},{"slug":"bangla-pesa","title":"Bangla-Pesa","date":1497458052093,"synopsis":"As a mutual-credit system for SMEs in an impoverished district of Mombasa, Kenya, the Bangla-Pesa allows members to trade goods and services with one another regardless of their conventional money supply."},{"slug":"berkshares","title":"Berkshares","date":1497458106818,"synopsis":"BerkShares are the community currency of the Berkshire region of Massachusetts, USA."},{"slug":"bitcoin","title":"Bitcoin","date":1497730992011,"synopsis":"As a currency it’s simply a new medium through which to trade, operating under parameters such as the total number in circulation, the method by which new units are allocated and free-market pricing."},{"slug":"bonus-and-malus","title":"Bonus and malus","date":1497740392124,"synopsis":"Within the community currency world, the term bonus refers to a premium paid to those who exchange legal tender for a community currency. Typically, bonuses take the form of a gift, issued in the community currency, added on top of the amount exchanged."},{"slug":"bonus-and-malus-in-action","title":"Bonus and malus in action","date":1497738280170,"synopsis":"Until 31 December 2013 the Brixton Pound had a bonus of 10% for those who exchanged their pounds sterling into the local currency, meaning that £100 of national currency would buy B£110."},{"slug":"brixton-pound","title":"Brixton Pound","date":1497736731805,"synopsis":"The Brixton Pound is a community currency operating in South London, UK. Although primarily designed to support local SMEs, the Brixton Pound also seeks to increase the sense of community cohesion and draw on the area’s history of social activism."},{"slug":"brixton-pound-case-study","title":"Brixton Pound case study","date":1497459009347,"synopsis":"[[Brixton Pound]] has pioneered new payment options for local traders. When the Brixton Pound launched their pay-by-text system, the added convenience prompted Alicia Reynolds – a Senior HR Officer at Lambeth Council – to request part of her salary in her local currency."},{"slug":"ccia-currency","title":"CCIA currency","date":1497446040843,"synopsis":"This symbol shows the six pilot currencies which were part of the CCIA project: [[Spice Time Credits]], [[Brixton Pound]], [[Makkie]], [[e-Portemonnee]], [[TradeQoin]], and [[SoNantes]]. Stories and learnings from these currencies in action are included throughout the book. For more information and links to their websites visit - [http://www.ccia.eu ccia.eu]"},{"slug":"ccia-partners","title":"CCIA Partners","date":1497447057391,"synopsis":"Amsterdam East Municipality: a local authority serving 112,000 residents of a long-deprived area of Amsterdam. Committed"},{"slug":"challenges-of-a-multi-stakeholder-project","title":"Challenges of a multi-stakeholder project","date":1497719897888,"synopsis":"As currency projects often rely on a large number of stakeholders, establishing shared goals from the outset and developing a picture of how different objectives might interact can be difficult."},{"slug":"changes-to-this-site","title":"Changes to this Site","date":1434532209841,"synopsis":"Below we list recent changes to this site only without also listing changes from the [[Neighbourhood]]:"},{"slug":"chiemgauer","title":"Chiemgauer","date":1497458338177,"synopsis":"The Bavarian Chiemgauer is the first and largest of Germany’s Regiogeld initiatives. The currency incorporates demurrage, or negative interest: in order for Chiemgauer notes to remain valid at face value, a token must be purchased and attached every three months. This incentivises spending and discourages hoarding, meaning that the Chiemgauer circulates more rapidly and frequently than the euro. The 600 SMEs in the network meet around 50% of local people’s needs. Around 2500 users and 250 voluntary organisations also use the Chiemgauer."},{"slug":"choosing-the-key-features","title":"Choosing the key features","date":1497729146703,"synopsis":"Having discussed design in general terms, we now turn to specific features that can be incorporated into a community currency system. Each of them has certain benefits and potential drawbacks, so the choice of which to use will depend on which are most appropriate to the currency’s objectives."},{"slug":"co-producing-a-currency","title":"Co-producing a currency","date":1497720122009,"synopsis":"The co-production method can be used in the currency design process itself to overcome some of the issues cited above. However, because needs, assets and objectives are unique to each individual and community, there is no definitive co-production blueprint. Rather, certain guiding principles should be considered."},{"slug":"community-and-complementary-currencies","title":"Community and complementary currencies","date":1497449797216,"synopsis":"Although often used interchangeably, ‘community currency’ and ‘complementary currency’ strictly refer to subtly different phenomena. Complementary currencies are designed to sit alongside mainstream"},{"slug":"contents","title":"Contents","date":1497722693793,"synopsis":"# Preface"},{"slug":"convertibility-to-national-currency","title":"Convertibility to national currency","date":1497739994221,"synopsis":"Whether or not to make a community currency convertible into another currency, usually the national currency, is an essential question during the design phase. The decision will have major ramifications for the whole system, from the issuance process to the detailed legal requirements that convertible currencies have to follow."},{"slug":"countering-inequality-and-social-exclusion","title":"Countering inequality and social exclusion","date":1497542074587,"synopsis":"The networks and relationships of trust within a community form the basis of social life and nurture the ground from which the formal economy of money and markets grows."},{"slug":"currencies-for-the-people-by-the-people","title":"Currencies for the people, by the people","date":1497544385033,"synopsis":"Community currency projects are often inspired by strong principles and these are essential to their success; however, any currency design must keep the users’ needs centre stage."},{"slug":"democratising-services-and-organisations","title":"Democratising services and organisations","date":1497542404196,"synopsis":"Currency projects can be used to shift the balance of power within public sector and voluntary organisations, transforming the way their services are designed and delivered."},{"slug":"demurrage","title":"Demurrage","date":1497739327706,"synopsis":"Demurrage, in the complementary currency domain, is a built-in reduction over time of the nominal value of a currency. This discourages hoarding and incentivises spending by essentially levying a tax on currency holders. Ideally, demurrage should involve a charge of a simple negative interest, applied as regularly as practical. While this is easily done on a daily basis with electronic currencies, for paper currencies longer intervals may be necessary."},{"slug":"denomination--transaction-medium","title":"Denomination & transaction medium","date":1497730936244,"synopsis":"As noted, community currencies have many different design features. One of the most basic of these is the ‘denomination’: the proper description of a currency amount, expressed through a range of different transaction media."},{"slug":"design-specifics","title":"Design specifics","date":1497739992427,"synopsis":"Although there are many different design features that can be included in community currency systems, we will focus on three that have a long history and can have significant impacts on how the currency operates."},{"slug":"e-portemonnee","title":"e-Portemonnee","date":1497736825762,"synopsis":"e-Portemonnee (E-Wallet) is an electronic savings and reward system designed to reduce household waste and support environmentally sustainable behaviour in the 44 municipalities of the East Belgian province of Limburg."},{"slug":"e-portemonnee-organogram","title":"e-Portemonnee organogram","date":1497718703056,"synopsis":"Diagram 02 shows how the municipalities of Limburg support the implementation of e-Portemonnee through integrating it into their systems."},{"slug":"eco-iris","title":"Eco-Iris","date":1497544087931,"synopsis":"The Eco-Iris is a local currency introduced in the Brussels region by the Ministry of Environment to promote sustainable behaviour and purchasing, boost the local economy and improve community cohesion. It is currently operating across five neighbourhoods. As with the e-Portemonnee in Belgium, members receive Eco-Iris for switching to environmentally friendly lifestyles or purchasing sustainable goods and services."},{"slug":"eko","title":"EKO","date":1497458717029,"synopsis":"The EKO is the community currency of the Findhorn ecovillage in north-west Scotland. Pegged to pound sterling, it operates alongside the village’s LETS to provide a strong and resilient local money system."},{"slug":"eusko","title":"Eusko","date":1497458676290,"synopsis":"The Eusko is a regional currency launched in 2013 in Bayonne, a city in the French Basque Country. As of October 2013, it is the largest complementary currency in France, with more than 466 business members, 2,300 individual users and 170,000 Euskos in circulation."},{"slug":"fedwiki-tools","title":"Fedwiki Tools","date":1497443621649,"synopsis":"Here we list a few tools that are of particular use in managing and creating [[Fedwiki]] content:"},{"slug":"forewords","title":"Forewords","date":1497447019834,"synopsis":"Just as fish do not see the water that they swim in, so we exist every day in a world where money is shaping and controlling our lives and yet we take it entirely for granted. We do not ask who created that money; or why some people come by it so easily whereas others are always running to catch up. That is a shame, because the design and issue of money is one of the keys to understanding economic injustice, and emancipating ourselves from the debt-based money system is an essential step towards creating a just and sustainable world."},{"slug":"function","title":"Function","date":1497729198524,"synopsis":"Money is generally defined by the fact that it performs three functions."},{"slug":"how-can-money-better-meet-our-aims","title":"How can money better meet our aims?","date":1497446361073,"synopsis":"For many, complementary and community currencies are fairly unfamiliar phenomena. The first part of this book is aimed primarily at those either entirely new to the field or still only loosely aware of the uses, aims and potential benefits of these pioneering monetary tools."},{"slug":"improving-individual-wellbeing-and-health","title":"Improving individual wellbeing and health","date":1497542914166,"synopsis":"Most people would agree that a successful society is one where economic activity delivers high levels of sustainable wellbeing for its citizens. In this context, wellbeing considers how people feel and function, and how they evaluate their lives. By providing opportunities for social contact and enhancing self-esteem, community currencies can contribute significantly to improving personal wellbeing."},{"slug":"incentivise-sustainable-behaviour","title":"Incentivise sustainable behaviour","date":1497543696414,"synopsis":"Redesigning money with ecological objectives in mind can drive behaviour and consumption changes that lead to energy saving, waste reduction, organic food production and more."},{"slug":"innovating-money","title":"InnovatIng Money","date":1497720626774,"synopsis":"We now discuss community currencies from a more pragmatic perspective. Covering the ‘nuts and bolts’"},{"slug":"insight","title":"Insight","date":1497449486844,"synopsis":"Track this symbol throughout the book for quotes, terminology explanations and interesting examples of currencies making impact in their communities across the globe."},{"slug":"introduction","title":"Introduction","date":1497447021800,"synopsis":"Money holds many mysteries. Where does it come from? How did it evolve? Who creates it and controls it? Why do we never seem to have enough?"},{"slug":"issuance","title":"Issuance","date":1497736882989,"synopsis":"There is no form of money that occurs naturally in any given society or community. Natural objects – from seashells and large stones to gold – have been used as money, but only when a society determines that they should be accorded a special status."},{"slug":"journal-cleaner-transport","title":"Journal Cleaner Transport","date":1491984730930,"synopsis":"This [[transport]] takes a [[Fedwiki Lineup]] url, and looks at the [[wiki-page]] that is furthest right in the lineup - returning a [[ghost page]] containing a version of the same page but with a stripped down [[journal]]."},{"slug":"key","title":"Key","date":1497449476163,"synopsis":"- [[Democratising services and organisations]]"},{"slug":"kruggerand","title":"Kruggerand","date":1497730891605,"synopsis":"The Krugerrand is a South African 22-karat gold coin, available in denominations of half, quarter and a tenth of an ounce of gold. First minted in 1967 to help market South African gold, the Krugerrand has since become the most popular choice for global investors wanting to purchase gold. Unusually, the Krugerrand has the status of legal tender in South Africa, meaning that its units can properly be referred to as ‘coins’, rather than ‘rounds’ – the technical term for similar, non-legal- tender gold media produced elsewhere."},{"slug":"lets","title":"LETS","date":1497452038810,"synopsis":"LETS today are essentially mutual-credit systems for individuals, rather than businesses. Members of a LETS advertise their skills and services and exchange these with other members in return for credits."},{"slug":"levels-of-engagement","title":"Levels of engagement","date":1497719532101,"synopsis":"The following schema looks a bit more in depth at the roles different groups might play in a currency system – considering six levels of engagement."},{"slug":"loyalty-cards","title":"Loyalty cards","date":1497730967359,"synopsis":"Loyalty cards – or, more generally, loyalty schemes – are marketing devices used by corporations to retain customers. They typically work by rewarding purchases with points, which can be accumulated and redeemed as discounts when making future purchases."},{"slug":"makkie","title":"Makkie","date":1497736800913,"synopsis":"Introduced in 2012 in the Makassarsquare area of the Indische Buurt region in the Netherlands, the Makkie is a time-currency and loyalty scheme."},{"slug":"makkie-case-study","title":"Makkie case study","date":1497459550346,"synopsis":"The time-based Makkie amplifies the impact of around 250 community projects in East Amsterdam."},{"slug":"makkie-organogram","title":"Makkie organogram","date":1497545695487,"synopsis":"Amsterdam East local authority joined CCIA as part of a wider government effort to tackle inequality in the Dutch capital."},{"slug":"market","title":"Market","date":1497729944784,"synopsis":"The economist Hyman Minsky espoused the maxim that ‘everyone can create (issue) money, the problem is getting it accepted’. Where mainstream money can be thought of as IOUs issued on the most part by banks as the legal tender to settle debts and taxes – community currencies cannot rely on legal rules to enforce their use. They are essentially voluntary in terms of participation and, therefore, need to encourage use by creating a viable and valued market. A currency’s value is mainly achieved by ensuring it is widely and reliably accepted. It could thus b"},{"slug":"miracle-of-worgl","title":"Miracle of Wörgl","date":1497449897003,"synopsis":"The 1932–3 ‘Miracle of Wörgl’ – named after the Austrian town in which it occurred – is one of the best-known examples of a community currency stimulating the local economy. In the midst of the Great Depression’s monetary contraction, the town’s new mayor, Michael Unterguggenberger, issued a town currency incorporating [[demurrage]]."},{"slug":"modern-grassroots-origins","title":"Modern grassroots origins","date":1497452265053,"synopsis":"The modern history of community currencies truly began in the early 1980s with the advent of information technology and in response to the economic hardship of the 1970s. [[Michael Linton]],"},{"slug":"money-with-a-purpose","title":"Money with a purpose","date":1497541861096,"synopsis":"Community currencies can be employed to achieve a range of outcomes; here we provide an overview of their most common objectives."},{"slug":"non-linear","title":"Non-linear","date":1497720953958,"synopsis":"In order to provide openness and flexibility to the design, the planning and execution of a currency project is an iterative and adaptive process. A spiral, rather than a straight line leading from start to finish, more accurately describes this method of progression. This does not mean going round in circles, but rather consciously seeking to revisit certain core elements regularly, knowing they might have to be amended when other elements change, whether due to deliberate decisions or external factors."},{"slug":"people-powered-money","title":"People Powered Money","date":1497450548533,"synopsis":"People Powered Money is the result of a project running from 2012-2015, Community Currencies in Action (CCIA). Part-funded by the European Union’s Interreg project, CCIA is a transnational project in the community currency field, bringing together expert partners from across north-west Europe and co-ordinating six pilot currencies in the United Kingdom, Belgium, the Netherlands and France."},{"slug":"phase-a-planning","title":"Phase A: Planning","date":1497721258582,"synopsis":"The first step is a market analysis, researching the socio- economic context and, if a currency is deemed feasible and useful, what the design of a basic, viable prototype might look like. Depending on the project’s complexity and partners’ and stakeholders’ commitment, this phase might take from six months to two years."},{"slug":"phase-b-building--piloting","title":"Phase B: Building – Piloting","date":1497721386829,"synopsis":"Acknowledging that any project of the complexity of a currency will always require testing and improvements, this second phase is about the implementation of a pilot. To allow for enough time for execution and testing of all scenarios, depending on the rate of uptake and intended scale, a further six months to two years should be allocated for this phase. Here all project elements need to be fully developed, and the currency will actually be launched."},{"slug":"phase-c-continuity-options","title":"Phase C: Continuity options","date":1497721469632,"synopsis":"Once the currency is running, the immediate and long-term future comes into focus. The learning from the second phase needs to be considered and the course set for coming years."},{"slug":"rebirth-of-an-old-technology","title":"Rebirth of an old technology","date":1497450322907,"synopsis":"[[Community currencies]] have flourished in recent decades. However, these contemporary projects have emerged from a rich historical legacy that continues to throw up new ideas and insights. Examining this legacy helps to demystify money – opening the way to new possibilities for its use and new designs better suited to communities’ economic, social and environmental objectives."},{"slug":"regiogeld","title":"Regiogeld","date":1497456861087,"synopsis":"Regiogeld refers to multiple community currencies across Germany, Austria and the Netherlands. As the name implies, ‘regional money’ serves a larger geographical community than most locally bound community currencies. They thereby increase the potential for environmentally sustainable production and supply chains by casting their net more widely across the local region."},{"slug":"scrip-money","title":"Scrip money","date":1497449607768,"synopsis":"[[Scrip money]], or ‘stamp scrip’, refers to a number of paper-based complementary currencies that rose to prominence during the Great Depression, particularly in the United States, Austria and Germany."},{"slug":"security","title":"Security","date":1497729903719,"synopsis":"A currency’s physical and digital security is paramount to protecting its value, especially as the currency becomes more widely adopted and the likelihood of fraud, counterfeiting, and hacking increases. This is common in national currencies, but is also an issue in some complementary and even some community currencies, particularly those that can be exchanged for national currency."},{"slug":"social-highstreet-case-study","title":"Social highstreet case study","date":1497458841470,"synopsis":"Research from the University of Bristol and Brunel University, London, provides evidence that community currencies primarily designed to support the SME economy may also have significant social effects."},{"slug":"social-participation","title":"Social participation","date":1497542487064,"synopsis":"Exclusion of certain groups from social life weakens community relationships overall. Specially designed currencies can be used to oil the wheels of social participation, ensuring that all groups are given realistic, relevant and meaningful opportunities to get involved in their communities."},{"slug":"solarcoin","title":"SolarCoin","date":1497543923717,"synopsis":"SolarCoin is a digital currency incentivising the production and use of solar electricity. The technology behind the currency is similar to the better-known Bitcoin; however, as the name suggests, SolarCoin has a specific environmental aim. Producers of clean solar energy receive the currency on top of their feed-in tariffs for generating solar power."},{"slug":"sonantes","title":"SoNantes","date":1497736786552,"synopsis":"Inspired by the Swiss WIR, the [[SoNantes]] currency launched in Spring 2015, supported with EU funding and managed by Nantes’ public bank."},{"slug":"spice-time-credits","title":"Spice Time Credits","date":1497737185857,"synopsis":"Spice partners with local authorities, schools and housing associations to offer time-credits to individuals participating in voluntary programmes."},{"slug":"spice-time-credits-case-study","title":"Spice Time Credits case study","date":1497721893789,"synopsis":"Cheryl Hughes first earned Ely Time Credits through participating in community projects, getting her whole family involved to earn enough for an upcoming day trip."},{"slug":"spice-time-credits-organogram","title":"Spice Time Credits organogram","date":1497721759376,"synopsis":"Diagram 03 shows how Spice partner with public institutions such as schools, local authorities and housing associations, as well as charitable organisations to provide opportunities for participants to earn time-credits. Spice provides staff, training and support to allow partner organisations to set up their own time-credits systems."},{"slug":"stakeholders-in-a-currency-system","title":"Stakeholders in a currency system","date":1497544554028,"synopsis":"The following section explores the different groups that feed into a currency’s planning process and determine its success, often more so than the actual initiator or host organisation."},{"slug":"support-sustainable-business-practices","title":"Support sustainable business practices","date":1497544050521,"synopsis":"Well designed and implemented community currencies encourage businesses to adopt more sustainable practices. This can be done in numerous ways, with different objectives requiring different types of currency."},{"slug":"supporting-the-core-economy","title":"Supporting the core economy","date":1497542089203,"synopsis":"The networks and relationships of trust within a community form the basis of social life and nurture the ground from which the formal economy of money and markets grows."},{"slug":"supporting-the-sme-economy","title":"Supporting the SME economy","date":1497459296776,"synopsis":"Many community currencies are designed to counter the dominance of large corporations through supporting more diverse SME economics and educating consumers about the choices they can exercise."},{"slug":"terra","title":"Terra","date":1497543988918,"synopsis":"The ‘Terra’ is a proposal for a commodity-backed currency, proposed by Belgian economist [[Bernard Lietaer]]."},{"slug":"the-historic-legacy","title":"The historic legacy","date":1497450353302,"synopsis":"From shells and giant stones to tobacco, clay tablets and grain, a huge range of media have functioned as currency."},{"slug":"the-new-millennials","title":"The new millennials","date":1497456858465,"synopsis":"These systems are distinct in that they are backed by their respective national currencies – making them redeemable for cash if there are no suitable spending options."},{"slug":"the-process-of-designing-a-currency","title":"The Process of designing a currency","date":1497720825888,"synopsis":"Like any other complex project, a community currency’s design is crucial to its success. This chapter discusses how to match a currency’s design to its objectives, as well as the importance of integrating the needs and concerns of stakeholders into the design process itself."},{"slug":"time-based-currencies","title":"Time-based currencies","date":1497451948048,"synopsis":"The community currencies most widely used to recognise the value of activities neglected by the mainstream economy are timebanks. The principle behind such currencies is simple: one hour’s work equals a unit of time. Exchanges between members are mediated by a broker, who matches the requests of one member with the skills offered by others."},{"slug":"todays-cross-sector-fusion","title":"Today’s cross-sector fusion","date":1497457064819,"synopsis":"Government and regulators have not always supported currency innovation – from the Austrian Central Bank’s infamous closure of the highly successful local currency in Wörgl in the 1930s to today’s lack of clarity, in many jurisdictions, on the tax and social benefit implications of LETS and timebank income (covered in Chapter 6). Such uncertainty can impede projects’ collaboration with regulators or the public sector."},{"slug":"tradeqoin","title":"TradeQoin","date":1497736768687,"synopsis":"[[TradeQoin]] is a Dutch SME trading network that lets businesses pay each other for goods and services with their own digital currency created at the moment of exchange."},{"slug":"tradeqoin-case-study","title":"TradeQoin case study","date":1497458312677,"synopsis":"Manoushka Botts, founder of Amsterdam-based CarCleaners.nl, is a TradeQoin member. Speaking of the benefits, Manoushka says:"},{"slug":"trueque","title":"Trueque","date":1497451109798,"synopsis":"The Redes de Trueque (Barter Networks) evolved in Argentina in the mid 1990s in response to the economic crisis and collapse of the national currency, the peso."},{"slug":"welcome-visitors","title":"Welcome Visitors","date":1497450535249,"synopsis":"People Powered Money is the result of a project running from 2012-2015, Community Currencies in Action (CCIA). Part-funded by the European Union’s Interreg project, CCIA is a transnational project in the community currency field, bringing together expert partners from across north-west Europe and co-ordinating six pilot currencies in the United Kingdom, Belgium, the Netherlands and France."},{"slug":"what-is-in-the-book","title":"What is in the book?","date":1497446347485,"synopsis":"The book is divided into two parts. Part One gives a non-technical overview of the potential benefits and major pragmatic considerations of community currency projects. As such, it may be particularly useful for those in the policymaking world or people new to the field."},{"slug":"wir-bank","title":"WIR Bank","date":1497450484228,"synopsis":"The Swiss [[WIR Bank]] (abbreviation of Wirtschaftsring or ’business circle’ Bank) was founded in 1934 as business was decimated during the interwar financial crisis. Today, the WIR Bank has a ten-figure turnover and over 60,000 members – mostly SMEs (small and medium-sized enterprises) in construction, hospitality, manufacturing and retail."},{"slug":"zeitvorsoge","title":"Zeitvorsoge","date":1497457871307,"synopsis":"A good example of using a community currency to facilitate co-production of public services is the ‘Zeitvorsoge’ – literally ‘time- provision’ – initiative, launched and financed by the City of St. Gallen, Switzerland."}]