[{"slug":"a-sound-garden","title":"A Sound Garden","date":1501844972005,"synopsis":"A Sound Garden is one of six outdoor public art works on the National Oceanic and Atmospheric Administration (NOAA) campus that lies adjacent to the Warren G. Magnuson Park on the northwestern shore of Lake Washington in Seattle, Washington. The Seattle Arts Commission guided the jury selection headed by Sadao James Hilario, Engineer-in-charge of the GSA Art in Architecture Program for the NOAA Project, and the jury chose five artists from a pool of more than 250 - [https://en.wikipedia.org/wiki/A_Sound_Garden wikipedia]"},{"slug":"alexander-mackenzie","title":"Alexander Mackenzie","date":1503251657167,"synopsis":"Alexander McKenzie was landscape designer to the Metropolitan Board of Works. He designed several public parks, including Alexandra Palace. He became the first superintendent of Alexandra Palace Park, and was also bailiff of Epping Forest and Burnham Beeches."},{"slug":"birkenhead-park","title":"Birkenhead Park","date":1503240007068,"synopsis":"Birkenhead Park is a public park in the centre of Birkenhead, in the Metropolitan Borough of Wirral, in Merseyside, England. It was designed by Joseph Paxton and opened on 5 April 1847. It is generally acknowledged as the first publicly funded civic park in the world. Paxton had earlier designed Princes Park, Liverpool, a private development - [https://en.wikipedia.org/wiki/Birkenhead_Park wikipedia]"},{"slug":"cgp-london","title":"CGP London","date":1503252645154,"synopsis":"CGP London is an artist led gallery of contemporary art based across two venues in [[Southwark Park]]; The Gallery and Dilston Grove."},{"slug":"deer-park-england","title":"Deer park (England)","date":1503237984995,"synopsis":"In medieval and Early Modern England, a deer park was an enclosed area containing deer. It was bounded by a ditch and bank with a wooden park pale on top of the bank, or by a stone or brick wall."},{"slug":"derby-arboretum","title":"Derby Arboretum","date":1503239061180,"synopsis":"Derby Arboretum is a public park and arboretum in the city of Derby, England, located about 1 mile (1.6 km) south of the city centre in the Rose Hill area - [https://en.wikipedia.org/wiki/Derby_Arboretum wikipedia]"},{"slug":"early-history-of-soho","title":"Early History Of Soho","date":1489839672923,"synopsis":"In the [[Middle Ages]], what is now Soho was known as Saint Giles Field, a farmland belonging to the Convent of Abingdon and the master of Burton St Lazar ([[Burton Lazars]]) Hospital in [[Leicestershire]], who owned a leper ([[leprosy]]) hospital in [[St Giles in the Fields]]. In 1536, the land was taken by Henry VIII ([[Henry VIII of England]]) as a royal park for the [[Palace of Whitehall]].[http://www.british-history.ac.uk/survey-london/vols33-4/pp20-26 Estate and Parish History] - [https://en.wikipedia.org/wiki/Soho#Early_history wikipedia]"},{"slug":"ecology-centre","title":"Ecology Centre","date":1501191801925,"synopsis":"Gillespi Park Ecology Centre is 2.8 hectare nature reserve which is home to a wealth of wildlife, including 244 species of plants, 94 species of birds and 24 types of butterflies. The centre gives advice on wildlife, gardening and sustainable living."},{"slug":"festivals-in-finsbury-park","title":"Festivals in Finsbury Park","date":1503175184063,"synopsis":"[[Finsbury Park]] has a long history of music festivals going back to [[Hendrix at the Astoria (1967)]] - [https://en.wikipedia.org/wiki/Finsbury_Park#Live_music_in_Finsbury_Park wikipedia]"},{"slug":"finsbury-park","title":"Finsbury Park","date":1503251818522,"synopsis":"Finsbury Park is a public park in the ward of the London neighbourhood of Harringay. It is in the area formerly covered by the historic parish of Hornsey, succeeded by the Municipal Borough of Hornsey - [https://en.wikipedia.org/wiki/Finsbury_Park wikipedia]"},{"slug":"finsbury-park-act-of-1857","title":"Finsbury Park Act of 1857","date":1503159189927,"synopsis":"I had a search on the National Archives website for the Finsbury Park Act 1857 and there aren't any records. I wonder if it was replaced by subsequent law on public open spaces without being repealed (as often seems to happen in English law)."},{"slug":"finsbury-park-feast","title":"Finsbury Park FEAST","date":1503176903006,"synopsis":"Finsbury Park [[FEAST]] is the format for a series of local cultural events leading up to the 150th Anniversary of the [[Founding of Finsbury Park]]."},{"slug":"founding-of-finsbury-park","title":"Founding of Finsbury Park","date":1503251686901,"synopsis":"An 'out-county' park for Finsbury residents was first proposed in 1850 because of severe overcrowding and the [[Finsbury Park Act of 1857]], the earliest act for a municipal park for London, set aside 250 acres (104ha) of land."},{"slug":"history-of-finsbury-park","title":"History of Finsbury Park","date":1503236789154,"synopsis":"Here we look at the various aspects of the history of [[Finsbury Park]], leading up to celebrating it's 150th year anniversary in 2019."},{"slug":"history-of-london-parks","title":"History of London Parks","date":1503237775926,"synopsis":"<img src='https://www.google.com/s2/favicons?domain=books.google.co.uk' style='vertical-align: middle; width:16px; height:16px' /><a target=_blank style='vertical-align: middle; padding-left: 10px; padding-right: 12px; text-decoration: none;' href='https://books.google.co.uk/books?id=cFVEBQAAQBAJ'>Municipal Parks, Gardens, and Open Spaces of London - John James Sexby - Google Books</a>"},{"slug":"history-of-public-parks","title":"History of Public Parks","date":1503250966118,"synopsis":"Here we look at researching and gathering information about public parks, that is parks that were brought into existence by local councils."},{"slug":"park","title":"Park","date":1503237945786,"synopsis":"A park is an area of natural, semi-natural or planted space set aside for human enjoyment and recreation or for the protection of wildlife or natural habitats - [https://en.wikipedia.org/wiki/Park wikipedia]"},{"slug":"peel-park-salford","title":"Peel Park, Salford","date":1503239659120,"synopsis":"Peel Park is a public urban park in Salford, Greater Manchester, England, located on the flood plain of the River Irwell below Salford Crescent and adjacent to the University of Salford - [https://en.wikipedia.org/wiki/Peel_Park,_Salford wikipedia]"},{"slug":"princes-park-liverpool","title":"Prince's Park, Liverpool","date":1503239308992,"synopsis":"Prince's Park in Toxteth, Liverpool, England, is a 45 ha (110 acres) municipal park, 2 mi (3.2 km) south east of Liverpool city centre. In 2009, its status was upgraded to a Grade II* Historic Park by English Heritage - [https://en.wikipedia.org/wiki/Prince%27s_Park,_Liverpool wikipedia]"},{"slug":"southwark-park","title":"Southwark Park","date":1504457590012,"synopsis":"Southwark Park is located in Rotherhithe, in central South East London, and is managed by the London Borough of Southwark. It first opened in 1869 by the Metropolitan Board of Works as one of its first parks. It was designed by Alexander McKenzie and covers 63 acres (250,000 m2). It takes its name from being in what was the old Parliamentary constituency of Southwark at the time of its opening - [https://en.wikipedia.org/wiki/Southwark_Park wikipedia]"},{"slug":"welcome-visitors","title":"Welcome Visitors","date":1504455426072,"synopsis":"Here I write and research about the [[History of Pubic Parks]]. My particular interest is [[Finsbury Park]] and the philosophical and political context which led to the creation of these forms of public space in some countries and not in others."}]