[{"slug":"adhocracy","title":"Adhocracy","date":1509881185843,"synopsis":"Adhocracy is a flexible, adaptable and informal form of organization that is defined by a lack of formal structure. It operates in an opposite fashion to a bureaucracy - [https://en.wikipedia.org/wiki/Adhocracy wikipedia]"},{"slug":"changes-to-this-site","title":"Changes to this Site","date":1434532209841,"synopsis":"Below we list recent changes to this site only without also listing changes from the [[Neighbourhood]]:"},{"slug":"facilitation","title":"Facilitation","date":1501088895816,"synopsis":"Facilitation is an emerging industry to perform the specialized role of assisting groups to collaborate, explore ideas or solve problems."},{"slug":"fedwiki-tools","title":"Fedwiki Tools","date":1509546962150,"synopsis":"Here we list a few tools that are of particular use in managing and creating [[Fedwiki]] content."},{"slug":"governance","title":"Governance","date":1509882175933,"synopsis":"Here we gather notes and research [[Governance]],"},{"slug":"michel-foucault","title":"Michel Foucault","date":1491136472429,"synopsis":"Michel Foucault (October 1926 – 25 June 1984) was a French philosopher, historian of ideas, social theorist, philologist and literary critic  - [https://en.wikipedia.org/wiki/Michel_Foucault wikipedia]"},{"slug":"obuchenie-skunkworks","title":"Obuchenie Skunkworks","date":1509881667960,"synopsis":"Obuchenie is the Russian word which does not translate in English in an equivalent sense, but roughly speaking it means both teaching and learning."},{"slug":"open-collective","title":"Open Collective","date":1509889111409,"synopsis":"While the Internet has been very good so far at helping people do things together, it is still very difficult for groups to collect money and use it transparently. As a result, we see initiatives, projects, movements popping up here and there that disappear quickly from lack of funding."},{"slug":"professor-henry-higgins","title":"Professor Henry Higgins","date":1509881296032,"synopsis":"Henry Higgins in the play and film Pygmalion changes the life of Eliza through coaching her speech. In so doing the relationship between teacher and student is explored. The setting for the professional activity of Higgins is a private clinic in the Harley Street area of London. This is the area associated with specialist medicine which developed in an era before the National Health Service."},{"slug":"skunkworks","title":"Skunkworks","date":1509881842511,"synopsis":"A skunkworks project is a project developed by a small and loosely structured group of people who research and develop a project primarily for the sake of radical innovation. The terms originated with Lockheed's World War II Skunk Works project - [https://en.wikipedia.org/wiki/Skunkworks_project wikipedia]"},{"slug":"soft-power","title":"Soft power","date":1509882107946,"synopsis":"Soft power is a concept developed by Joseph Nye of Harvard University to describe the ability to attract and co-opt rather than by coercion (hard power), using force or giving money as a means of persuasion- [https://en.wikipedia.org/wiki/Soft_power wikipedia]"},{"slug":"welcome-visitors","title":"Welcome Visitors","date":1509882127179,"synopsis":"Here we gather notes and research [[Governance]],"}]