[{"slug":"beaker","title":"Beaker","date":1507714637061,"synopsis":"Beaker is an experimental Peer-to-Peer web browser, using Dat Protocol. [https://beakerbrowser.com/ site]"},{"slug":"dat","title":"dat","date":1448889098514,"synopsis":"[[Dat]] is an open source project that provides a streaming interface between every file format and data storage backend. API's include [[Command Line]], [[REST]], and [[JavaScript]]"},{"slug":"decentralised-protocols","title":"Decentralised protocols","date":1523465393680,"synopsis":"Here we review the rapidly expanding ecosystem of decentralised protocols that we can build with. We can use these protocols to create architectures that are p2p or federated, but that do not rely on conventional centralised servers."},{"slug":"decentralized-technology","title":"Decentralized Technology","date":1523463885111,"synopsis":"In recent times there has been a lot of interest in building decentralised technologies for the web. historically there have been many such attempts, but the newer technology stacks, thanks in no small part to the perceived success of [[blockchain]] technology, looks particulalry promissing."},{"slug":"ethereum","title":"Ethereum","date":1464377729809,"synopsis":"Web 3.0 publishing platform. Purpose of Ethereum is to decentralise the Web. Read more on [http://en.wikipedia.org/wiki/ethereum Wikipedia] and [https://forum.ethereum.org Ethereum forum]"},{"slug":"fedwiki-tools","title":"Fedwiki Tools","date":1449105067435,"synopsis":"Here we list a few tools that are of particular use in managing and creating [[Fedwiki]] content."},{"slug":"holochain","title":"Holochain","date":1514134906111,"synopsis":"Holographic storage for distributed applications. A holochain is a validating distributed hash table (DHT) where every node enforces validation rules on data against the signed chains where the data originated - [http://ceptr.org/projects/holochain ceptr.org]"},{"slug":"ipfs","title":"IPFS","date":1523450482347,"synopsis":"IPFS stands for the [[InterPlanetary File System]]. IPFS is a bold attempt at evolving the Internet's infrastructure."},{"slug":"polkadot","title":"Polkadot","date":1508256510263,"synopsis":"Present-day blockchain architectures all suffer from a number of issues not least practical means of extensi- bility and scalability - [https://polkadot.io/ polkadot.io]"},{"slug":"research-activity","title":"Research Activity","date":1523450939476,"synopsis":"On this page you can find [[research groups]] that are working on topics related to the current [[domain]]:"},{"slug":"secure-scuttlebutt","title":"Secure Scuttlebutt","date":1509847757545,"synopsis":"Scuttlebutt is a decent(ralised) secure gossip platform. Historically, sea-slang for gossip - a scuttlebutt is basically a watercooler on a ship."},{"slug":"welcome-visitors","title":"Welcome Visitors","date":1523476666085,"synopsis":"The [[Outlandish Academy]] is a P2P framework for creating online and offline learning experiences. Here we research and gather information about [[Decentralized Technology]] that we can use to [[Redecentralize The Web]]."},{"slug":"wikidata-for-research","title":"Wikidata for Research","date":1417798227066,"synopsis":"... we plan to draft a proposal that aims at establishing Wikidata as a central hub for linked open research data more generally, so that it can facilitate fruitful interactions at scale between professional research institutions and citizen science and knowledge initiatives. We plan to draft this proposal in public – you can join us and help develop it via a dedicated page on Wikidata. [http://blog.wikimedia.de/2014/12/05/wikidata-for-research-a-grant-proposal-that-anyone-can-edit/ post]"}]