[{"slug":"accreditation-is-important","title":"Accreditation Is Important","date":1495217474552,"synopsis":"Accreditation is important. It is harmless, and builds trust. I have never asked for money, nor more than being jointly accredited with the creative concept. Without this, an artist, writer or scientist is constantly wary of sharing their ideas with fellow creators. Many times I have come across friends, and colleagues who have heard of Plantoid and described it as an original work by Primavera Di Filippi. In the original publicity material FurtherField refers to the work as “Plantoid conceived and developed by Primavera de Filippi”."},{"slug":"aeration","title":"Aeration","date":1466190328702,"synopsis":"Aeration (also called aerification) is the process by which air is circulated through, mixed with or dissolved in a liquid or substance - [https://en.wikipedia.org/wiki/Aeration wikipedia]"},{"slug":"aeroponics","title":"Aeroponics","date":1466190638343,"synopsis":"Aeroponics is the process of growing plants in an air or mist environment without the use of soil or an aggregate medium (known as geoponics). The word \"aeroponic\" is derived from the Greek meanings of aero- (air) and ponos (labour). Aeroponic culture differs from both conventional hydroponics, aquaponics, and in-vitro (plant tissue culture) growing. Unlike hydroponics, which uses a liquid nutrient solution as a growing medium and essential minerals to sustain plant growth; or aquaponics which uses water and fish waste, aeroponics is conducted without a "},{"slug":"aquaculture","title":"Aquaculture","date":1466180295810,"synopsis":"Aquaculture is the captive rearing and production of fish and other aquatic animal and"},{"slug":"aquaponics","title":"Aquaponics","date":1466190659227,"synopsis":"Aquaponics, refers to any system that combines conventional aquaculture (raising aquatic animals such as snails, fish, crayfish or prawns in tanks) with hydroponics (cultivating plants in water) in a symbiotic environment."},{"slug":"arduino","title":"Arduino","date":1466336876124,"synopsis":"Arduino is a hardware and software company, project, and user community that designs and manufactures computer open-source hardware, open-source software, and microcontroller-based kits for building digital devices and interactive objects that can sense and control physical devices - [https://en.wikipedia.org/wiki/Arduino wikipedia]"},{"slug":"arduino-based-aquaponics","title":"Arduino Based Aquaponics","date":1466325668243,"synopsis":"Here we collect some links and research on using [[Arduino]] or other small cheap embedded devices to facilitate the how we might control and monitor [[Aquaponics]]."},{"slug":"arduino-based-ph-sensors","title":"Arduino Based pH Sensors","date":1466327144991,"synopsis":"Here we collect some links about low cost [[pH]] sensors that we can build into projects."},{"slug":"asexual-plant-reproduction","title":"Asexual Plant Reproduction","date":1428827919828,"synopsis":"Plants have two main types of asexual reproduction in which new plants are produced that are genetically identical clones of the parent individual - [https://en.wikipedia.org/wiki/Plant_reproduction#Asexual_reproduction wikipedia]"},{"slug":"attraction-strategies","title":"Attraction Strategies","date":1428925644843,"synopsis":"Flowers are [[Attraction Strategies]] and [[Sexual Expressions]] are functional strategies used to produce the next generation of plants, with pollinators and plants having co-evolved, often to some extraordinary degrees, very often rendering mutual benefit."},{"slug":"ayahuasca","title":"Ayahuasca","date":1466337220172,"synopsis":"These sessions vary greatly depending on the vegetalista conducting the ceremony, and there are significant differences between an ayahuasca session held in an urban setting and one held in a rural setting."},{"slug":"bacteria-for-aquaponics","title":"Bacteria For Aquaponics","date":1466189693619,"synopsis":"Nitrification, the aerobic ([[aerobic organism]]) conversion of ammonia into nitrates, is one of the most important functions in an aquaponics system as it reduces the toxicity of the water for fish, and allows the resulting nitrate compounds to be removed by the plants for nourishment."},{"slug":"biofeedback","title":"Biofeedback","date":1466328621136,"synopsis":"Biofeedback is the process of gaining greater awareness of many physiological functions primarily using instruments that provide information on the activity of those same systems, with a goal of being able to manipulate them at will. Some of the processes that can be controlled include brainwaves, muscle tone, skin conductance, heart rate and pain perception - [https://en.wikipedia.org/wiki/Biofeedback wikipedia]"},{"slug":"biofilter","title":"Biofilter","date":1466190547038,"synopsis":"In an aquaponics system, the bacteria responsible for the conversion of ammonia to usable nitrates for plants form a [[biofilm]] on all solid surfaces throughout the system that are in constant contact with the water - [https://en.wikipedia.org/wiki/Aquaponics#Biofilter wikipedia]"},{"slug":"biofiltration","title":"Biofiltration","date":1466190419892,"synopsis":"Biofiltration is a pollution control technique using living material to capture and biologically degrade pollutants. Common uses include processing waste water, capturing harmful chemicals or silt from surface runoff, and microbiotic oxidation of contaminants in air - [https://en.wikipedia.org/wiki/Biofiltration wikipedia]"},{"slug":"biological-pest-control","title":"Biological pest control","date":1466190406233,"synopsis":"Biological control is a method of controlling pests such as insects, mites, weeds and plant diseases using other organisms. It relies on predation, parasitism, herbivory, or other natural mechanisms, but typically also involves an active human management role. It can be an important component of integrated pest management (IPM) programs. There are three basic types of biological pest control strategies: importation (sometimes called classical biological control), augmentation and conservation - [https://en.wikipedia.org/wiki/Biological_pest_control wikip"},{"slug":"biologically-inspired-cybords","title":"Biologically Inspired Cybords","date":1495550332979,"synopsis":"Random pulses cascade among tiny computers each programmed to interface one more device into their signaling pathways. [http://c2.com/cybords/ site]"},{"slug":"biomimicry","title":"Biomimicry","date":1466193265891,"synopsis":"Biomimetics or biomimicry is the imitation of the models, systems, and elements of nature for the purpose of solving complex human problems. The terms \"biomimetics\" and \"biomimicry\" derive from Ancient Greek: βίος (bios), life, and μίμησις (mīmēsis), imitation, from μιμεῖσθαι (mīmeisthai), to imitate, from μῖμος (mimos), actor. A closely related field is bionics - [https://en.wikipedia.org/wiki/Biomimicry wikipedia]"},{"slug":"bioremediation","title":"Bioremediation","date":1466190663618,"synopsis":"Bioremediation is a waste management technique that involves the use of organisms to remove or neutralize pollutants from a contaminated site. According to the United States EPA, bioremediation is a “treatment that uses naturally occurring organisms to break down hazardous substances into less toxic or non toxic substances”. Technologies can be generally classified as in situ or ex situ. In situ bioremediation involves treating the contaminated material at the site, while ex situ involves the removal of the contaminated material to be treated elsewhere. "},{"slug":"calcium-in-biology","title":"Calcium in biology","date":1466190288421,"synopsis":"Calcium ions (Ca2+) play a vital role in the physiology and biochemistry of organisms and the cell. They play an important role in signal transduction pathways, where they act as a second messenger, in neurotransmitter release from neurons, in contraction of all muscle cell types, and in fertilization. Many enzymes require calcium ions as a cofactor, those of the blood-clotting cascade being notable examples. Extracellular calcium is also important for maintaining the potential difference across excitable cell membranes, as well as proper bone formation "},{"slug":"changes-to-this-site","title":"Changes to this Site","date":1434641767059,"synopsis":"Below we list recent changes to this site only without also listing changes from the [[Neighbourhood]]:"},{"slug":"chaosmosis","title":"Chaosmosis","date":1466337868418,"synopsis":"In his last book, Chaosmosis (1992), [[Guattari]] returned to the question of subjectivity: \"How to produce it, collect it, enrich it, reinvent it permanently in order to make it compatible with mutant Universes of value?\""},{"slug":"chinampa","title":"Chinampa","date":1466190681241,"synopsis":"Chinampa (Nahuatl: chināmitl [tʃiˈnaːmitɬ]) is a type of Mesoamerican agriculture which used small, rectangular areas of fertile arable land to grow crops on the shallow lake beds in the Valley of Mexico - [https://en.wikipedia.org/wiki/Chinampa wikipedia]"},{"slug":"construction-aggregate","title":"Construction Aggregate","date":1466190316569,"synopsis":"Construction aggregate, or simply \"aggregate\", is a broad category of coarse particulate material used in construction, including sand, gravel, crushed stone, slag, recycled concrete and geosynthetic aggregates. Aggregates are the most mined materials in the world. Aggregates are a component of composite materials such as concrete and asphalt concrete; the aggregate serves as reinforcement to add strength to the overall composite material. Due to the relatively high hydraulic conductivity value as compared to most soils, aggregates are widely used in dra"},{"slug":"currently-working-on","title":"Currently Working On","date":1466092280229,"synopsis":"Here is a list of [[Recent Changes]] I consider important. View our experiments on the [[Scratch]] page. To clear stuff saved in your browser try [[Local Changes]]."},{"slug":"fedwiki-tools","title":"Fedwiki Tools","date":1466624227301,"synopsis":"Here we list a few tools that are of particular use in managing and creating [[Fedwiki]] content:"},{"slug":"fish","title":"Fish","date":1466188656026,"synopsis":"A fish is any member of a paraphyletic group of organisms that consist of all gill-bearing aquatic craniate animals that lack limbs with digits. Included in this definition are the living hagfish, lampreys, and cartilaginous and bony fish, as well as various extinct related groups. Most fish are ectothermic (\"cold-blooded\"), allowing their body temperatures to vary as ambient temperatures change, though some of the large active swimmers like white shark and tuna can hold a higher core temperature. Fish are abundant in most bodies of water. They can be fo"},{"slug":"fish-for-aquaponics","title":"Fish for Aquaponics","date":1466189560008,"synopsis":"Filtered water from the hydroponics system drains into a right tank for re-circulation."},{"slug":"flix-guattari","title":"Félix Guattari","date":1466330504664,"synopsis":"Pierre-Félix Guattari; April 30, 1930 – August 29, 1992) was a French psychotherapist, philosopher, semiologist, and militant."},{"slug":"flowering-plants","title":"Flowering plants","date":1428827177171,"synopsis":"Flowering plants are the dominant plant form on land and they reproduce by sexual and asexual means. Often their most distinguishing feature is their reproductive organs, commonly called flowers - [https://en.wikipedia.org/wiki/Plant_reproduction#Flowering_plants wikipedia]"},{"slug":"from-tree-to-shining-tree","title":"From Tree to Shining Tree","date":1469975952360,"synopsis":"Forests feel like a place of great stillness but dig deeper and theres a hidden world beneath your feet as busy and complicated as a city - [http://www.radiolab.org/story/from-tree-to-shining-tree/?utm_source=sharedUrl&utm_medium=metatag&utm_campaign=sharedUrl radiolab.org]"},{"slug":"history","title":"History","date":1466190452522,"synopsis":"Aquaponics has ancient roots, although there is some debate on its first occurrence: - [https://en.wikipedia.org/wiki/Aquaponics#History wikipedia]"},{"slug":"history-of-the-project","title":"History of the Project","date":1431974878652,"synopsis":"I originally started to look into this project following an invitation by [[K]] to explore ideas for physical structures (sculptures) that might communicate the ideas behind the strange new quasi-legal forms we were working on know as [[DAO]]s."},{"slug":"how-well-the-plants-grow","title":"How Well the Plants Grow","date":1424436148228,"synopsis":"This is a quick thought. The thought is that it would be useful to build in a physical sensor\" into the [[Building Utopia]] project. Something that we can easily measure in terms of real world effect of the methodology."},{"slug":"hydroponic-subsystem","title":"Hydroponic Subsystem","date":1466190041307,"synopsis":"Since plants at different growth stages require different amounts of minerals and nutrients, plant harvesting is staggered with seedlings growing at the same time as mature plants. This ensures stable nutrient content in the water because of continuous symbiotic cleansing of toxins from the water.[http://biology.westfield.ma.edu/Biol300/sites/default/files/Aquaponic-Production-of-Tilapia-and-Basil.pdf Aquaponic production of tilapia and basil: Comparing a batch and staggered cropping system]"},{"slug":"icaro","title":"Icaro","date":1466337642401,"synopsis":"An icaro (Quechua: ikaro) is a song sung or whistled in vegetal ceremonies. The word icaro is believed to derive from the Quechua verb ikaray, which means \"to blow smoke in order to heal\" - [https://en.wikipedia.org/wiki/Icaro wikipedia]"},{"slug":"iit-plantoid-project","title":"IIT Plantoid Project","date":1431523441684,"synopsis":"An example of a plantoid in active research was demonstrated by Dr Mazzolai of the Italian Institute of Technology, in Pontedera plans during a conference at the [[Natural History Museum in London]] on July 29th 2013."},{"slug":"integrated-information-theory","title":"Integrated information theory","date":1466449483054,"synopsis":"Integrated information theory (IIT) attempts to explain what consciousness is and why it might be associated with certain physical systems  - [https://en.wikipedia.org/wiki/Integrated_information_theory wikipedia]"},{"slug":"invisible-forest","title":"Invisible Forest","date":1466324155999,"synopsis":"The 'Invisible Forest\" was a sound installation by the artist Augustine Leudar in 2013, where sensors picked up on the electrical activity of trees, and produced and immersive soundscape - [http://www.augustineleudar.com/ augustineleudar.com]"},{"slug":"microponics","title":"Microponics","date":1466193375449,"synopsis":"Microaquaponics is the symbiotic integration of fish, plants and micro-livestock in a semi-controlled environment. The term was created recently by Australian urban farmer, Gary Donaldson to describe his integrated backyard food production concept. While microponics was also the name given to an obscure grafting method used in hydroponics, Donaldson's use of the term was derived from the integration of micro-livestock (and micro-farming) and the production of fish and plants - aquaponics - [https://en.wikipedia.org/wiki/Microponics wikipedia]"},{"slug":"open-source-hardware","title":"Open-source hardware","date":1466329195551,"synopsis":"Open-source hardware (OSH), consists of physical artifacts of technology designed and offered by the open design movement. Both free and open-source software (FOSS) as well as open-source hardware is created by this open-source culture movement and applies a like concept to a variety of components. It is sometimes, thus, referred to as FOSH (free and open-source hardware). The term usually means that information about the hardware is easily discerned so that others can make it - coupling it closely to the maker movement. Hardware design (i.e. mechanical "},{"slug":"operation","title":"Operation","date":1466190372720,"synopsis":"The five main inputs to the system are water, oxygen, light, feed given to the aquatic animals, and electricity to pump, filter, and oxygenate the water. Spawn ([[Spawn (biology)]]) or fry ([[Juvenile fish]]) may be added to replace grown fish that are taken out from the system to retain a stable system. In terms of outputs, an aquaponics system may continually yield plants such as vegetables grown in hydroponics, and edible aquatic species raised in an aquaculture.  Typical build ratios are .5 to 1 [[square foot]] of grow space for every 1USgalliter of "},{"slug":"parents","title":"Parents","date":1431448550195,"synopsis":"We document the [[History of the Project]] as it evolves. We hope and aim to develop a [[Human Ecosystem]] around the [[Plantoid]] so that she has a chance of surviving the most difficult [[Early Years]]."},{"slug":"parts-of-an-aquaponic-system","title":"Parts of an aquaponic system","date":1466188943624,"synopsis":"A commercial aquaponics system. An electric pump moves nutrient-rich water from the fish tank through a solids filter to remove particles the right (thumb ([[plants ([[Image:Aquaponics at Growing Power, Milwaukee.jpg]]))) above cannot absorb. The [[water]] then provides nutrients for the plants and is cleansed before returning to the fish tank below.]] - [https://en.wikipedia.org/wiki/Aquaponics#Parts_of_an_aquaponic_system wikipedia]"},{"slug":"permaculture","title":"Permaculture","date":1466193293833,"synopsis":"Permaculture is a system of agricultural and social design principles centered on simulating or directly utilizing the patterns and features observed in natural ecosystems. The term permaculture (as a systematic method) was first coined by David Holmgren, then a graduate student, and his professor, Bill Mollison, in 1978. The word permaculture originally referred to \"permanent agriculture\", but was expanded to stand also for \"permanent culture\", as it was understood that social aspects were integral to a truly sustainable system as inspired by Masanobu F"},{"slug":"ph","title":"pH","date":1466190429150,"synopsis":"In chemistry, pH (/piːˈeɪtʃ/) is a numeric scale used to specify the acidity or basicity (alkalinity) of an aqueous solution. It is roughly the negative of the logarithm to base 10 of the molar concentration, measured in units of moles per liter, of hydrogen ions. More precisely it is the negative of the logarithm to base 10 of the activity of the hydrogen ion. Solutions with a pH less than 7 are acidic and solutions with a pH greater than 7 are basic. Pure water is neutral, being neither an acid nor a base. Contrary to popular belief, the pH value can b"},{"slug":"plant-electric-fields","title":"Plant Electric Fields","date":1466332172642,"synopsis":"Bees don’t just recognise flowers by their colour and scent; they can also pick up on their minute electric fields. Such fields—which form from the imbalance of charge between the ground and the atmosphere—are unique to each species, based on the plant’s distance from the ground and shape - [http://www.sciencemag.org/news/2016/05/video-how-bees-sense-flower-s-electric-field sciencemag.org]"},{"slug":"plant-intelligence","title":"Plant Intelligence","date":1469976080271,"synopsis":"Plants behave in some oddly intelligent ways: fighting predators, maximizing food opportunities ... But can we think of them as actually having a form of intelligence of their own?"},{"slug":"plant-sexual-history","title":"Plant Sexual History","date":1428827127140,"synopsis":"Unlike animals, plants are immobile, and cannot seek out sexual partners for reproduction. In the evolution of early plants, abiotic means, including water and wind, transported sperm for reproduction - [https://en.wikipedia.org/wiki/Plant_reproduction#History_of_sexual_reproduction wikipedia]"},{"slug":"plantoid","title":"Plantoid","date":1495234565599,"synopsis":"Below is the original proposal sent to Primavera (and dated) - [https://docs.google.com/document/d/1puG_Pzv7DsP5woNjfrdmGNuCjSxhDLHDRHQavuJcMH4/edit#heading=h.e0d9jhgec6bo docs.google.com]"},{"slug":"plantoid-as-dao","title":"Plantoid as DAO","date":1492126728062,"synopsis":"Here is an example of a [[DAO]] that is structured somewhat like [[Plantoid]] - [http://garzikrants.blogspot.ch/2013/01/storj-and-bitcoin-autonomous-agents.html garzikrants.blogspot.ch]"},{"slug":"plantoid-science","title":"Plantoid Science","date":1492126336038,"synopsis":"The term Plantoid was first used in a sceintific context by in reference to a hypothetical robot or synthetic organism designed to look, act and grow like a plant."},{"slug":"plants","title":"Plants","date":1427666255819,"synopsis":"Plants are [[Minecraft]]'s representation of plant life. They do not move, but some can grow and spread under the right conditions. Most plants can be planted and farmed. All plants occur naturally in the [[Overworld]], with the exception of [[Nether Warts]] - [http://minecraft.gamepedia.com/Plants gamepedia.com]"},{"slug":"plants-and-art","title":"Plants and Art","date":1497947947548,"synopsis":"A few links and thoughts on artists and plant metaphors:"},{"slug":"plants-and-machines","title":"Plants and Machines","date":1450816821160,"synopsis":"Food replicating Robots from Open Source Technologies"},{"slug":"plants-for-aquaponics","title":"Plants for Aquaponics","date":1466190010609,"synopsis":"A Deep Water Culture hydroponics system where plant grow directly into the effluent rich water without a right medium. Plants can be spaced closer together because the roots do not need to expand outwards to support the weight of the plant."},{"slug":"pollination","title":"Pollination","date":1428925650244,"synopsis":"In plants that use insects or other animals to move pollen from one flower to the next, plants have developed greatly modified flower parts to attract pollinators and to facilitate the movement of pollen from one flower to the insect and from the insect back to the next flower - [https://en.wikipedia.org/wiki/Plant_reproduction#Pollination wikipedia]"},{"slug":"potassium-in-biology","title":"Potassium in biology","date":1466190278004,"synopsis":"Potassium is an essential mineral micronutrient and is the main intracellular ion for all types of cells. It is important in maintaining fluid and electrolyte balance in the bodies of humans and animals. Potassium is necessary for the function of all living cells, and is thus present in all plant and animal tissues. It is found in especially high concentrations within plant cells, and in a mixed diet, it is most highly concentrated in fruits. The high concentration of potassium in plants, associated with comparatively very low amounts of sodium there, hi"},{"slug":"pulsum-plantae","title":"Pulsu(m) Plantae","date":1466336786725,"synopsis":"Pulsu (m Plantae is a project that empirically analyzes which are the mechanisms that plants use to communicate and also how their own biological processes are a manifestation of communication, seemingly intangible to our senses  - [http://lessnullvoid.cc/pulsum lessnullvoid.cc]"},{"slug":"pure-data","title":"Pure Data","date":1466336821200,"synopsis":"Pure Data (Pd) is a visual programming language developed by Miller Puckette in the 1990s for creating interactive computer music and multimedia works. While Puckette is the main author of the program, Pd is an open source project with a large developer base working on new extensions. It is released under a license similar to the BSD license. It runs on GNU/Linux, Mac OS X, iOS, Android and Windows. Ports exist for FreeBSD and IRIX - [https://en.wikipedia.org/wiki/Pure_data wikipedia]"},{"slug":"rhizome","title":"Rhizome","date":1459268027893,"synopsis":"Rhizome is a philosophical concept developed by Gilles Deleuze and Félix Guattari. It is what Deleuze calls an \"image of thought\", based on the botanical rhizome, that apprehends multiplicities - [https://en.wikipedia.org/wiki/Rhizome_%28philosophy%29 wikipedia]"},{"slug":"robot-plant","title":"Robot Plant","date":1431523467728,"synopsis":"Robotots usually move, but a robot plant moves like a plant. It may turn slowly towards the sun, or it may be still. However it breathes, in captures energy, and it produces. It is alive."},{"slug":"robot-plant-desings","title":"Robot Plant Desings","date":1431522899482,"synopsis":"Here I outline a few thoughts about potential designs for the first and [[Future Plantoids]]."},{"slug":"settling-basin","title":"Settling basin","date":1466190300162,"synopsis":"A settling basin, settling pond or decant pond is an earthen or concrete structure using sedimentation to remove settleable matter and turbidity from wastewater. The basins are used to control water pollution in diverse industries such as agriculture, aquaculture, and mining. Turbidity is an optical property of water caused by scattering of light by material suspended in that water. Although turbidity often varies directly with weight or volumetric measurements of settleable matter, correlation is complicated by variations in size, shape, refractive inde"},{"slug":"singing-with-plants","title":"Singing With Plants","date":1466344536360,"synopsis":"In this project we look to research, document and write together on a project to examine [[How Plants Communicate]]."},{"slug":"soil-less-culture","title":"Soil-less Culture","date":1466180172466,"synopsis":"Soil-less culture is the method of growing"},{"slug":"solar-power","title":"Solar power","date":1507289798373,"synopsis":"Solar power is the conversion of energy from sunlight into electricity, either directly using photovoltaics (PV), or indirectly using concentrated solar power. Concentrated solar power systems use lenses or mirrors and tracking systems to focus a large area of sunlight into a small beam. Photovoltaic cells convert light into an electric current using the photovoltaic effect - [https://en.wikipedia.org/wiki/Solar_power wikipedia]"},{"slug":"starch","title":"Starch","date":1428873031461,"synopsis":"In photosynthesis, plants use light energy to produce glucose from carbon dioxide. The glucose is stored mainly in the form of starch granules, in plastids such as chloroplasts and especially amyloplasts."},{"slug":"tezos","title":"Tezos","date":1492114071201,"synopsis":"Tezos, a generic and self-amending crypto-ledger."},{"slug":"the-power-of-plants","title":"The Power of Plants","date":1431522856770,"synopsis":"When looking at a garden, meadow or forest, that half of almost every plant in it is underground."},{"slug":"theory","title":"Theory","date":1466193389832,"synopsis":"No section text, so add your own here.. - [https://en.wikipedia.org/wiki/Permaculture#Theory wikipedia]"},{"slug":"vegetalismo","title":"Vegetalismo","date":1466337074392,"synopsis":"Vegetalismo is a term used to refer to a practice of mestizo shamanism in the Amazonic provinces of Peru in which the shamans – known as vegetalistas – gain their knowledge and power to cure from the vegetables, or plants of the region. Many receive their knowledge from ingesting the hallucinogenic, emetic brew ayahuasca - [https://en.wikipedia.org/wiki/Vegetalismo wikipedia]"},{"slug":"vermiponics","title":"Vermiponics","date":1466190579349,"synopsis":"Vermiponics is a soil-less growing technique that combines hydroponics with vermiculture by utilizing diluted wormbin leachate (\"worm tea\") as the nutrient solution as opposed to the use of fish waste (as used in aquaponics) or the addition of manufactured chemicals to provide the nutrients - [https://en.wikipedia.org/wiki/Vermiponics wikipedia]"},{"slug":"welcome-visitors","title":"Welcome Visitors","date":1497947805044,"synopsis":"The Plantoid is a autopoietic sculpture. It owns, designs, manufactures and finances itself. It is in essence a form that exists, and interacts with other entities on the blockchain."}]