[{"slug":"appurtenant","title":"Appurtenant","date":1457610154116,"synopsis":"adj. pertaining to something that attaches."},{"slug":"changes-to-the-commons","title":"Changes to the Commons","date":1457787092644,"synopsis":"Here we list all the [[Commons Sites]] we know of in the federation that concentrate mainly on the commons."},{"slug":"changes-to-this-site","title":"Changes to this Site","date":1434641767059,"synopsis":"Below we list recent changes to this site only without also listing changes from the [[Neighbourhood]]:"},{"slug":"common-land","title":"Common land","date":1457614442000,"synopsis":"Common land is land owned collectively by a number of persons, or by one person, but over which other people have certain traditional rights, such as to allow their livestock to graze upon it, to collect firewood, or to cut turf for fuel - [https://en.wikipedia.org/wiki/Common_land wikipedia]"},{"slug":"commons","title":"Commons","date":1457622133809,"synopsis":"The commons is the cultural and natural resources accessible to all members of a society, including natural materials such as air, water, and a habitable earth. These resources are held in common, not owned privately - [https://en.wikipedia.org/wiki/Commons wikipedia]"},{"slug":"commons-councils","title":"Commons Councils","date":1457614292877,"synopsis":"Some commons are managed by Boards of Conservators ([[Conservators]]) for the wider public benefit."},{"slug":"community-forests-in-nepal","title":"Community Forests In Nepal","date":1457606328768,"synopsis":"Implemented in the late 1980s, Nepal chose to decentralize government control over forests. Community forest programs work by giving local areas a financial stake in nearby woodlands, and therefore increasing the incentive to protect them from overuse. These local institutions regulate harvesting and selling of timber and land, and must use any profit towards community development and preservation of the forests. In twenty years, locals have noticed visible improvements in the number of trees. In addition to this, community forestry contributed to commun"},{"slug":"content-overflow","title":"Content Overflow","date":1447778549349,"synopsis":"Joel Spolsky compares the evolution and propagation of content rules on Stack Overflow and Wikipedia in a talk he titled How to Have Nice Things."},{"slug":"controls-on-development","title":"Controls on Development","date":1457614068252,"synopsis":"Development of common land is strictly controlled. The government states that common land should be open and accessible to the public, and the law restricts the kind of works that can be carried out on commons."},{"slug":"cultural-commons","title":"Cultural Commons","date":1457606447824,"synopsis":"Today, the commons are also understood within a [[cultural]] sphere. These commons include literature, music, arts, design, film, video, television, radio, information, software and sites of heritage. [[Wikipedia]] is an example of the production and maintenance of [[common good]]s by a contributor community in the form of encyclopedic knowledge that can be freely accessed by anyone without a central authority.<ref>Huberman, Bernardo A. and Romero, Daniel M. and Wu, Fang, Crowdsourcing, Attention and Productivity (September 12, 2008). </ref>"},{"slug":"currently-working-on","title":"Currently Working On","date":1457611684760,"synopsis":"Here is a list of [[Recent Changes]] I consider important. View our experiments on the [[Scratch]] page. To clear stuff saved in your browser try [[Local Changes]]."},{"slug":"digital-commons","title":"Digital Commons","date":1457606547887,"synopsis":"[[Mayo Fuster Morell]] proposed a definition of digital commons as \"as an information and knowledge resources that are collectively created and owned or shared between or among a community and that tend to be non-exclusivedible, that is, be (generally freely) available to third parties. Thus, they are oriented to favor use and reuse, rather than to exchange as a commodity. Additionally, the community of people building them can intervene in the governing of their interaction processes and of their shared resources\".<ref>Fuster Morell, M. (2010, p. 5). Di"},{"slug":"digital-library-of-the-commons","title":"Digital Library of the Commons","date":1457606019951,"synopsis":"THe Digital Library of the Commons is a project by Indiana University concerned with \"Research on the Commons, Common-Pool Resources, and Common Property\" - [http://dlc.dlib.indiana.edu/dlc/contentguidelines indiana.edu]"},{"slug":"elinor-ostrom","title":"Elinor Ostrom","date":1457621876129,"synopsis":"Elinor Ostrom (1933 – 2012) was an American political economist whose work was associated with the New Institutional Economics and the resurgence of political economy."},{"slug":"enclosure-and-decline","title":"Enclosure and Decline","date":1457612242003,"synopsis":"Most of the medieval [[Common Land]] of England was lost due to enclosure. In English social and economic history, '''enclosure''' or '''inclosure''' is the process which ends traditional rights such as [[mowing]] [[meadow]]s for [[hay]], or [[grazing]] [[livestock]] on common land formerly held in the [[open field system]]."},{"slug":"environmental-commons","title":"Environmental Commons","date":1457612990264,"synopsis":"The examples below illustrate types of environmental commons."},{"slug":"european-land-use","title":"European Land Use","date":1457612628670,"synopsis":"Originally in medieval England ([[England in the Middle Ages]]) the common was an integral part of the [[manor]], and was thus legally part of the [[estate in land]] owned by the [[lord of the manor]], but over which certain classes of manorial tenants and others held certain rights - [https://en.wikipedia.org/wiki/Commons wikipedia]"},{"slug":"federated-governance","title":"Federated Governance","date":1453204837043,"synopsis":"What sort of governance i suitable for a software project that is in many ways about decentralised architecture? How should we govern and sustain the federation?"},{"slug":"fencing","title":"Fencing","date":1457613932187,"synopsis":"The act of transferring resources from the commons to purely private ownership is known as ''[[enclosure]]'', or (especially in formal use, and in place names) ''Inclosure''. The [[Inclosure Acts]] were a series of private Acts of Parliament, mainly from about 1750 to 1850, which enclosed large areas of common, especially the arable and haymeadow land and the better pasture land."},{"slug":"governance","title":"Governance","date":1453204969980,"synopsis":"Why is it that in so many hierarchical institutions authority is separated from competence? Why do so many such systems continue to exist?"},{"slug":"irrigation-systems-of-new-mexico","title":"Irrigation Systems of New Mexico","date":1457606357273,"synopsis":"''Acequia'' is a method of collective responsibility and management for irrigation systems in desert areas. In New Mexico, a community-run organization known as Acequia Associations supervises water in terms of diversion, distribution, utilization, and recycling, in order to reinforce agricultural traditions and preserve water as a common resource for future generations.[http://ourwatercommons.org/sites/default/files/local-control-management-water-commons.pdf Local Control and Management of Our Water Commons: Stories of Rising to the Challenge]"},{"slug":"knowledge-commons","title":"Knowledge Commons","date":1449082243893,"synopsis":"Elinor Ostrom, with Oliver Williamson, won the Nobel Prize in Economic Sciences in 2009 because she demonstrated that regular folks like you and I can create and self-govern a commons in a sustainable and equitable manner.[http://www.elinorostrom.com site]"},{"slug":"law-of-common-land","title":"Law of Common Land","date":1457614822491,"synopsis":"The legal position concerning common land has been confused, but recent legislation has sought to remedy this and remove the legal uncertainties so that commons can be better used and protected."},{"slug":"linked-data","title":"Linked Data","date":1436210610390,"synopsis":"In computing, linked data (often capitalized as Linked Data) describes a method of publishing structured data so that it can be interlinked and become more useful through semantic queries - [https://en.wikipedia.org/wiki/Linked_data wikipedia]"},{"slug":"lobster-fishery-of-maine","title":"Lobster Fishery of Maine","date":1457606305785,"synopsis":"Widespread success of the Maine lobster industry is often attributed to the willingness of Maine’s lobstermen to uphold and support lobster conservation rules. These rules include harbor territories not recognized by the state, informal trap limits, and laws imposed by the state of Maine (which are largely influenced by lobbying from lobster industry itself).[https://books.google.com/?id=u23TkAVptOYC&printsec=frontcover&dq=james+acheson+lobster#v=onepage&q&f=false Capturing the Commons: Devising Institutions to Manage the Maine Lobster] Essentially, the "},{"slug":"modern-commons","title":"Modern Commons","date":1457612765389,"synopsis":"Much [[common land]] is still used for its original purpose. The right to graze domestic stock is by far the most extensive commoners right registered, and its ongoing use contributes significantly to agricultural and rural economies."},{"slug":"mongolian-grasslands","title":"Mongolian Grasslands","date":1457606295522,"synopsis":"Based on a research project by the Environmental and Cultural Conservation in Inner Asia (ECCIA) from 1992 to 1995, satellite images were used to compare the amount of land degradation due to livestock grazing in the regions of Mongolia, Russia, and China.[http://www.sciencemag.org/content/281/5380/1147.full?ijkey=2a465918ef9b55416bf136bee66c9175ccef1bdb&keytype2=tf_ipsecsha State Policy and Pasture Degradation in Inner Asia] In Mongolia, where shepherds were permitted to move collectively between seasonal grazing pastures, degradation remained relativel"},{"slug":"rights-of-common","title":"Rights of Common","date":1457610858198,"synopsis":"COMMON. or right of common, English law. An encorporeal hereditament, which consists in a profit which a man has in the lands of another. 12 S. & R. 32; 10 Wend. R. 647; 11 John. R. 498; 2 Bouv. Inst. 1640, et seq - [http://legal-dictionary.thefreedictionary.com/right+of+common thefreedictionary]"},{"slug":"roadways","title":"Roadways","date":1457614492132,"synopsis":"Commons are often crossed by unfenced public roads, and this leads to another problem on modern pasture commons where grazing survives (or is to be reintroduced)."},{"slug":"time-bank","title":"Time Bank","date":1457598217802,"synopsis":"In economics, a time-based currency is an alternative currency where the unit of exchange is the person-hour."},{"slug":"types-of-common","title":"Types of Common","date":1457612128998,"synopsis":"[[Common Land]] can be classified into the following types: pasture commons, arable and hay-meadow commons, and Lammas rights."},{"slug":"welcome-visitors","title":"Welcome Visitors","date":1489066156073,"synopsis":"Here we write about the [[World of the Commons]]. Follow [[Changes to this Site]] or [[Recent Changes]] to find out what we are [[Currently Working On]]."},{"slug":"world-of-the-commons","title":"World of the Commons","date":1457621179341,"synopsis":"[[The Commons]] is not a singular thing. There are many diverse forms of commons. Here we collect them together so that they can learn from and inform each other."}]