[{"slug":"archivist-manifesto","title":"Archivist Manifesto","date":1490211992687,"synopsis":"There appears to be no publicly available text for thsi manifesto?"},{"slug":"aristotelian-notes","title":"Aristotelian Notes","date":1498644076145,"synopsis":"In the 13th century a number of texts, primarily those based around Aristotle's work, adopted a \"pillared\" approach to textual annotation. We will call these Aristotelian Notes. Here we discuss how the system worked and its import."},{"slug":"changes-to-this-site","title":"Changes to this Site","date":1434532209841,"synopsis":"Below we list recent changes to this site only without also listing changes from the [[Neighbourhood]]:"},{"slug":"collaborative-software","title":"Collaborative software","date":1470314383777,"synopsis":"Collaborative software or groupware is an application software designed to help people involved in a common task to achieve their goals. One of the earliest definitions of collaborative software is 'intentional group processes plus software to support them.' - [https://en.wikipedia.org/wiki/Collaborative_software wikipedia]"},{"slug":"currently-working-on","title":"Currently Working On","date":1498909405631,"synopsis":"Here is a list of [[Recent Changes]] I consider important. View our experiments on the [[Scratch]] page. To clear stuff saved in your browser try [[Local Changes]]."},{"slug":"diverse-and-personal-context","title":"Diverse and Personal Context","date":1451615490515,"synopsis":"The personal context is naturally diverse. Not banal, but truly diverse. It is rare that we appreciate the reality of the difference between us."},{"slug":"docu-islands","title":"Docu-islands","date":1424872027530,"synopsis":"When [[Andy van Dam]] spoke of docu-islands, what he really was referring to was a concern over the lack of conversation by programmers in defining a set of standards surrounding hypertext product development."},{"slug":"drive-by-commenting","title":"Drive-by Commenting","date":1422637947480,"synopsis":"Comment sections on blogs are meant to extend a discussion on a post, and the participants are assumed to understand the larger conversation with which the post engages. Drive-by comments are a perversion of the medium which treat comments sections as a publishing platform or general forum, only loosely related to the post and the community with which it engages. [http://www.philosophyetc.net/2008/08/drive-by-commenting.html html]"},{"slug":"ebooks","title":"ebooks","date":1459373562109,"synopsis":"As a generic term, an electronic book (variously: e-book, eBook, e-Book, ebook, digital book or e-edition) or a digital book is a book-publication in digital form, consisting of text, images, or both, readable on computers or other electronic devices. Although sometimes defined as \"an electronic version of a printed book\", many e-books exist without any printed equivalent. Commercially produced and sold e-books are usually intended to be read on dedicated e-readers. However, almost any sophisticated electronic device that features a controllable viewing "},{"slug":"external-tanks","title":"External Tanks","date":1454867489233,"synopsis":"Science fiction writer Neal Stephenson talks about the \"innovation starvation\" of our current age, using the external tanks of the space shuttle. "},{"slug":"fedwiki-tools","title":"Fedwiki Tools","date":1520935412564,"synopsis":"Here we list a few tools that are of particular use in managing and creating [[Fedwiki]] content."},{"slug":"how-deleuzian-concepts-travel","title":"How Deleuzian Concepts Travel","date":1420640243527,"synopsis":"John Rajchman in his book The Deleuze Connections explains how Deleuzian concepts travel:"},{"slug":"json","title":"JSON","date":1452622246592,"synopsis":"JSON, or JavaScript Object Notation, is an open standard format that uses human-readable text to transmit data objects consisting of attribute‚Äìvalue pairs. It is used primarily to transmit data between a server and web application, as an alternative to XML."},{"slug":"markdown","title":"Markdown","date":1459373415979,"synopsis":"Markdown is a lightweight markup language with plain text formatting syntax designed so that it can be converted to HTML and many other formats using a tool by the same name. Markdown is often used to format readme files, for writing messages in online discussion forums, and to create rich text using a plain text editor - [https://en.wikipedia.org/wiki/Markdown wikipedia]"},{"slug":"permalinked-revolution","title":"Permalinked Revolution","date":1442165118071,"synopsis":"> As Tom Coates, the pioneering British blogger behind plasticbag.org, wrote, “It was effectively the device that turned weblogs from an ease-of-publishing phenomenon into a conversational mess of overlapping communities.” Before, when one blogger linked to some current post on the home page of another, the link had no meaning—it pointed to a page that would be different in a few days, as new posts crowded out the one that had been linked to. With permalinks, in Coates’s words, “For the first time it became relatively easy to gesture directly at a highly"},{"slug":"permanent-wiki","title":"Permanent Wiki","date":1496583776069,"synopsis":"The [[Permanent Wiki]] is a project that I have been working towards for several years now."},{"slug":"plain-text","title":"Plain text","date":1459376072397,"synopsis":"In computing, plain text is the data (e.g. file contents) which represent only characters of readable material but not its graphical representation nor other objects (images, etc.). It may also include a limited number of characters that control simple arrangement of text, such as line breaks or tabulation characters. Plain text is different from formatted text, where style information is included, and \"binary files\" in which some portions must be interpreted as binary objects (encoded integers, real numbers, images, etc.) - [https://en.wikipedia.org/wik"},{"slug":"portable-document-format","title":"Portable Document Format","date":1459373878486,"synopsis":"The Portable Document Format ([[PDF]]) is a file format used to present documents in a manner independent of application software, hardware, and operating systems. Each PDF file encapsulates a complete description of a fixed-layout flat document, including the text, fonts, graphics, and other information needed to display it. In 1991, Adobe Systems' co-founder John Warnock outlined a system called \"Camelot\" that developed into PDF - [https://en.wikipedia.org/wiki/Portable_document_format wikipedia]"},{"slug":"project-hieroglyph","title":"Project Hieroglyph","date":1454867643703,"synopsis":"Project from ASU that pairs science fiction writers with ASU thinkers to imagine positive futures. [link](http://hieroglyph.asu.edu/)"},{"slug":"stories-in-wiki","title":"Stories in Wiki","date":1521968194274,"synopsis":"So, for instance, I would like all of us to have a story about why we are here. And I would like every project we do here to have a story. And I would like any 'rule' / policy introduced here (whether as a proposal or as accepted policy) to have a story."},{"slug":"tangled-web","title":"Tangled Web","date":1448740971233,"synopsis":"The tangled-web is the combination of several ideas into a single unified way of authoring which includes code and annotation (text, video, audio etc) in a single environment."},{"slug":"textus-inclusus","title":"Textus Inclusus","date":1444086792106,"synopsis":"A medieval approach to intertextuality, also called a \"square bracket\" text. The main text was laid in the middle, but with significant margins. The margins would then be filled with the annotations of scholars."},{"slug":"the-garden-and-the-stream","title":"The Garden and the Stream","date":1498909652571,"synopsis":"A decade and a half ago a set of innovators mapped Usenet and mailing list culture onto the hypertext environment of the web. Many good things resulted, but the cracks in this approach are beginning to show. We propose that an older and alternate approach to conversation, here named The Garden, is required to balance the useful energy of the endless stream of self-assertion we find ourselves in."},{"slug":"the-hypertext-garden","title":"The Hypertext Garden","date":1466754634210,"synopsis":"The original vision of hypertext was textual and timeless. When [[Vannevar Bush]] and [[Ted Nelson]] imagined hypertext, they imagined a conversation between documents, data, and other media, not individual banter. Importantly, additions to the conversation were not conceived of as replies, but as *extensions* of a large static but continuously evolving network of knowledge, one that allowed many different paths."},{"slug":"the-memex","title":"The Memex","date":1489520621094,"synopsis":"Imagined by [[Vannevar Bush]] in [http://www.theatlantic.com/magazine/archive/1945/07/as-we-may-think/303881/ \"As We May Think,\"] in 1945, the memex is a desk-sized scholar workstation containing a microfilm library. Text and images are displayed on two screens, and can be annotated by hand. Most importantly, texts and images can be linked, so that bringing up a text on one screen brings up a linked text on the other. These links can be organized into trails, and the trails shared with others."},{"slug":"thread-mode","title":"Thread Mode","date":1422554800206,"synopsis":"<i>Thread mode is a form of discussion where our community holds a conversation. It is the beginning of a process of distilling experience that culminates in patterns.</i>"},{"slug":"transclusion","title":"Transclusion","date":1522742101654,"synopsis":"In computer science, transclusion is the inclusion of part or all of an electronic document into one or more other documents by hypertext reference. Transclusion is usually performed when the referencing document is displayed, and is normally automatic and transparent to the end user. The result of transclusion is a single integrated document made of parts assembled on the fly from separate sources, possibly stored on different computers in disparate places - [https://en.wikipedia.org/wiki/Transclusion wikipedia]"},{"slug":"two-sides-of-wiki","title":"Two sides of wiki","date":1522758636454,"synopsis":"I was provoked into writing this following  discussion with [[Dil Green]] about writing in [[Fedwiki]]. His complaint I thought was a bit unfair, but as with any such encounter, it is important to dig deep and not react with easy defensiveness."},{"slug":"we-make-the-road-by-walking","title":"we make the road by walking","date":1419008605970,"synopsis":"This is the title of a [http://www.amazon.com/Make-Road-Walking-Conversations-Education/dp/0877227756  book] published in 1990, transcribing a series of conversations between radical educators Myles Horton and Paolo Friere in 1987. The transcribers of this section of the conversation explain in a footnote that the phrase Friere is quoting is from a poem about pilgrimage by the Spanish poet Antonio Machado."},{"slug":"welcome-visitors","title":"Welcome Visitors","date":1521967950285,"synopsis":"On this site we write and research about the history and use of text as a writing and collaboration medium."},{"slug":"wiki-essay","title":"Wiki Essay","date":1425296904453,"synopsis":"A wiki-essay is a cluster of wiki-pages (notes), that forms a coherent and complete whole. A wiki-essay is of particular use in setting [[Assignments]], but it also of use to a reader when looking to familiarise herself with an new area."},{"slug":"write-the-docs","title":"Write the Docs","date":1432651221358,"synopsis":"Just as the first wiki changed how people write, our new wiki will change how people work. By pushing steadily on two fundamental ideas we have once again uncovered a simpler and more powerful internet."}]