[{"slug":"3d-printing","title":"3D Printing","date":1430067576550,"synopsis":"Makevoid - 3D Hub, London - [https://www.3dhubs.com/london/hubs/makevoid 3dhubs.com]"},{"slug":"about-this-specification","title":"About This Specification","date":1463318154295,"synopsis":"This template is taken from  - [http://www.joelonsoftware.com/articles/fog0000000035.html joelonsoftware.com]"},{"slug":"about-time","title":"About Time","date":1475588344314,"synopsis":"Time and therefore change which leads to uncertainty are not built into our programming languages. Indeed nor is it built into much of our philosophy, or common sense modes of thinking.  What would a language look like that builds in the idea of time?"},{"slug":"acid-properties","title":"ACID Properties","date":1424569439245,"synopsis":"The ACID properties, Atomicity, Consistency, Isolation and Durability, are required to guarantee that database transactions are processed reliably. [http://en.wikipedia.org/wiki/ACID wikipedia]"},{"slug":"add-a-project-to-github","title":"Add a project To GitHub","date":1473194599558,"synopsis":"Here we look at how to add a project to GitHub. There are two ways to do this. The easy way is to create a project in GitHub and clone it to your desktop. The hard(er) way is to use the [[command-line]] from within an existing project."},{"slug":"add-pagemap-to-the-sitemap","title":"Add PageMap to the Sitemap","date":1489224806615,"synopsis":"Suppose you've defined [[PageMaps]] with a \"pagetype\" attribute as in this example:"},{"slug":"aiml-framework","title":"AIML Framework","date":1427239473926,"synopsis":"AIML (Artificial Intelligence Markup Language) is an XML-compliant language that's easy to learn, and makes it possible for you to begin customizing an Alicebot or creating one from scratch within minutes - [http://www.alicebot.org/aiml.html alicebot.org]"},{"slug":"alan-kay","title":"Alan Kay","date":1469880665227,"synopsis":"Alan Curtis Kay (born May 17, 1940 ) is an American computer scientist. He has been elected a Fellow of the American Academy of Arts and Sciences, the National Academy of Engineering, and the Royal Society of Arts. He is best known for his pioneering work on object-oriented programming and windowing graphical user interface design - [https://en.wikipedia.org/wiki/Alan_Kay wikipedia]"},{"slug":"alan-turing","title":"Alan Turing","date":1426607282721,"synopsis":"By Stephen Richards (Geograph Britain and Ireland) [CC BY-SA 2.0 (http://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons"},{"slug":"almost-instant-web-sites","title":"Almost Instant Web Sites","date":1448810594606,"synopsis":"Now running web sites involves ftping files to servers, and running complex perl scripts."},{"slug":"alternative-gmail-address","title":"Alternative Gmail Address","date":1489265558586,"synopsis":"Here we describe how to set up an alternative Gmail address for a domain you host."},{"slug":"angular-js","title":"Angular JS","date":1491999264594,"synopsis":"[[AngularJS]] is built on the belief that [[Declarative Programming]] should be used to create [[user interface]]s and connect [[software component]]s, while [[Imperative Programming]] is better suited to defining an application's [[business logic]]"},{"slug":"angularjs","title":"AngularJS","date":1491999594726,"synopsis":"AngularJS is a JavaScript-based open-source front-end web application framework mainly maintained by Google and by a community of individuals and corporations to address many of the challenges encountered in developing single-page applications  - [https://en.wikipedia.org/wiki/AngularJS wikipedia]"},{"slug":"animated-gif","title":"Animated Gif","date":1459417719049,"synopsis":"Animated Gifs are not just a popular medium but hey also work nicely with [[Federated Wiki]]."},{"slug":"annotations-xml-file","title":"Annotations XML File","date":1460199884375,"synopsis":"The [[search annotations file]], ([[cse.xml]]), is the XML specification for Google [[Custom Search Engine]]. It specifies how the search engine works and looks, and can be downloaded, edited and used to programatically create search engines on the fly."},{"slug":"apache-cordova","title":"Apache Cordova","date":1491996445251,"synopsis":"Apache Cordova (formerly [[PhoneGap]]) is a mobile application development framework which enables software programmers to build applications for mobile devices using CSS3, HTML5, and JavaScript instead of relying on platform-specific APIs like those in Android, iOS, or Windows Phone."},{"slug":"apache-http-server","title":"Apache HTTP Server","date":1497958838526,"synopsis":"Apache HTTP Server, colloquially called Apache (/əˈpætʃiː/ ə-PA-chee), is free and open-source cross-platform web server software, released under the terms of Apache License 2.0. Apache is developed and maintained by an open community of developers under the auspices of the Apache Software Foundation - [https://en.wikipedia.org/wiki/Apache_HTTP_Server wikipedia]"},{"slug":"ascii-cinema","title":"ASCII Cinema","date":1497887661471,"synopsis":"Here we look at ascii art and ascii animation."},{"slug":"asciidoc","title":"AsciiDoc","date":1459376113332,"synopsis":"AsciiDoc is a human-readable document format, semantically equivalent to DocBook XML, but using plain-text mark-up conventions. AsciiDoc documents can be created using any text editor and read “as-is”, or rendered to HTML or any other format supported by a DocBook tool-chain, i.e. PDF, TeX, Unix manpages, e-books, slide presentations, etc - [https://en.wikipedia.org/wiki/Asciidoc wikipedia]"},{"slug":"asynchronous-io","title":"Asynchronous I/O","date":1427031133083,"synopsis":"In computer science, asynchronous I/O, or non-blocking I/O is a form of input/output processing that permits other processing to continue before the transmission has finished - [https://en.wikipedia.org/wiki/Asynchronous_I/O wikipedia]"},{"slug":"atkinson-hypercard-demo","title":"Atkinson HyperCard Demo","date":1424712946607,"synopsis":"Demo of HyperCard, originally broadcast in 1987. Guests include Apple Fellow and Hypercard creator Bill Atkinson, Hypercard senior engineer Dan Winkler, author of \"The Complete Hypercard Handbook\" Danny Goodman, and Robert Stein, Publisher of Voyager Company."},{"slug":"atom","title":"Atom","date":1451740215627,"synopsis":"Atom is a free and [[open-source]] text and source code editor for OS X, Linux, and Windows with support for plug-ins written in [[Node.js]], and embedded [[Git]] Control, developed by [[GitHub]] - [https://en.wikipedia.org/wiki/Atom_(text_editor) wikipedia]"},{"slug":"audio-transcription","title":"Audio Transcription","date":1470320722895,"synopsis":"Here we look at technologies that we can use to integrate speech and audio into wiki."},{"slug":"author","title":"Author","date":1463318318813,"synopsis":"One author. Some companies think that the spec should be written by a team. If you've ever tried group writing, you know that there is no worse torture  - [http://www.joelonsoftware.com/articles/fog0000000035.html joelonsoftware]"},{"slug":"bash","title":"Bash","date":1520507676634,"synopsis":"Bash is a Unix shell and command language written by Brian Fox for the GNU Project as a free software replacement for the Bourne shell.["},{"slug":"benefits-of-jwts","title":"Benefits of JWT's","date":1510693351674,"synopsis":"There are a number of benefits to using [[JSON Web Token]]s:"},{"slug":"beyond-the-canvas","title":"Beyond the Canvas","date":1512650928564,"synopsis":"As you have seen, the createCanvas function of [[p5.js]] creates an [[HTML5 Canvas]], a special element you can draw graphics into. However, using the [[p5.dom]] add-on library, [[p5.js]] can also be used to create and interact with HTML elements outside of the graphics canvas."},{"slug":"bibtex","title":"BibTeX","date":1459375201586,"synopsis":"BibTeX is reference management software for formatting lists of references. The BibTeX tool is typically used together with the LaTeX document preparation system. Within the typesetting system, its name is styled as . The name is a portmanteau of the abbreviation of \"bibliography\" and TeX - [https://en.wikipedia.org/wiki/Bibtex wikipedia]"},{"slug":"bill-atkinson","title":"Bill Atkinson","date":1469881035249,"synopsis":"Bill Atkinson (born 1951) is an American computer engineer and photographer. Atkinson worked at Apple Computer from 1978 to 1990 - [https://en.wikipedia.org/wiki/Bill_Atkinson wikipedia]"},{"slug":"bind","title":"BIND","date":1449329887545,"synopsis":"BIND, or named, is the most widely used Domain Name System (DNS) software on the Internet. On Unix-like operating systems it is the de facto standard."},{"slug":"bootstrap","title":"Bootstrap","date":1453229106355,"synopsis":"Bootstrap is a front end framework, that is the most-starred project on GitHub, with over 90K stars and more than 38K forks - [https://en.wikipedia.org/wiki/Bootstrap_(front-end_framework) wikipedia]"},{"slug":"bootstrap-4","title":"Bootstrap 4","date":1453222453634,"synopsis":"Bootstrap 4 is a massive undertaking that touches nearly every line of code. Source code for v4 is available in a v4-dev branch on [https://github.com/twbs/bootstrap/tree/v4-dev github]"},{"slug":"bootstrap-cards","title":"Bootstrap Cards","date":1453221849035,"synopsis":"Bootstrap Cards are a brand new component to Bootstrap, but they’ll feel super familiar as they do nearly everything wells, thumbnails, and panels did, only better."},{"slug":"browser-console","title":"Browser Console","date":1437142273725,"synopsis":"There are a number of ways of running a terminal in a browser window. Here we look at some ways we may wish to do this in the Viral Acadmey."},{"slug":"budget-studio","title":"Budget Studio","date":1437998380322,"synopsis":"Here we look at creating a super low cost [[Live TV Studio]] using one or more [[Raspberry Pi]] devices."},{"slug":"build-and-submit-a-sitemap","title":"Build and submit a sitemap","date":1489233213188,"synopsis":"Here is how you build and submit a [[Google Sitemap]]:"},{"slug":"c","title":"C","date":1512643485303,"synopsis":"This page is for the [[C]], [[C#]] and [[C++]] programming languages."},{"slug":"c-programming-language","title":"C (programming language)","date":1512640285902,"synopsis":"[[C]] is a general-purpose, imperative computer programming language, supporting structured programming, lexical variable scope and recursion, while a static type system prevents many unintended operations."},{"slug":"c-sharp-programming-language","title":"C Sharp (programming language)","date":1512638833055,"synopsis":"[[C#]] (pronounced as see sharp) is a multi-paradigm programming language encompassing strong typing, imperative, declarative, functional, generic, object-oriented (class-based), and component-oriented programming disciplines."},{"slug":"c0de-academy","title":"C0de Academy","date":1520499181812,"synopsis":"The C0de Academy is a site where we collect and research topics related to code, programming and technology."},{"slug":"caja","title":"Caja","date":1427735138109,"synopsis":"Caja is a Google project and a JavaScript implementation for \"virtual iframes\" based on the principles of object-capabilities - [http://developers.google.com/caja/ developers.google.com]"},{"slug":"canonical-version","title":"Canonical Version","date":1449572671482,"synopsis":"In mathematics and computer science, a canonical, normal, or standard form of a mathematical object is a standard way of presenting that object as a mathematical expression - [https://en.wikipedia.org/wiki/Canonical_form wikipedia]"},{"slug":"captcha","title":"CAPTCHA","date":1427538242711,"synopsis":"A CAPTCHA (an acronym for \"Completely Automated Public [[Turing Test]] to tell Computers and Humans Apart\") is a type of challenge-response test used in computing to determine whether or not the user is human."},{"slug":"cascading-style-sheets","title":"Cascading Style Sheets","date":1492001389941,"synopsis":"[[Cascading Style Sheets]] (CSS) is a style sheet language used for describing the presentation of a document written in a markup language."},{"slug":"centrality-measures","title":"Centrality measures","date":1491953014738,"synopsis":"Information about the relative importance of nodes and edges in a graph can be obtained through [[centrality]] measures, widely used in disciplines like [[sociology]]."},{"slug":"changes-to-coding-sites","title":"Changes to Coding Sites","date":1501668069895,"synopsis":"Here we list changes to all the [[Livecode Sites]]"},{"slug":"changes-to-fedwiki-sites","title":"Changes to Fedwiki Sites","date":1438015164114,"synopsis":"Here we list [[Recent Changes]] to [[Fedwiki Sites]]:"},{"slug":"changes-to-happening-2-sites","title":"Changes to Happening #2 Sites","date":1437983507075,"synopsis":"Here we list all the sites we know of in the federation that concentrate mainly on education with participants from the [[Teaching machines]] Happening."},{"slug":"changes-to-technology-sites","title":"Changes to Technology Sites","date":1519650218174,"synopsis":"Here we list all the sites we know of in the federation that concentrate mainly on technology and coding."},{"slug":"changes-to-this-site","title":"Changes to this Site","date":1434641767059,"synopsis":"Below we list recent changes to this site only without also listing changes from the [[Neighbourhood]]:"},{"slug":"channel-9","title":"Channel 9","date":1460894256848,"synopsis":"A page with 1 items."},{"slug":"channel-9-microsoft","title":"Channel 9 (Microsoft)","date":1460894782094,"synopsis":"Channel 9 is a Microsoft community site for Microsoft customers created in 2004. It hosts video channels, discussions, podcasts, screencasts and interviews - [https://en.wikipedia.org/wiki/Channel_9_(microsoft) wikipedia]"},{"slug":"character-encoding","title":"Character encoding","date":1471074516400,"synopsis":"In computing, a character encoding is used to represent a repertoire of characters by some kind of an encoding system. Depending on the abstraction level and context, corresponding code points and the resulting code space may be regarded as bit patterns, octets, natural numbers, electrical pulses, etc. A character encoding is used in computation, data storage, and transmission of textual data. Character set, character map, codeset and code page are related, but not identical, terms - [https://en.wikipedia.org/wiki/Character_encoding wikipedia]"},{"slug":"chatbot","title":"Chatbot","date":1511362198386,"synopsis":"A chatbot (also known as a talkbot, chatterbot, Bot, IM bot, interactive agent, or Artificial Conversational Entity) is a computer program which conducts a conversation via auditory or textual methods. Such programs are often designed to convincingly simulate how a human would behave as a conversational partner, thereby passing the Turing test. Chatbots are typically used in dialog systems for various practical purposes including customer service or information acquisition. Some chatterbots use sophisticated natural language processing systems, but many "},{"slug":"chrome-profile-folder","title":"Chrome Profile Folder","date":1520880558980,"synopsis":"Chrome allows for the use of multiple user profiles. If you don’t have multiple user profiles set up in Chrome, then your settings and installed extensions are associated with the Default profile."},{"slug":"client-certificates-in-webid","title":"Client Certificates in WebID","date":1431777758542,"synopsis":"Contrary to the usual SSL usage patterns, it does not require a dedicated Certificate authority to perform the user authorization. Users can easily mint useful identities for themselves using any TLS certificate (even self-signed ones)."},{"slug":"coding-sites","title":"Coding Sites","date":1501751399424,"synopsis":"Here we list all the [[Coding Sites]] we know of in the federation:"},{"slug":"combine-and-compress-files","title":"Combine and Compress Files","date":1437648537309,"synopsis":"You can use [[gulp]], [[grunt]] or Google's [[Closure Compiler]] - [http://stackoverflow.com/questions/5511989/combine-multiple-javascript-files-into-one-js-file stackoverflow]"},{"slug":"command-line-interface","title":"Command-line Interface","date":1448901659228,"synopsis":"A command-line interface or command language interpreter ([[CLI]]), is a means of interacting with a computer program where the user (or client) issues commands to the program in the form of successive lines of text (command lines) - [https://en.wikipedia.org/wiki/Command-line_interface wikipedia]"},{"slug":"compiler-infrastructure","title":"Compiler Infrastructure","date":1438244252670,"synopsis":"Compiler infrastructure libraries are used to construct compilers for programming languages. Compilers turn human-readable code into machine instructions."},{"slug":"complexities-of-using-docker","title":"Complexities of Using Docker","date":1438593035226,"synopsis":"These notes on the problems and issues of deploying with Docker emphasise lissues regarding arge scale multi-server deployments."},{"slug":"composition-inheritance-and-delegation","title":"Composition, inheritance, and delegation","date":1466430994879,"synopsis":"Objects can contain other objects in their instance variables; this is known as [[object composition]].  For example, an object in the Employee class might contain (point to) an object in the Address class, in addition to its own instance variables like \"first_name\" and \"position\".  Object composition is used to represent \"has-a\" relationships: every employee has an address, so every Employee object has a place to store an Address object - [https://en.wikipedia.org/wiki/Object_Oriented_Programming#Composition,_inheritance,_and_delegation wikipedia]"},{"slug":"concurrency-computer-science","title":"Concurrency (computer science)","date":1475588155398,"synopsis":"In computer science, concurrency is the decomposability property of a program, algorithm, or problem into order-independent or partially-ordered components or units - [https://en.wikipedia.org/wiki/Concurrency_(computer_science) wikipedia]"},{"slug":"context-xml-file","title":"Context XML File","date":1460200944934,"synopsis":"A context file ([[cse.xml]]), specifies the global settings of the search engine, such as whether Image Search or promotions are enabled - [https://developers.google.com/custom-search/docs/context#overview developers.google.com]"},{"slug":"convert-html-to-xhtml","title":"Convert HTML to xHTML","date":1437648548305,"synopsis":"Here we list the best tools we can find that are able to parse HTML documnents and convert them to something that XML parsers can understand."},{"slug":"copy-ssh-keys-to-server","title":"Copy SSH Keys to Server","date":1460446531738,"synopsis":"Here we describe how to copy over your public ssh keys to a server on Linux and MacOS."},{"slug":"cors","title":"CORS","date":1434924448927,"synopsis":"Cross-origin resource sharing (CORS) is a mechanism that allows restricted resources (e.g. fonts, JavaScript, etc.) on a web page to be requested from another domain outside the domain from which the resource originated - [https://en.wikipedia.org/wiki/Cross-origin_resource_sharing wikipedia]"},{"slug":"cp-unix","title":"Cp (Unix)","date":1466527740344,"synopsis":"cp is a UNIX command for copying files and directories. The command has three principal modes of operation, expressed by the types of arguments presented to the program for copying a file to another file, one or more files to a directory, or for copying entire directories to another directory - [https://en.wikipedia.org/wiki/Cp_(unix) wikipedia]"},{"slug":"crawl-errors","title":"Crawl Errors","date":1459778907368,"synopsis":"The [[Sitemaps Testing Tool]] allows you to examine different types of crawl errors that Google finds on your site. You can examine these here - [https://www.google.com/webmasters/tools/crawl-errors?hl=en&siteUrl=http://www.himalayanacademy.com/ google.com]"},{"slug":"create-refinements-labels","title":"Create Refinements Labels","date":1459538770701,"synopsis":"There are two ways to create the refinements lables that show up in the custom search pane, first by using the [[Control Panel]], and second by editing and then submitting a specialised XML file."},{"slug":"creating-refinements","title":"Creating Refinements","date":1459779167862,"synopsis":"You can create [[refinement]] labels and tag sites with them in the [[Refinements Tab]] of the [[CSE Control Panel]], but you can have greater control over the ranking if you are using the [[Custom Search XML Annotations]] file."},{"slug":"cross-origin-resource-sharing","title":"Cross-origin resource sharing","date":1460811967051,"synopsis":"Cross-origin resource sharing (CORS) is a mechanism that allows restricted resources (e.g. fonts) on a web page to be requested from another domain outside the domain from which the resource originated - [https://en.wikipedia.org/wiki/Cross-origin_resource_sharing wikipedia]"},{"slug":"cse-control-panel","title":"CSE Control Panel","date":1520852684997,"synopsis":"The [[Google Custom Search Engine]] (CSE) control panel is where you are able to specify setting and customise your own search engine."},{"slug":"css","title":"CSS","date":1492001485969,"synopsis":"[[Cascading Style Sheets]] (CSS) is a style sheet language used for describing the presentation of a document written in a markup language."},{"slug":"currently-working-on","title":"Currently Working On","date":1509119612572,"synopsis":"Here is a list of [[Recent Changes]] I consider important. View our experiments on the [[Scratch]] page. To clear stuff saved in your browser try [[Local Changes]]."},{"slug":"custom-browser-protocol","title":"Custom browser protocol","date":1521206489076,"synopsis":"Here we start some research regarding how to create [[Inter-app Communication]] using [[Custom browser protocol]]s and / or a [[Custom URL Scheme]]."},{"slug":"custom-search-engine","title":"Custom Search Engine","date":1491503007794,"synopsis":"Google's custom search engines are a powerful way to create flexible dynamic and free search engines for sites."},{"slug":"custom-search-links","title":"Custom Search Links","date":1520800851147,"synopsis":"Below are a collection of links imported from [[OneTab]]. You can view these links here - [https://www.one-tab.com/page/x5-xca9bQzGf21ZeHAJ66w one-tab.com]:"},{"slug":"custom-search-xml-annotations","title":"Custom Search XML Annotations","date":1460199451209,"synopsis":"You can create refinement labels and tag sites with them in the [[Refinements Tab]] of the control panel, but you can have greater control over the ranking if you are using the [[Search Annotations File]] - [https://developers.google.com/custom-search/docs/basics#contextxml developers.google.com]"},{"slug":"custom-url-scheme","title":"Custom URL Scheme","date":1521206477765,"synopsis":"Here we start some research regarding how to create [[Inter-app Communication]] using [[Custom browser protocol]]s and / or a [[Custom URL Scheme]]."},{"slug":"daedalus-now-bloom","title":"Daedalus (now Bloom)","date":1475587985268,"synopsis":"Bloom is a programming language for the cloud and other distributed computing systems. BOOM is the research project at UC Berkeley that is developing Bloom, as part of a larger agenda to make it easy to build distributed software systems."},{"slug":"dat","title":"dat","date":1417798462125,"synopsis":"This release is the first step towards our goal of creating a streaming interface between every database or file storage backend in the world. We are trying to solve hard problems the right way. This is a process that takes a lot of time."},{"slug":"data-and-javascript","title":"Data and Javascript","date":1451696088141,"synopsis":"Here we list a set of references to pages and sites relevant to data and [[Javascript]]:"},{"slug":"data-binding","title":"Data binding","date":1491999758482,"synopsis":"Data binding is a general technique that binds data sources from the provider and consumer together and synchronizes them. This is usually done with two data/information sources with different languages as in XML data binding. In UI data binding, data and information objects of the same language but different logic function are bound together (e.g. Java UI elements to Java objects) - [https://en.wikipedia.org/wiki/Data_binding wikipedia]"},{"slug":"dataobject","title":"DataObject","date":1489232913159,"synopsis":"The <DataObject> tag wraps a set of attributes for a single type of markup (thumbnail, action, or publication) within a <PageMap> tagged section of a [[PageMap]]."},{"slug":"david-bovill","title":"David Bovill","date":1433697611299,"synopsis":"My name is [[David Bovill]]. I started coding in [[LiveCode]] on a Linux based Gentoo system in 1998 or thereabouts (when it was called MetaCard)."},{"slug":"davids-recent-changes","title":"David's Recent Changes","date":1491950474587,"synopsis":"This older page shows all my recent changes across all my sites. use [[David's Recent Activity]] instead:"},{"slug":"davids-sites","title":"David's Sites","date":1429377431392,"synopsis":"Here is a list of sites I write on (and some [[Dead Sites]]):"},{"slug":"dbpedia","title":"DBpedia","date":1427529449370,"synopsis":"DBpedia is a project aiming to extract structured content from the information created as part of the Wikipedia project. Data is accessed using an SQL-like query language for [[RDF]] called [[SPARQL]]."},{"slug":"dbpedia-spotlight","title":"DBpedia Spotlight","date":1427529408132,"synopsis":"DBpedia Spotlight is a tool for annotating mentions of [[DBpedia]] resources in text. This provides a solution for linking unstructured information sources to the [[Linked Open Data]] cloud through [[DBpedia]] - [https://en.wikipedia.org/wiki/DBpedia#DBpedia_Spotlight wikipedia]"},{"slug":"dead-sites","title":"Dead Sites","date":1536157093056,"synopsis":"A list of dead sites whose domain names have lapsed:"},{"slug":"declarative-programming","title":"Declarative programming","date":1491999418671,"synopsis":"In computer science, declarative programming is a programming paradigm (a style of building the structure and elements of computer programs), that expresses the logic of a computation without describing its control flow - [https://en.wikipedia.org/wiki/Declarative_programming wikipedia]"},{"slug":"design-patterns","title":"Design patterns","date":1466431884120,"synopsis":"Challenges of object-oriented design are addressed by several methodologies. Most common is known as the design patterns codified by Gamma ''et al.'' ([[Design Patterns (book)]]). More broadly, the term \"design patterns ([[design pattern (computer science)]])\" can be used to refer to any general, repeatable solution to a commonly occurring problem in software design. Some of these commonly occurring problems have implications and solutions particular to object-oriented development - [https://en.wikipedia.org/wiki/Object_Oriented_Programming#Design_patter"},{"slug":"difference-engine","title":"Difference Engine","date":1427974967128,"synopsis":"Charles Babbage was an English polymath. A mathematician, philosopher, inventor and mechanical engineer, Babbage is best remembered for originating the concept of a [[Programmable Computer]]."},{"slug":"dig-command","title":"Dig (command)","date":1520995920346,"synopsis":"dig (domain information groper) is a network administration command-line tool for querying Domain Name System (DNS) servers - [https://en.wikipedia.org/wiki/Dig_(command) wikipedia]"},{"slug":"digital-ocean","title":"Digital Ocean","date":1438528635270,"synopsis":"[[DigitalOcean]] is an American virtual private server provider based in New York City. The company leases capacity from existing datacenters, including sites in New York, Amsterdam, San Francisco, London and Singapore."},{"slug":"digitalocean","title":"DigitalOcean","date":1428065631465,"synopsis":"[[DigitalOcean]] is an American virtual private server provider based in New York City. The company leases capacity from existing datacenters, including sites in New York, Amsterdam, San Francisco, London and Singapore."},{"slug":"digitalocean-api","title":"DigitalOcean API","date":1428067110012,"synopsis":"The first step to using the API is to generate a personal access token. Personal access tokens function like ordinary [[OAuth]] access tokens. They can be used instead of a password for [[DigitalOcean]] over [[HTTPS]], or can be used to authenticate to the API over [[Basic Authentication]]."},{"slug":"disclaimer","title":"Disclaimer","date":1463317437797,"synopsis":"Pure self defense. If you put a paragraph saying something like \"This spec is not complete\", people won't come into your office to bite your head off."},{"slug":"distributed-academy","title":"Distributed Academy","date":1437566548057,"synopsis":"The [[Distributed Academy]] aims to create a decentralised [[Network of Learning Spaces]] for [[Flipped Classroom]]s and [[Hyperlocal MOOC]]s"},{"slug":"dns","title":"DNS","date":1457861989513,"synopsis":"The [[Domain Name Service]] (DNS) is the internet service that translates [[Domain Name]]s into the corresponding internet [[IP Address]]."},{"slug":"dns-hijacking","title":"DNS hijacking","date":1457861758783,"synopsis":"DNS hijacking or DNS redirection is the practice of subverting the resolution of Domain Name System (DNS) queries. This can be achieved by malware that overrides a computer's TCP/IP configuration to point at a rogue DNS server under the control of an attacker, or through modifying the behaviour of a trusted DNS server so that it does not comply with internet standards - [https://en.wikipedia.org/wiki/DNS_hijacking wikipedia]"},{"slug":"dns-propagation","title":"DNS propagation","date":1520511773742,"synopsis":"It can take a little while to update the DNS records. Check the progress using [[Domain Name Tools]]. In particular to check [[DNS propagation]] - [https://www.whatsmydns.net/ whatsmydns.net]"},{"slug":"docbook","title":"DocBook","date":1459373355193,"synopsis":"DocBook is a semantic markup language for technical documentation. It was originally intended for writing technical documents related to computer hardware and software but it can be used for any other sort of documentation - [https://en.wikipedia.org/wiki/Docbook wikipedia]"},{"slug":"docker","title":"Docker","date":1459437795001,"synopsis":"Docker is an open-source project that automates the deployment of applications inside software containers - [https://en.wikipedia.org/wiki/Docker_%28software%29 wikipedia]"},{"slug":"docker-and-distributed-systems","title":"Docker and Distributed Systems","date":1438247827193,"synopsis":"Using Docker to create and manage containers may simplify the creation of highly distributed systems, by allowing multiple applications, worker tasks and other processes to run autonomously on a single physical machine or across multiple virtual machines."},{"slug":"docker-container","title":"Docker Container","date":1438251674125,"synopsis":"Docker containers are similar to a directory. A Docker container holds everything that is needed for an application to run."},{"slug":"docker-hub","title":"Docker Hub","date":1438251315049,"synopsis":"Docker Hub is a cloud hosted service from Docker that provides registry capabilities for public and private content. Collaborate effortlessly with the broader Docker community or within your team on key content, or automate your application building workflows - [https://www.docker.com/docker-hub docker.com]"},{"slug":"docker-image","title":"Docker Image","date":1438253023574,"synopsis":"A Docker image is a read-only template. For example, an image could contain an Ubuntu operating system with Apache and your web application installed."},{"slug":"docker-images","title":"Docker Images","date":1438251482910,"synopsis":"Docker images are read-only templates that allow you to layer and construct a deployment. You can search for publically available images using the [[Docker Registry]] - [https://registry.hub.docker.com/ registry.hub.docker.com]"},{"slug":"docker-provisioning","title":"Docker Provisioning","date":1438246678225,"synopsis":"For simple ad-hoc farms of diverse infrastructure, [[Docker]] is a simple deployment platform."},{"slug":"docker-questions","title":"Docker Questions","date":1438378920259,"synopsis":"Here ask a few basic questions we try to answer best we can:"},{"slug":"docker-registry","title":"Docker Registry","date":1438251617996,"synopsis":"Docker registries hold images. These are public or private stores from which you upload or download images."},{"slug":"domain-api","title":"Domain API","date":1457860995215,"synopsis":"Search for and register domains and manage your [[DNS]] settings with a [[REST]]ful [[Domain API]]."},{"slug":"domain-name","title":"Domain Name","date":1520432697455,"synopsis":"Here we gather useful information about services you can use to manage your domain names, or look up information about domain names."},{"slug":"domain-name-tools","title":"Domain Name Tools","date":1520511890802,"synopsis":"He we list some useful tools to examine, manipulate, or register your [[domain names]] and [[DNS]] records."},{"slug":"domain-names","title":"Domain Names","date":1520433169546,"synopsis":"Here we gather useful information about services you can use to manage your domain names, or look up information about domain names."},{"slug":"domain-registration","title":"Domain Registration","date":1520432659785,"synopsis":"He we gather information about registering your [[Domain Name]]."},{"slug":"dreamfactory","title":"DreamFactory","date":1491952469029,"synopsis":"DreamFactory automatically generates a comprehensive [[REST API]] for every popular [[SQL]] database, [[NoSQL]] document store, and file storage system - [https://www.dreamfactory.com/features html]."},{"slug":"e-programming-language","title":"E Programming Language","date":1427734602841,"synopsis":"E is an object-oriented programming language for secure distributed computing, created by Mark S. Miller, Dan Bornstein, and others at Electric Communities in 1997 - [http://en.wikipedia.org/wiki/E_%28programming_language%29 wikipedia]"},{"slug":"ebooks","title":"ebooks","date":1459373562109,"synopsis":"As a generic term, an electronic book (variously: e-book, eBook, e-Book, ebook, digital book or e-edition) or a digital book is a book-publication in digital form, consisting of text, images, or both, readable on computers or other electronic devices. Although sometimes defined as \"an electronic version of a printed book\", many e-books exist without any printed equivalent. Commercially produced and sold e-books are usually intended to be read on dedicated e-readers. However, almost any sophisticated electronic device that features a controllable viewing "},{"slug":"ecmascript","title":"ECMAScript","date":1466432887353,"synopsis":"ECMAScript (or ES) is a trademarked scripting-language specification standardized by Ecma International in ECMA-262 and ISO/IEC 16262. It was based on JavaScript, which now tracks ECMAScript. It is commonly used for client-side scripting on the World Wide Web. Other implementations of ECMAScript include JScript and ActionScript - [https://en.wikipedia.org/wiki/Ecmascript wikipedia]"},{"slug":"editing-custom-search-files","title":"Editing Custom Search Files","date":1460198060343,"synopsis":"To work on an XML file, download the XML specification from Advanced tab of the Control Panel. Don't start a file from scratch."},{"slug":"elm-programming-language","title":"Elm (programming language)","date":1469871246973,"synopsis":"Elm is a functional programming language for declaratively creating web browser-based graphical user interfaces. Elm uses the functional reactive programming style and purely functional graphical layout to build user interface without any destructive updates - [https://en.wikipedia.org/wiki/Elm_(programming_language) wikipedia]"},{"slug":"embedding-github-geojson","title":"Embedding GitHub Geojson","date":1492544914763,"synopsis":"Want to make your [[geoJSON]] map available someplace other than [[GitHub]]? Simply modify this template, and place it in any HTML page that supports javascript (e.g., [[GitHub Pages]]):"},{"slug":"emscripten","title":"Emscripten","date":1438245082599,"synopsis":"[[Emscripten]] is a source-to-source compiler ([[Transpiler]]), that transforms [[LLVM]] bytecode, typically created by compiling from C or C++, to JavaScript. It produces a subset of [[JavaScript]] known as [[asm.js]] - [https://en.wikipedia.org/wiki/Emscripten wikipedia]"},{"slug":"encapsulation","title":"Encapsulation","date":1491953118500,"synopsis":"If a class disallows calling code from accessing internal object data and forces access through methods only, this is a strong form of abstraction or information hiding known as encapsulation ([[Encapsulation (object-oriented programming)]])."},{"slug":"endnote","title":"EndNote","date":1459375365321,"synopsis":"EndNote is a commercial reference management software package, used to manage bibliographies and references when writing essays and articles. It is produced by Thomson Reuters - [https://en.wikipedia.org/wiki/Endnote wikipedia]"},{"slug":"epub","title":"ePub","date":1437648618293,"synopsis":"EPUB (short for electronic publication; sometimes styled ePub) is a free and open e-book standard by the International Digital Publishing Forum (IDPF). Files have the extension .epub - [https://en.wikipedia.org/wiki/EPUB wikipedia]"},{"slug":"eric-s-raymond","title":"Eric S. Raymond","date":1466432286766,"synopsis":"Eric Steven Raymond (born December 4, 1957), often referred to as ESR, is an American software developer, author of the widely cited 1997 essay and 1999 book The Cathedral and the Bazaar and other works, and open-source software advocate. He wrote a guidebook for the Roguelike game NetHack. In the 1990s, he edited and updated the Jargon File, currently in print as the The New Hacker's Dictionary - [https://en.wikipedia.org/wiki/Eric_S._Raymond wikipedia]"},{"slug":"etherpad-lite","title":"Etherpad Lite","date":1512054976393,"synopsis":"[[Etherpad Lite]] is an almost complete rewrite of the original [[Etherpad]] software, based on different technical foundations and written by different authors."},{"slug":"evidence-based-scheduling","title":"Evidence Based Scheduling","date":1463314657331,"synopsis":"Evidence-Based Scheduling, or EBS is a system in which you gather evidence, mostly from historical timesheet data, that you feed back into your schedules."},{"slug":"exiftool","title":"ExifTool","date":1434902562743,"synopsis":"ExifTool is a platform-independent [[Perl]] library plus a [[command-line]] application for reading, writing and editing meta information in a wide variety of files - [http://www.sno.phy.queensu.ca/~phil/exiftool/ queensu.ca]"},{"slug":"fallacies-of-distributed-computing","title":"Fallacies of Distributed Computing","date":1437315372727,"synopsis":"The fallacies of distributed computing are a set of assumptions that L Peter Deutsch and others at Sun Microsystems originally asserted programmers new to distributed applications invariably make - [https://en.wikipedia.org/wiki/Fallacies_of_distributed_computing wikipedia]"},{"slug":"federated-microservice","title":"Federated Microservice","date":1511368391023,"synopsis":"Here we explore how we might implement a [[microservice]] architecture in a federated way."},{"slug":"federated-social-protocols","title":"Federated Social Protocols","date":1433518985378,"synopsis":"Some protocols for the federated social web - [http://www.w3.org/2005/Incubator/federatedsocialweb/wiki/Protocols w3.org]"},{"slug":"federated-social-web","title":"Federated Social Web","date":1433529988521,"synopsis":"Federated Social Web initiative works on technologies to help us bridge those gaps and provide smooth experience in participating in many online communities' - [http://p2pfoundation.net/Federated_Social_Web p2pfoundation.net]"},{"slug":"federated-wiki","title":"Federated Wiki","date":1427018604379,"synopsis":"Federated Wiki sites share pages circulating within a creative commons. A single-page browser application can read from many sites at once and save changes in that browser. Users who host their own sites can login there to have their edits shared back to the federation as they edit."},{"slug":"fedwiki-pi","title":"Fedwiki Pi","date":1437992805110,"synopsis":"The [[Raspberry Pi]] makes a handy server for [[Fedwiki]]. This page is about how you setup and run a [[Wiki Farm]] on a Raspberry Pi."},{"slug":"fedwiki-tools","title":"Fedwiki Tools","date":1520993357121,"synopsis":"Here we list a few tools that are of particular use in managing and creating [[Fedwiki]] content."},{"slug":"ffmpeg","title":"FFmpeg","date":1509120299317,"synopsis":"FFmpeg is a free software project that produces libraries and programs for handling multimedia data. FFmpeg includes libavcodec, an audio/video codec library used by several other projects, libavformat (Lavf), an audio/video container mux and demux library, and the ffmpeg command line program for transcoding multimedia files. FFmpeg is published under the GNU Lesser General Public License 2.1+ or GNU General Public License 2+ (depending on which options are enabled) - [https://en.wikipedia.org/wiki/FFmpeg wikipedia]"},{"slug":"file-association","title":"File association","date":1471072759233,"synopsis":"A file association associates a file with an application capable of opening that file. More commonly, a file association associates a class of files (usually determined by their filename extension, such as .txt) with a corresponding application (such as a text editor) - [https://en.wikipedia.org/wiki/File_association wikipedia]"},{"slug":"file-system","title":"File System","date":1434536239809,"synopsis":"A file system is used to control how data is stored and retrieved - [https://en.wikipedia.org/wiki/File_system wikipedia]"},{"slug":"filesystem-in-userspace","title":"Filesystem in Userspace","date":1502984795116,"synopsis":"Filesystem in Userspace (FUSE) is a software interface for Unix-like computer operating systems that lets non-privileged users create their own file systems without editing kernel code. This is achieved by running file system code in user space while the FUSE module provides only a \"bridge\" to the actual kernel interfaces - [https://en.wikipedia.org/wiki/Filesystem_in_Userspace wikipedia]"},{"slug":"firebase","title":"Firebase","date":1521644305103,"synopsis":"Firebase is a mobile and web application development platform developed by Firebase, Inc. in 2011, then acquired by Google in 2014 - [https://en.wikipedia.org/wiki/Firebase wikipedia]"},{"slug":"fish","title":"fish","date":1448901528218,"synopsis":"The friendly interactive shell (fish) is a Unix shell that attempts to be more interactive and user-friendly than former shells - [https://en.wikipedia.org/wiki/Friendly_interactive_shell wikipedia]"},{"slug":"forcecom","title":"Force.com","date":1470750002181,"synopsis":"Force.com is a [[platform as a service]] (PaaS) that allows developers to create multitenant ([[multitenancy]]) (single instance of software runs on a server and serves multiple tenants) add-on applications that integrate into the main Salesforce.com application.[http://www.nytimes.com/idg/IDG_002570DE00740E180025742400363509.html What Cloud Computing Really Means] Force.com applications are hosted on Salesforce.com's infrastructure.[http://www.eweek.com/c/a/Enterprise-Apps/Salesforcecom-Unveils-Forcecom-Cloud-Computing-Architecture/ Salesforce.com Unvei"},{"slug":"form-html","title":"Form (HTML)","date":1511893543453,"synopsis":"A webform, web form or HTML form on a web page allows a user to enter data that is sent to a server for processing. Forms can resemble paper or database forms because web users fill out the forms using checkboxes, radio buttons, or text fields. For example, forms can be used to enter shipping or credit card data to order a product, or can be used to retrieve search results from a search engine - [https://en.wikipedia.org/wiki/Form_(HTML) wikipedia]"},{"slug":"forms-in-wiki","title":"Forms in Wiki","date":1511949702334,"synopsis":"Here we experiment with [[HTML Form]]s in wiki. We look to hook the HTML plugin into the [[Transporter]] mechanism, such that the [[About HTML Plugin]] takes not of and [[Form Action]] requests, and looks for [[Page JSON]] in the response. If it finds this it renders a [[ghost page]], otherwise it opens an external page if it finds a simple URI, or HTML in the returned JSON."},{"slug":"fossil","title":"Fossil","date":1427746025036,"synopsis":"http://fossil-scm.org/index.html/artifact/5f9eb551c89c2ec9adaa0934a8b8da990c40f782"},{"slug":"fragment-identifier","title":"fragment identifier","date":1459374154887,"synopsis":"In computer hypertext, a fragment identifier is a short string of characters that refers to a resource that is subordinate to another, primary resource. The primary resource is identified by a Uniform Resource Identifier (URI), and the fragment identifier points to the subordinate resource - [https://en.wikipedia.org/wiki/Fragment_identifier wikipedia]"},{"slug":"friendica","title":"Friendica","date":1433518252642,"synopsis":"Friendica is open source software that implements a distributed social network - [https://en.wikipedia.org/wiki/Friendica wikipedia]"},{"slug":"functional-programming","title":"Functional programming","date":1467739475828,"synopsis":"In computer science, functional programming is a programming paradigm—a style of building the structure and elements of computer programs—that treats computation as the evaluation of mathematical functions and avoids changing-state and mutable data - [https://en.wikipedia.org/wiki/Functional_programming wikipedia]"},{"slug":"functional-specification","title":"Functional Specification","date":1463312768687,"synopsis":"A functional specification describes how a product will work entirely from the user's perspective. It doesn't care how the thing is implemented. It talks about features. It specifies screens, menus, dialogs, and so on - [http://www.joelonsoftware.com/articles/fog0000000035.html joelonsoftware.com]"},{"slug":"fuse","title":"FUSE","date":1433248203723,"synopsis":"Filesystem in Userspace (FUSE) is an operating system mechanism for Unix-like computer operating systems that lets non-privileged users create their own file systems without editing kernel code - [https://en.wikipedia.org/wiki/Filesystem_in_Userspace wikipedia]"},{"slug":"future-of-programming","title":"Future of Programming","date":1475588227371,"synopsis":"Here we collect notes and ideas on the future directions of programming and creating software."},{"slug":"gcloud","title":"Gcloud","date":1520801122058,"synopsis":"Google Cloud comes with a set of tools and cli for managing multiple services. Having installed them you can issue commands like:"},{"slug":"geocoding","title":"Geocoding","date":1492536142623,"synopsis":"Geocoding is the computational process of transforming a postal address description to a location on the Earth's surface (spatial representation in numerical coordinates) - [https://en.wikipedia.org/wiki/Geocoding wikipedia]"},{"slug":"geocoding-api","title":"Geocoding API","date":1492363654311,"synopsis":"Here we review a number of [[Geocoding]] [[API]]'s that we can use to create [[REST Services]] from."},{"slug":"geojson","title":"GeoJSON","date":1492536668225,"synopsis":"GeoJSON is an open standard format designed for representing simple geographical features, along with their non-spatial attributes, based on JavaScript Object Notation - [https://en.wikipedia.org/wiki/Geojson wikipedia]"},{"slug":"gist","title":"Gist","date":1460244559183,"synopsis":"[[GitHub]] also operates other services: a pastebin-style site called Gist which is for hosting code snippets."},{"slug":"gist-api","title":"Gist API","date":1460292158557,"synopsis":"This link describes the resources that make up the official GitHub API v3 - [https://developer.github.com/v3/gists/ developer.github]"},{"slug":"git","title":"GIT","date":1475664046224,"synopsis":"This is a great way to learn GIT. It also shows how you can embed a terminal in the browser for education purposes - [https://try.github.io/levels/1/challenges/1 try.github.io]"},{"slug":"git-subrepo","title":"git-subrepo","date":1473192144269,"synopsis":"The git-subrepo command \"clones\" an external git repo into a subdirectory of your repo. Later on, upstream changes can be pulled in, and local changes can be pushed back - [https://github.com/ingydotnet/git-subrepo#readme github]"},{"slug":"git-subtree","title":"git-subtree","date":1462874507849,"synopsis":"A promising approach is to use git's [[subtree]] capabilities to create a single custom [[revIgniter Repository]] that can be checked out using the normal commands to update development and production servers - [https://medium.com/@porteneuve/mastering-git-subtrees-943d29a798ec#.89talvw02 medium]"},{"slug":"github","title":"GitHub","date":1516039965056,"synopsis":"GitHub is a web-based Git repository hosting service. It offers all of the distributed revision control and source code management (SCM) functionality of Git as well as adding its own features - [https://en.wikipedia.org/wiki/Github wikipedia]"},{"slug":"github-documentation","title":"GitHub Documentation","date":1460244815319,"synopsis":"Github is great for creating, hosting, and collaborating on documentation."},{"slug":"google-cloud-dns","title":"Google Cloud DNS","date":1457862070227,"synopsis":"Google Cloud DNS is a scalable, reliable and managed authoritative Domain Name System (DNS) service running on the same infrastructure as Google - [https://cloud.google.com/dns/getting-started cloud.google.com]"},{"slug":"google-cloud-speech-api","title":"Google Cloud Speech API","date":1470319934135,"synopsis":"Google Cloud Speech [[API]] enables developers to convert audio to text by applying powerful neural network models in an easy to use API - [https://cloud.google.com/speech/?gclid=CjwKEAjww_a8BRDB-O-OqZb_vRASJAA9yrc5NlS9bfBEKZ50vGer1z0igd3-gcqeI68K5RiLfoIzFxoCBuLw_wcB cloud.google.com]"},{"slug":"google-custom-search","title":"Google Custom Search","date":1520852677104,"synopsis":"Google Custom Search is a platform provided by Google that allows web developers to feature specialized information in web searches, refine and categorize queries and create customized search engines, based on Google Search."},{"slug":"google-knowledge-graph","title":"Google Knowledge Graph","date":1433253642222,"synopsis":"The Knowledge Graph is a knowledge base used by [[Google]] to enhance its search engine's search results with semantic-search information gathered from a wide variety of sources - [https://en.wikipedia.org/wiki/Knowledge_Graph wikipedia]"},{"slug":"google-now","title":"Google Now","date":1433253669524,"synopsis":"Google Now is an intelligent personal assistant developed by Google. It is available within the Google Search mobile application for Android, as well as the Google Chrome web browser on personal computers - [https://en.wikipedia.org/wiki/Google_Now wikipedia]"},{"slug":"google-public-dns","title":"Google Public DNS","date":1457862135932,"synopsis":"Google Public DNS is a Domain Name System (DNS) service offered by Google. It functions as a [[Recursive Name Server]] providing domain name resolution for any host on the Internet. - [https://en.wikipedia.org/wiki/Google_Public_DNS wikipedia]"},{"slug":"google-site-maps","title":"Google Site Maps","date":1452601795977,"synopsis":"This is a misspelling of [[sitemap]]. See [[Google Sitemap]] for the correct page!"},{"slug":"google-sitemap","title":"Google Sitemap","date":1459536115175,"synopsis":"A site map (or sitemap) is a list of pages of a web site accessible to crawlers or users. It can be either a document in any form used as a planning tool for Web design, or a Web page that lists the pages on a Web site, typically organized in hierarchical fashion."},{"slug":"graph-database","title":"Graph database","date":1466779466598,"synopsis":"In computing, a graph database is a database that uses graph structures for semantic queries with nodes, edges and properties to represent and store data - [https://en.wikipedia.org/wiki/Graph_Database wikipedia]"},{"slug":"graphoid-service","title":"Graphoid Service","date":1455627350721,"synopsis":"Graphoid (git repo) is a node.js service that converts a graph definition into a static PNG image using the same [[Vega]] library code that runs in advanced browsers. Graphoid is used as a fallback for non-JS enabled/compatible browsers - [https://wikitech.wikimedia.org/wiki/Graphoid wikitech.wikimedia.org]"},{"slug":"graphviz","title":"Graphviz","date":1512122500921,"synopsis":"Graphviz (short for Graph Visualization Software) is a package of open-source tools initiated by AT&T Labs Research for drawing graphs specified in DOT language scripts. It also provides libraries for software applications to use the tools. Graphviz is free software licensed under the Eclipse Public License - [https://en.wikipedia.org/wiki/Graphviz wikipedia]"},{"slug":"groovy","title":"Groovy","date":1423694807039,"synopsis":"Groovy is an agile and dynamic language for the Java Virtual Machine."},{"slug":"group-write-permissions","title":"Group Write Permissions","date":1460446720671,"synopsis":"Some quick notes on adding several people to a new group so that you can give them permissions to a folder."},{"slug":"gvmap-algorithm","title":"GvMap Algorithm","date":1434091471427,"synopsis":"GvMap is an algorithm for visualizing graphs as maps. It is part of the [[Graphviz]] library, and was originally called the [[GMap Algorithm]]."},{"slug":"hard-link","title":"Hard Link","date":1466524323437,"synopsis":"In computing, a hard link is a directory entry that associates a name with a file on a file system. All directory-based file systems must have (at least) one hard link giving the original name for each file. The term “hard link” is usually only used in file systems that allow more than one hard link for the same file - [https://en.wikipedia.org/wiki/Hard_Link wikipedia]"},{"slug":"haskell","title":"Haskell","date":1459403454087,"synopsis":"Haskell is a standardized, general-purpose purely functional programming language, with non-strict semantics and strong static typing - [https://en.wikipedia.org/wiki/Haskell_(programming_language) wikipedia]"},{"slug":"haskell-programming-language","title":"Haskell (programming language)","date":1459403404781,"synopsis":"Haskell /ˈhæskəl/ is a standardized, general-purpose purely functional programming language, with non-strict semantics and strong static typing. It is named after logician Haskell Curry. The latest standard of Haskell is Haskell 2010; however, there is a group working on the next version, Haskell 2014 as of February 2016 - [https://en.wikipedia.org/wiki/Haskell_(programming_language) wikipedia]"},{"slug":"html","title":"HTML","date":1459373396482,"synopsis":"HyperText Markup Language, commonly referred to as HTML, is the standard markup language used to create web pages. Along with CSS, and JavaScript, HTML is a cornerstone technology used to create web pages, as well as to create user interfaces for mobile and web applications. Web browsers can read HTML files and render them into visible or audible web pages. HTML describes the structure of a website semantically and, before the advent of Cascading Style Sheets (CSS), included cues for the presentation or appearance of the document (web page), making it a "},{"slug":"html-form","title":"HTML Form","date":1511895998585,"synopsis":"A webform, web form or HTML form on a web page allows a user to enter data that is sent to a server for processing. Forms can resemble paper or database forms because web users fill out the forms using checkboxes, radio buttons, or text fields - [https://en.wikipedia.org/wiki/Form_(HTML) wikipedia]"},{"slug":"html-image-maps","title":"HTML Image maps","date":1430038573093,"synopsis":"Client-side image maps were introduced in HTML 3.2, and do not require any special logic to be executed on the server (they are fully client-side). They also do not require any JavaScript - [https://en.wikipedia.org/wiki/Image_map wikipedia]"},{"slug":"html5","title":"HTML5","date":1457830827029,"synopsis":"HTML5 is a markup language used for structuring and presenting content on the World Wide Web. It is the fifth and current version of the HTML standard - [https://en.wikipedia.org/wiki/HTML5 wikipedia]"},{"slug":"html5-audio","title":"HTML5 Audio","date":1501837225251,"synopsis":"HTML5 Audio is a subject of the HTML5 specification, investigating audio input, playback, synthesis, as well as speech to text in the browser - [https://en.wikipedia.org/wiki/HTML5_Audio wikipedia]"},{"slug":"html5-local-storage","title":"HTML5 Local Storage","date":1429820168081,"synopsis":"Cookies and local storage really serve difference purposes. Cookies are primarily for reading server-side, local storage can only be read client-side. So the question is, in your app, who needs this data — the client or the server?"},{"slug":"html5-video","title":"HTML5 Video","date":1469880713404,"synopsis":"HTML5 video is intended by its creators to become the new standard way to show video on the web without plugins - [https://en.wikipedia.org/wiki/HTML5_video wikipedia]"},{"slug":"html5-webgl-interaction","title":"HTML5 WebGL Interaction","date":1511546962247,"synopsis":"Below are a collection of links imported from [[OneTab]]. You can view these links here - [https://www.one-tab.com/page/kSaiWRLmQzKDhhhLAl7TsQ one-tab.com]:"},{"slug":"human-ecosystems","title":"Human Ecosystems","date":1465467521654,"synopsis":"Human Ecosystems is a family of real-time system capturing information from social networks to visualise the human geography of cities, across space, time and relations - [http://human-ecosystems.com/home/about-the-human-ecosystems/ human-ecosystems.com]"},{"slug":"human-ecosystems-api","title":"Human Ecosystems API","date":1433946188396,"synopsis":"The [[Human ecosystems]] API is fairly comprehensive but does not seem to include methods for adding data feeds from other sources which would seem to require php coding to extend."},{"slug":"hypercard","title":"HyperCard","date":1469964817114,"synopsis":"HyperCard is an application program and programming tool for Apple Macintosh and Apple IIGS computers, that is among the first successful hypermedia systems before the World Wide Web - [https://en.wikipedia.org/wiki/Hypercard wikipedia]"},{"slug":"hyperlocal-server","title":"Hyperlocal Server","date":1437484440156,"synopsis":"On this page we discuss the development of a \"hyperlocal server\" for the [[Federation]]. We imagine a number of bespoke [[Hyperlocal Servers]] coded in different languages. The one we are concentrating here is the [[LiveNode Server]] or more specifically the [[Block Server]]."},{"slug":"hyperlocal-servers","title":"Hyperlocal Servers","date":1437483857075,"synopsis":"A [[Hyperlocal Server]] is term I coined for a local web server that a use may run at home, or in a local business, school, or cafe."},{"slug":"imagine-transport","title":"Imagine Transport","date":1511528154428,"synopsis":"This new transport imports [[Tweet]]s, [[Flickr]] images, [[Pinterest]] pins, web images, research articles, and general web images. It also imports wikipedia articles."},{"slug":"immutable-data","title":"Immutable Data","date":1493484726460,"synopsis":"In object-oriented and functional programming, an [[immutable object]] is an object whose state cannot be modified after it is created."},{"slug":"immutable-object","title":"Immutable object","date":1493479689377,"synopsis":"In object-oriented and functional programming, an immutable object (unchangeable object) is an object whose state cannot be modified after it is created. This is in contrast to a mutable object (changeable object), which can be modified after it is created. In some cases, an object is considered immutable even if some internally used attributes change but the object's state appears to be unchanging from an external point of view. For example, an object that uses memoization to cache the results of expensive computations could still be considered an immut"},{"slug":"imperative-programming","title":"Imperative programming","date":1491999455137,"synopsis":"In computer science, imperative programming is a programming paradigm that uses statements that change a program's state - [https://en.wikipedia.org/wiki/Imperative_programming wikipedia]"},{"slug":"indesign","title":"InDesign","date":1459373543213,"synopsis":"Adobe InDesign is a desktop publishing software application produced by Adobe Systems. It can be used to create works such as posters, flyers, brochures, magazines, newspapers, and books. InDesign can also publish content suitable for tablet devices in conjunction with Adobe Digital Publishing Suite. Graphic designers and production artists are the principal users, creating and laying out periodical publications, posters, and print media. It also supports export to EPUB and SWF formats to create e-books and digital publications, including digital magazin"},{"slug":"installing-human-ecosystems","title":"Installing Human Ecosystems","date":1433702115124,"synopsis":"Installing instructions - [https://github.com/xdxdVSxdxd/HumanEcosystems/blob/master/HE_v2/installation-instructions.txt github]"},{"slug":"inter-app-communication","title":"Inter-app Communication","date":1521206412226,"synopsis":"Here we start some research regarding how to create [[Inter-app Communication]] using [[Custom browser protocol]]s and / or a [[Custom URL Scheme]]."},{"slug":"internationalisation","title":"Internationalisation","date":1432750759006,"synopsis":"Internationalization and localization (other correct spellings are internationalisation and localisation) are means of adapting computer software to different languages, regional differences and technical requirements of a target market - [https://en.wikipedia.org/wiki/Internationalization_and_localization wikipedia]"},{"slug":"interplanetary-file-system","title":"InterPlanetary File System","date":1433116695901,"synopsis":"IPFS is a distributed file system that seeks to connect all computing devices with the same system of files. In some ways, this is similar to the original aims of the Web, but IPFS is actually more similar to a single bittorrent swarm exchanging git objects."},{"slug":"ionic-mobile-app-framework","title":"Ionic (mobile app framework)","date":1492001000678,"synopsis":"Ionic is a complete open-source SDK for hybrid mobile app development. Built on top of [[AngularJS]] and Apache Cordova, Ionic provides tools and services for developing hybrid mobile apps using Web technologies like [[CSS]], [[HTML5]], and [[Sass]]  - [https://en.wikipedia.org/wiki/Ionic_(mobile_app_framework) wikipedia]"},{"slug":"ip-lookup-tool","title":"IP Lookup Tool","date":1428051026545,"synopsis":"An IP lookup shows the IP status of your domain and will tell you if your changes to the name server settings have been propagated or not."},{"slug":"ipfs","title":"IPFS","date":1448811146261,"synopsis":"IPFS stands for the \"inter-planetary file system\". IPFS is a bold attempt at evolving the Internet's infrastructure."},{"slug":"ipfs-howto","title":"IPFS Howto","date":1433961238626,"synopsis":"[[ipfs]] uses a global local object repository, added to ~/.ipfs. See the full instructions over at [http://ipfs.io/docs/getting-started/ ipfs.io]"},{"slug":"issue","title":"Issue","date":1458147677831,"synopsis":"Above you can drag and drop a [[issue:]] from a page you are writing, and replace it with the [[factory]] so you can make a [[reference link]]."},{"slug":"javascript","title":"JavaScript","date":1467112291997,"synopsis":"JavaScript (/ˈdʒɑːvəˌskrɪpt/) is a high-level, dynamic, untyped, and interpreted programming language. It has been standardized in the ECMAScript language specification. Alongside HTML and CSS, it is one of the three core technologies of World Wide Web content production; the majority of websites employ it and it is supported by all modern Web browsers without plug-ins. JavaScript is prototype-based with first-class functions, making it a multi-paradigm language, supporting object-oriented, imperative, and functional programming styles. It has an API for"},{"slug":"javascript-slide-presentation","title":"Javascript Slide presentation","date":1459402832425,"synopsis":"There are a number of ways of creating presentations in Javascript and HTML5 (see [[Web-based Slideshow]]). Here we look how we can author a  [[reveal.js]] presentation using [[pandoc]] (see [[Presentations with Pandoc]])."},{"slug":"journal-cleaner-transport","title":"Journal Cleaner Transport","date":1491984730930,"synopsis":"This [[transport]] takes a [[Fedwiki Lineup]] url, and looks at the [[wiki-page]] that is furthest right in the lineup - returning a [[ghost page]] containing a version of the same page but with a stripped down [[journal]]."},{"slug":"jquery","title":"JQuery","date":1512311521169,"synopsis":"jQuery is a cross-platform JavaScript library designed to simplify the client-side scripting of HTML. It is free, open-source software using the permissive MIT License. Web analysis indicates that it is the most widely deployed JavaScript library by a large margin - [https://en.wikipedia.org/wiki/JQuery wikipedia]"},{"slug":"js-bin","title":"JS Bin","date":1460897642104,"synopsis":"JS Bin is a tool for experimenting with web languages. In particular [[HTML]], [[CSS]] and [[JavaScript]], but JS Bin also supports other languages too (like [[Markdown]], [[Jade]] and [[Sass]])- [http://jsbin.com/help/how-can-i-embed-jsbin jsbin.com]"},{"slug":"json","title":"JSON","date":1452622246592,"synopsis":"JSON, or JavaScript Object Notation, is an open standard format that uses human-readable text to transmit data objects consisting of attribute‚Äìvalue pairs. It is used primarily to transmit data between a server and web application, as an alternative to XML."},{"slug":"json-ld","title":"JSON-LD","date":1458033169550,"synopsis":"JSON-LD, or JavaScript Object Notation for Linked Data, is a method of transporting [[Linked Data]] using [[JSON]] - [https://en.wikipedia.org/wiki/JSON-LD wikipedia]"},{"slug":"json-ld-signature","title":"JSON-LD Signature","date":1452623437603,"synopsis":"This specification adds authentication and integrity protection to Linked Data documents through the use of public/private key cryptography without sacrificing Linked Data features such as extensibility and composability - [https://web-payments.org/specs/source/ld-signatures/#bib-RDF-DATASET-NORMALIZATION web-payments.org]"},{"slug":"json-schema","title":"JSON Schema","date":1418516871338,"synopsis":"We define the schema for federated wiki pages to the depth that we know it. We use a BNF-like notation to suggest JSON elements. Any ambiguity will be resolved by examining the example. We close with a brief reflection on the successes of the format."},{"slug":"json-tools","title":"JSON Tools","date":1450549703518,"synopsis":"Here we list a number of tools and utilities that are useful when dealing with [[JSON]] data outside of the Javascript environment:"},{"slug":"json-web-token","title":"JSON Web Token","date":1518887837633,"synopsis":"JSON Web Token (JWT, pronounced jot) is a relatively new token format used in space-constrained environments such as HTTP Authorization headers. JWT is architected as a method for transferring security claims based between parties - [https://en.wikipedia.org/wiki/JSON_Web_Token wikipedia]"},{"slug":"jwt","title":"JWT","date":1510693390193,"synopsis":"[[JSON Web Token]] (JWT, pronounced jot) is a relatively new token format used in space-constrained environments such as HTTP Authorization headers. JWT is architected as a method for transferring security claims based between parties - [https://en.wikipedia.org/wiki/JSON_Web_Token wikipedia]"},{"slug":"kademlia","title":"Kademlia","date":1450109618083,"synopsis":"[[Kademlia]] is the inspiration for the distributed hash table used as a core component of [[IPFS]]."},{"slug":"keybaseio","title":"Keybase.io","date":1431434472899,"synopsis":"Keybase is a website, but it's also an open source command line program. Let's walk through a terminal example, which illustrates what Keybase does. All of this can be embedded into other software, written by anyone - [https://keybase.io/ keybase.io]"},{"slug":"lambda-calculus","title":"Lambda calculus","date":1467739250637,"synopsis":"Lambda calculus (also written as λ-calculus) is a formal system in mathematical logic for expressing computation based on function abstraction and application using variable binding and substitution. It is a universal model of computation that can be used to simulate any single-taped Turing machine and was first introduced by mathematician Alonzo Church in the 1930s as part of an investigation into the foundations of mathematics - [https://en.wikipedia.org/wiki/Lambda_calculus wikipedia]"},{"slug":"lastpass","title":"LastPass","date":1511894757021,"synopsis":"LastPass is a freemium password management service that stores encrypted passwords in private accounts. LastPass is standard with a web interface, but also includes plugins for many web browsers and apps for many smartphones. It also includes support for bookmarklets - [https://en.wikipedia.org/wiki/LastPass wikipedia]"},{"slug":"latex","title":"LaTeX","date":1459373446265,"synopsis":"LaTeX (/ˈlɑːtɛx/ LAH-tekh, commonly pronounced as /ˈlɑːtɛk/ LAH-tek or /ˈleɪtɛk/ LAY-tek, styled as LaTeX, and a shortening of Lamport TeX) is a word processor and a document markup language. It is distinguished from typical word processors such as Microsoft Word, LibreOffice Writer and Apple Pages in that the writer uses plain text as opposed to formatted text, relying on markup tagging conventions to define the general structure of a document (such as article, book, and letter), to stylise text throughout a document (such as bold and italic), and to ad"},{"slug":"leaflet","title":"Leaflet","date":1492006291076,"synopsis":"[[LeafletJS]] is a widely used open source JavaScript library used to build web mapping applications. First released in 2011, it supports most mobile and desktop platforms, supporting [[HTML5]] and [[CSS3]]."},{"slug":"leafletjs","title":"Leafletjs","date":1492002620141,"synopsis":"[[Leaflet]] is a widely used open source JavaScript library used to build web mapping applications. First released in 2011, it supports most mobile and desktop platforms, supporting [[HTML5]] and [[CSS3]]."},{"slug":"learning-timebank","title":"Learning TimeBank","date":1438595452384,"synopsis":"We use a time based currency: Students are required to pass on their learning in order to earn credits that they can use to take further free courses."},{"slug":"lets-encrypt","title":"Let's Encrypt","date":1496655173456,"synopsis":"Let’s Encrypt is a free, automated, and open certificate authority (CA), run for the public’s benefit. Let’s Encrypt is a service provided by the Internet Security Research Group (ISRG). [https://letsencrypt.org Let's Encrypt] [https://letsencrypt.org/isrg/ ISRG]"},{"slug":"link-analysis","title":"Link analysis","date":1457264330685,"synopsis":"[[Link analysis]] is a subset of network analysis, exploring associations between objects. An example may be examining the addresses of suspects and victims, the telephone numbers they have dialed and financial transactions that they have partaken in during a given timeframe, and the familial relationships between these subjects as a part of police investigation."},{"slug":"linked-custom-search-engine","title":"Linked Custom Search Engine","date":1489224354309,"synopsis":"In a Linked CSE the specification of the search engine is hosted on your website. In a Google Stored CSE the specification is stored at Google."},{"slug":"linked-data","title":"Linked Data","date":1433253756330,"synopsis":"In computing, linked data describes a method of publishing structured data so that it can be interlinked and become more useful through semantic queries - [https://en.wikipedia.org/wiki/Linked_data wikipedia]"},{"slug":"linked-data-platform","title":"Linked Data Platform","date":1433254531196,"synopsis":"Linked Data Platform (LDP) is a specification that defines a set of rules for [[HTTP]] operations on Web resources, some based on [[RDF]], to provide an architecture for reading and writing Linked Data on the Web."},{"slug":"linked-data-wiki","title":"Linked Data Wiki","date":1427716397353,"synopsis":"So what is the relationship betweed [[Federated Wiki]] and [[Linked Data]]? Is not the merger of these two things the [[Web We Want]]?"},{"slug":"livecode","title":"LiveCode","date":1450608111762,"synopsis":"Livecode is an easy to learn, open source, high level language for creating programs and mobile apps for a variety of platforms including Windows, iOS and Android."},{"slug":"livecode-and-webservices-course","title":"LiveCode and WebServices Course","date":1435387820080,"synopsis":"In this course we will explore [[RESTful Web Services]] ([[REST]]). We will create libraries for popular web services like [[Flickr]], [[Taiga]] and [[Slack]], and we will explore creating a modern RESTful backend using [[DreamFactory]]."},{"slug":"livecode-server-on-digitalocean","title":"Livecode Server on DigitalOcean","date":1433722981802,"synopsis":"The following instructions from Mike Bonner describe how to get [[Livecode Server]] running on [[DigitalOcean]]:"},{"slug":"living-specification","title":"Living Specification","date":1463313772907,"synopsis":"Specs Need To Stay Alive. Some programming teams adopt a \"waterfall\" mentality: we will design the program all at once, write a spec, print it, and throw it over the wall at the programmers and go home. All I have to say is: \"Ha ha ha ha ha ha ha ha!\""},{"slug":"llvm","title":"LLVM","date":1438244448416,"synopsis":"The LLVM compiler infrastructure project (formerly Low Level Virtual Machine) is a [[Compiler Infrastructure]] designed to be a set of reusable libraries with well-defined interfaces - [https://en.wikipedia.org/wiki/LLVM wikipedia]"},{"slug":"lua-programming-language","title":"Lua (programming language)","date":1466432752191,"synopsis":"Lua (from Portuguese meaning moon) is a lightweight multi-paradigm programming language designed primarily for embedded systems and clients. Lua is cross-platform since it is written in ANSI C, and has a relatively simple C API - [https://en.wikipedia.org/wiki/Lua_(programming_Language) wikipedia]"},{"slug":"mac-os-x","title":"Mac OS X","date":1471071815538,"synopsis":"[[OS X]] is a series of Unix-based graphical interface operating systems (OS) developed and marketed by Apple Inc. It is designed to run on Macintosh computers, having been pre-installed on all Macs since 2002. Within the market of desktop, laptop and home computers, and by web usage, OS X is the second most widely used desktop OS after Windows - [https://en.wikipedia.org/wiki/OS_X wikipedia]"},{"slug":"macpaint","title":"MacPaint","date":1469880897653,"synopsis":"MacPaint is a bitmap-based graphics painting software program developed by Apple Computer and released with the original Macintosh personal computer on January 24, 1984- [https://en.wikipedia.org/wiki/MacPaint wikipedia]"},{"slug":"making-your-metadata-available","title":"Making your Metadata Available","date":1489321821387,"synopsis":"# Add PageMap to the Sitemap"},{"slug":"mapbox","title":"Mapbox","date":1495477918836,"synopsis":"Mapbox is a large provider of custom online maps for websites such as Foursquare, Pinterest, Evernote, the Financial Times, The Weather Channel and Uber Technologies - [https://en.wikipedia.org/wiki/Mapbox wikipedia]"},{"slug":"mapnik","title":"Mapnik","date":1492003091424,"synopsis":"Mapnik is an open source mapping toolkit for desktop- and server-based map rendering, written in C++."},{"slug":"markdown","title":"Markdown","date":1459373415979,"synopsis":"Markdown is a lightweight markup language with plain text formatting syntax designed so that it can be converted to HTML and many other formats using a tool by the same name. Markdown is often used to format readme files, for writing messages in online discussion forums, and to create rich text using a plain text editor - [https://en.wikipedia.org/wiki/Markdown wikipedia]"},{"slug":"material-design","title":"Material Design","date":1465198522193,"synopsis":"Material Design (codenamed Quantum Paper) is a design language developed by Google. Expanding upon the \"card\" motifs that debuted in Google Now, Material Design makes more liberal use of grid-based layouts, responsive animations and transitions, padding, and depth effects such as lighting and shadows - [https://en.wikipedia.org/wiki/Material_Design wikipedia]"},{"slug":"mediastream-processing-api","title":"MediaStream Processing API","date":1501838949885,"synopsis":"A number of existing or proposed features for the Web platform deal with continuous real-time media:"},{"slug":"mediawiki-api","title":"MediaWiki API","date":1458480276002,"synopsis":"The MediaWiki web API is a web service that provides convenient access to wiki features, data, and meta-data over HTTP. - [https://www.mediawiki.org/wiki/API:Main_page mediawiki.org]"},{"slug":"mendeley","title":"Mendeley","date":1459375190593,"synopsis":"Mendeley is a desktop and web program for managing and sharing research papers, discovering research data and collaborating online. It combines Mendeley Desktop, a PDF and reference management application (available for Windows, OS X and Linux) and Mendeley for Android and iOS, with Mendeley Web, an online social network for researchers - [https://en.wikipedia.org/wiki/Mendeley wikipedia]"},{"slug":"message-passing","title":"Message passing","date":1466430968908,"synopsis":"It is the responsibility of the object, not any external code, to select the procedural code to execute in response to a method call, typically by looking up the method at run time in a table associated with the object.  This feature is known as [[dynamic dispatch]], and distinguishes an object from an [[abstract data type]] (or module), which has a fixed (static) implementation of the operations for all instances.  If there are multiple methods that might be run for a given name, it is known as [[multiple dispatch]] - [https://en.wikipedia.org/wiki/Obje"},{"slug":"metacrap","title":"Metacrap","date":1427535253083,"synopsis":"Metacrap is a [[Pictogram]] for the supposed insurmountable obstacles to create reliable metadata in the [[Real World]]."},{"slug":"metadata","title":"Metadata","date":1434901695447,"synopsis":"https://commons.wikimedia.org/wiki/Commons:Exif#Editing_Exif_fields"},{"slug":"microdata","title":"Microdata","date":1458042024889,"synopsis":"Microdata is an HTML specification used to nest metadata within existing content on web pages - [https://en.wikipedia.org/wiki/Microdata_(HTML) wikipedia]"},{"slug":"microdata-is-not-xml","title":"Microdata is not XML","date":1458041900099,"synopsis":"[[Microdata]] (and [[HTML5]] in general), is not valid [[XML]]. However there is a fix."},{"slug":"microservice","title":"Microservice","date":1510671826092,"synopsis":"A microservice is for all intents and purposes a small [[restful web service]] :)"},{"slug":"microservices","title":"Microservices","date":1510673640830,"synopsis":"A [[microservice]] is an architectural style, in which complex applications are composed of small, independent processes communicating with each other using language-agnostic APIs - [https://en.wikipedia.org/wiki/Microservices wikipedia]"},{"slug":"mime","title":"MIME","date":1471073118301,"synopsis":"Not to be confused with [[MIME Type]]."},{"slug":"mime-headers","title":"MIME headers","date":1471074666026,"synopsis":"No section text, so add your own here.. - [https://en.wikipedia.org/wiki/Mime#MIME_headers wikipedia]"},{"slug":"mime-type","title":"MIME Type","date":1471074558747,"synopsis":"A media type (also MIME type and content type) is a two-part identifier for file formats and format contents transmitted on the Internet - [https://en.wikipedia.org/wiki/Media_type wikipedia]"},{"slug":"mob-programming","title":"Mob programming","date":1457638470018,"synopsis":"Mob programming is a software development approach where the whole team works on the same thing, at the same time, in the same space, and at the same computer - [https://en.wikipedia.org/wiki/Mob_programming wikipedia]"},{"slug":"modular-programming","title":"Modular programming","date":1469796585553,"synopsis":"Modular programming is a software design technique that emphasizes separating the functionality of a program into independent, interchangeable modules, such that each contains everything necessary to execute only one aspect of the desired functionality - [https://en.wikipedia.org/wiki/Modular_programming wikipedia]"},{"slug":"mozilla-persona","title":"Mozilla Persona","date":1429134809136,"synopsis":"Mozilla Persona is a decentralized authentication system for the web based on the open [[BrowserID Protocol]] prototyped by Mozilla - [http://en.wikipedia.org/wiki/Mozilla_Persona wikipedia]"},{"slug":"mumble-audio-server","title":"Mumble Audio Server","date":1437984105621,"synopsis":"Mumble is a voice over IP (VoIP) application primarily designed for use by gamers, similar to programs such as TeamSpeak and Ventrilo."},{"slug":"mumble-pi","title":"Mumble Pi","date":1438341320991,"synopsis":"This is a Raspberry Pi solution that we can make to create a mini streaming audio server based sn [[Raspberry Pi]]."},{"slug":"mumble-server-for-remote-podcasting","title":"Mumble Server for Remote Podcasting","date":1437985121329,"synopsis":"Mumble’s default settings appear to be geared for gamers, not podcasters. However it is possible to set up Mumble for high audio quality and low latency for remote podcasting."},{"slug":"name-servers","title":"Name Servers","date":1428051242633,"synopsis":"It takes time for all of the zone name servers located all over the world to update their lists. So, when you make a change to your [[Name Servers]], these changes must be updated to all zone name servers around the world before your domain displays the correct web page."},{"slug":"ncx","title":".ncx","date":1437410740581,"synopsis":"The NCX file (Navigation Control file for XML), traditionally named toc.ncx, contains the hierarchical table of contents for the [[EPUB]] file - [https://en.wikipedia.org/wiki/EPUB#Open_Packaging_Format_2.0.1 wikipedia]"},{"slug":"neo4j","title":"Neo4J","date":1451004658897,"synopsis":"Neo4j is an open-source graph database implemented in Java and accessible from software written in other languages using the Cypher query language through a transactional HTTP endpoint. [https://en.wikipedia.org/wiki/Neo4j wikipedia] [http://neo4j.com/ site]"},{"slug":"neo4j-resources","title":"Neo4J Resources","date":1451004746669,"synopsis":"This graph database has worked well enough that we want to be good at applying it. There are documents that might help."},{"slug":"nginx","title":"Nginx","date":1502228517842,"synopsis":"Nginx (pronounced \"engine x\") is a web server. It can act as a reverse proxy server for HTTP, HTTPS, SMTP, POP3, and IMAP protocols, as well as a load balancer and an HTTP cache - [https://en.wikipedia.org/wiki/Nginx wikipedia]"},{"slug":"node-addons","title":"Node Addons","date":1427926206116,"synopsis":"Addons are dynamically linked shared objects. They can provide glue to C and C++ libraries - [https://nodejs.org/api/addons.html nodejs.org]"},{"slug":"node-webid","title":"Node WebID","date":1431433565125,"synopsis":"An article describing the promise of integrating [[NodeJS]] and [[WebID]] - [http://magnetik.github.io/node-webid-report/ magnetik.github.io]"},{"slug":"nodejs","title":"Node.js","date":1448978927081,"synopsis":"Node.js is a platform built on Chrome's JavaScript runtime for easily building fast, scalable network applications - [https://nodejs.org/ nodejs.org]"},{"slug":"nongoals","title":"Nongoals","date":1463313145535,"synopsis":"Nongoals. When you're building a product with a team, everybody tends to have their favorite, real or imagined pet features that they just can't live without."},{"slug":"norvig-on-data","title":"Norvig on Data","date":1427059163570,"synopsis":"Peter Norvig, et al. \"The Unreasonable Effectiveness of Data\" in IEEE Intelligent Systems (2011) [http://static.googleusercontent.com/media/research.google.com/en/us/pubs/archive/35179.pdf pdf]"},{"slug":"note","title":"Note","date":1459943699815,"synopsis":"Here we list notes for this site:"},{"slug":"npm","title":"npm","date":1502983389567,"synopsis":"[[Node.js]] package ecosystem, npm, is the largest ecosystem of open source libraries in the world - [https://www.npmjs.com/ npmjs.com]"},{"slug":"npm-faq","title":"npm FAQ","date":1466508143750,"synopsis":"Here we list some frequently asked questions about [[npm]]. See [https://docs.npmjs.com/files/folders docs.npmjs.com] for the official FAQ."},{"slug":"npm-package-distribution-tags","title":"NPM: package distribution tags","date":1464590288902,"synopsis":"How to make use of npm's package distribution tags to create cgannels just like Google Chrome's [https://medium.com/greenkeeper-blog/one-simple-trick-for-javascript-package-maintainers-to-avoid-breaking-their-user-s-software-and-to-6edf06dc5617#.9wu79omsu blog]"},{"slug":"nucaptcha","title":"NuCAPTCHA","date":1427538392477,"synopsis":"NuCaptcha uses animated video technology that it claims make puzzles easier for humans to solve, but harder for bots and hackers to decipher - [https://en.wikipedia.org/wiki/NuCaptcha wikipedia]"},{"slug":"oauth-20","title":"OAuth 2.0","date":1501922416868,"synopsis":"OAuth 2.0 is the next evolution of the OAuth protocol and is not backwards compatible with OAuth 1.0. OAuth 2.0 focuses on client developer simplicity while providing specific authorization flows for web applications, desktop applications, mobile phones, and living room devices - [https://en.wikipedia.org/wiki/Oauth#OAuth_2.0 wikipedia]"},{"slug":"object-orientation","title":"Object Orientation","date":1466431205795,"synopsis":"Object-oriented programming (OOP) is a programming paradigm based on the concept of \"objects\", which may contain data, in the form of fields, often known as attributes; and code, in the form of procedures, often known as methods - [https://en.wikipedia.org/wiki/Object_Oriented_Programming wikipedia]"},{"slug":"object-oriented-programming","title":"Object-oriented programming","date":1466432270794,"synopsis":"Object-oriented programming (OOP) is a programming paradigm based on the concept of \"objects\", which may contain data, in the form of fields, often known as attributes; and code, in the form of procedures, often known as methods - [https://en.wikipedia.org/wiki/Object_Oriented_Programming wikipedia]"},{"slug":"objects-and-classes","title":"Objects and classes","date":1466430920571,"synopsis":"Languages that support object-oriented programming typically use inheritance ([[Inheritance (object-oriented programming)]]) for code reuse and extensibility in the form of either classes ([[Class-based programming]]) or prototypes ([[Prototype-based programming]]). Those that use classes support two main concepts: - [https://en.wikipedia.org/wiki/Object_Oriented_Programming#Objects_and_classes wikipedia]"},{"slug":"oembed","title":"oEmbed","date":1434985416896,"synopsis":"oEmbed is a format for allowing an embedded representation of a URL on third party sites."},{"slug":"oembed-provider","title":"oEmbed Provider","date":1434985320133,"synopsis":"Here is a list of [[oEmbed]] Providers:"},{"slug":"office-open-xml","title":"Office Open XML","date":1459373503197,"synopsis":"Office Open XML (also informally known as OOXML or OpenXML or earlier as MOX) is a zipped, XML-based file format developed by Microsoft for representing spreadsheets, charts, presentations and word processing documents. The format was initially standardised by Ecma (as ECMA-376), and by the ISO and IEC (as ISO/IEC 29500) in later versions - [https://en.wikipedia.org/wiki/Office_Open_Xml wikipedia]"},{"slug":"one-line-bash","title":"One Line Bash","date":1520508039893,"synopsis":"There are a number of ways to chain together several [[Bash]] commands:"},{"slug":"onetab","title":"OneTab","date":1520881397439,"synopsis":"Whenever you find yourself with too many tabs, click the OneTab icon to convert all of your tabs into a list. When you need to access the tabs again, you can either restore them individually or all at once - [https://www.one-tab.com/ one-tab.com]"},{"slug":"ontologies","title":"Ontologies","date":1433256944712,"synopsis":"Here we list some useful [[Linked Data]] ontologies:"},{"slug":"open-container-format","title":"Open Container Format","date":1437411039871,"synopsis":"An EPUB file is a group of files that conform to the OPS/OPF standards and are wrapped in a ZIP file. The OCF specifies how to organize these files in the ZIP, and defines two additional files that must be included."},{"slug":"open-issues","title":"Open Issues","date":1463313494136,"synopsis":"It's OK for the first version of the spec to leave open issues. When I write a first draft, I always have lots of open issues, but I flag them (using a special style so I can search for them) and, if appropriate, discuss the alternatives."},{"slug":"open-recursion","title":"Open recursion","date":1466431010716,"synopsis":"In languages that support [[open recursion]], object methods can call other methods on the same object (including themselves), typically using a special variable or keyword called <code>this</code> or <code>self</code>.  This variable is ''late-bound ([[name binding]])''; it allows a method defined in one class to invoke another method that is defined later, in some subclass thereof - [https://en.wikipedia.org/wiki/Object_Oriented_Programming#Open_recursion wikipedia]"},{"slug":"opendocument","title":"OpenDocument","date":1459373517272,"synopsis":"The Open Document Format for Office Applications (ODF), also known as OpenDocument, is an XML-based file format for spreadsheets, charts, presentations and word processing documents. It was developed with the aim of providing an open, XML-based file format specification for office applications - [https://en.wikipedia.org/wiki/Opendocument wikipedia]"},{"slug":"opengl","title":"OpenGL","date":1511524280041,"synopsis":"Open Graphics Library (OpenGL) is a cross-language, cross-platform application programming interface (API) for rendering 2D and 3D vector graphics. The API is typically used to interact with a graphics processing unit (GPU), to achieve hardware-accelerated rendering - [https://en.wikipedia.org/wiki/OpenGL wikipedia]"},{"slug":"openresty","title":"OpenResty","date":1520903958383,"synopsis":"Below are a collection of links imported from [[OneTab]]. You can view these links here - [https://www.one-tab.com/page/H-_DoCxYT1-KouSz1zBpHA one-tab.com]:"},{"slug":"opf","title":".opf","date":1437410106299,"synopsis":"The OPF file, traditionally named content.opf, houses the [[EPUB]] book's metadata, file manifest, and linear reading order."},{"slug":"opml","title":"OPML","date":1459373460409,"synopsis":"OPML (Outline Processor Markup Language) is an XML format for outlines (defined as \"a tree, where each node contains a set of named attributes with string values\"). Originally developed by UserLand as a native file format for the outliner application in its Radio UserLand product, it has since been adopted for other uses, the most common being to exchange lists of web feeds between web feed aggregators - [https://en.wikipedia.org/wiki/Opml wikipedia]"},{"slug":"org-mode","title":"Org-mode","date":1459373471874,"synopsis":"Org-mode (also: Org mode; pronounced /ɔːɡ məʊd/) is an editing and organizing mode for notes, planning, and authoring in the free software text editor Emacs. The name is used to encompass plain text files (\"org files\") that include simple marks to indicate levels of a hierarchy (which could be the outline of an essay, a topic list with subtopics, nested computer code, ...), and an editor with functions that can read the markup and manipulate hierarchy elements (expand/hide elements, move blocks of elements, check off to-do list items, ...) - [https://en."},{"slug":"os-x","title":"OS X","date":1471071863470,"synopsis":"[[OS X]] is a series of Unix-based graphical interface operating systems (OS) developed and marketed by Apple Inc. It is designed to run on Macintosh computers, having been pre-installed on all Macs since 2002. Within the market of desktop, laptop and home computers, and by web usage, OS X is the second most widely used desktop OS after Windows - [https://en.wikipedia.org/wiki/OS_X wikipedia]"},{"slug":"p5dom","title":"p5.dom","date":1512650409728,"synopsis":"The web is much more than just canvas and p5.dom makes it easy to interact with other [[HTML5]] objects, including text, hyperlink, image, input, video, audio, and webcam."},{"slug":"p5js","title":"p5.js","date":1512650852680,"synopsis":"p5.js looks like an excellent framework and community to work with for building [[simulation]]s into wiki."},{"slug":"pachyderm-file-system","title":"Pachyderm File System","date":1434536222617,"synopsis":"Pachyderm is a distributed file system and analytics engine built specifically for containerized infrastructures - [https://github.com/pachyderm/pfs/ github]"},{"slug":"packagejson","title":"package.json","date":1448972361903,"synopsis":"This file is the configuration file that tells [[npm]] what to install and how. You can interactively browse an example package.json file over at [http://browsenpm.org/package.json browsenpm.org]"},{"slug":"pagemap","title":"PageMap","date":1459544412551,"synopsis":"The <PageMap> tag wraps one or more [[DataObject]] tags, in a [[Google Sitemap]] or the markup fo an HTML page. It encloses all PageMap information for the relevant URL."},{"slug":"pagemap-examples","title":"Pagemap Examples","date":1489224752421,"synopsis":"Here we list a few example [[pagemaps]]. Let's start with a simple one:"},{"slug":"pagemaps","title":"PageMaps","date":1489233218715,"synopsis":"A [[PageMap]] is a structured data format that Google created to enable website creators to embed data and notes in their webpages - [https://support.google.com/customsearch/answer/1628213 support.google.com]"},{"slug":"pagerank","title":"PageRank","date":1457263427733,"synopsis":"PageRank is an algorithm used by Google Search to rank websites in their search engine results. PageRank was named after Larry Page, one of the founders of Google. PageRank is a way of measuring the importance of website pages. According to Google: - [https://en.wikipedia.org/wiki/PageRank wikipedia]"},{"slug":"pages-with-images","title":"Pages with Images","date":1434986262310,"synopsis":"Find all pages with images. Our search markup says to look at every item on every page and make links to those pages that have items of type image."},{"slug":"pages-with-maps","title":"Pages with Maps","date":1434986302390,"synopsis":"Find all pages with images. Our search markup says to look at every item on every page and make links to those pages that have items of type image."},{"slug":"pages-with-videos","title":"Pages with Videos","date":1434986170921,"synopsis":"Find all pages with videos. Our search markup says to look at every item on every page and make links to those pages that have items of type video."},{"slug":"pandoc","title":"pandoc","date":1512209130407,"synopsis":"Pandoc is an open-source document converter, widely used as a writing tool (especially by scholars) and as a basis for publishing workflows - [https://en.wikipedia.org/wiki/Pandoc wikipedia]"},{"slug":"papers-software","title":"Papers (software)","date":1459375617014,"synopsis":"Papers is a reference management software for Mac OS X and Windows, used to manage bibliographies and references when writing essays and articles - [https://en.wikipedia.org/wiki/Papers_(software) wikipedia]"},{"slug":"parsoid","title":"Parsoid","date":1455630487209,"synopsis":"[[Parsoid]] is an application which can translate back and forth, at runtime, between MediaWiki's wikitext syntax and an equivalent HTML/RDFa document model with enhanced support for automated processing and rich editing - [https://www.mediawiki.org/wiki/Parsoid mediawiki.org]"},{"slug":"pdf","title":"PDF","date":1459373831405,"synopsis":"Portable Document Format (PDF) is a file format used to present documents in a manner independent of application software, hardware and operating systems - [https://en.wikipedia.org/wiki/Portable_Document_Format wikipedia]"},{"slug":"phonegap","title":"PhoneGap","date":1491996572081,"synopsis":"[[Apache Cordova]] (formerly PhoneGap) is a mobile application development framework originally created by Nitobi. Adobe Systems purchased Nitobi in 2011, rebranded it as PhoneGap, and later released an open source version of the software called Apache Cordova."},{"slug":"php","title":"PHP","date":1466432629880,"synopsis":"PHP is a server-side scripting language designed for web development but also used as a general-purpose programming language. Originally created by Rasmus Lerdorf in 1994, the PHP reference implementation is now produced by The PHP Group. PHP originally stood for Personal Home Page, but it now stands for the recursive backronym PHP: Hypertext Preprocessor - [https://en.wikipedia.org/wiki/Php wikipedia]"},{"slug":"pi-studio","title":"Pi Studio","date":1437992995334,"synopsis":"Here we gather code and hardware notes about the creation of a minimal [[Budget Studio]] based around small precessors like the [[Raspberry Pi]]."},{"slug":"picture","title":"<picture>","date":1437414204031,"synopsis":"The latest specification of the [[<picture>]] element is the result of years (years!) of debate on how to make images adapt."},{"slug":"picturefill-20","title":"Picturefill 2.0","date":1437422012526,"synopsis":"A page with 1 items."},{"slug":"pip","title":"pip","date":1434100659191,"synopsis":"pip is a package management system used to install and manage software packages written in Python - [https://en.wikipedia.org/wiki/Pip_%28package_manager%29 wikipedia]"},{"slug":"plain-text","title":"Plain text","date":1459376072397,"synopsis":"In computing, plain text is the data (e.g. file contents) which represent only characters of readable material but not its graphical representation nor other objects (images, etc.). It may also include a limited number of characters that control simple arrangement of text, such as line breaks or tabulation characters. Plain text is different from formatted text, where style information is included, and \"binary files\" in which some portions must be interpreted as binary objects (encoded integers, real numbers, images, etc.) - [https://en.wikipedia.org/wik"},{"slug":"png-textualdata","title":"PNG TextualData","date":1434901853634,"synopsis":"The [[PNG TextualData]] format allows arbitrary tag names to be used - [http://www.libpng.org/pub/png/spec/1.2/ libpng.org]"},{"slug":"polymer-library","title":"Polymer (library)","date":1520017757944,"synopsis":"Polymer is an open-source JavaScript library for building web applications using Web Components. The library is being developed by Google developers and contributors on GitHub. Modern design principles are implemented as a separate project using Google's [[Material Design]] design principles - [https://en.wikipedia.org/wiki/Polymer_(library) wikipedia]"},{"slug":"polymorphism","title":"Polymorphism","date":1466431004629,"synopsis":"[[Subtyping]], a form of polymorphism ([[polymorphism (computer science)]]), is when calling code can be agnostic as to whether an object belongs to a parent class or one of its descendants.  For example, a function might call \"make_full_name()\" on an object, which will work whether the object is of class Person or class Employee.  This is another type of abstraction which simplifies code external to the class hierarchy and enables strong [[separation of concerns]] - [https://en.wikipedia.org/wiki/Object_Oriented_Programming#Polymorphism wikipedia]"},{"slug":"portable-document-format","title":"Portable Document Format","date":1459373878486,"synopsis":"The Portable Document Format ([[PDF]]) is a file format used to present documents in a manner independent of application software, hardware, and operating systems. Each PDF file encapsulates a complete description of a fixed-layout flat document, including the text, fonts, graphics, and other information needed to display it. In 1991, Adobe Systems' co-founder John Warnock outlined a system called \"Camelot\" that developed into PDF - [https://en.wikipedia.org/wiki/Portable_document_format wikipedia]"},{"slug":"posix-and-unix-like-operating-systems","title":"POSIX and Unix-like operating systems","date":1466523943438,"synopsis":"The following command creates a symbolic link at the [[command-line interface]] (shell):"},{"slug":"presentations-with-pandoc","title":"Presentations with Pandoc","date":1459417811126,"synopsis":"Here we look how we can author a  [[reveal.js]] presentation using [[pandoc]]"},{"slug":"processing","title":"Processing","date":1512645590803,"synopsis":"[[Processing (programming language)]] is an open source computer programming language and integrated development environment ([[IDE]]) built for the electronic arts, new media art, and visual design communities with the purpose of teaching the fundamentals of computer programming in a visual context, and to serve as the foundation for electronic sketchbooks - [https://en.wikipedia.org/wiki/Processing_(programming_language) wikipedia]"},{"slug":"processing-programming-language","title":"Processing (programming language)","date":1512645575189,"synopsis":"The project was initiated in 2001 by Casey Reas and Benjamin Fry, both formerly of the Aesthetics and Computation Group at the MIT Media Lab. In 2012, they started the Processing Foundation along with Daniel Shiffman, who joined as a third project lead. Johanna Hedva joined the Foundation in 2014 as Director of Advocacy."},{"slug":"programming-and-scaling","title":"Programming and Scaling","date":1469880679636,"synopsis":"Here is a great talk by [[Alan Kay]]. It is also an example of how to represent a talk integrating video, slide, annotations and the ability to jump to sections of the talk - [http://www.tele-task.de/archive/video/flash/14029/ tele-task.de]"},{"slug":"proof-of-work","title":"Proof of Work","date":1427539294894,"synopsis":"It is distinct from a [[CAPTCHA]], which is intended for a human to solve quickly, rather than a computer."},{"slug":"prototype-based-programming","title":"prototype-based programming","date":1466432765340,"synopsis":"Prototype-based programming is a style of object-oriented programming in which behaviour reuse (known as inheritance) is performed via a process of reusing existing objects via delegation that serve as prototypes. This model can also be known as prototypal, prototype-oriented, classless, or instance-based programming. Delegation is the language feature that supports prototype-based programming - [https://en.wikipedia.org/wiki/Prototype_Based_Programming wikipedia]"},{"slug":"question","title":"Question","date":1458121150657,"synopsis":"Above you can drag and drop a [[question:]] from a page you are writing, and replace it with the [[factory]] so you can make a [[reference link]]."},{"slug":"raspberry-pi","title":"Raspberry Pi","date":1437998572101,"synopsis":"The Raspberry Pi is a credit card–sized single-board computer developed in the UK by the [[Raspberry Pi Foundation]] with the intention of promoting the teaching of basic computer science in schools - [https://en.wikipedia.org/wiki/Raspberry_Pi - wikipedia]"},{"slug":"rdf","title":"RDF","date":1433260956394,"synopsis":"The Resource Description Framework (RDF) is a framework for representing information in the Web, originally designed as a graph-based data model, where the core structure of the abstract syntax is a set of triples, each consisting of a subject, a predicate and an object."},{"slug":"rdf-dataset-normalization","title":"RDF-Dataset-Normalization","date":1452623379979,"synopsis":"This document outlines an algorithm for normalizing RDF datasets such that these operations can be performed - [http://json-ld.github.io/normalization/spec/#normalization json-ld.github.io]"},{"slug":"rdf-schema","title":"RDF Schema","date":1433261505768,"synopsis":"Ontologies described in [[RDF]], otherwise called RDF vocabularies, are intended to structure RDF resources."},{"slug":"reactive-programming","title":"Reactive programming","date":1469871963728,"synopsis":"In computing, reactive programming is a programming paradigm oriented around data flows and the propagation of change. This means that it should be possible to express static or dynamic data flows with ease in the programming languages used, and that the underlying execution model will automatically propagate changes through the data flow - [https://en.wikipedia.org/wiki/Reactive_programming wikipedia]"},{"slug":"recaptcha","title":"reCAPTCHA","date":1427538130341,"synopsis":"The reCAPTCHA service supplies subscribing websites with images of words that optical character recognition (OCR) software has been unable to read - [https://en.wikipedia.org/wiki/ReCAPTCHA wikipedia]"},{"slug":"recent-thoughts","title":"Recent Thoughts","date":1434653560123,"synopsis":"Here we jot down quick thoughts that ay or may not go anywhere:"},{"slug":"reference-management-software","title":"Reference management software","date":1459375728209,"synopsis":"Reference management software, citation or personal bibliographic management software is software for scholars and authors to use for recording and utilising bibliographic citations (references) - [https://en.wikipedia.org/wiki/Reference_management_software wikipedia]"},{"slug":"refinement","title":"Refinement","date":1489220071810,"synopsis":"[[Refinements]] are labels that you apply to web sites in your search engine index to help your users more easily find the information they are looking for. When a user clicks a refinement label, sites that you have annotated with the label are either searched exclusively or given priority in the results—you choose - [https://developers.google.com/custom-search/docs/refinements developers.google.com]"},{"slug":"refinements","title":"Refinements","date":1489219991689,"synopsis":"Refinements are labels that you apply to web sites in your search engine index to help your users more easily find the information they are looking for. When a user clicks a refinement label, sites that you have annotated with the label are either searched exclusively or given priority in the results—you choose - [https://developers.google.com/custom-search/docs/refinements developers.google.com]"},{"slug":"relative-path","title":"relative path","date":1460474382012,"synopsis":"For convenience and brevity we list all paths on the server as paths relative to some documented folder."},{"slug":"reo-coordination-language","title":"Reo Coordination Language","date":1469878471759,"synopsis":"Reo is a domain-specific language for programming and analyzing coordination protocols that compose individual processes into full systems, broadly construed - [https://en.wikipedia.org/wiki/Reo_Coordination_Language wikipedia]"},{"slug":"research-activity","title":"Research Activity","date":1523432008770,"synopsis":"On this page you can find [[research groups]] that are working on topics related to the current [[domain]]:"},{"slug":"research-group-activity","title":"Research Group Activity","date":1502227210017,"synopsis":"Here we list views of the activity of groups and individual related to the current project. You may want to keep an eye on:"},{"slug":"responsive-images","title":"Responsive Images","date":1437422073895,"synopsis":"[[Picturefill 2.0]] is a near a perfect polyfill for responsive images. Here we explain exactly how we can use the upcoming [[<picture>]] element and [[srcset]], with simple fallbacks for legacy browsers."},{"slug":"responsive-web-design","title":"Responsive Web Design","date":1437413735208,"synopsis":"[[Responsive Web Design]] is an approach to web design aimed at crafting sites to provide an optimal viewing and interaction experience—easy reading and navigation with a minimum of resizing, panning, and scrolling—across a wide range of devices (from desktop computer monitors to mobile phones) - [https://en.wikipedia.org/wiki/Responsive_web_design wikipedia]"},{"slug":"rest","title":"REST","date":1493381725173,"synopsis":"Representational State Transfer (REST) is a software architecture style consisting of guidelines and best practices for creating scalable web services - [https://en.wikipedia.org/wiki/Representational_state_transfer wikipedia]"},{"slug":"rest-api","title":"REST API","date":1493381317150,"synopsis":"A REST API is an [[API]] that provides it's interface through [[REST]]. Here we list a number of services and projects that help you develop and maintain a robust [[REST API]]."},{"slug":"restbase","title":"RESTBase","date":1455622211932,"synopsis":"RESTBase is a caching / storing API proxy. Its configuration is based on [[Swagger]] specs, and its primary storage backend is using [[Cassandra]]."},{"slug":"restful","title":"RESTful","date":1493380270641,"synopsis":"A RESTful web service, is a [[Web Service]] that conforms to Representational State Transfer ([[REST]]) practices. See [[REST]]"},{"slug":"restful-security","title":"RESTful Security","date":1493381558247,"synopsis":"As RESTful Web Services work with HTTP URL Paths, it is very important to safeguard a RESTful Web Service in the same manner as a website is secured - [https://www.tutorialspoint.com/restful/restful_security.htm tutorialspoint.com]"},{"slug":"restful-web-service","title":"RESTful Web Service","date":1510670021277,"synopsis":"A [[RESTful]] web service, is a [[Web Service]] that conforms to Representational State Transfer ([[REST]]) practices. See [[REST]]"},{"slug":"restfull-api","title":"RESTfull API","date":1510669845383,"synopsis":"A [[REST API]] is an [[API]] that provides it's interface through [[REST]]. Here we list a number of services and projects that help you develop and maintain a robust [[REST API]]."},{"slug":"restructuredtext","title":"ReStructuredText","date":1459373428742,"synopsis":"reStructuredText is a file format for textual data used primarily in the Python programming language community for technical documentation - [https://en.wikipedia.org/wiki/Restructuredtext wikipedia]"},{"slug":"revealjs","title":"reveal.js","date":1459433443764,"synopsis":"A framework for easily creating beautiful presentations using HTML."},{"slug":"revealjs-javascript-api","title":"Reveal.js JavaScript API","date":1459402266559,"synopsis":"The Reveal object exposes a JavaScript API for controlling navigation and reading state:"},{"slug":"revealjs-multiplexing","title":"Reveal.js Multiplexing","date":1459378928617,"synopsis":"The multiplex plugin allows your audience to view the slides of the [[reveal.js]] presentation you are controlling on their own phone, tablet or laptop. As the master presentation navigates the slides, all client presentations will update in real time."},{"slug":"rich-snippet-testing-tool","title":"Rich Snippet Testing Tool","date":1457998818687,"synopsis":"Google provides a tool for testing your embedded microdata or [[Structured Data Markup]], which you can find here - [https://developers.google.com/structured-data/testing-tool/ developers.google.com]"},{"slug":"robotstxt","title":"robots.txt","date":1448808021247,"synopsis":"The robots exclusion standard, also known as the robots exclusion protocol or simply robots.txt, is a standard used by websites to communicate with [[Web Crawlers]] and other web robots - [https://en.wikipedia.org/wiki/Robots_exclusion_standard wikipedia]"},{"slug":"round-robin-dns","title":"Round-robin DNS","date":1511367491692,"synopsis":"Round Robin DNS is a technique of load distribution, load balancing, or fault-tolerance provisioning multiple, redundant web servers, by managing the Domain Name System's ([[DNS]]) responses to address requests from client computers according to an appropriate statistical model - [https://en.wikipedia.org/wiki/Round-robin_DNS wikipedia]"},{"slug":"rsync","title":"rsync","date":1466530560788,"synopsis":"rsync is a utility to keep copies of a file on two computer systems. It is commonly found on Unix-like systems and functions as both a file synchronization and file transfer program. The rsync algorithm is a type of delta encoding, and is used to minimize network usage. Zlib may be used for additional compression, and SSH or stunnel can be used for data security - [https://en.wikipedia.org/wiki/Rsync wikipedia]"},{"slug":"running-shell-in-background","title":"Running Shell in Background","date":1520508009507,"synopsis":"Use the & symbol in your command. This will begin the process and immediately return the command line to you, allowing you to use it for other things."},{"slug":"salesforcecom","title":"Salesforce.com","date":1470751554144,"synopsis":"Salesforce.com (stylized as salesƒorce) is an American cloud computing company headquartered in San Francisco, California. Though its revenue comes from a customer relationship management (CRM) product, Salesforce also capitalizes on commercial applications of social networking through acquisition. As of early 2016, it is one of the most highly valued American cloud computing companies with a market capitalization above $55 billion, although the company has never turned a GAAP profit in any fiscal year since its inception in 1999 - [https://en.wikipedia."},{"slug":"salesforceorg","title":"Salesforce.org","date":1470751495837,"synopsis":"Salesforce.org (formerly known as the Salesforce Foundation) is the philanthropic arm of Salesforce.com. It provides grants in addition to free software licenses and volunteering - [https://en.wikipedia.org/wiki/Salesforce.com#Salesforce.org_(Salesforce_Foundation) wikipedia]"},{"slug":"same-origin-policy","title":"Same-origin policy","date":1460812212488,"synopsis":"In computing, the same-origin policy is an important concept in the web application security model. Under the policy, a web browser permits scripts contained in a first web page to access data in a second web page, but only if both web pages have the same origin. An origin is defined as a combination of URI scheme, hostname, and port number. This policy prevents a malicious script on one page from obtaining access to sensitive data on another web page through that page's Document Object Model - [https://en.wikipedia.org/wiki/Same_Origin_policy wikipedia]"},{"slug":"sass","title":"Sass","date":1492001284465,"synopsis":"[[Sass (stylesheet language)]] is a [[Style sheet language]] designed to extend [[CSS]] with SassScript, a simple scripting language used in Sass files - [https://en.wikipedia.org/wiki/Sass_(stylesheet_language) wikipedia]"},{"slug":"sass-stylesheet-language","title":"Sass (stylesheet language)","date":1492001469535,"synopsis":"[[Sass]] is a scripting language that is interpreted into Cascading Style Sheets (CSS). SassScript is the scripting language itself. Sass consists of two syntaxes."},{"slug":"scala-programming-language","title":"Scala (programming language)","date":1467739489153,"synopsis":"Scala (/ˈskɑːlɑː/ SKAH-lah) is a general purpose programming language. Scala has full support for functional programming and a very strong static type system. Designed to be concise, many of Scala's design decisions were inspired by criticism of the shortcomings of Java - [https://en.wikipedia.org/wiki/Scala_(programming_language) wikipedia]"},{"slug":"scema-for-tvseries","title":"Scema for TVSeries","date":1457999774509,"synopsis":"CreativeWorkSeries dedicated to TV broadcast and associated online delivery - [https://schema.org/TVSeries schema.org]"},{"slug":"scenarios","title":"Scenarios","date":1463313066260,"synopsis":"When you're designing a product, you need to have some real live scenarios in mind for how people are going to use it. Otherwise you end up designing a product that doesn't correspond to any real-world usage (like the Cue?Cat)."},{"slug":"schema-for-code","title":"Schema for Code","date":1457981999152,"synopsis":"Have a look here over at [https://schema.org/Code schema.org]"},{"slug":"schema-for-mediaobject","title":"Schema for MediaObject","date":1457983863488,"synopsis":"An image, video, or audio object embedded in a web page. Note that a creative work may have many media objects associated with it on the same web page. For example, a page about a single song (MusicRecording) may have a music video (VideoObject), and a high and low bandwidth audio stream (2 AudioObject's) - [https://schema.org/MediaObject schema.org]"},{"slug":"schema-for-tvseries","title":"Schema for TVSeries","date":1457999854104,"synopsis":"CreativeWorkSeries dedicated to TV broadcast and associated online delivery - [https://schema.org/TVSeries schema.org]"},{"slug":"schemaorg","title":"Schema.org","date":1457999956153,"synopsis":"Schema.org is an initiative launched on 2 June 2011 by Bing, Google, Yandex (whose search engine is the largest one in Russia) and Yahoo to create and support a common set of schemas for structured data markup on web pages - [https://schema.org/ schema.org]"},{"slug":"scratch","title":"Scratch","date":1433260948575,"synopsis":"A page with 0 items."},{"slug":"screen","title":"Screen","date":1520508014279,"synopsis":"[[Screen]] is a full-screen window manager that multiplexes a physical terminal between several processes, typically interactive shells. Each virtual terminal provides the functions of the DEC VT100 terminal and, in addition, several control functions from the ANSI X3.64 (ISO 6429) and ISO 2022 standards (e.g., insert/delete line and support for multiple character sets) - [https://www.gnu.org/software/screen/ gnu.org]"},{"slug":"screenshot-on-a-raspberry-pi","title":"Screenshot on a Raspberry Pi","date":1437998616600,"synopsis":"This can be achieved with [[ImageMagick]] or [[scrot]]. Install by running the command:"},{"slug":"search-annotations-file","title":"Search Annotations File","date":1460205762562,"synopsis":"To work on an [[annotations.xml]] file, download the XML specification from Advanced tab of the Control Panel. Don't start a file from scratch."},{"slug":"search-console","title":"Search Console","date":1520852740503,"synopsis":"The Google Search Console - is the place to find out how well your search is performing. You can examine reports on [[Crawl Errors]] here - [https://www.google.com/webmasters/tools/crawl-errors?hl=en&authuser=0&siteUrl=http://www.himalayanacademy.com/ google.com]"},{"slug":"search-console-sitemaps-tool","title":"Search Console Sitemaps Tool","date":1459778923863,"synopsis":"The main way to submit sitemaps to Google is to use the [[Search Console]] sitemaps tool - [https://www.google.com/webmasters/tools/sitemap-list?siteUrl=http://www.himalayanacademy.com/#MAIN_TAB=1&CARD_TAB=-1 google.com]"},{"slug":"search-labels","title":"Search Labels","date":1460206603857,"synopsis":"Google uses \"search labels' to link together \"sites\" and refinements\"."},{"slug":"secure-copy","title":"Secure copy","date":1466528124837,"synopsis":"Secure copy or SCP is a means of securely transferring computer files between a local host and a remote host or between two remote hosts. It is based on the Secure Shell (SSH) protocol - [https://en.wikipedia.org/wiki/Secure_copy wikipedia]"},{"slug":"semantic-web","title":"Semantic Web","date":1427533902677,"synopsis":"The term was coined by [[Tim Berners-Lee]] for a web of data that can be processed by machines."},{"slug":"semantic-web-quotes","title":"Semantic Web Quotes","date":1427530780129,"synopsis":"Some collected quotes about the [[Semantic Web]]:"},{"slug":"serverless-computing","title":"Serverless computing","date":1506536782532,"synopsis":"# Advantages"},{"slug":"serverless-frameworks","title":"Serverless frameworks","date":1506534396969,"synopsis":"Serverless frameworks ([[Software framework]]) are designed to make it easier to build, test, and deploy serverless applications. Some prominent ones are:"},{"slug":"side-notes","title":"Side Notes","date":1463313686361,"synopsis":"While you're writing a spec, remember your various audiences: programmers, testers, marketing, tech writers, etc. As you write the spec you may think of useful factoids that will be helpful to just one of those groups."},{"slug":"sinatra","title":"Sinatra","date":1502231049874,"synopsis":"Sinatra is a free and open source software web application library and domain-specific language written in Ruby. It is an alternative to other [[Ruby]] web application frameworks such as Ruby on Rails, Merb, Nitro, and Camping. It is dependent on the Rack web server interface. It is named after musician Frank Sinatra - [https://en.wikipedia.org/wiki/Sinatra_(software) wikipedia]"},{"slug":"sinatra-software","title":"Sinatra (software)","date":1502228158039,"synopsis":"[[Sinatra]] is a free and open source software web application library and domain-specific language written in Ruby. It is an alternative to other [[Ruby]] web application frameworks such as Ruby on Rails, Merb, Nitro, and Camping. It is dependent on the Rack web server interface. It is named after musician Frank Sinatra - [https://en.wikipedia.org/wiki/Sinatra_(software) wikipedia]"},{"slug":"single-sign-on","title":"Single Sign On","date":1427029710018,"synopsis":"Single sign-on (SSO) is a property of access control of multiple related, but independent software systems. With this property a user logs in once and gains access to all systems without being prompted to log in again at each of them - [https://en.wikipedia.org/wiki/Single_sign-on wikipedia]"},{"slug":"sitemap","title":"Sitemap","date":1459536054542,"synopsis":"[[Sitemap]]s are an easy way for webmasters to inform search engines about pages on their sites that are available for crawling - [http://www.sitemaps.org/ sitemaps.org]"},{"slug":"sitemap-protocol","title":"Sitemap Protocol","date":1459535952075,"synopsis":"This document describes the XML schema for the Sitemap protocol - [http://www.sitemaps.org/protocol.html sitemaps.org/]"},{"slug":"sitemaps-index","title":"Sitemaps Index","date":1459973304155,"synopsis":"As we have many sitemaps, we use a Sitemaps Index file as a way to submit them at once. The XML format of a sitemap index file is very similar to the XML format of a sitemap file."},{"slug":"sitemaps-testing-tool","title":"Sitemaps Testing Tool","date":1460149745398,"synopsis":"You can add and test your sitemaps using the [[Search Console Sitemaps Tool]] which is part of the [[Search Console]] interface. You can find that here -  [https://www.google.com/webmasters/tools/sitemap-list?siteUrl=http://www.himalayanacademy.com/#MAIN_TAB=1&CARD_TAB=-1 google.com]"},{"slug":"social-network-analysis","title":"Social Network Analysis","date":1428662433239,"synopsis":"A page with 1 items."},{"slug":"socially-aware-cloud-storage","title":"Socially Aware Cloud Storage","date":1431771699752,"synopsis":"There is an architecture in which a few existing or [[Web Protocol]]s are gathered together with some glue to make a world wide system in which applications (desktop or [[Web Application]]) can work on top of a layer of commodity read-write storage."},{"slug":"software-jokes","title":"Software Jokes","date":1469820846847,"synopsis":"Here we collect some jokes and absurdities to do with programming and software."},{"slug":"solid","title":"SoLid","date":1433254229287,"synopsis":"SoLiD stands for Social Linked Data platform."},{"slug":"span-element","title":"<span> element","date":1458027325895,"synopsis":"The [[HTML element]] <span> represents an [[inline]] portion of a document, for example words within a sentence."},{"slug":"specification","title":"Specification","date":1463314618433,"synopsis":"Here we look to create a simple stack and rich documentation of a specification for the [[SivaSiva Mobile Application]] modules for interactive book reading."},{"slug":"specification-details","title":"Specification Details","date":1463313369982,"synopsis":"Details, details, details. Finally you go into the details. Most people will skim this until they need to know a particular detail. When you're designing a web-type service, a good way to do this is to give every possible screen a canonical name, and provide a chapter describing each one in utter and mind-numbing detail."},{"slug":"specification-overview","title":"Specification Overview","date":1463313274348,"synopsis":"This is like the table of contents for your spec. It might be a simple flowchart, or it might be an extensive architectural discussion. Everybody will read this to get the big picture, then the details will make more sense."},{"slug":"sqlite","title":"SQLite","date":1521644236222,"synopsis":"SQLite ( or ) is a relational database management system contained in a C programming library. In contrast to many other database management systems, SQLite is not a client–server database engine. Rather, it is embedded into the end program - [https://en.wikipedia.org/wiki/SQLite wikipedia]"},{"slug":"ssh-copy-id","title":"ssh-copy-id","date":1434701714283,"synopsis":"ssh-copy-id is a handy script that installs your public key in a remote machine's authorized_keys."},{"slug":"ssh-filesystem","title":"SSH Filesystem","date":1433262674736,"synopsis":"This is a filesystem client based on the SSH File Transfer Protocol."},{"slug":"sshfs","title":"SSHFS","date":1520507620603,"synopsis":"In computing, SSHFS (SSH Filesystem) is a filesystem client to mount and interact with directories and files located on a remote server or workstation over a normal ssh connection - [https://en.wikipedia.org/wiki/Sshfs wikipedia]"},{"slug":"stateful-rest","title":"Stateful REST","date":1493382565156,"synopsis":"This is a no-no. As per the REST architecture, a RESTful Web Service should not keep a client state on the server. This restriction is called [[Statelessness]]."},{"slug":"stateless-protocol","title":"Stateless protocol","date":1493380450902,"synopsis":"In computing, a stateless protocol is a communications protocol in which no information is retained by either sender or receiver. The sender transmits a packet to the receiver and does not expect an acknowledgment of receipt. A UDP connection-oriented session is a stateless connection because neither systems maintains information about the session during its life - [https://en.wikipedia.org/wiki/Stateless_protocol wikipedia]"},{"slug":"statelessness","title":"Statelessness","date":1493381239530,"synopsis":"In computing, a [[stateless protocol]] is a communications protocol in which no information is retained by either sender or receiver. The sender transmits a packet to the receiver and does not expect an acknowledgment of receipt. A UDP connection-oriented session is a stateless connection because neither systems maintains information about the session during its life - [https://en.wikipedia.org/wiki/Stateless_protocol wikipedia]"},{"slug":"submit-your-sitemap-to-google","title":"Submit your sitemap to Google","date":1489233251477,"synopsis":"There are two different ways to make your [[sitemap]] available to Google:"},{"slug":"submitting-a-pagemap","title":"Submitting a PageMap","date":1489222788143,"synopsis":"This title is phrased badly. Better would be \"Providing a Pagemap\" or [[Making your Metadata Available]]. After making the information available for Google to craw, you then need to let Google know - that is inform or submit the whereabouts of the [[Pagemap]] information to Google."},{"slug":"suggestion","title":"Suggestion","date":1458123119325,"synopsis":"Above you can drag and drop a [[suggestion:]] from a page you are writing, and replace it with the [[factory]] so you can make a [[reference link]]."},{"slug":"surge","title":"Surge","date":1499016091689,"synopsis":"Surge has been built from the ground up for native web application publishing and is committed to being the best way for Front-End Developers to put HTML5 applications into production - [http://surge.sh/ surge.sh]"},{"slug":"symbolic-link","title":"Symbolic link","date":1466523938215,"synopsis":"In computing, a symbolic link (also symlink or soft link) is the nickname for any file that contains a reference to another file or directory in the form of an absolute or relative path and that affects pathname resolution - [https://en.wikipedia.org/wiki/Symbolic_link wikipedia]"},{"slug":"system-administration-is-hard","title":"System Administration is Hard","date":1438247777046,"synopsis":"Here we list some of the things that make [[System Administration]] hard:"},{"slug":"tag","title":"Tag","date":1458304495267,"synopsis":"Above you can drag and drop a [[tag:]] from a page you are writing, and replace it with the [[factory]] so you can make a [[reference link]]."},{"slug":"tau-chain","title":"Tau Chain","date":1475588036035,"synopsis":"τ-chain (pronounced tau-chain) is a decentralized peer-to-peer network having three unified faces: Rules, Proofs, and Computer Programs, allowing a generalization of virtually any centralized or decentralized P2P network, together with many new abilities, as we present on this note - [http://tauchain.org/tauchain.pdf pdf]"},{"slug":"technology-sites","title":"Technology Sites","date":1424445310106,"synopsis":"A list of sites that document technology related to the technology. There are also a bunch of [[Dead Sites]]."},{"slug":"telling-google-about-metadata","title":"Telling Google About Metadata","date":1489222537839,"synopsis":"You provide information about a page's metadata and also tell Google to crawl this information (ie submit a PageMaps) in three ways. You can:"},{"slug":"test-your-google-sitemap","title":"Test Your Google Sitemap","date":1457998911664,"synopsis":"You should test your sitemap syntax before you submit it. To test an unsubmitted sitemap - [https://support.google.com/webmasters/answer/183669#error-list support.google.com]:"},{"slug":"tex","title":"TeX","date":1459373577184,"synopsis":"TeX (/ˈtɛx/ or /ˈtɛk/, see below) is a typesetting system designed and mostly written by Donald Knuth and released in 1978 - [https://en.wikipedia.org/wiki/Tex wikipedia]"},{"slug":"the-coding-train","title":"The Coding Train","date":1512647758263,"synopsis":"The Coding Train publish [[Creative coding]] video tutorials every week. Subjects covered range from the basics of programming languages like [[JavaScript]] (with [[p5.js]]) and Java (with [[Processing]]) to [[generative algorithm]]s like [[physics simulation]], computer vision, and [[data visualization]]."},{"slug":"the-difference-engine","title":"The Difference Engine","date":1427975146610,"synopsis":"The Difference Engine (1990) is an alternate history novel by [[William Gibson]] and [[Bruce Sterling]]. It is widely regarded as a book that helped establish the genre conventions of [[Steampunk]] - [https://en.wikipedia.org/wiki/The_Difference_Engine wikipedia]"},{"slug":"the-humane-representation-of-thought","title":"The Humane Representation of Thought","date":1425763117671,"synopsis":"VIMEO 115154289"},{"slug":"tinkerpop","title":"TinkerPop","date":1466778907321,"synopsis":"[[TinkerPop]] is not a graph DB, it's a graph software stack / computing framework for graph DBs (OLTP) and graph analytic systems (OLAP)."},{"slug":"titan-graph-database","title":"Titan Graph Database","date":1466780532760,"synopsis":"Titan is a scalable [[graph database]] optimized for storing and querying graphs containing hundreds of billions of vertices and edges distributed across a multi-machine cluster. Titan is a transactional database that can support thousands of concurrent users executing complex graph traversals in real time - [http://titan.thinkaurelius.com/ thinkaurelius.com]"},{"slug":"tls","title":"TLS","date":1431778300675,"synopsis":"Transport Layer Security (TLS) and its predecessor, Secure Sockets Layer (SSL), are cryptographic protocols designed to provide communications security over a computer network - [https://en.wikipedia.org/wiki/Transport_Layer_Security wikipedia]"},{"slug":"topic","title":"Topic","date":1458147701118,"synopsis":"Above you can drag and drop a [[topic:]] from a page you are writing, and replace it with the [[factory]] so you can make a [[reference link]]."},{"slug":"topical-engines","title":"Topical Engines","date":1491505093484,"synopsis":"Topical search engine is an engine that focuses on a particular topic. It covers a part of the whole Web rather than a particular website - this is possible because Google Custom Search allows you to include multiple websites in the same engine. This article discusses some of the interesting techniques for building and maintaining such engines - [https://developers.google.com/custom-search/docs/topical developers.google.com]"},{"slug":"topojson","title":"TopoJSON","date":1491995269493,"synopsis":"A notable offspring of GeoJSON is [[TopoJSON]], an extension of GeoJSON that encodes geospatial topology and that typically provides smaller file sizes - [https://github.com/topojson/topojson-specification github.com]"},{"slug":"transcription-linguistics","title":"Transcription (linguistics)","date":1470320323295,"synopsis":"Transcription in the linguistic sense is the systematic representation of language in written form. The source can either be utterances (speech or sign language) or preexisting text in another writing system - [https://en.wikipedia.org/wiki/Transcription_(linguistics) wikipedia]"},{"slug":"transcription-software","title":"Transcription (software)","date":1470320662965,"synopsis":"Transcription software assists in the conversion of human speech into a text transcript. The primary meaning of the term \"transcription software\" has changed over time, with the introduction of new technologies such as natural language speech recognition."},{"slug":"transpiler","title":"Transpiler","date":1450385277968,"synopsis":"A source-to-source compiler, transcompiler or transpiler is a type of compiler that takes the source code of a program written in one programming language as its input and produces the equivalent source code in another programming language - [https://en.wikipedia.org/wiki/Source-to-source_compiler wikipedia]"},{"slug":"tree","title":"tree","date":1448906311324,"synopsis":"Tree is a recursive directory listing command that produces a depth indented listing of files. It answers the question \"How do list contents of directories in a structure like format under Linux operating systems?\""},{"slug":"trusted-computing","title":"Trusted Computing","date":1438818904495,"synopsis":"With Trusted Computing, the computer will consistently behave in expected ways, and those behaviors will be enforced by computer hardware and software - [https://en.wikipedia.org/wiki/Trusted_Computing wikipedia]"},{"slug":"turing-test","title":"Turing Test","date":1427535627670,"synopsis":"[[Alan Turing]] first proposed an \"imitation game' as a way to test an entity for the presence of the ability to think - that is intelligence."},{"slug":"two-way-data-binding","title":"Two-way data binding","date":1491999725299,"synopsis":"AngularJS two-way [[Data Binding]] is its most notable feature, largely relieving the server backend of templating responsibilities. Instead, templates are rendered in plain HTML according to data contained in a scope defined in the model -"},{"slug":"typescript","title":"TypeScript","date":1466432930854,"synopsis":"TypeScript is a free and open source programming language developed and maintained by Microsoft. It is a strict superset of JavaScript, and adds optional static typing and class-based object-oriented programming to the language - [https://en.wikipedia.org/wiki/Typescript wikipedia]"},{"slug":"unchain-the-office-computers","title":"Unchain the Office Computers!","date":1427925983827,"synopsis":"Why corporate IT should let us browse any way we want."},{"slug":"unity-3d","title":"Unity 3D","date":1512638721431,"synopsis":"The [[Unity (game engine)]] is a cross-platform game engine developed by Unity Technologies, which is primarily used to develop video games and simulations for computers, consoles and mobile devices - [https://unity3d.com/ unity3d.com]"},{"slug":"unity-game-engine","title":"Unity (game engine)","date":1498944848885,"synopsis":"Unity is a cross-platform game engine developed by Unity Technologies, which is primarily used to develop video games and simulations for computers, consoles and mobile devices - [https://en.wikipedia.org/wiki/Unity_(game_engine) wikipedia]"},{"slug":"unix","title":"Unix","date":1466432338873,"synopsis":"Unix (trademarked as UNIX) is a family of multitasking, multiuser computer operating systems that derive from the original AT&T Unix, developed in the 1970s at the Bell Labs research center by Ken Thompson, Dennis Ritchie, and others - [https://en.wikipedia.org/wiki/Unix wikipedia]"},{"slug":"use-case","title":"Use-case","date":1457800263654,"synopsis":"In software and systems engineering, a use case is a list of actions or event steps, typically defining the interactions between a role (known in the Unified Modeling Language as an actor) and a system, to achieve a goal - [https://en.wikipedia.org/wiki/Use_case wikipedia]"},{"slug":"vagrant","title":"Vagrant","date":1438593508571,"synopsis":"Vagrant is a tool for building and distributing development environments - [http://www.vagrantup.com vagrantup.com] and [https://github.com/mitchellh/vagrant github]"},{"slug":"vega","title":"Vega","date":1455630838022,"synopsis":"Vega is a visualization grammar, a declarative format for creating, saving and sharing interactive visualization designs."},{"slug":"version-control","title":"Version control","date":1471087627734,"synopsis":"A component of software configuration management, version control, also known as revision control or source control, is the management of changes to documents, computer programs, large web sites, and other collections of information. Changes are usually identified by a number or letter code, termed the \"revision number\", \"revision level\", or simply \"revision\". For example, an initial set of files is \"revision 1\". When the first change is made, the resulting set is \"revision 2\", and so on. Each revision is associated with a timestamp and the person making"},{"slug":"vinyl","title":"Vinyl","date":1503002702034,"synopsis":"Vinyl is a very simple metadata object that describes a file. When you think of a file, two attributes come to mind: path and contents. These are the main attributes on a Vinyl object - [https://github.com/gulpjs/vinyl github]"},{"slug":"virtual-file-system","title":"Virtual file system","date":1503002507623,"synopsis":"A virtual file system (VFS) or virtual filesystem switch is an abstraction layer on top of a more concrete file system. The purpose of a VFS is to allow client applications to access different types of concrete file systems in a uniform way."},{"slug":"vorlonjs","title":"Vorlon.JS","date":1460894645682,"synopsis":"Vorlon.js is an open source, extensible, platform-agnostic tool for remotely debugging and testing your JavaScript. Powered by [[node.js]] and [[socket.io]] - [http://vorlonjs.com/ vorlonjs.com]"},{"slug":"wavefront-obj-file","title":"Wavefront .obj file","date":1512650843109,"synopsis":"OBJ (or .OBJ) is a geometry definition file format first developed by Wavefront Technologies for its Advanced Visualizer animation package. The file format is open and has been adopted by other 3D graphics application vendors - [https://en.wikipedia.org/wiki/Wavefront_.obj_file wikipedia]"},{"slug":"wc3-datatime","title":"WC3 Datatime","date":1459729067753,"synopsis":"Dates and times in sitemaps should use a simplified version of the standard [[ISO 8601]] format."},{"slug":"web-audio-api","title":"Web Audio API","date":1501838382821,"synopsis":"The [[Web Audio API]] specification developed by [[W3C]] describes a high-level JavaScript API for processing and synthesizing audio in web applications. The primary paradigm is of an audio routing graph, where a number of AudioNode objects are connected together to define the overall audio rendering. The actual processing will primarily take place in the underlying implementation (typically optimized Assembly / C / C++ code), but direct JavaScript processing and synthesis is also supported.[ ]"},{"slug":"web-based-slideshow","title":"Web-based slideshow","date":1459376615304,"synopsis":"A Web-based slideshow is a slide show which can be played (viewed or presented) using a web browser - [https://en.wikipedia.org/wiki/Web-based_slideshow wikipedia]"},{"slug":"web-components","title":"Web Components","date":1510699537905,"synopsis":"Web Components are a set of features currently being added by the W3C to the HTML and DOM specifications that allow for the creation of reusable widgets or components in web documents and web applications."},{"slug":"web-messaging","title":"Web Messaging","date":1464448046903,"synopsis":"Web Messaging or cross-document messaging, is an API introduced in the WHATWG HTML5 draft specification, allowing documents to communicate with one another across different origins, or source domains - [https://en.wikipedia.org/wiki/Web_Messaging wikipedia]"},{"slug":"web-speech-api","title":"Web Speech API","date":1470320618178,"synopsis":"The Web Speech API aims to provide an alternative input method for web applications (without using a keyboard). With this API, developers can give web apps the ability to transcribe voice to text, from the computer's microphone."},{"slug":"webgl","title":"WebGL","date":1511547167380,"synopsis":"WebGL (Web Graphics Library) is a JavaScript API for rendering interactive 2D and 3D graphics within any compatible web browser without the use of plug-ins - [https://en.wikipedia.org/wiki/WebGL wikipedia]"},{"slug":"webid","title":"WebID","date":1448888901641,"synopsis":"A WebID is an HTTP URI that denotes (\"refers to\" or \"names)\" an agent on HTTP based networks e.g., the Web or an enterprise Intranet."},{"slug":"webid--tls","title":"WebID + TLS","date":1431777987699,"synopsis":"A [[Web of Trust]] based on [[WebID + TLS]] could be gradually constructed, connecting users and their activities on the World Wide Web, without formal [[Key Signing Parties]], making the identification harder for anyone (even the original issuing authority) to falsify."},{"slug":"webid-authentication","title":"WebID Authentication","date":1431777819575,"synopsis":"[[WebID]] base authentication can facilitate multiple authentication methods using - [https://github.com/w3c-social/activitypump/issues/20#issuecomment-101038428 github]"},{"slug":"webid-authentication-over-tls","title":"WebID Authentication over TLS","date":1431778326907,"synopsis":"The WebID-TLS protocol enables secure, efficient and maximally user friendly authentication on the Web. It enables people to authenticate onto any site by simply choosing one of the certificates proposed to them by their browser - [http://www.w3.org/2005/Incubator/webid/spec/tls/ w3.org]"},{"slug":"webid-rsa","title":"WebID-RSA","date":1431433940588,"synopsis":"WebID-RSA is somehow similar to [[WebID + TLS]], in that a public RSA key is published in the WebID profile, and the user will sign a token with the corresponding private key that matches the public key in the profile - [https://github.com/linkeddata/SoLiD#webid-rsa github]"},{"slug":"welcome-visitors","title":"Welcome Visitors","date":1520937043151,"synopsis":"Welcome to a [[Federated Wiki]] site for the [[c0de Academy]], where we write about code and programming."},{"slug":"whois","title":"WHOIS","date":1520433067893,"synopsis":"WHOIS (pronounced as the phrase who is) is a query and response protocol that is widely used for querying databases that store the registered users or assignees of an Internet resource, such as a domain name, an IP address block, or an autonomous system, but is also used for a wider range of other information - [https://en.wikipedia.org/wiki/WHOIS wikipedia]"},{"slug":"why-indie-web","title":"Why Indie Web","date":1420948528326,"synopsis":"\"You're here because you know something. What you know you can't explain, but you feel it. You've felt it your entire life, that there's something wrong with the world.\" -- [https://secure.wikimedia.org/wikiquote/en/wiki/The_Matrix Morpheus, The Matrix]"},{"slug":"wiki-markup","title":"Wiki markup","date":1459373524743,"synopsis":"Wiki markup, also known as wikitext language and wikicode, is a lightweight markup language used to write pages at wiki-based websites (such as Wikipedia) that is a simplified/alternative/intermediate to HTML. Its ultimate purpose is to be converted by wiki software into HTML, which, in turn, is served to web browsers. It was originally created in 1995 to format pages on the original wiki site, WikiWikiWeb - [https://en.wikipedia.org/wiki/Wiki_Markup wikipedia]"},{"slug":"wikidata-for-research","title":"Wikidata for Research","date":1417798227066,"synopsis":"... we plan to draft a proposal that aims at establishing Wikidata as a central hub for linked open research data more generally, so that it can facilitate fruitful interactions at scale between professional research institutions and citizen science and knowledge initiatives. We plan to draft this proposal in public – you can join us and help develop it via a dedicated page on Wikidata. [http://blog.wikimedia.de/2014/12/05/wikidata-for-research-a-grant-proposal-that-anyone-can-edit/ post]"},{"slug":"windowpostmessage","title":"Window.postMessage","date":1464448033383,"synopsis":"The window.postMessage method safely enables cross-origin communication - [https://developer.mozilla.org/en-US/docs/Web/API/Window/postMessage developer.mozilla.org]"},{"slug":"wolfram-graph-visualisation","title":"Wolfram Graph Visualisation","date":1428662189032,"synopsis":"Wolfram language has native support for processing and visualising any form of graph - [http://reference.wolfram.com/language/guide/GraphsAndNetworks.html reference.wolfram.com]"},{"slug":"wolfram-language","title":"Wolfram Language","date":1428662425423,"synopsis":"The Wolfram Language is a general multi-paradigm programming language developed by Wolfram Research, that serves as the main interfacing language for Mathematica and the Wolfram Programming Cloud - [https://en.wikipedia.org/wiki/Wolfram_Language wikipedia]"},{"slug":"wordpress-rest-api","title":"Wordpress REST API","date":1453237629540,"synopsis":"The Wordpress REST API has come a long way since the original XMLRPC API. Today it can be enabled on any Wordpress Blog using the [[Jetpack Plugin]] - [afds afds]"},{"slug":"workcom","title":"Work.com","date":1470749981779,"synopsis":"Work.com, previously [[Rypple]], is a social performance management platform that helps managers and employees improve work performance through continuous coaching, real-time feedback, and recognition - [http://www2.canada.com/edmontonjournal/story.html?id=e47cbc72-7f06-437e-bea2-d470e9c4fb30 canada.com]"},{"slug":"xcode","title":"Xcode","date":1435157234308,"synopsis":"Here you can find a hidden place to download older versions of Xcode - [https://developer.apple.com/downloads/ developer.apple.com]"},{"slug":"xml","title":"XML","date":1459983259329,"synopsis":"Extensible Markup Language (XML) is a markup language that defines a set of rules for encoding documents in a format which is both human-readable and machine-readable. It is defined by the W3C's XML 1.0 Specification and by several other related specifications, all of which are free open standards - [https://en.wikipedia.org/wiki/Xml wikipedia]"},{"slug":"xpath","title":"XPath","date":1459984395595,"synopsis":"XPath, the XML Path Language, is a query language for selecting nodes from an [[XML]] document."},{"slug":"xpath-predicates","title":"XPath Predicates","date":1459984523478,"synopsis":"Predicates are used to find a specific node or a node that contains a specific value. Predicates are always embedded in square brackets."},{"slug":"xpath-selecting-unknown-nodes","title":"XPath Selecting Unknown Nodes","date":1459984698605,"synopsis":"[[XPath]] wildcards can be used to select unknown [[XML]] nodes."},{"slug":"xpath-syntax","title":"XPath Syntax","date":1459984864298,"synopsis":"[[XPath]] uses path expressions to select nodes in an [[XML]] document. The node is selected by following a path or steps."},{"slug":"xslt","title":"XSLT","date":1459981643878,"synopsis":"XSLT (Extensible Stylesheet Language Transformations) is a language for transforming XML documents into other XML documents, or other formats such as HTML for web pages, plain text or into XSL Formatting Objects, which may subsequently be converted to other formats, such as PDF, PostScript and PNG - [https://en.wikipedia.org/wiki/Xslt wikipedia]"},{"slug":"zeroconf","title":"Zeroconf","date":1436718397671,"synopsis":"Zero-configuration networking ([[Zeroconf]]) is a set of technologies that automatically creates a usable computer network based on the Internet Protocol Suite (TCP/IP) when computers or network peripherals are interconnected. It does not require manual operator intervention or special configuration servers - [https://en.wikipedia.org/wiki/Zero-configuration_networking wikipedia]"},{"slug":"zotero","title":"Zotero","date":1459375178516,"synopsis":"Zotero /zoʊˈtɛroʊ/ is free and open-source reference management software to manage bibliographic data and related research materials (such as PDF files). Notable features include web browser integration, online syncing, generation of in-text citations, footnotes and bibliographies, as well as integration with the word processors Microsoft Word, LibreOffice, OpenOffice.org Writer and NeoOffice. It is produced by the Center for History and New Media at George Mason University (GMU) - [https://en.wikipedia.org/wiki/Zotero wikipedia]"},{"slug":"regular-expression","title":"Regular expression","date":1536146813225,"synopsis":"A regular expression, regex or regexp (sometimes called a rational expression) is, in theoretical computer science and formal language theory, a sequence of characters that define a search pattern. Usually this pattern is then used by string searching algorithms for \"find\" or \"find and replace\" operations on strings, or for input validation. - [https://en.wikipedia.org/wiki/Regular_expression wikipedia]"},{"slug":"pcre","title":"PCRE","date":1536146791137,"synopsis":"__Perl Compatible Regular Expressions__ (__PCRE__) is a [[library (computing)]] written in [[C (programming language)]], which implements a [[regular expression]] engine, inspired by the capabilities of the [[Perl]]. [[Philip Hazel]] started writing PCRE in summer 1997. PCRE's syntax is much more powerful and flexible than either of the [[regular expression#POSIX]] flavors and than that of many other regular-expression libraries."},{"slug":"perl-compatible-regular-expressions","title":"Perl Compatible Regular Expressions","date":1536146837194,"synopsis":"Perl Compatible Regular Expressions ([[PCRE]]) is a library written in C, which implements a regular expression engine, inspired by the capabilities of the Perl programming language. Philip Hazel started writing PCRE in summer 1997. PCRE's syntax is much more powerful and flexible than either of the POSIX regular expression flavors and than that of many other regular-expression libraries. - [https://en.wikipedia.org/wiki/Perl_Compatible_Regular_Expressions wikipedia]"},{"slug":"dropped-image","title":"Dropped Image","date":1536153649349,"synopsis":"This is a simple image dropped on to a wiki."}]