[{"slug":"ai-alignment-problem","title":"AI Alignment Problem","date":1519503787656,"synopsis":"The Alignment problem is essentially a recognition of two facts:"},{"slug":"ai-safety","title":"AI Safety","date":1519318412944,"synopsis":"AI Safety is, crudely, the concern that a true Artificial General Intelligence - one with an equivalent intelligence to a human, but with the additional technical nature of a machine (in other words, lacking the restrictions imposed by consisting of an organic 'whole'), could become superhuman in capacity, and that in this situation, it would be of critical importance that it be reliably 'friendly' to humans, and sufficiently aligned with human values that it would not make judgements about what it should do which would not be prejudicial to humans."},{"slug":"artificial-intelligence","title":"Artificial Intelligence","date":1519317115178,"synopsis":"I'm interested in AI for a number of reasons; practically, because I am sure that we need as much help as possible to safely address [[Climate Change]], and more intellectually, because consideration of what intelligence is seems a fundamental question that can lead to all sorts of insight about humans."},{"slug":"decisionargumenttopic-visualisationdiscovery","title":"Decision/Argument/Topic Visualisation/Discovery","date":1519318976958,"synopsis":"LINKS"},{"slug":"dil-green","title":"Dil Green","date":1519130799531,"synopsis":"I trained as an architect, studied and worked with [[Christopher Alexander]], got deep into the usage and possibilities of [[Pattern Languages]], designed and built quite a few buildings, from large to small, and was a founder member of a few community activism projects, including the Brixton LETS scheme in the 1990s, and Brixton Common Land, a property co-operative."},{"slug":"image-drag--drop","title":"Image Drag & Drop","date":1523050080293,"synopsis":"Here we look at the current image drag and drop functionality, demo a tip, and suggest an improvement that would enable direct drag and drop from any image url on a web site."},{"slug":"julio-monteiro","title":"Julio Monteiro","date":1522683318564,"synopsis":"PhD in Cognitive Sciences on the University of São Paulo (POLI) and 15+ years of experience designing and building projects for the web and the internet using and advocating open source, agile, lean reaching millions of users aiming to provide a great experience based on continuous feedback."},{"slug":"life-like-structure","title":"life-like structure","date":1523024842490,"synopsis":"STORY:"},{"slug":"life-like-structure-1---steady-state","title":"Life-like structure 1 - Steady State","date":1523023945170,"synopsis":"STORY:"},{"slug":"life-like-structure-2---tiered-policy-with-heart-at-the-bottom","title":"Life-like structure 2 - Tiered Policy with Heart at the bottom","date":1523026529702,"synopsis":"STORY:"},{"slug":"my-darvoz-story","title":"My darVOZ story","date":1523016892286,"synopsis":"SHORT: I'm with VOZ to strengthen my sometime precarious grip on meaning and purpose by working with people I feel broadly aligned on optimistic and life-affirming projects."},{"slug":"voz-life-like-governance","title":"VOZ life-like Governance","date":1523023397586,"synopsis":"STORY:"},{"slug":"voz-story-governance","title":"VOZ Story governance","date":1522682741686,"synopsis":"# Story Governance Story"},{"slug":"welcome-visitors","title":"Welcome Visitors","date":1521974175996,"synopsis":"My name is [[Dil Green]], and I'm using this tool / the linked content it builds to document and archive my explorations, reactions, discoveries and writings around a range of topics broadly related to humanity's shift into cultural modes influenced by digital technology, considered as a fundamental cultural shift that is required for us to get through the imminent existential bottleneck that is [[Climate Change]]."}]