[{"slug":"about-flagmatic-plugin","title":"About Flagmatic Plugin","date":1496593549976,"synopsis":"This plugin offers an assortment of flags that can replace that of the logged-in site. Each choice is saved immediately. Choose often. Refresh offers new choices."},{"slug":"federated-wiki","title":"Federated Wiki","date":1496587649537,"synopsis":"Federated Wiki sites share pages circulating within a creative commons. A single-page browser application can read from many sites at once and save changes in that browser. Users who host their own sites can login there to have their edits shared back to the federation as they edit."},{"slug":"fedwiki-tools","title":"Fedwiki Tools","date":1496663736625,"synopsis":"Here we list a few useful tools. See [[Changes to this site]]."},{"slug":"how-to-wiki","title":"How To Wiki","date":1496587033874,"synopsis":"Here we describe how to use the web interface to the federated wiki. Read [[About Federated Wiki]] to learn about the project. If you are just starting to write in your first wiki then read the [[Field Guide to the Federation]]."},{"slug":"mathematical-notation","title":"Mathematical Notation","date":1132915640000,"synopsis":"The means used to express mathematical ideas on paper or other visual medium."},{"slug":"salaries","title":"Salaries","date":1496662935725,"synopsis":"What you need to know"},{"slug":"shanghai","title":"Shanghai","date":1496663002600,"synopsis":"[[Shanghai Institute of Visual Arts]]"},{"slug":"welcome-visitors","title":"Welcome Visitors","date":1496663736629,"synopsis":"Welcome to this [[Federated Wiki]] site. From this page you can find who we are and what we do. New sites provide this information and then claim the site as their own. You will need your own site to participate."},{"slug":"youre-new-here","title":"You're New Here","date":1496586988503,"synopsis":"There are four steps to making a home here once you have your own site. In other systems this would be like filling out your profile page. Do these steps in any order."}]