[{"slug":"agile-teachers","title":"Agile Teachers","date":1498574088613,"synopsis":"In the [[Outlandish Academy]] we use a modified version of [[Agile Project Management]] as our teaching philosophy and methodology"},{"slug":"apprenticeship","title":"Apprenticeship","date":1524045146743,"synopsis":"An apprenticeship is a system of training a new generation of practitioners of a trade or profession with on-the-job training and often some accompanying study - [https://en.wikipedia.org/wiki/Apprenticeship wikipedia]"},{"slug":"apprenticeship-systems-worldwide","title":"Apprenticeship systems worldwide","date":1498572653667,"synopsis":"Here we research apprenticeships and apprenticeship systems from around the world."},{"slug":"apprenticeships-in-australia","title":"Apprenticeships in Australia","date":1498570438569,"synopsis":"Australian Apprenticeships encompass all apprenticeships and traineeships.  They cover all industry sectors in Australia and are used to achieve both 'entry-level' and career 'upskilling' objectives. There were 475,000 Australian Apprentices in-training as at 31 March 2012, an increase of 2.4% from the previous year - [https://en.wikipedia.org/wiki/Apprenticeship#Australia wikipedia]"},{"slug":"apprenticeships-in-austria","title":"Apprenticeships in Austria","date":1498571518711,"synopsis":"Apprenticeship training in Austria is organized in a [[dual education system]]: company-based training of apprentices is complemented by compulsory attendance of a part-time vocational school for apprentices (Berufsschule).[http://www.bmukk.gv.at/enfr/school/secon/app.xml Archived copy] It lasts two to four years &ndash; the duration varies among the 250 legally recognized apprenticeship trades."},{"slug":"apprenticeships-in-canada","title":"Apprenticeships in Canada","date":1498571679286,"synopsis":"In Canada, each province has its own apprenticeship program. In Canada, apprenticeships tend to be formalized for craft trades and technician level qualifications."},{"slug":"apprenticeships-in-france","title":"Apprenticeships in France","date":1498571751092,"synopsis":"In France, apprenticeships also developed between the ninth and thirteenth centuries, with [[guild]]s structured around apprentices, journeymen ([[Journeyman]]) and master craftsmen ([[master craftsman]]), continuing in this way until 1791, when the guilds were suppressed."},{"slug":"apprenticeships-in-germany","title":"Apprenticeships in Germany","date":1498571020545,"synopsis":"Apprenticeships are part of Germany's [[dual education system]], and as such form an integral part of many people's working life. Finding employment without having completed an apprenticeship is almost impossible. For some particular technical university professions, such as [[food technology]], a completed apprenticeship is often recommended; for some, such as marine engineering ([[Engine department (ship)]]) it may even be mandatory."},{"slug":"apprenticeships-in-india","title":"Apprenticeships in India","date":1498571816498,"synopsis":"In India, the Apprentices Act was enacted in 1961.[http://apprenticeshiptraining.gov.in/Act1961.htm Archived copy] It regulates the programme of training of apprentices in the industry so as to conform to the syllabi, period of training etc. as laid down by the Central Apprenticeship Council and to utilise fully the facilities available in industry for imparting practical training with a view to meeting the requirements of skilled manpower for industry."},{"slug":"apprenticeships-in-pakistan","title":"Apprenticeships in Pakistan","date":1498571909124,"synopsis":"In Pakistan, the Apprenticeship Training is implemented under a National Apprenticeship Ordinance 1962 and Apprenticeship Rules 1966. It regulates apprenticeship programs in industry and a TVET institute for theoretical instructions. It is obligatory for industry having fifty or more workers in an apprenticeable trade to operate apprenticeship training in the industry. Entire cost of training is borne by industry including wages to apprentices. The provincial governments through Technical Education & Vocational Training Authorities (Punjab TEVTA, Sindh T"},{"slug":"apprenticeships-in-switzerland","title":"Apprenticeships in Switzerland","date":1498570526897,"synopsis":"Switzerland has an apprenticeship similarly to Germany and Austria. The educational system is ternar, which is basically [[dual education system]] with mandatory practical courses. The length of an apprenticeship can be 2, 3 or 4 years."},{"slug":"apprenticeships-in-turkey","title":"Apprenticeships in Turkey","date":1498571993856,"synopsis":"In Turkey, apprenticeship has been part of the small business culture for centuries since the time of Seljuk ([[Great Seljuq Empire]]) Turks ([[Turkish people]]) who claimed Anatolia as their homeland in the 11th century."},{"slug":"apprenticeships-in-uk","title":"Apprenticeships in UK","date":1498572425326,"synopsis":"Apprenticeships have a long tradition in the [[United Kingdom]], dating back to around the 12th century and flourishing by the 14th century. The parents or guardians of a minor would agree with a Guild's ([[Guild]]) [[Master craftsman]] the conditions for an apprenticeship which would bind the minor for 5–9 years (e.g., from age 14 to 21). They would pay a \"premium\" to the craftsman and the contract would be recorded in an [[indenture]].[https://books.google.com/?id=9lGp9Tad5-QC&dq=apprentice+twelfth+century Lessons from History of Education]  Modern app"},{"slug":"apprenticeships-in-usa","title":"Apprenticeships in USA","date":1498572649998,"synopsis":"Apprenticeship programs in the United States are regulated by the [[Smith-Hughes Act]] (1917), The [[National Industrial Recovery Act]] (1933), and [[National Apprenticeship Act]], also known as the \"Fitzgerald Act.\"[http://www.dol.gov/apprenticeship/ UNITED STATES DEPARTMENT OF LABOR]"},{"slug":"bootstrap-map-themes","title":"Bootstrap Map Themes","date":1498665433726,"synopsis":"Below are a collection of links imported from [[OneTab]]. You can view these links here - [https://www.one-tab.com/page/KORkFnBDTSy2zXjoLsv8EA one-tab.com]:"},{"slug":"changes-to-this-site","title":"Changes to this Site","date":1434532209841,"synopsis":"Below we list recent changes to this site only without also listing changes from the [[Neighbourhood]]:"},{"slug":"commons-passport","title":"Commons Passport","date":1466274002849,"synopsis":"A \"commons passport\" is a provocative title for a collaborative research tool for anyone working on the commons. It's a working title."},{"slug":"czech-republic-apprenticeships","title":"Czech Republic Apprenticeships","date":1498570601519,"synopsis":"In the Czech Republic, the term \"vocational school\" (učiliště) can refer to the two, three or four years of secondary practical education."},{"slug":"federated-wiki-roles","title":"Federated Wiki Roles","date":1427449892865,"synopsis":"In conversation with [[Mike Caulfield]] we started to outline a series of [[Roles or Hats]] that might enable a more explicit contract with people working together on a [[Happening]]:"},{"slug":"fedwiki-tools","title":"Fedwiki Tools","date":1498482905320,"synopsis":"Here we list a few tools that are of particular use in managing and creating [[Fedwiki]] content."},{"slug":"identity","title":"Identity","date":1449087570443,"synopsis":"This will be a collection of audio notes on the topic of idenity. Some subtopics below:"},{"slug":"journeyman","title":"Journeyman","date":1425429794470,"synopsis":"A journeyman (Wandergeselle in German), is an individual who has completed an apprenticeship and is fully educated in a trade or craft, but not yet a master - [https://en.wikipedia.org/wiki/Journeyman wikipedia]"},{"slug":"json-ld","title":"JSON-LD","date":1458033169550,"synopsis":"JSON-LD, or JavaScript Object Notation for Linked Data, is a method of transporting [[Linked Data]] using [[JSON]] - [https://en.wikipedia.org/wiki/JSON-LD wikipedia]"},{"slug":"learning-passport","title":"Learning Passport","date":1498605545239,"synopsis":"Here I research the idea of creating a portable, secure, learning passport."},{"slug":"lifelong-learning","title":"Lifelong learning","date":1498573859899,"synopsis":"Lifelong learning is the \"ongoing, voluntary, and self-motivated\" pursuit of knowledge for either personal or professional reasons. Therefore, it not only enhances social inclusion, active citizenship, and personal development, but also self-sustainability, as well as competitiveness and employability - [https://en.wikipedia.org/wiki/Lifelong_learning wikipedia]"},{"slug":"living-document","title":"Living document","date":1498573549500,"synopsis":"A living document, also known as an evergreen document or dynamic document, is a document that is continually edited and updated. A simple example of a living document is an article in Wikipedia, an online encyclopedia that permits anyone to freely edit its articles, in contrast to \"dead\" or \"static\" documents, such as an article in a single edition of the Encyclopædia Britannica - [https://en.wikipedia.org/wiki/Living_document wikipedia]"},{"slug":"mozilla-open-badges","title":"Mozilla Open Badges","date":1498566814365,"synopsis":"[[Open Badges]] is the name of a group of specifications and open technical standards originally developed by the Mozilla Foundation with funding from the MacArthur Foundation."},{"slug":"open-badges","title":"Open Badges","date":1498573287721,"synopsis":"A digital badge is an online representation of a skill you’ve earned. Open Badges take that concept one step further, and allows you to verify your skills, interests and achievements through credible organizations and attaches that information to the badge image file, hard-coding the metadata for future access and review."},{"slug":"outlandish-academy","title":"Outlandish Academy","date":1524045324331,"synopsis":"The Outlandish Academy is an open distributed education project for offline and online group work. Our aim is to make online learning more social, personalised, and flexible - [http://outlandish.academy outlandish]"},{"slug":"portable-linked-profiles","title":"Portable Linked Profiles","date":1426508315282,"synopsis":"Portable Linked Profiles enable individual entities to own their own [[Linked data]] profiles in a standardised way that facilitates matching and searching of skills and services - [https://github.com/hackers4peace/plp-docs github]."},{"slug":"pseudonymity","title":"Pseudonymity","date":1467103909360,"synopsis":"Pseudonymity, a word derived from pseudonym, meaning 'false name', is a state of disguised identity."},{"slug":"secure-scuttlebutt","title":"Secure Scuttlebutt","date":1492440230898,"synopsis":"Scuttlebot is an open source peer-to-peer log store used as a database, identity provider, and messaging system. It features global replication, file-syncronization, and end-to-end encryption - [https://scuttlebot.io/ scuttlebot.io]"},{"slug":"sprint","title":"Sprint","date":1427378049826,"synopsis":"A sprint is a get-together of people involved in a project to give a focused development on the project. Sprints are typically from one week up to three weeks  - [https://en.wikipedia.org/wiki/Sprint_%28software_development%29 wikipedia]"},{"slug":"transient-identity","title":"Transient Identity","date":1438183575495,"synopsis":"I'm trying to imagine the use case @opn is exploring. I think it works like this:"},{"slug":"wanderbuch","title":"Wanderbuch","date":1524045220925,"synopsis":"A [[Journeyman]] would be required to keep a journal or [[Wanderbuch]]. This would often serve as both passport and a resumé - [http://www.peterspioneers.com/wanderbuch.htm peterspioneers.com]"},{"slug":"welcome-visitors","title":"Welcome Visitors","date":1502460492494,"synopsis":"Here I collect research, and develop ideas around creating [[Learning Passport]]s for the [[Outlandish Academy]]."}]