[{"slug":"agile-governance-structure","title":"Agile Governance Structure","date":1522671127335,"synopsis":"With governance, as with other aspects, we should apply the same bootstrapping philosophy we use with building currency and software in general. Explicitly that means working on software implementation, interface design, and (soft) process in small agile increments."},{"slug":"agile-is-dead","title":"Agile is Dead","date":1523707415072,"synopsis":"This talk illustrates the dangers of co-option with regard to buzzwords and cool phrases. Relevant and interesting as well with regard to the concretisation or productisation of concepts and processes, as and when they interface with 9financial) incentive structures."},{"slug":"censorship","title":"Censorship","date":1533145785086,"synopsis":"Notes from [[DWebSummit]]:"},{"slug":"changes-to-this-site","title":"Changes to this Site","date":1434532209841,"synopsis":"Below we list recent changes to this site only without also listing changes from the [[Neighbourhood]]:"},{"slug":"defrauding-the-manifesto","title":"Defrauding the Manifesto","date":1433344915327,"synopsis":"In a startling moment diverse proponents of agile methods discovered what united them. This articulation became the Agile Manifesto, with author's names attached, and soon after a mechanism for others to similarly sign. I moderate those signatures and have seen and fought the relentless growth of SEO spam."},{"slug":"dwebsummit","title":"DWebSummit","date":1533229330630,"synopsis":"Some notes on governance at [https://decentralizedwebsummit2018.sched.com/event/FfOq/panel-decentralized-governance-keynotes-and-case-studies DWebSummit2018]"},{"slug":"eip","title":"EIP","date":1528453540668,"synopsis":"The ethereum improvement process (EIP) is pretty basic."},{"slug":"federated-culture","title":"Federated culture","date":1523807646460,"synopsis":"[[The Federation]] is a word we use for a federated culture, that while it has structure (you can examine it like any organism and ask yourself \"What is the purpose of this skeleton?\" or \"this organ?\") - it's substance is not defined only by this structure. It has a culture, you may say a soft-culture, in the same way an organism will have soft-tissue."},{"slug":"federated-governance","title":"Federated Governance","date":1525938897966,"synopsis":"What sort of [[governance]] is suitable for a software project that is in many ways about decentralised architecture? How should we govern and sustain the federation?"},{"slug":"federation-architecture","title":"Federation Architecture","date":1523807927889,"synopsis":"<div style=\""},{"slug":"fedwiki-tools","title":"Fedwiki Tools","date":1535993528793,"synopsis":"Here we list a few tools that are of particular use in managing and creating [[Fedwiki]] content. For a full list of transporters navigate to the site below:"},{"slug":"governance","title":"Governance","date":1535890475249,"synopsis":"Here we explore governance in the particular context of governing a commons, that is an organic federation or ecosystem of decentralised entities."},{"slug":"governance-interface","title":"Governance Interface","date":1525939056745,"synopsis":"Governance is complex. Simplified governance is possible, it can be effective, however such simplified governance has a proven track record of negative consequences."},{"slug":"governance-modules","title":"Governance Modules","date":1528453551867,"synopsis":"A page with 1 items."},{"slug":"inter-coop-governance","title":"Inter-coop Governance","date":1522252584779,"synopsis":"Here we look at structures, and in particular legals governance structures and [[fintech]] tools that facilitate exchanges between coops."},{"slug":"is-search-politically-neutral","title":"Is search politically neutral?","date":1523807605123,"synopsis":"The question here poses itself with regard to how the software is designed at several levels. How should search be structured? How should plugins be listed and developed? And these questions point to the fact that in software projects governance and code are interrelated - code is political."},{"slug":"microservices-for-governance","title":"Microservices for Governance","date":1522999009321,"synopsis":"# See also"},{"slug":"minimal-viable-governance","title":"Minimal Viable Governance","date":1525333614320,"synopsis":"Our aim is to support this governance with minimal flexible tools, that enable small groups of individuals to choose, select and build the governance they seek."},{"slug":"netflix-guide-to-microservices","title":"Netflix Guide to Microservices","date":1523776539540,"synopsis":"This video is very useful in terms of getting a realistic picture of what scaling implies when dealing with microservices."},{"slug":"oneclickorgs","title":"OneClickOrgs","date":1525939216392,"synopsis":"One Click Orgs is a social enterprise based in London that provides a range of innovative platforms for democratic membership organisations - [http://create.oneclickorgs.com/organisations/new oneclickorgs.com]"},{"slug":"organic-governance","title":"Organic Governance","date":1522997162276,"synopsis":"Consensus building is not agile, takes a lot of time and generates lots of garbage and heartbreak. I am much more confortable with the use of [[Consent]] from Sociocracy/Holacracy, are you familiar with them?"},{"slug":"our-governance","title":"Our Governance","date":1522670498582,"synopsis":"The Culture Collective is currently constituted as a voluntary association, and we use OneClickOrgs for democratic member based governance."},{"slug":"patent-pool","title":"Patent pool","date":1533322634618,"synopsis":"In patent law, a patent pool is a consortium of at least two companies agreeing to cross-license patents relating to a particular technology. The creation of a patent pool can save patentees and licensees time and money, and, in case of blocking patents, it may also be the only reasonable method for making the invention available to the public. Competition law issues are usually important when a large consortium is formed. - [https://en.wikipedia.org/wiki/Patent_pool wikipedia]"},{"slug":"polyglot-earth","title":"Polyglot Earth","date":1523808933391,"synopsis":"<div style=\""},{"slug":"protocol-governance","title":"Protocol governance","date":1533146254763,"synopsis":"Standards bodies"},{"slug":"sociocracy","title":"Sociocracy","date":1517751736873,"synopsis":"Sociocracy, also known as dynamic governance, is a system of governance which seeks to achieve solutions that create harmonious social environments as well as productive organizations and businesses. It is distinguished by the use of consent rather than majority voting in decision-making, and decision-making after discussion by people who know each other - [https://en.wikipedia.org/wiki/Sociocracy wikipedia]"},{"slug":"stewardship","title":"Stewardship","date":1533145998208,"synopsis":"What should be stored, who should..."},{"slug":"the-federation","title":"The Federation","date":1523807824894,"synopsis":"Here we describe the The Federation. We should use this term wisely. It describes quite clearly the social aspects of this project, while also pointing gently towards [[Star Trek]] and the future of the [[Decentralised Web]]."},{"slug":"three-layers-of-federation","title":"Three layers of federation","date":1523805274785,"synopsis":"[[The Federation]] can be viewed as an interlocking set of layers that support decentralisation and federation."},{"slug":"viable-system-model","title":"Viable system model","date":1523017828339,"synopsis":"The viable system model (VSM) is a model of the organisational structure of any autonomous system capable of producing itself -  [https://en.wikipedia.org/wiki/Viable_system_model wikipedia]"},{"slug":"voz-activity","title":"Voz Activity","date":1522267550808,"synopsis":"View all activity from [[Voz Sites]] listed in the roster below:"},{"slug":"welcome-visitors","title":"Welcome Visitors","date":1538478623588,"synopsis":"Here we explore the concepts, implementation, and legal and software consideration of [[governance]] for [[Platform Earth]]."},{"slug":"democracy","title":"Democracy","date":1535894206736,"synopsis":"Democracy is a system of government in which all the people of a state or polity are involved in making decisions about its affairs, typically by voting to elect representatives to a parliament or similar assembly."},{"slug":"liquid-democracy","title":"Liquid Democracy","date":1519985671561,"synopsis":"Liquid Democracy is a combination of [[Direct Democracy]], and [[Representative Democracy]]. It aims to create a more flexible and fluid way for people to express their [[Democratic Preference]]."},{"slug":"america-laboratory-of-democracy","title":"America Laboratory of Democracy","date":1510962342091,"synopsis":"American democracy can easily frustrate change. The country’s Constitution is almost impossible to amend. The many interest groups swirling through Congress often paralyse or colonise it; and corralling 50 states is often beyond the capacity of the most able president - [http://www.bbc.co.uk/programmes/w3cswbm4 bbc]"},{"slug":"blockchain-democracy","title":"Blockchain Democracy","date":1535893843184,"synopsis":"Here we research the belated, but increasingly important emphasis on democracy, law, and decision making that leverages [[blockchain]], [[distributed ledger]]s and [[decentralised technology]]."},{"slug":"athenian-democracy","title":"Athenian democracy","date":1536089799001,"synopsis":"Athenian democracy developed around the fifth century BC in the Greek city-state (known as a polis) of Athens, comprising the city of Athens and the surrounding territory of Attica, and is the first known democracy in the world. Other Greek cities set up democracies, most following the Athenian model, but none are as well documented as Athens' - [https://en.wikipedia.org/wiki/Athenian_democracy wikipedia]"},{"slug":"thing-assembly","title":"Thing (assembly)","date":1426129179656,"synopsis":"A \"thing\" was the governing assembly of a Germanic society, made up of the free people of the community presided over by [[Lawspeaker]]s. Its meeting-place was called a [[Thingstead]]."},{"slug":"aragon","title":"Aragon","date":1522495270549,"synopsis":"Aragon looks like an interesting project with good film and media capabilities in the area of blockchain and democracy:"},{"slug":"authentic-deliberation","title":"Authentic deliberation","date":1510231478504,"synopsis":"[[Deliberative democracy]] holds that, for a democratic decision to be legitimate, it must be preceded by authentic deliberation, not merely the aggregation of preferences that occurs in voting."},{"slug":"deliberative-democracy","title":"Deliberative democracy","date":1535903618170,"synopsis":"Deliberative democracy or discursive democracy is a form of democracy in which deliberation is central to decision-making. It adopts elements of both consensus decision-making and majority rule - [https://en.wikipedia.org/wiki/Deliberative_democracy wikipedia]"},{"slug":"democracy-initiative","title":"Democracy Initiative","date":1509819252775,"synopsis":"The Democracy Initiative is a progressive coalition formed in late 2012 which had goals of restricting the unlimited monetary donations by corporations and the wealthy to political campaigns and causes permitted by the United States Supreme Court decision in Citizens United v. Federal Election Commission, supporting voters' rights, combating voter ID laws, and curbing aggressive use of the filibuster in the United States Senate. The coalition was formed at an invitation only meeting at National Education Association headquarters by the NEA, the Sierra Cl"},{"slug":"democracy-realized-the-progressive-alternative","title":"Democracy Realized: The Progressive Alternative","date":1509817376988,"synopsis":"Democracy Realized: The Progressive Alternative is a 1998 book by philosopher and politician Roberto Mangabeira Unger. In the book, Unger sets forth a program of \"democratic experimentalism\" that challenges and defies the neoliberal consensus that there are few alternatives for the progressive reform of democratic and market structures - [https://en.wikipedia.org/wiki/Democracy_Realized:_The_Progressive_Alternative wikipedia]"},{"slug":"blockchain-party","title":"Blockchain Party","date":1430299475114,"synopsis":"My first serious interest in Blockchain technology was when I realised how it could be directly applied to [[Liquid Democracy]]. It is idealinfrastructure for the types of distributed multilayered democratic systems that are needed in society."},{"slug":"post-democracy","title":"Post-Democracy","date":1509730945990,"synopsis":"[http://markcarrigan.net/2015/01/11/what-will-post-democracy-look-like/ Interesting post by Mark Carrigan] that mirrors a couple of recent conversations I've had on similar topics e.g. the illusion of democratic functions when money buys the ability to set the agenda."},{"slug":"progressive-democracy","title":"Progressive Democracy","date":1535891561018,"synopsis":"With the rise in popularity of self-proclaimed progressives such as [[Bernie Sanders]] and [[Elizabeth Warren]], the term began to carry greater cultural currency, particularly in the [[2016 Democratic primaries]]."},{"slug":"epistemic-democracy","title":"Epistemic democracy","date":1510232819639,"synopsis":"Epistemic democracy is the \"doctrine of the wisdom of the multitude.\" - [https://en.wikipedia.org/wiki/Epistemic_democracy wikipedia]"},{"slug":"democratic-school","title":"Democratic School","date":1427242242030,"synopsis":"Democratic education is an educational ideal in which democracy is both a goal and a method of instruction - [https://en.wikipedia.org/wiki/Democratic_education wikipedia]"},{"slug":"art-of-democracy","title":"Art of Democracy","date":1523350814544,"synopsis":"Here we explore projects and ideas that integrate art practice, theatre and documentary into political debate. How can we represent, visualise, animate and inform political concepts and their consequences. How we feed back this information to a [[Demos]]?"},{"slug":"blockchain-based-voting","title":"Blockchain Based Voting","date":1509835747500,"synopsis":"Below are a collection of links imported from [[OneTab]]. You can view these links here - [https://www.one-tab.com/page/GS3bmzlaTEeBHGiLkWrQ1Q one-tab.com]:"},{"slug":"types-of-democracy","title":"Types of democracy","date":1535897015333,"synopsis":"Democracy has taken a number of forms, both in theory and practice. Some varieties of democracy provide better representation and more freedom for their citizens than others. However, if any democracy is not structured so as to prohibit the government from excluding the people from the legislative process, or any branch of government from altering the [[separation of powers]] in its own favour, then a branch of the system can accumulate too much power and destroy the democracy. - [https://en.wikipedia.org/wiki/Democracy#Types_of_governmental_democracies "},{"slug":"politics-of-nature","title":"Politics of Nature","date":1425155310369,"synopsis":"Politics of Nature: How to Bring the Sciences Into Democracy - is an influential book by the French theorist and philosopher of science [[Bruno Latour]] - [https://en.wikipedia.org/wiki/Politics_of_Nature Wikipedia]."},{"slug":"citizens-foundation","title":"Citizens Foundation","date":1519922111941,"synopsis":"<img src='https://www.google.com/s2/favicons?domain=www.regjeringen.no' style='vertical-align: middle; width:16px; height:16px' /><a target=_blank style='vertical-align: middle; padding-left: 10px; padding-right: 12px; text-decoration: none;' href='https://www.regjeringen.no/contentassets/a22bb750da2f4b23bb8f525beacf7125/robert-bjarnason-citizen-participation-and-digital-tools-for-democracy.pdf'>robert-bjarnason-citizen-participation-and-digital-tools-for-democracy.pdf</a>"},{"slug":"democracy-caf","title":"Democracy Café","date":1535894092022,"synopsis":"The purpose of Democracy Cafes is to make genuine transnational politics possible, by providing an online space in which political activists from across Europe can meet and discuss pressing political issues in an informal “Cafe” setting."},{"slug":"ricardo-semler","title":"Ricardo Semler","date":1427240825303,"synopsis":"Ricardo Semler (born 1959 in S√£o Paulo) is the CEO and majority owner of Semco Partners, a Brazilian company best known for its radical form of industrial democracy and corporate re-engineering - [https://en.wikipedia.org/wiki/Ricardo_Semler wikipedia]"},{"slug":"pnyx","title":"Pnyx","date":1535926736751,"synopsis":"The Pnyx is a hill in central Athens, the capital of Greece. Beginning as early as 507 BC, the Athenians gathered on the Pnyx to host their popular assemblies, thus making the hill one of the earliest and most important sites in the creation of democracy. - [https://en.wikipedia.org/wiki/Pnyx wikipedia]"},{"slug":"kleroterion","title":"Kleroterion","date":1511718768840,"synopsis":"A kleroterion was a randomisation device used by the Athenian polis during the period of democracy to select citizens to the boule, to most state offices, to the nomothetai, and to court juries - [https://en.wikipedia.org/wiki/Kleroterion wikipedia]"},{"slug":"technology-and-democracy","title":"Technology and Democracy","date":1471680672498,"synopsis":"Here we look at the issues, problems and potential of using technology to augment democratic practice."},{"slug":"the-wise-democracy-pattern-language","title":"The Wise Democracy Pattern Language","date":1535893112876,"synopsis":"The 3 Dimensions: Power, Participation, Wisdom. [https://i1.wp.com/www.wd-pl.com/wp-content/uploads/Venn-Merge-Film-2.png?resize=300%2C240 source]"},{"slug":"domination-of-extroverts","title":"Domination of extroverts","date":1519926324451,"synopsis":"The [[domination of extroverts]], which is the problem that regularly arises with grassroots democracy -"},{"slug":"democracy-using-ethereum","title":"Democracy using Ethereum","date":1519986556186,"synopsis":"This tutorial shows how to build a decentralized and democratic organization that exists solely on the blockchain, but that can do anything that a simple account would be able to - [https://www.ethereum.org/dao ethereum.org]"},{"slug":"democracy-notes","title":"Democracy Notes","date":1519985745949,"synopsis":"Here we list research and notes that needs further elaboration. Drag and drop links to other pages. Create new pages from here:"},{"slug":"speakers-corner","title":"Speakers' Corner","date":1535879382118,"synopsis":"A Speakers' Corner is an area where open-air public speaking, debate, and discussion are allowed. The original and most noted is in the northeast corner of Hyde Park in London, England."},{"slug":"direct-democracy","title":"Direct democracy","date":1535896823655,"synopsis":"Direct democracy or pure democracy is a form of democracy in which people decide on policy initiatives directly. This differs from the majority of most currently established democracies, which are representative democracies. - [https://en.wikipedia.org/wiki/Direct_democracy wikipedia]"},{"slug":"democratic-variants","title":"Democratic variants","date":1535900041115,"synopsis":"Many countries such as the United Kingdom, Spain, the Netherlands, Belgium, Scandinavian countries ([[Scandinavia]]), [[Thailand]], [[Japan]] and [[Bhutan]] turned powerful monarchs into constitutional monarchs with limited or, often gradually, merely symbolic roles. For example, in the predecessor states to the United Kingdom, constitutional monarchy began to emerge and has continued uninterrupted since the [[Glorious Revolution]] of 1688 and passage of the [[Bill of Rights 1689]]."},{"slug":"representative-democracy","title":"Representative democracy","date":1535896510653,"synopsis":"Representative democracy is a type of democracy founded on the principle of elected officials representing a group of people, as opposed to direct democracy. Nearly all modern Western-style democracies are types of representative democracies; for example, the United Kingdom is a constitutional monarchy, France is a unitary state, and the United States is a federal republic. - [https://en.wikipedia.org/wiki/Representative_democracy wikipedia]"},{"slug":"polyarchy","title":"Polyarchy","date":1535896181367,"synopsis":"In Western European political science, the term polyarchy was used by [[Robert A. Dahl]] to describe a form of government in which power is invested in multiple people. It takes the form of neither a dictatorship nor a democracy."},{"slug":"robert-a-dahl","title":"Robert A. Dahl","date":1535896216878,"synopsis":"Robert Alan Dahl was a political theorist and Sterling Professor of Political Science at Yale University. He established the pluralist theory of democracy—in which political outcomes are enacted through competitive, if unequal, interest groups—and introduced \"polyarchy\" as a descriptor of actual democratic governance. An originator of \"empirical theory\" and known for advancing behavioralist characterizations of political power, Dahl's research focused on the nature of decision making in actual institutions, such as American cities. Dahl is considered one"},{"slug":"parliamentary-system","title":"Parliamentary system","date":1535896351173,"synopsis":"A parliamentary system is a system of democratic governance of a state where the executive branch derives its democratic legitimacy from its ability to command the confidence of the legislative branch, typically a parliament, and is also held accountable to that parliament. In a parliamentary system, the head of state is usually a different person from the head of government."},{"slug":"parliamentary-democracy","title":"Parliamentary Democracy","date":1535896502887,"synopsis":"A [[parliamentary system]] is a system of democratic governance of a state where the executive branch derives its democratic legitimacy from its ability to command the confidence of the legislative branch, typically a parliament, and is also held accountable to that parliament. In a parliamentary system, the head of state is usually a different person from the head of government."},{"slug":"presidential-system","title":"Presidential system","date":1535896486479,"synopsis":"A presidential system is a democratic and republican system of government where a head of government leads an executive branch that is separate from the legislative branch. This head of government is in most cases also the head of state, which is called president. - [https://en.wikipedia.org/wiki/Presidential_system wikipedia]"},{"slug":"presidential-democracy","title":"Presidential Democracy","date":1535896551747,"synopsis":"A [[presidential system]] is a democratic and republican system of government where a head of government leads an executive branch that is separate from the legislative branch. This head of government is in most cases also the head of state, which is called president. - [https://en.wikipedia.org/wiki/Presidential_system wikipedia]"},{"slug":"semi-direct-democracy","title":"Semi-direct Democracy","date":1535896806007,"synopsis":"Some modern democracies that are predominantly representative in nature also heavily rely upon forms of political action that are directly democratic. These democracies, which combine elements of representative democracy and direct democracy, are termed ''hybrid democracies'', ''semi-direct democracies'' or ''participatory democracies''. Examples include Switzerland and some [[U.S. state]]s, where frequent use is made of [[referendum]]s and [[initiatives]]."},{"slug":"republicanism","title":"Republicanism","date":1535897314153,"synopsis":"Republicanism is a political ideology centered on citizenship in a state organized as a republic under which the people hold popular sovereignty. Many countries are \"republics\" in the sense that they are not monarchies. - [https://en.wikipedia.org/wiki/Republicanism wikipedia]"},{"slug":"republic","title":"Republic","date":1535899961062,"synopsis":"The term ''[[republic]]'' has many different meanings, but today often refers to a representative democracy with an elected [[head of state]], such as a [[president]], serving for a limited term."},{"slug":"constitutional-monarchy","title":"Constitutional monarchy","date":1535897469947,"synopsis":"A constitutional monarchy is a form of monarchy in which the sovereign exercises authority in accordance with a written or unwritten constitution. Constitutional monarchy differs from absolute monarchy, in that constitutional monarchs are bound to exercise their powers and authorities within the limits prescribed within an established legal framework."},{"slug":"liberal-democracy","title":"Liberal democracy","date":1535899963667,"synopsis":"A liberal democracy is a representative democracy in which the ability of the elected representatives to exercise decision-making power is subject to the [[rule of law]], and moderated by a constitution or laws that emphasise the protection of the rights and freedoms of individuals, and which places constraints on the leaders and on the extent to which the will of the majority can be exercised against the rights of minorities (see [[civil liberties]])."},{"slug":"universal-suffrage","title":"Universal suffrage","date":1535897811982,"synopsis":"The concept of universal suffrage, also known as general suffrage or common suffrage, consists of the right to vote of all adult citizens, regardless of property ownership, income, race, or ethnicity, subject only to minor exceptions."},{"slug":"socialist-democracy","title":"Socialist democracy","date":1535898250529,"synopsis":"Socialist ([[Socialism]]) thought has several different views on democracy. [[Social democracy]], [[democratic socialism]], and the [[dictatorship of the proletariat]] (usually exercised through [[Soviet democracy]]) are some examples."},{"slug":"anarchist-democracy","title":"Anarchist democracy","date":1535898298668,"synopsis":"Anarchists are split in this domain, depending on whether they believe that a majority-rule is tyrannic or not ([[Tyranny of the majority]]). The only form of democracy considered acceptable to many anarchists is direct democracy."},{"slug":"sortition","title":"Sortition","date":1535928143659,"synopsis":"Also known as allotment, demarchy or [[democracy without elections]], sortition selects political officials as a random sample from a larger pool of candidates - [https://en.wikipedia.org/wiki/Sortition wikipedia]"},{"slug":"democracy-without-elections","title":"Democracy without elections","date":1535899312311,"synopsis":"Sometimes called \"democracy without elections\", [[sortition]] chooses decision makers via a random process."},{"slug":"consociationalism","title":"Consociationalism","date":1535899941387,"synopsis":"Consociationalism is often viewed as synonymous with power-sharing, although it is technically only one form of power-sharing. - [https://en.wikipedia.org/wiki/Consociationalism wikipedia]"},{"slug":"consociational-democracy","title":"Consociational democracy","date":1535900071027,"synopsis":"[[Consociationalism]] or consociational democracy allows for simultaneous majority votes in two or more ethno-religious constituencies, and policies are enacted only if they gain majority support from both or all of them."},{"slug":"consensus-democracy","title":"Consensus democracy","date":1535903571951,"synopsis":"Consensus democracy, or [[Consociationalism]], is the application of consensus decision-making to the process of legislation in a democracy. It is characterized by a decision-making structure which involves and takes into account as broad a range of opinions as possible, as opposed to systems where minority opinions can potentially be ignored by vote-winning majorities. The latter systems are classified as Majoritarian Democracy. - [https://en.wikipedia.org/wiki/Consensus_democracy wikipedia]"},{"slug":"democracyos","title":"DemocracyOS","date":1535900154090,"synopsis":"In the DemocracyOS software each citizen can either cast their vote or can delegate it on a trusted peer - [https://en.wikipedia.org/wiki/Net_Party#DemocracyOS wikipedia]"},{"slug":"media-and-democracy","title":"Media and democracy","date":1535901701172,"synopsis":"In a quest to make sense of the political environment in the United States in 2017, lawyer and ACLU executive director Anthony D. Romero turned to a surprising place -- a 14th-century fresco by Italian Renaissance master Ambrogio Lorenzetti."},{"slug":"duty-of-care","title":"Duty of care","date":1535901630651,"synopsis":"In tort law, a duty of care is a legal obligation which is imposed on an individual requiring adherence to a standard of reasonable care while performing any acts that could foreseeably harm others. It is the first element that must be established to proceed with an action in negligence. The claimant must be able to show a duty of care imposed by law which the defendant has breached. In turn, breaching a duty may subject an individual to liability. The duty of care may be imposed by operation of law between individuals with no current direct relationship"},{"slug":"sortition-in-ancient-athens","title":"Sortition in Ancient Athens","date":1535903805894,"synopsis":"[[Sortition]] was in widespread use in [[Athenian Democracy]] and Renaissance Florence and is still used in modern [[jury selection]]."},{"slug":"ecclesia-ancient-athens","title":"Ecclesia (ancient Athens)","date":1535992261297,"synopsis":"The [[Ecclesia]] or [[ekklesia]] was the principal assembly of the democracy of ancient Athens. It was the popular assembly, open to all male citizens as soon as they qualified for citizenship - [https://en.wikipedia.org/wiki/Ecclesia_(ancient_Athens) wikipedia]"},{"slug":"apella","title":"Apella","date":1535990906731,"synopsis":"The Apella was the popular deliberative assembly in the Ancient Greek city-state of Sparta, corresponding to the ecclesia in most other Greek states. Every Spartan male full citizen who had completed his thirtieth year was entitled to attend the meetings, which, according to Lycurgus' ordinance, must be held at the time of each full moon within the boundaries of Sparta. - [https://en.wikipedia.org/wiki/Apella wikipedia]"},{"slug":"ekklesia","title":"ekklesia","date":1535992212895,"synopsis":"The [[ecclesia]] or [[ekklesia]] was the principal assembly of the democracy of ancient Athens. It was the popular assembly, open to all male citizens as soon as they qualified for citizenship - [https://en.wikipedia.org/wiki/Ecclesia_(ancient_Athens) wikipedia]"},{"slug":"history-of-the-ecclesia-","title":"History of the Ecclesia ","date":1535991906571,"synopsis":"The [[Ecclesia (ancient Athens)]] was the principal assembly of the democracy of ancient Athens. It was the popular assembly, open to all male citizens as soon as they qualified for citizenship - [https://en.wikipedia.org/wiki/Ecclesia_(ancient_Athens) wikipedia]"},{"slug":"ecclesia","title":"Ecclesia","date":1535992191612,"synopsis":"The [[ecclesia]] or [[ekklesia]] was the principal assembly of the democracy of ancient Athens. It was the popular assembly, open to all male citizens as soon as they qualified for citizenship - [https://en.wikipedia.org/wiki/Ecclesia_(ancient_Athens) wikipedia]"},{"slug":"attica","title":"Attica","date":1536089833657,"synopsis":"A page with 0 items."},{"slug":"open-banking","title":"Open banking","date":1520785556050,"synopsis":"Open Banking is a financial services term as part of financial technology that refers to:"}]