[{"slug":"welcome-visitors","title":"Welcome Visitors","date":1535189275196,"synopsis":"Here we write about tools and [[Science software]] that support the [[Open Science]] and the [[Science Commons]]."},{"slug":"science-software","title":"Science software","date":1536151422111,"synopsis":"Here we list software tools that are useful to scientists and open scientists in particular:"},{"slug":"mendeley","title":"Mendeley","date":1535188960987,"synopsis":"Mendeley is a desktop and web program for managing and sharing research papers, discovering research data and collaborating online. It combines Mendeley Desktop, a PDF and reference management application (available for Windows, OS X and Linux) and Mendeley for Android and iOS, with Mendeley Web, an online social network for researchers - [https://en.wikipedia.org/wiki/Mendeley wikipedia]"},{"slug":"zotero","title":"Zotero","date":1535211542967,"synopsis":"Zotero is software for managing bibliographic and other reference material, usually in research contexts. It is quite an agile tool, not only for storage of references but also for generation of citations, footnotes, bibliographies and reference lists in many formats - [https://en.wikipedia.org/wiki/Zotero wikipedia]"},{"slug":"citoid","title":"Citoid","date":1535189091775,"synopsis":"Citoid is a stateless node service on the SCB cluster. It processes HTTP requests containing a URL or ISBN number by retrieving citation information from external sources with help from a local XULrunner-based Zotero server. It responds with a JSON structure containing the citation information - [https://wikitech.wikimedia.org/wiki/Citoid wikitech.wikimedia.org]"},{"slug":"collaborative-bookmarking","title":"Collaborative Bookmarking","date":1535189135624,"synopsis":"Collaborative bookmarking has been tried many times before, but never really taken off. This may be because of corporate priorities (Yahoo buying [[Delicio.us]]), or may be not many people want to collaborate this way. Here we look at simple and effective ways to share research, references and bookmarks:"},{"slug":"omeka","title":"Omeka","date":1535213843166,"synopsis":"Omeka is a free, open source content management system for online digital collections. As a web application, it allows users to publish and exhibit cultural heritage objects, and extend its functionality with themes and plugins - [https://en.wikipedia.org/wiki/Omeka wikipedia]"},{"slug":"sci-hub","title":"Sci-Hub","date":1504450013557,"synopsis":"Sci-Hub is the first pirate website in the world to provide mass and public access to tens of millions of research papers - [http://sci-hub.cc/ sci-hub.cc]"},{"slug":"scigen","title":"SCIgen","date":1496685557008,"synopsis":"SCIgen is a computer program that uses context-free grammar to randomly generate nonsense in the form of computer science research papers. All elements of the papers are formed, including graphs, diagrams, and citations. Created by scientists at the Massachusetts Institute of Technology, its stated aim is \"to maximize amusement, rather than coherence.\" - [https://en.wikipedia.org/wiki/SCIgen wikipedia]"},{"slug":"research-networking-tools","title":"Research Networking Tools","date":1496691432501,"synopsis":"Research networking (RN) is about using web-based tools to discover and use research and scholarly information about people and resources. Research networking tools (RN tools) serve as knowledge management systems for the research enterprise. RN tools connect institution-level/enterprise systems, national research networks, publicly available research data (e.g., grants and publications), and restricted/proprietary data by harvesting information from disparate sources into compiled expertise profiles for faculty, investigators, scholars, clinicians, comm"},{"slug":"orcid","title":"ORCID","date":1436210520895,"synopsis":"ORCID (Open Researcher and Contributor ID) is a nonproprietary alphanumeric code to uniquely identify scientific and other academic authors - [https://en.wikipedia.org/wiki/ORCID wikipedia]"},{"slug":"software-for-science","title":"Software for Science","date":1535190373857,"synopsis":"Redirect to [[Science Software]]"},{"slug":"wikidata-for-research","title":"Wikidata for Research","date":1417798227066,"synopsis":"... we plan to draft a proposal that aims at establishing Wikidata as a central hub for linked open research data more generally, so that it can facilitate fruitful interactions at scale between professional research institutions and citizen science and knowledge initiatives. We plan to draft this proposal in public – you can join us and help develop it via a dedicated page on Wikidata. [http://blog.wikimedia.de/2014/12/05/wikidata-for-research-a-grant-proposal-that-anyone-can-edit/ post]"},{"slug":"dat","title":"dat","date":1448712788392,"synopsis":"Dat is a version-controlled, decentralized data sync tool designed to improve collaboration between data people and data systems - [https://github.com/maxogden/dat github]"},{"slug":"public-knowledge-project","title":"Public Knowledge Project","date":1535195079814,"synopsis":"The Public Knowledge Project (PKP) is a non-profit research initiative that is focused on the importance of making the results of publicly funded research freely available through open access policies, and on developing strategies for making this possible including software solutions."},{"slug":"open-journal-systems","title":"Open Journal Systems","date":1535213409087,"synopsis":"Open Journal Systems (OJS) is an open-source software for the management of peer-reviewed academic journals, and is created by the Public Knowledge Project, released under the GNU General Public License. - [https://en.wikipedia.org/wiki/Open_Journal_Systems wikipedia]"},{"slug":"dpubs","title":"DPubS","date":1535194842672,"synopsis":"DPubS, developed by Cornell University Library and Penn State University Libraries, is a free open access publication management software. DPubS arose out of Project Euclid, an electronic publishing platform for journals in mathematics and statistics. DPubS is free software released under Educational Community License. - [https://en.wikipedia.org/wiki/DPubS wikipedia]"},{"slug":"history-of-open-access","title":"History of Open Access","date":1535194747337,"synopsis":"Cornell University Library’s involvement in digital publishing dates back to the 1980s.  In partnership with the Xerox Corporation and the Commission on Preservation and Access, Cornell developed an early digital imaging project to preserve books in a fragile condition.  Initially focused upon republishing mathematics titles, this effort expanded to include projects in agricultural history, home economics and [[American studies]].<ref name=thomas /> - [https://en.wikipedia.org/wiki/Dpubs#History wikipedia]"},{"slug":"reference-management-software","title":"Reference management software","date":1535213662272,"synopsis":"Reference management software is software for scholars and authors to use for recording and utilising bibliographic citations as well as managing project references either as a company or an individual - [https://en.wikipedia.org/wiki/Reference_management_software wikipedia]"},{"slug":"bibsonomy","title":"BibSonomy","date":1535213951754,"synopsis":"BibSonomy is a social bookmarking and publication-sharing system. It aims to integrate the features of bookmarking systems as well as team-oriented publication management. BibSonomy offers users the ability to store and organize their bookmarks and publication entries and supports the integration of different communities and people by offering a social platform for literature exchange. - [https://en.wikipedia.org/wiki/BibSonomy wikipedia]"},{"slug":"sharelatex","title":"ShareLaTeX","date":1535214120276,"synopsis":"ShareLaTeX is an online LaTeX editor that allows real-time collaboration and online compiling of projects to PDF format. - [https://en.wikipedia.org/wiki/ShareLaTeX wikipedia]"},{"slug":"overleaf","title":"Overleaf","date":1535214549026,"synopsis":"Overleaf is an online [[LaTeX]] and Rich Text collaborative writing and publishing tool that makes the whole process of writing, editing and publishing scientific documents much quicker and easier."},{"slug":"latex","title":"LaTeX","date":1535214342283,"synopsis":"LaTeX is a document preparation system. When writing, the writer uses plain text as opposed to the formatted text found in WYSIWYG word processors like Microsoft Word, LibreOffice Writer and Apple Pages. The writer uses markup tagging conventions to define the general structure of a document, to stylise text throughout a document, and to add citations and cross-references."},{"slug":"pybliographer","title":"Pybliographer","date":1535214463525,"synopsis":"Pybliographer is a reference management software tool that deals with bibliographic databases, used for viewing, editing, searching, and reformatting bibliographies. Written in Python and licensed under GNU GPL, it provides a scripting framework of classes and functions, which makes it extendable to many other applications. Documentation is available. - [https://en.wikipedia.org/wiki/Pybliographer wikipedia]"}]