[{"slug":"aragon","title":"Aragon","date":1522496709973,"synopsis":"Aragon looks like an interesting project with good film and media capabilities in the area of blockchain and democracy:"},{"slug":"brave-browser","title":"Brave Browser","date":1522496823778,"synopsis":"Brave loads major news sites 2 to 8 times faster than Chrome and Safari on mobile. And Brave is 2 times faster than Chrome on desktop - [https://brave.com/about/ brave.com]"},{"slug":"decentralized-autonomous-organization","title":"Decentralized autonomous organization","date":1519629487869,"synopsis":"A decentralized autonomous organization ([[DAO]]), sometimes labeled a decentralized autonomous corporation (DAC), is an organization that is run through rules encoded as computer programs called smart contracts. A DAO's financial transaction record and program rules are maintained on a blockchain. The precise legal status of this type of business organization is unclear - [https://en.wikipedia.org/wiki/Decentralized_autonomous_organization wikipedia]"},{"slug":"distributed-hash-table","title":"Distributed Hash Table","date":1448636552934,"synopsis":"A distributed hash table (DHT) is a class of a decentralized distributed system that provides a lookup service similar to a hash table. Any participating node can efficiently retrieve the value associated with a given key. [https://en.wikipedia.org/wiki/Distributed_hash_table wikipedia]"},{"slug":"ether","title":"Ether","date":1424039311504,"synopsis":"The basic unit of the internal currency of [[Ethereum]], which is divided into smaller units of currency called finney, szabo, shannon, babbage, lovelace, and wei. Each larger unit is equal to 1000 of the next lower unit, so 1000 finney is 1 ether, 1000 szabo is 1 finney."},{"slug":"ether-camp-hackathon","title":"Ether Camp Hackathon","date":1449086212776,"synopsis":"Ether Camp Hackathon is an online hackathon organised by [http://cointelegraph.com/news/115775/ethers-hacker-about-vulnerability-of-blockchain-bitcoin-and-ethereum Roman] which took place Dec 1st - 5th 2015."},{"slug":"ethereum","title":"Ethereum","date":1515112881278,"synopsis":"Ethereum is an open-source, public, blockchain-based distributed computing platform featuring smart contract (scripting) functionality. It provides a decentralized Turing-complete virtual machine, the Ethereum Virtual Machine ([[EVM]]), which can execute scripts using an international network of public nodes."},{"slug":"evm","title":"EVM","date":1515114066505,"synopsis":"There are a number of different virtual machines for [[ethereum]]."},{"slug":"evm-c","title":"EVM-C","date":1519466587445,"synopsis":"EVM-C – C interface to Ethereum Virtual Machine. this looks like the library we need to create a [[Livecode]] library easily in [[Livecode Builder]]. This would enable cross platform creation of DAPPs in LiveCode - let's call it [[Ethereum for Kids]]."},{"slug":"ewasm","title":"eWASM","date":1515151902233,"synopsis":"[[eWASM]] (Ethereum WebAssembly)"},{"slug":"gas","title":"Gas","date":1515504766603,"synopsis":"[[Gas]] is the name for a special unit used in [[Ethereum]]. It measures how much \"work\" an action or set of actions takes to perform: for example, to calculate one Keccak256 cryptographic hash it will take 30 gas each time a hash is calculated, plus a cost of 6 more gas for every 256 bits of data being hashed - [https://ethereum.stackexchange.com/questions/3/what-is-meant-by-the-term-gas ethereum.stackexchange.com]"},{"slug":"halting-problem","title":"Halting problem","date":1515504193195,"synopsis":"In computability theory, the halting problem is the problem of determining, from a description of an arbitrary computer program and an input, whether the program will finish running or continue to run forever - [https://en.wikipedia.org/wiki/Halting_problem wikipedia]"},{"slug":"humanitarian-assistance","title":"Humanitarian Assistance","date":1515115429673,"synopsis":"In the past few years the humanitarian community has been increasingly adopting Cash-Based Transfers as the means to provide assistance to beneficiaries."},{"slug":"livecode","title":"LiveCode","date":1515112088815,"synopsis":"Livecode is an easy to learn, open source, high level language for creating programs and mobile apps for a variety of platforms including Windows, iOS and Android."},{"slug":"livecode-builder","title":"LiveCode Builder","date":1448912429032,"synopsis":"Livecode Builder is a new dialect of LiveCode in which you are able to write things called extensions. An extension will (in the first instance) either be a library or a widget - [http://livecode.com/the-present-and-future-livecode/ livecode.com]"},{"slug":"membrane-computing","title":"Membrane computing","date":1514990285656,"synopsis":"Membrane computing (or MC) is an area within computer science that seeks to discover new computational models from the study of biological cells, particularly of the cellular membranes. It is a sub-task of creating a cellular model - [https://en.wikipedia.org/wiki/Membrane_computing wikipedia]"},{"slug":"metamask","title":"Metamask","date":1522496734912,"synopsis":"MetaMask is a chrome browser extension for using the Ethereum blockchain in a normal browser. This video assumes a basic understanding of [[Ethereum]], so you might want to get started by learning about that!"},{"slug":"puppeth","title":"Puppeth","date":1515112809967,"synopsis":"There’s a very useful utility called puppeth that ships with the Geth source code. Puppeth can be used to deploy and manage networks such as the one we are creating here. As of writing, Puppeth are making certain assumptions about your deployment, such as all servers being remote, or using Docker."},{"slug":"the-energy-blockchain","title":"The Energy Blockchain","date":1515115705659,"synopsis":"An overview of the energy blockchain landscape detailing the tech that is being built to accommodate energy data oracles + real world device interactions. What have we learned from using this technology on mission critical infrastructure where lives can be lost if decimals are out of place?"},{"slug":"trustlines","title":"TrustLines","date":1515510434131,"synopsis":"The Trustlines Network is the original [[Ripple]] idea built on [[Ethereum]]. It looks like an interesting and solid basis for building a [[Creative Currency]] - [https://trustlines.network/ trustlines.network]"},{"slug":"welcome-visitors","title":"Welcome Visitors","date":1515115364754,"synopsis":"Here we gather documentation, writing and research about [[Ethereum]] for the [[Crypto Academy]]."}]