[{"slug":"fedwiki-tools","title":"Fedwiki Tools","date":1502534642551,"synopsis":"Here we list a few tools that are of particular use in managing and creating [[Fedwiki]] content."},{"slug":"gavin-peacock","title":"Gavin Peacock","date":1499119296630,"synopsis":"Born in the 1960s in South West London into an \"ordinary\" working household. Nothing traumatic that I can recall about my childhood, and I left school at 18 after my \"A\" Levels and fell straight into banking. Deep down, I didn't really have a strong sense of what I wanted to do, and where my brightest \"talents\" might lie."},{"slug":"outlandish-academy","title":"Outlandish Academy","date":1502460356004,"synopsis":"The Outlandish Academy is an open distributed education project for offline and online group work. Our aim is to make online learning more social, personalised, and flexible - [http://outlandish.academy outlandish]"},{"slug":"outlandish-activity","title":"Outlandish Activity","date":1500814831211,"synopsis":"View all activity of the [[Outlandish Researchers]]  listed in the roster below, writing across education initiatives in the [[Outlandish Academy]]:"},{"slug":"the-federation","title":"The Federation","date":1465197141849,"synopsis":"Here we describe the The Federation. We should use this term wisely. It describes quite clearly the social aspects of this project, while also pointing gently towards [[Star Trek]] and the future of the [[Decentralised Web]]."},{"slug":"welcome-to-exponentially-human","title":"Welcome to Exponentially Human","date":1500850477904,"synopsis":"*[[Pamela McLean]] is responsible for content here*"},{"slug":"welcome-visitors","title":"Welcome Visitors","date":1502747130405,"synopsis":"Welcome to this [[Federated Wiki]] site initiated by [[Gavin Peacock]]. What is the future of humanity and its most valuable commons - our shared support system that is the precious Earth? How might we, from personal to planetary scale, shift what's possible, shaping new stories for bold, inclusive, creative, abundant futures?"},{"slug":"x10-experience","title":"X10 Experience","date":1502747444420,"synopsis":"Imagine an audience has just finished watching a 2D or 3D version of the X10 Movie and is excited to see included in the end credits something along the lines of:"},{"slug":"x10-movie","title":"X10 Movie","date":1502729105085,"synopsis":"The X10 Movie is proposed to be one of the X10 Project \"pillars\". The aim is to release a feature film in 2018 as one of the \"time capsules\" of the kinds of changes that will (hopefully!) be celebrated at the Exponentially Human event in September 2027."},{"slug":"x10-project","title":"X10 Project","date":1502728152138,"synopsis":"The reason for a working title of X10 Project, which includes the first [[X10 Movie]], [[X10 Experience]] future-making immersive experiences, and more, is because we want to stimulate and gather inspiring responses and involvement for this question and generative challenge:"}]