[{"slug":"blackscholes-model","title":"Black–Scholes model","date":1499685666441,"synopsis":"The Black–Scholes  or Black–Scholes–Merton model is a mathematical model of a financial market containing derivative investment instruments. From the model, one can deduce the Black–Scholes formula, which gives a theoretical estimate of the price of European-style options."},{"slug":"bretton-woods-system","title":"Bretton Woods system","date":1499687169541,"synopsis":"The Bretton Woods system of monetary management established the rules for commercial and financial relations among the United States, Canada, Western Europe, Australia and Japan in the mid-20th century."},{"slug":"creative-destruction","title":"Creative destruction","date":1499686619631,"synopsis":"Creative destruction (German: schöpferische Zerstörung), sometimes known as Schumpeter's gale, is a concept in economics which since the 1950s has become most readily identified with the Austrian-American economist [[Joseph Schumpeter]] who derived it from the work of [[Karl Marx]] and popularized it as a theory of economic innovation and the [[Business Cycle]] - [https://en.wikipedia.org/wiki/Creative_destruction wikipedia]"},{"slug":"currently-working-on","title":"Currently Working On","date":1499684798896,"synopsis":"Here is a list of [[Recent Changes]] I consider important. View our experiments on the [[Scratch]] page. To clear stuff saved in your browser try [[Local Changes]]."},{"slug":"death--taxes","title":"Death & Taxes","date":1499687336244,"synopsis":"I'm thinking of this phrase in relation to the architecture of knowledge or information - how it is or \"should\" be structured. The reference here is in relation to [[money]]."},{"slug":"fedwiki-tools","title":"Fedwiki Tools","date":1499258461696,"synopsis":"Here we list a few tools that are of particular use in managing and creating [[Fedwiki]] content."},{"slug":"history-of-money","title":"History of money","date":1499685925326,"synopsis":"The history of money concerns the development of means of carrying out transactions involving a medium of exchange. Money is any clearly identifiable object of value that is generally accepted as payment for goods and services and repayment of debts within a market or which is legal tender within a country - [https://en.wikipedia.org/wiki/History_of_money wikipedia]"},{"slug":"liquid-desire","title":"Liquid Desire","date":1494458860211,"synopsis":"I'm not sure where I first heard this phrase, but it comes out of the [[Complementary Currency]] field. It's an answer to the question of what meaning or value money captures in society or the individual."},{"slug":"richard-nixon","title":"Richard Nixon","date":1499687268988,"synopsis":"Richard Milhous Nixon (January 9, 1913 – April 22, 1994) was the 37th President of the United States from 1969 until 1974, when he resigned from office, the only U.S. president to do so. He had previously served as the 36th Vice President of the United States from 1953 to 1961 under the presidency of Dwight D. Eisenhower, and prior to that as a U.S. Representative and also Senator from California - [https://en.wikipedia.org/wiki/Richard_Nixon wikipedia]"},{"slug":"susan-strange","title":"Susan Strange","date":1499685855582,"synopsis":"Susan Strange (9 June 1923 – 25 October 1998) was a British scholar of international relations who was \"almost single-handedly responsible for creating international political economy\". Notable publications include Casino Capitalism (1986), States and Markets (1988), The Retreat of the State (1996), and Mad Money (1998) - [https://en.wikipedia.org/wiki/Susan_Strange wikipedia]"},{"slug":"welcome-visitors","title":"Welcome Visitors","date":1499684538884,"synopsis":"People Powered Money is the result of a project running from 2012-2015, Community Currencies in Action (CCIA). Part-funded by the European Union’s Interreg project, CCIA is a transnational project in the community currency field, bringing together expert partners from across north-west Europe and co-ordinating six pilot currencies in the United Kingdom, Belgium, the Netherlands and France."}]